#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Athena
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class /Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresets.MobileHUDPresets_C
	// Inherited from UFortMobileHUDPresetContainer -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UMobileHUDPresets_C : public UFortMobileHUDPresetContainer	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresets.MobileHUDPresets_C");
			return ret;
		}
	};


	// Class /Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresetsInDevelopment.MobileHUDPresetsInDevelopment_C
	// Inherited from UFortMobileHUDPresetContainer -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UMobileHUDPresetsInDevelopment_C : public UFortMobileHUDPresetContainer	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresetsInDevelopment.MobileHUDPresetsInDevelopment_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s.GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s.GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NavFilters/NavFilter_NPC_AnyTraversable.NavFilter_NPC_AnyTraversable_C
	// Inherited from UNavigationQueryFilter -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UNavFilter_NPC_AnyTraversable_C : public UNavigationQueryFilter	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NavFilters/NavFilter_NPC_AnyTraversable.NavFilter_NPC_AnyTraversable_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_GoalSelection_Tamed.GE_NPC_GoalSelection_Tamed_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_GoalSelection_Tamed_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_GoalSelection_Tamed.GE_NPC_GoalSelection_Tamed_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Convert_Damage.GE_NPC_Parent_Convert_Damage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Parent_Convert_Damage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Convert_Damage.GE_NPC_Parent_Convert_Damage_C");
			return ret;
		}
	};


	// Class /Game/Athena/UI/Challenges/Art/ChallengeTile_EmptyButton.ChallengeTile_EmptyButton_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UChallengeTile_EmptyButton_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/UI/Challenges/Art/ChallengeTile_EmptyButton.ChallengeTile_EmptyButton_C");
			return ret;
		}
	};


	// Class /Game/Athena/Prototype/Blueprints/White/GE_AntiGrav.GE_AntiGrav_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_AntiGrav_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Prototype/Blueprints/White/GE_AntiGrav.GE_AntiGrav_C");
			return ret;
		}
	};


	// Class /Game/Athena/Effects/Blueprints/Ash/GE_SnowFlakes_PlayerEffect.GE_SnowFlakes_PlayerEffect_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SnowFlakes_PlayerEffect_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Effects/Blueprints/Ash/GE_SnowFlakes_PlayerEffect.GE_SnowFlakes_PlayerEffect_C");
			return ret;
		}
	};


	// Class /Game/Athena/Prototype/Blueprints/White/GE_Lowgrav.GE_Lowgrav_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Lowgrav_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Prototype/Blueprints/White/GE_Lowgrav.GE_Lowgrav_C");
			return ret;
		}
	};


	// Class /Game/Athena/PawnHighlight_Interface.PawnHighlight_Interface_C
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UPawnHighlight_Interface_C : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PawnHighlight_Interface.PawnHighlight_Interface_C");
			return ret;
		}

		void RemoveHighlightFromSource(UObject Source); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D76895000
		void AddHighlightFromSource(UObject Source, FPawnHighlight Highlight, bool OnlyUpdateIfCurrent); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D76895100
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_Revive.GE_Athena_Revive_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Revive_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_Revive.GE_Athena_Revive_C");
			return ret;
		}
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_Revive_Self.GE_Athena_Revive_Self_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Revive_Self_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_Revive_Self.GE_Athena_Revive_Self_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Components/MultiInteractActorComponent.MultiInteractActorComponent_C
	// Inherited from UFortActorComponent_MultiInteract -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x21 (0x1E1 - 0x1C0)
	class UMultiInteractActorComponent_C : public UFortActorComponent_MultiInteract	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1C0(0x8)
		FGameplayTag RemoveInteractPlayerTag; // 0x1C8(0x4)
		FGameplayTag AddInteractPlayerTag; // 0x1CC(0x4)
		FGameplayTag LoopingMultiInteractTag; // 0x1D0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1D4(0x4) UNKNOWN PROPERTY
		double RequiredDuration; // 0x1D8(0x8)
		bool GCNLApplied; // 0x1E0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Components/MultiInteractActorComponent.MultiInteractActorComponent_C");
			return ret;
		}

		void AddGCNL(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7689D200
		void RemoveGCNL(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7689CE00
		void ExecuteGCNFromTag(AFortPlayerPawn& PlayerPawn, FGameplayTag& InteractTag, int32_t PreviousInteractPlayerCount); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7689D100
		void SetRequiredDuration(double NewRequiredDuration); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7689CD00
		void UpdateForPlayerJustJoinedInteraction(AFortPlayerStateAthena JoinedPlayer); // Flags: Event|Public|BlueprintEvent 0x15D7689CC00
		void UpdateForPlayerJustLeftInteraction(AFortPlayerStateAthena LeftPlayer); // Flags: Event|Public|BlueprintEvent 0x15D7689CB00
		void ReceiveBeginPlay(); // Flags: Event|Public|BlueprintEvent 0x15D7689CF00
		void ExecuteUbergraph_MultiInteractActorComponent(int32_t EntryPoint); // Flags: Final 0x15D7689D000
	};


	// Class /Game/Athena/MappedEffects/Lockout/GA_Athena_Lockout.GA_Athena_Lockout_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x18 (0xB58 - 0xB40)
	class UGA_Athena_Lockout_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FTimerHandle Timer_LockoutFailsafe; // 0xB48(0x8)
		double LockoutFailsafeTime; // 0xB50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/Lockout/GA_Athena_Lockout.GA_Athena_Lockout_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D7ADE0C00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D7ADE0D00
		void Failsafe(); // Flags: BlueprintCallable|BlueprintEvent 0x15D7ADE0E00
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent 0x15D7ADE0F00
		void ExecuteUbergraph_GA_Athena_Lockout(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ADE1000
	};


	// Class /Game/Athena/MappedEffects/Lockout/GE_Athena_Lockout.GE_Athena_Lockout_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Lockout_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/Lockout/GE_Athena_Lockout.GE_Athena_Lockout_C");
			return ret;
		}
	};


	// Class /Game/Athena/Effects/Blueprints/ColdBreath/GE_ColdBreath_V2.GE_ColdBreath_V2_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ColdBreath_V2_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Effects/Blueprints/ColdBreath/GE_ColdBreath_V2.GE_ColdBreath_V2_C");
			return ret;
		}
	};


	// Class /Game/Athena/Sounds/Weapons/BulletWhips/BulletWhipTrackerComponent_Default.BulletWhipTrackerComponent_Default_C
	// Inherited from UBulletWhipTrackerComponentBase -> UActorComponent -> UObject
	// Size: 0x0 (0xF8 - 0xF8)
	class UBulletWhipTrackerComponent_Default_C : public UBulletWhipTrackerComponentBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Sounds/Weapons/BulletWhips/BulletWhipTrackerComponent_Default.BulletWhipTrackerComponent_Default_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Phoebe/NavFilter/NavFilter_Phoebe.NavFilter_Phoebe_C
	// Inherited from UFortNavigationFilter -> UNavigationQueryFilter -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UNavFilter_Phoebe_C : public UFortNavigationFilter	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Phoebe/NavFilter/NavFilter_Phoebe.NavFilter_Phoebe_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Phoebe/BP_PhoebePlayerController.BP_PhoebePlayerController_C
	// Inherited from AFortAthenaAIBotController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x28 (0x1710 - 0x16E8)
	class ABP_PhoebePlayerController_C : public AFortAthenaAIBotController	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x16E8(0x8) UNKNOWN PROPERTY
		UFortControllerComponent_RechargeWeapons RechargingWeaponsComponent; // 0x16F0(0x8)
		UFortBlackboardComponent Blackboard1; // 0x16F8(0x8)
		UFortAthenaAIBotBuildingComponent FortAthenaAIBotBuilding; // 0x1700(0x8)
		UAIPerceptionComponent AIPerception; // 0x1708(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Phoebe/BP_PhoebePlayerController.BP_PhoebePlayerController_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/BP_PhoebeController_NonParticipant.BP_PhoebeController_NonParticipant_C
	// Inherited from ABP_PhoebePlayerController_C -> AFortAthenaAIBotController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x0 (0x1710 - 0x1710)
	class ABP_PhoebeController_NonParticipant_C : public ABP_PhoebePlayerController_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BP_PhoebeController_NonParticipant.BP_PhoebeController_NonParticipant_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_HireNPC.GE_Quest_Converted_HireNPC_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Quest_Converted_HireNPC_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_HireNPC.GE_Quest_Converted_HireNPC_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C
	// Inherited from UFortPatrolAnimLayer -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0xCA0 (0x11E0 - 0x540)
	class UMANG_PatrolLayerAnimBP_C : public UFortPatrolAnimLayer	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x540(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x548(0x1C)
		unsigned char UnknownData01_6[0x4]; // 0x564(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x568(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x570(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x578(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x598(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x648(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x668(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x718(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x738(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7E8(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x830(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x858(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x880(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x920(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x948(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x970(0x70)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x9E0(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAD0(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xAF8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB18(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xB40(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xB60(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xBD0(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xC98(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD88(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xDB0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xE20(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xE40(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xE68(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF30(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xF78(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xF98(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1060(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x10D8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1100(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1148(0x78)
		FAnimNode_Root AnimGraphNode_Root; // 0x11C0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C");
			return ret;
		}

		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable 0x15D817B1500
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D817B1300
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D817B1600
		void ExecuteUbergraph_MANG_PatrolLayerAnimBP(int32_t EntryPoint); // Flags: Final 0x15D817B1400
	};


	// Class /Game/Athena/AI/NPCs/Base/BPI_NonParticipant.BPI_NonParticipant_C
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBPI_NonParticipant_C : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BPI_NonParticipant.BPI_NonParticipant_C");
			return ret;
		}

		void AttemptPlayVocalReinforcementSound(FGameplayTagContainer MetadataTagContainer); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D817B4C00
		void PlayVoiceSoundByTag(FGameplayTag SoundBankTag); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D817B4B00
	};


	// Class /Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Cooldown.GE_NPC_Status_Stressed_Cooldown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Status_Stressed_Cooldown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Cooldown.GE_NPC_Status_Stressed_Cooldown_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Infinite.GE_NPC_Status_Stressed_Infinite_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Status_Stressed_Infinite_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Infinite.GE_NPC_Status_Stressed_Infinite_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/GE_NPC_Challenged.GE_NPC_Challenged_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Challenged_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/GE_NPC_Challenged.GE_NPC_Challenged_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/PhantomBooth/GE_Athena_Disguise_Remove.GE_Athena_Disguise_Remove_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Disguise_Remove_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/PhantomBooth/GE_Athena_Disguise_Remove.GE_Athena_Disguise_Remove_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/GameplayEffects/GE_Patrolling.GE_Patrolling_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Patrolling_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/GameplayEffects/GE_Patrolling.GE_Patrolling_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/BP_BotController_NPC_Base.BP_BotController_NPC_Base_C
	// Inherited from ABP_PhoebeController_NonParticipant_C -> ABP_PhoebePlayerController_C -> AFortAthenaAIBotController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x50 (0x1760 - 0x1710)
	class ABP_BotController_NPC_Base_C : public ABP_PhoebeController_NonParticipant_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1710(0x8)
		UFortAthenaNpcPatrollingComponent FortAthenaNpcPatrolling; // 0x1718(0x8)
		UClass GE_Patrolling; // 0x1720(0x8)
		FActiveGameplayEffectHandle GE_PatrollingSpeedHandle; // 0x1728(0x8)
		FRotator SavedRotationRate; // 0x1730(0x18)
		FRotator PatrollingRotationRate; // 0x1748(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BP_BotController_NPC_Base.BP_BotController_NPC_Base_C");
			return ret;
		}

		void StopPatrolling(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D817BAB00
		void StartPatrolling(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D817BAC00
		void RemovePatrollingGE(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D817BAD00
		void AddPatrollingGE(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D817BB100
		void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_0_PatrollingComponentOnStartPatrolling__DelegateSignature(); // Flags: BlueprintEvent 0x15D817BB000
		void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_1_PatrollingComponentOnStopPatrolling__DelegateSignature(); // Flags: BlueprintEvent 0x15D817BAF00
		void ExecuteUbergraph_BP_BotController_NPC_Base(int32_t EntryPoint); // Flags: Final 0x15D817BAE00
	};


	// Class /Game/Athena/HUD/SimpleMaterialProgressBar.SimpleMaterialProgressBar_C
	// Inherited from UFortSimpleMaterialProgressBar -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3B0 - 0x3B0)
	class USimpleMaterialProgressBar_C : public UFortSimpleMaterialProgressBar	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/SimpleMaterialProgressBar.SimpleMaterialProgressBar_C");
			return ret;
		}
	};


	// Class /Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthPositive.GCNL_Creative_Powerup_HealthPositive_C
	// Inherited from AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x0 (0x9B0 - 0x9B0)
	class AGCNL_Creative_Powerup_HealthPositive_C : public AFortGameplayCueNotify_Loop	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthPositive.GCNL_Creative_Powerup_HealthPositive_C");
			return ret;
		}
	};


	// Class /Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthNegative.GCNL_Creative_Powerup_HealthNegative_C
	// Inherited from AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x0 (0x9B0 - 0x9B0)
	class AGCNL_Creative_Powerup_HealthNegative_C : public AFortGameplayCueNotify_Loop	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthNegative.GCNL_Creative_Powerup_HealthNegative_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse.GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_SlotInUse_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse.GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot.GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot.GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C
	// Inherited from AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0xF8 (0x5CF0 - 0x5BF8)
	class APlayerPawn_Athena_Generic_Parent_C : public AFortPlayerPawnAthena	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x5BF8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x5C00(0x8)
		UMotionWarpingComponent MotionWarping; // 0x5C08(0x8)
		UMultiInteractActorComponent_C MultiInteractActorComponent; // 0x5C10(0x8)
		TArray Default_Weapon_Materials; // 0x5C18(0x10)
		TArray PawnBackpackMaterials; // 0x5C28(0x10)
		TArray PawnHatMaterials; // 0x5C38(0x10)
		TArray PawnHeadMaterials; // 0x5C48(0x10)
		TArray PawnBodyMaterials; // 0x5C58(0x10)
		TArray PawnCharmMaterials; // 0x5C68(0x10)
		TArray PawnFaceMaterials; // 0x5C78(0x10)
		UPostProcessComponent PlayerPostProcessFX; // 0x5C88(0x8)
		TArray SkeletalMeshes; // 0x5C90(0x10)
		TArray PawnMaterials_ALL; // 0x5CA0(0x10)
		FMulticastInlineDelegate ShootingTargetReactToJump; // 0x5CB0(0x10)
		FMulticastInlineDelegate OnPlayHit; // 0x5CC0(0x10)
		FMulticastInlineDelegate OnEnteredVehicleDispatcher; // 0x5CD0(0x10)
		FMulticastInlineDelegate OnExitedVehicleDispatcher; // 0x5CE0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6A0CB900
		void OnEnteredVehicle(); // Flags: Event|Public|BlueprintEvent 0x15D6A0CBF00
		void OnExitedVehicle(); // Flags: Event|Public|BlueprintEvent 0x15D6A0CBD00
		void OnJumped(); // Flags: Event|Public|BlueprintEvent 0x15D6A0CBB00
		void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Flags: Event|Public|BlueprintEvent 0x15D6A0CC000
		void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Flags: Event|Public|BlueprintEvent 0x15D6A0CC100
		void ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6A0CC200
		void OnExitedVehicleDispatcher__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6A0CBC00
		void OnEnteredVehicleDispatcher__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6A0CBE00
		void OnPlayHit__DelegateSignature(AActor SelfActor, AActor OtherActor, FVector NormalImpulse, FHitResult& Hit); // Flags: Public|Delegate|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6A0CBA00
		void ShootingTargetReactToJump__DelegateSignature(AFortPlayerPawnAthena JumpingPlayer); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6A0CB800
	};


	// Class /Game/Athena/Items/Parents/FallImmunity/GE_Athena_TillLandFallDamageImmunity.GE_Athena_TillLandFallDamageImmunity_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_TillLandFallDamageImmunity_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Parents/FallImmunity/GE_Athena_TillLandFallDamageImmunity.GE_Athena_TillLandFallDamageImmunity_C");
			return ret;
		}
	};


	// Class /Game/Athena/DrivableVehicles/GE_VehicleDamage_PhysicsObject_Global.GE_VehicleDamage_PhysicsObject_Global_C
	// Inherited from UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_VehicleDamage_PhysicsObject_Global_C : public UGet_DirectDamageParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GE_VehicleDamage_PhysicsObject_Global.GE_VehicleDamage_PhysicsObject_Global_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_Max.GE_NPC_Behavior_TargetSlots_Melee_Max_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_Max_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_Max.GE_NPC_Behavior_TargetSlots_Melee_Max_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot.GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot.GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Controllers/NPC_Wildlife_Controller_Parent.NPC_Wildlife_Controller_Parent_C
	// Inherited from AAthenaAIController -> AFortAIController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x10 (0x618 - 0x608)
	class ANPC_Wildlife_Controller_Parent_C : public AAthenaAIController	
	{
	public:
		UAthenaMarkerComponent AthenaMarker; // 0x608(0x8)
		UFortAthenaNpcPatrollingComponent FortAthenaNpcPatrolling; // 0x610(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Controllers/NPC_Wildlife_Controller_Parent.NPC_Wildlife_Controller_Parent_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner.GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_SlotOwner_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner.GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/RecentlyDamaged/GE_NPC_Gameplay_Status_RecentlyDamaged_10sec.GE_NPC_Gameplay_Status_RecentlyDamaged_10sec_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Gameplay_Status_RecentlyDamaged_10sec_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/RecentlyDamaged/GE_NPC_Gameplay_Status_RecentlyDamaged_10sec.GE_NPC_Gameplay_Status_RecentlyDamaged_10sec_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Pawns/NPC/Parents/NPCFunctionLibrary.NPCFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UNPCFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Pawns/NPC/Parents/NPCFunctionLibrary.NPCFunctionLibrary_C");
			return ret;
		}

		void HasCustomEffect(FGameplayTag CustomFXTag, AFortPawn Pawn, UObject __WorldContext, bool& HasCustomEffect); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D82E27900
		void PlayCustomEffect(FGameplayTag CustomFXTag, AFortPawn Pawn, UObject __WorldContext, bool& Success); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D82E27800
		void GetCustomEffectByTag(FGameplayTag CustomFXTag, UFortPawnComponent_AICustomEffects PawnCustomVFXComp, UObject __WorldContext, FNPCCustomEffect& CustomFX); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D82E27B00
		void GetCustomEffectLocation(FName SocketName, AFortPawn Pawn, UObject __WorldContext, FTransform& EffectTransformLocation); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D82E27A00
	};


	// Class /Game/Athena/AI/NavFilters/NavFilter_NPC_AvoidAllWater.NavFilter_NPC_AvoidAllWater_C
	// Inherited from URecastFilter_UseDefaultArea -> UNavigationQueryFilter -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UNavFilter_NPC_AvoidAllWater_C : public URecastFilter_UseDefaultArea	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NavFilters/NavFilter_NPC_AvoidAllWater.NavFilter_NPC_AvoidAllWater_C");
			return ret;
		}
	};


	// Class /Game/Athena/UI/Customization/AthenaFloatSliderVariantPicker.AthenaFloatSliderVariantPicker_C
	// Inherited from UFortFloatSliderVariantPicker -> UFortVariantEditorWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x400 - 0x3E8)
	class UAthenaFloatSliderVariantPicker_C : public UFortFloatSliderVariantPicker	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3E8(0x8)
		UOverlay Panel_Value; // 0x3F0(0x8)
		USimpleMaterialProgressBar_C Progress; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/UI/Customization/AthenaFloatSliderVariantPicker.AthenaFloatSliderVariantPicker_C");
			return ret;
		}

		void OnUpdateValue(float NormalizedValue, bool bIsLocked); // Flags: Event|Protected|BlueprintEvent 0x15D80765700
		void ExecuteUbergraph_AthenaFloatSliderVariantPicker(int32_t EntryPoint); // Flags: Final 0x15D80765600
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Alert_Cooldown.GE_NPC_Parent_Alert_Cooldown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Parent_Alert_Cooldown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Alert_Cooldown.GE_NPC_Parent_Alert_Cooldown_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_InSafeZone.GE_InSafeZone_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_InSafeZone_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_InSafeZone.GE_InSafeZone_C");
			return ret;
		}
	};


	// Class /Game/Athena/GameplayCueNotifies/GCN_Athena_PlayerLevelUp.GCN_Athena_PlayerLevelUp_C
	// Inherited from UFortGameplayCueNotify_Burst -> UGameplayCueNotify_Static -> UObject
	// Size: 0x0 (0x218 - 0x218)
	class UGCN_Athena_PlayerLevelUp_C : public UFortGameplayCueNotify_Burst	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCN_Athena_PlayerLevelUp.GCN_Athena_PlayerLevelUp_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotInUse.GE_NPC_Behavior_TargetSlots_Melee_SlotInUse_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_SlotInUse_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotInUse.GE_NPC_Behavior_TargetSlots_Melee_SlotInUse_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Parents/FallImmunity/GA_Athena_TillLandFallDamageImmunity_Parent.GA_Athena_TillLandFallDamageImmunity_Parent_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x70 (0xBB0 - 0xB40)
	class UGA_Athena_TillLandFallDamageImmunity_Parent_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		UClass GE_FallDamageImmunity; // 0xB48(0x8)
		FActiveGameplayEffectHandle GEH_FallDamageImmunity; // 0xB50(0x8)
		double Delay_PostLand; // 0xB58(0x8)
		FGameplayTag Tag_SurfaceSwimming; // 0xB60(0x4)
		FGameplayTag Tag_Sliding; // 0xB64(0x4)
		FGameplayTagContainer TC_IgnoreApplication; // 0xB68(0x20)
		FGameplayTag Tag_InVehicle; // 0xB88(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xB8C(0x4) UNKNOWN PROPERTY
		double Delay_WaterSwimBind; // 0xB90(0x8)
		bool ApplyInAirOnly; // 0xB98(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xB99(0x3) UNKNOWN PROPERTY
		FGameplayTag TagIsRiding; // 0xB9C(0x4)
		TArray WaitTagAsyncTasks; // 0xBA0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Parents/FallImmunity/GA_Athena_TillLandFallDamageImmunity_Parent.GA_Athena_TillLandFallDamageImmunity_Parent_C");
			return ret;
		}

		void Added_3DBE819D4ED6A0A0909A7690321F9B09(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F5400
		void Added_15DBA1504E74C72F22BBCBAD8E3CD31E(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F5500
		void Added_052C8416489756AFAF2C5391148ABB52(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F5700
		void Added_1195BCDD4C66168D5746C2BD02970859(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F5600
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D499F5000
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D499F4F00
		void CallEnd(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F5300
		void SetUpWaits(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F4A00
		void SetUpBinds(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F4B00
		void PawnLanded(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D499F4D00
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent 0x15D499F5100
		void MovementModeChanged(ACharacter Character, TEnumAsByte PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F4E00
		void RemoveBinds(); // Flags: BlueprintCallable|BlueprintEvent 0x15D499F4C00
		void ExecuteUbergraph_GA_Athena_TillLandFallDamageImmunity_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D499F5200
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GE_Athena_FallDmgImmune_FX.GE_Athena_FallDmgImmune_FX_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_FallDmgImmune_FX_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GE_Athena_FallDmgImmune_FX.GE_Athena_FallDmgImmune_FX_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot.GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_AbandonSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot.GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotOwner.GE_NPC_Behavior_TargetSlots_Melee_SlotOwner_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_SlotOwner_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotOwner.GE_NPC_Behavior_TargetSlots_Melee_SlotOwner_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_Max.GE_NPC_Behavior_TargetSlots_Ranged_Max_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_Max_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_Max.GE_NPC_Behavior_TargetSlots_Ranged_Max_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_Irwin.GE_Quest_Converted_Irwin_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Quest_Converted_Irwin_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_Irwin.GE_Quest_Converted_Irwin_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot.GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_OverrideSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot.GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/SafeZone/GE_UnderwaterDamage.GE_UnderwaterDamage_C
	// Inherited from UGET_PeriodicEnergyDamage_C -> UGET_PeriodicPhysicalDamage_C -> UGET_PeriodicDamageParent_C -> UGET_AfflictedParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UnderwaterDamage_C : public UGET_PeriodicEnergyDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/SafeZone/GE_UnderwaterDamage.GE_UnderwaterDamage_C");
			return ret;
		}
	};


	// Class /Game/Athena/SafeZone/GE_OutsideSafeZoneDamage.GE_OutsideSafeZoneDamage_C
	// Inherited from UGET_PeriodicEnergyDamage_C -> UGET_PeriodicPhysicalDamage_C -> UGET_PeriodicDamageParent_C -> UGET_AfflictedParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_OutsideSafeZoneDamage_C : public UGET_PeriodicEnergyDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/SafeZone/GE_OutsideSafeZoneDamage.GE_OutsideSafeZoneDamage_C");
			return ret;
		}
	};


	// Class /Game/Athena/AthenaFunctionLibrary.AthenaFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AthenaFunctionLibrary.AthenaFunctionLibrary_C");
			return ret;
		}

		void SpawnLootFromTableUsingItemEntry(FName TierGroupName, int32_t WorldLevel, int32_t ForcedLootTier, FVector Position, FVector Direction, int32_t OverrideMaxStackCount, bool bToss, bool bRandomRotation, bool bBlockedFromAutoPickup, int32_t PickupInstigatorHandle, EFortPickupSourceTypeFlag SourceType, EFortPickupSpawnSource Source, AFortPlayerController OptionalOwnerPC, bool bPickupOnlyRelevantToOwner, UObject __WorldContext, TArray& ItemPickupsSpawned); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D68082000
		void SpawnLootFromArray(TArray& Array, FVector Position, FVector Direction, int32_t OverrideMaxStackCount, bool bToss, bool bRandomRotation, bool bBlockedFromAutoPickup, int32_t PickupInstigatorHandle, EFortPickupSourceTypeFlag SourceType, EFortPickupSpawnSource Source, AFortPlayerController OptionalOwnerPC, bool bPickupOnlyRelevantToOwner, UObject __WorldContext, TArray& ItemPickupsSpawned); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6661E800
		void GetPlayerGroundedZ(AFortPlayerPawn PlayerPawn, UObject __WorldContext, double& Ground Z); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6661EC00
		bool ShouldAllowDeathEffects(FGameplayTagContainer Damage Or Death Tags, UObject __WorldContext); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6661E900
		void GetActorMeshExtents(AActor Actor, UObject __WorldContext, FVector& BoundingBoxExtents); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6661ED00
		void UnclampedLerp(double A, double B, double Alpha, UObject __WorldContext, double& Return Value); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D68081F00
		FGameplayEffectContextHandle MakeSimpleFortEffectContext(AActor Instigator, AActor Damage Source, UObject __WorldContext); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6661EB00
		void SpawnLootFromTable(FName TierGroupName, int32_t WorldLevel, int32_t ForcedLootTier, FVector Position, FVector Direction, int32_t OverrideMaxStackCount, bool bToss, bool bRandomRotation, bool bBlockedFromAutoPickup, int32_t PickupInstigatorHandle, EFortPickupSourceTypeFlag SourceType, EFortPickupSpawnSource Source, AFortPlayerController OptionalOwnerPC, bool bPickupOnlyRelevantToOwner, UObject __WorldContext, TArray& ItemPickupsSpawned); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D68082100
		bool RowToBool(FScalableFloat& Input, double Level, UObject __WorldContext); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6661EA00
		void AllOnSameTeam(AActor Actor, TArray& ActorArray, UObject __WorldContext, bool& Result); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6661EF00
		void CreateEnvironmentalKnockbackExplosion(FVector ExplosionSourcePoint, double ExplosionRadius, double Intensity, double MinKnockbackAngle, bool Reverse, AActor SpecificActor, UObject __WorldContext); // Flags: Static|Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6661EE00
	};


	// Class /Game/Athena/HUD/Actors/ConvertedMarkerInfo.ConvertedMarkerInfo_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xF8 (0x3D8 - 0x2E0)
	class UConvertedMarkerInfo_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UImage Image_Avatar; // 0x2E8(0x8)
		UImage Image_Command; // 0x2F0(0x8)
		UCommonVisibilitySwitcher ImageSwitcher; // 0x2F8(0x8)
		UImage SquadMarker; // 0x300(0x8)
		FTimerHandle DBNOPulseTimer; // 0x308(0x8)
		FGameplayTagContainer RelevantPlaylistTags; // 0x310(0x20)
		bool bIsTalking; // 0x330(0x1)
		bool bShowBackgroundOverridden; // 0x331(0x1)
		bool bEnemyVersion; // 0x332(0x1)
		unsigned char UnknownData01_6[0x5]; // 0x333(0x5) UNKNOWN PROPERTY
		TWeakObjectPtr Icon_Move; // 0x338(0x20)
		TWeakObjectPtr Icon_Hold; // 0x358(0x20)
		TWeakObjectPtr Icon_BackToMe; // 0x378(0x20)
		TWeakObjectPtr Icon_Revive; // 0x398(0x20)
		TWeakObjectPtr Icon_Attack; // 0x3B8(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/ConvertedMarkerInfo.ConvertedMarkerInfo_C");
			return ret;
		}

		void SetBackgroundVisibility(bool bOverride, bool bBackgroundVisible); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D68081500
		void OnLoaded_68559753464A154900ECA9BC6BB940C0(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D68081800
		void OnLoaded_25BCEE7642585A8BD6CE1CAFC70FEAF3(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D68081900
		void OverrideShowBackground(bool bShowBackground); // Flags: BlueprintCallable|BlueprintEvent 0x15D68081700
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D68081600
		void InitPlayerIconState(AFortPlayerStateAthena PSA); // Flags: BlueprintCallable|BlueprintEvent 0x15D68081A00
		void UpdateCommandIcon(PingCommandType PingCommand, FLinearColor Color); // Flags: BlueprintCallable|BlueprintEvent 0x15D68081400
		void InitNPCCommandIcon(FLinearColor Color); // Flags: BlueprintCallable|BlueprintEvent 0x15D68081B00
		void ExecuteUbergraph_ConvertedMarkerInfo(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D68081C00
	};


	// Class /Game/Athena/HUD/Actors/NPCStatusWidgetBar.NPCStatusWidgetBar_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xF1 (0x3A9 - 0x2B8)
	class UNPCStatusWidgetBar_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		USizeBox BarSizeBox; // 0x2C0(0x8)
		UImage Image_BarBG; // 0x2C8(0x8)
		UImage Image_CastShadow; // 0x2D0(0x8)
		USimpleMaterialProgressBar_C ProgressBarDelta; // 0x2D8(0x8)
		USimpleMaterialProgressBar_C ProgressBarFill; // 0x2E0(0x8)
		FLinearColor FillColor1; // 0x2E8(0x10)
		FLinearColor FillColor2; // 0x2F8(0x10)
		FLinearColor Delta1; // 0x308(0x10)
		FLinearColor Delta2; // 0x318(0x10)
		FLinearColor FillColor1_75Percent; // 0x328(0x10)
		FLinearColor FillColor2_75Percent; // 0x338(0x10)
		FLinearColor FillColor1_50Percent; // 0x348(0x10)
		FLinearColor FillColor2_50Percent; // 0x358(0x10)
		FLinearColor FillColor1_25Percent; // 0x368(0x10)
		FLinearColor FillColor2_25Percent; // 0x378(0x10)
		FLinearColor FillColor1_100Percent; // 0x388(0x10)
		FLinearColor FillColor2_100Percent; // 0x398(0x10)
		bool DifferentProgressColors; // 0x3A8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/NPCStatusWidgetBar.NPCStatusWidgetBar_C");
			return ret;
		}

		void SetHealthBarColorDependingHealth(double CurrentPercentage); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D68081000
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D68081100
		void SetPercent(double Value); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080E00
		void SetNumPips(int32_t NumPips); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080F00
		void SetPercentInstant(double Value); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080D00
		void ExecuteUbergraph_NPCStatusWidgetBar(int32_t EntryPoint); // Flags: Final 0x15D68081200
	};


	// Class /Game/Athena/HUD/Actors/NPCStatusWidget.NPCStatusWidget_C
	// Inherited from UNPCStatusWidgetBase -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x498 - 0x430)
	class UNPCStatusWidget_C : public UNPCStatusWidgetBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x430(0x8)
		UNPCStatusWidgetBar_C Bar_Health; // 0x438(0x8)
		UNPCStatusWidgetBar_C Bar_Shield; // 0x440(0x8)
		UOverlay Overlay_BarsPrefix; // 0x448(0x8)
		UVerticalBox VerticalBox_BarExtensions; // 0x450(0x8)
		FTimerHandle VisibiltyTimer; // 0x458(0x8)
		FMulticastInlineDelegate VisibilityChanged; // 0x460(0x10)
		double StatusWidgetVisibleDuration; // 0x470(0x8)
		double CurrentHealthPercent; // 0x478(0x8)
		double CurrentShieldPercent; // 0x480(0x8)
		bool KeepVisibilityOn; // 0x488(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x489(0x7) UNKNOWN PROPERTY
		AFortPawn FortPawn; // 0x490(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/NPCStatusWidget.NPCStatusWidget_C");
			return ret;
		}

		void EventUpdateStatus(double Health, double Shield, bool ShowShield); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080900
		void EventHideStatus(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080A00
		void ChangeWidgetVisibleDuration(double StatusWidgetVisibleDuration); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080C00
		void SetKeepVisibilityOn(bool KeepVisibilityOn); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080600
		void TryCallEventHideByTimer(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080500
		void BP_HandlePlaylistExtensionWidgetCreated(UUserWidget Widget, EUIExtensionSlot SlotType); // Flags: Event|Protected|BlueprintEvent 0x15D620B0A00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D68080B00
		void OnPawnFocused(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68080700
		void ExecuteUbergraph_NPCStatusWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D68080800
		void VisibilityChanged__DelegateSignature(bool bVisible); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D68080400
	};


	// Class /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C
	// Inherited from AFortAIPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x8E4 (0x3FA4 - 0x36C0)
	class ANPC_Pawn_Parent_C : public AFortAIPawn	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x36C0(0x8)
		USoundLibraryComponent SoundLibrary; // 0x36C8(0x8)
		UFortPawnComponent_CustomDepth FortPawnComponent_CustomDepth; // 0x36D0(0x8)
		UCapsuleComponent WeaponCapsuleCollision; // 0x36D8(0x8)
		UFortTaggedNavFiltersComponent FortTaggedNavFilters; // 0x36E0(0x8)
		UFortActorComponent_Affiliation FortActorComponent_Affiliation; // 0x36E8(0x8)
		USoundLibraryComponent SoundLibrary_Component; // 0x36F0(0x8)
		UAudioComponent MovementAudioComponent; // 0x36F8(0x8)
		UNPC_VoiceComponent_C NPC_VoiceComponent; // 0x3700(0x8)
		UAudioComponent VOAudioComponent; // 0x3708(0x8)
		UFortWidgetComponent NPCStatusWidget; // 0x3710(0x8)
		float Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x3718(0x4)
		TEnumAsByte Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x371C(0x1)
		unsigned char UnknownData34_6[0x3]; // 0x371D(0x3) UNKNOWN PROPERTY
		UTimelineComponent Timeline_ScaleMeshInOrOut; // 0x3720(0x8)
		UClass GE_NPC_RecentlyDamaged; // 0x3728(0x8)
		TEnumAsByte NPC_AlertLevel; // 0x3730(0x1)
		TEnumAsByte NPC_AlertLevelPrevious; // 0x3731(0x1)
		unsigned char UnknownData35_6[0x6]; // 0x3732(0x6) UNKNOWN PROPERTY
		TMap NPC_AlertLevelToTagMap; // 0x3738(0x50)
		bool NPC_StatusWidgetHealthBarDisabled; // 0x3788(0x1)
		unsigned char UnknownData36_6[0x3]; // 0x3789(0x3) UNKNOWN PROPERTY
		FGameplayTag GameplayCue_PickupGrabbed; // 0x378C(0x4)
		EFortRarity NPC_BestLootRarityInInventory; // 0x3790(0x1)
		bool NPC_DebugPawn; // 0x3791(0x1)
		bool NPC_ShowInventoryRarityVisuals; // 0x3792(0x1)
		unsigned char UnknownData37_6[0x5]; // 0x3793(0x5) UNKNOWN PROPERTY
		double InventoryGlowDelay; // 0x3798(0x8)
		FScalableFloat NPC_NumberOfInventoryItemsToDeliverHF; // 0x37A0(0x28)
		bool NPC_SpawnInvisible; // 0x37C8(0x1)
		bool NPC_ScaleMeshInOnSpawn; // 0x37C9(0x1)
		unsigned char UnknownData38_6[0x6]; // 0x37CA(0x6) UNKNOWN PROPERTY
		FGameplayTagContainer TC_NPC_SpawnAbilityTag; // 0x37D0(0x20)
		FGameplayTagContainer TC_NPC_AlternateSpawnAbilityTag; // 0x37F0(0x20)
		bool NPC_IsSpawning; // 0x3810(0x1)
		unsigned char UnknownData39_6[0x7]; // 0x3811(0x7) UNKNOWN PROPERTY
		double NPC_OriginalGravityScale; // 0x3818(0x8)
		FRotator NPC_OriginalRotationRate; // 0x3820(0x18)
		bool NPC_HasPawnGoal; // 0x3838(0x1)
		unsigned char UnknownData40_6[0x7]; // 0x3839(0x7) UNKNOWN PROPERTY
		AActor NPC_PawnGoalActor; // 0x3840(0x8)
		FScalableFloat NPC_NumberOfInventoryItemsToConsumeBeforeFullHF; // 0x3848(0x28)
		bool NPC_PawnIsDestroyingBuildingForNavigation; // 0x3870(0x1)
		unsigned char UnknownData41_6[0x7]; // 0x3871(0x7) UNKNOWN PROPERTY
		FScalableFloat MaxIdleVODelay; // 0x3878(0x28)
		FScalableFloat MinIdleVODelay; // 0x38A0(0x28)
		FScalableFloat NPC_DeathDropLootDelay; // 0x38C8(0x28)
		FName NPC_DeathDropLootTierGroupName; // 0x38F0(0x4)
		unsigned char UnknownData42_6[0x4]; // 0x38F4(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer NPC_DeathDropLootRequiredDamageTags; // 0x38F8(0x20)
		FGameplayTagContainer NPC_DeathDropLootForbiddenDamageTags; // 0x3918(0x20)
		FGameplayTagContainer GrantStartingItemsAbilityTC; // 0x3938(0x20)
		bool NPC_HasItemInInventory; // 0x3958(0x1)
		unsigned char UnknownData43_6[0x3]; // 0x3959(0x3) UNKNOWN PROPERTY
		FGameplayTag VoiceTag_FullAlertIdle; // 0x395C(0x4)
		FGameplayTag VoiceTag_Idle; // 0x3960(0x4)
		FGameplayTag VoiceTag_ReturnToIdle; // 0x3964(0x4)
		FGameplayTag VoiceTag_LostTarget; // 0x3968(0x4)
		FGameplayTag VoiceTag_Suspicious; // 0x396C(0x4)
		FGameplayTag VoiceTag_FullAlert; // 0x3970(0x4)
		unsigned char UnknownData44_6[0x4]; // 0x3974(0x4) UNKNOWN PROPERTY
		TArray NPC_TargetSlotsHF; // 0x3978(0x10)
		bool NPC_DamageCanCancelIntroPhase; // 0x3988(0x1)
		unsigned char UnknownData45_6[0x7]; // 0x3989(0x7) UNKNOWN PROPERTY
		FGameplayTagQuery TQ_NPC_DamageTagsThatCanCancelIntroPhase; // 0x3990(0x48)
		UClass GE_NPC_IntroPhaseBehaviorCooldown; // 0x39D8(0x8)
		FGameplayTagContainer TC_IntroBehaviorActive; // 0x39E0(0x20)
		bool Debug_NPC_AlertLevelForced; // 0x3A00(0x1)
		bool NPC_PawnCanInteractInternal; // 0x3A01(0x1)
		unsigned char UnknownData46_6[0x6]; // 0x3A02(0x6) UNKNOWN PROPERTY
		FScalableFloat NPC_PrimtiveDataFloatSetRandomlyInRange; // 0x3A08(0x28)
		FScalableFloat NPC_PrimtiveDataFloatIndexHF; // 0x3A30(0x28)
		FScalableFloat NPC_PrimtiveDataFloatMinRangeHF; // 0x3A58(0x28)
		FScalableFloat NPC_PrimtiveDataFloatMaxRangeHF; // 0x3A80(0x28)
		AActor NPC_Leader; // 0x3AA8(0x8)
		FGameplayTag GameplayCue_LeaderSet; // 0x3AB0(0x4)
		unsigned char UnknownData47_6[0x4]; // 0x3AB4(0x4) UNKNOWN PROPERTY
		double NPC_Skeletal_Mesh_Index; // 0x3AB8(0x8)
		USoundBase TamedSound; // 0x3AC0(0x8)
		UAudioComponent StateChangeSound; // 0x3AC8(0x8)
		FScalableFloat NPC_ShouldDespawnFromStormHF; // 0x3AD0(0x28)
		FScalableFloat NPC_DespawnTimerHF; // 0x3AF8(0x28)
		FGameplayTag NPC_DespawnGameplayTag; // 0x3B20(0x4)
		unsigned char UnknownData48_6[0x4]; // 0x3B24(0x4) UNKNOWN PROPERTY
		FTimerHandle NPC_TestIsInSafeZoneTimer; // 0x3B28(0x8)
		FTimerHandle NPC_DespawnFromStormTimer; // 0x3B30(0x8)
		bool NPC_isTryingToDespawn; // 0x3B38(0x1)
		unsigned char UnknownData49_6[0x3]; // 0x3B39(0x3) UNKNOWN PROPERTY
		FGameplayTag NPC_ResetIntroGameplayTags; // 0x3B3C(0x4)
		double SelectedPrimitiveDataFloat; // 0x3B40(0x8)
		FGameplayTag GameplayCue_Death; // 0x3B48(0x4)
		unsigned char UnknownData50_6[0x4]; // 0x3B4C(0x4) UNKNOWN PROPERTY
		TArray OG_Materials; // 0x3B50(0x10)
		bool NPC_Apply_GE_for_Swimming; // 0x3B60(0x1)
		unsigned char UnknownData51_6[0x7]; // 0x3B61(0x7) UNKNOWN PROPERTY
		UClass NPC_GE_ClassToApplyForSwimming; // 0x3B68(0x8)
		bool NPC_Apply_Water_Enter_Exit_Burst_GC; // 0x3B70(0x1)
		unsigned char UnknownData52_6[0x3]; // 0x3B71(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle NPC_GE_AppliedForSwimming; // 0x3B74(0x8)
		FName GoalActorBBKey; // 0x3B7C(0x4)
		FGameplayTag GameplayCueLureInterest; // 0x3B80(0x4)
		unsigned char UnknownData53_6[0x4]; // 0x3B84(0x4) UNKNOWN PROPERTY
		UObject NPC_PreviousLureGoal; // 0x3B88(0x8)
		FGameplayTag Enter_Water; // 0x3B90(0x4)
		FGameplayTag Exit_Water; // 0x3B94(0x4)
		FScalableFloat NPC_MaxDistanceFromDamagedNPCToDrawHeallthBarHF; // 0x3B98(0x28)
		FScalableFloat NPC_HealthBarHideTimeAfterDeathHF; // 0x3BC0(0x28)
		FScalableFloat NPC_PlayEffectWhenLuredHF; // 0x3BE8(0x28)
		FScalableFloat NPC_PawnCanInteractHF; // 0x3C10(0x28)
		FScalableFloat NPC_AllowInteractOnlyWhenUnawareHF; // 0x3C38(0x28)
		FScalableFloat NPC_AllowInteractWhenHasLeaderHF; // 0x3C60(0x28)
		FScalableFloat NPC_AllowDrownInShallowWaterHF; // 0x3C88(0x28)
		bool NPC_IsInventoryInitialized; // 0x3CB0(0x1)
		unsigned char UnknownData54_6[0x3]; // 0x3CB1(0x3) UNKNOWN PROPERTY
		float LeaderClearedCueDelay; // 0x3CB4(0x4)
		FGameplayTag GameplayCue_LeaderCleared; // 0x3CB8(0x4)
		bool isGCForLeaderSetLooping; // 0x3CBC(0x1)
		unsigned char UnknownData55_6[0x3]; // 0x3CBD(0x3) UNKNOWN PROPERTY
		FGameplayTag NPC_DeathByStormTag; // 0x3CC0(0x4)
		bool NPC_TryDespawnAbility; // 0x3CC4(0x1)
		unsigned char UnknownData56_6[0x3]; // 0x3CC5(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GeOutsideSafeZoneDamageHandle; // 0x3CC8(0x8)
		bool IsGEStormDamageInit; // 0x3CD0(0x1)
		bool NPC_MeshScalingInProgress; // 0x3CD1(0x1)
		bool NPC_DisableCapsuleOverlapsWhenScalingOut; // 0x3CD2(0x1)
		unsigned char UnknownData57_6[0x5]; // 0x3CD3(0x5) UNKNOWN PROPERTY
		FVector NPC_OriginalMeshScale; // 0x3CD8(0x18)
		FMulticastInlineDelegate NPCScaleMeshInCompleted; // 0x3CF0(0x10)
		FMulticastInlineDelegate NPCScaleMeshOutCompleted; // 0x3D00(0x10)
		bool NPC_CanDropLoot; // 0x3D10(0x1)
		unsigned char UnknownData58_6[0x7]; // 0x3D11(0x7) UNKNOWN PROPERTY
		FScalableFloat NPC_StaleDespawnTestDistance_HF; // 0x3D18(0x28)
		FScalableFloat NPC_StaleDespawnTimeThreshold_HF; // 0x3D40(0x28)
		double NPC_LastNonStaleCheckTime; // 0x3D68(0x8)
		bool bCanBeDamagedByNullInstigator; // 0x3D70(0x1)
		bool IsEnteringWater; // 0x3D71(0x1)
		unsigned char UnknownData59_6[0x6]; // 0x3D72(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate NPCPawnInteractWithDispatcher; // 0x3D78(0x10)
		bool NPCDynamicBlockConversionOnInteract; // 0x3D88(0x1)
		bool NPC_TempInteractOverride; // 0x3D89(0x1)
		unsigned char UnknownData60_6[0x6]; // 0x3D8A(0x6) UNKNOWN PROPERTY
		USoundBase HeadShot_Sound; // 0x3D90(0x8)
		FName Headshot_FX_Socket; // 0x3D98(0x4)
		bool UseHeadShotFX; // 0x3D9C(0x1)
		unsigned char UnknownData61_6[0x3]; // 0x3D9D(0x3) UNKNOWN PROPERTY
		FGameplayTagContainer TC_WeaponTypesAllowedForHeadshotFX; // 0x3DA0(0x20)
		bool AllowHeadshot; // 0x3DC0(0x1)
		unsigned char UnknownData62_6[0x7]; // 0x3DC1(0x7) UNKNOWN PROPERTY
		double AdditiveHitReactRetriggerDelay; // 0x3DC8(0x8)
		UAnimMontage Additive_Hit_React_Montage; // 0x3DD0(0x8)
		USoundBase Death_Normal_Sound; // 0x3DD8(0x8)
		UParticleSystem HeadshotFXEmitterTemplate; // 0x3DE0(0x8)
		FGameplayTagContainer Sound_Library_Collection_Tags; // 0x3DE8(0x20)
		FGameplayTagContainer Sound_Library_Default_Tags; // 0x3E08(0x20)
		FGameplayTagContainer Sound_Library_Alert_Tags; // 0x3E28(0x20)
		FGameplayTagContainer Sound_Library_Aggressive_Tags; // 0x3E48(0x20)
		TArray SoundLibs_Default; // 0x3E68(0x10)
		TArray SoundLibs_Alert; // 0x3E78(0x10)
		USoundLibrary CurrentSoundLib; // 0x3E88(0x8)
		TArray SoundLibs_Aggressive; // 0x3E90(0x10)
		TArray SoundLibs_Foley; // 0x3EA0(0x10)
		TArray SoundLibs_Foley_Water; // 0x3EB0(0x10)
		USoundLibrary CurrentFoleyLib; // 0x3EC0(0x8)
		double Custom_Depth_Update_Rate; // 0x3EC8(0x8)
		UClass Class; // 0x3ED0(0x8)
		UClass GE_Converted; // 0x3ED8(0x8)
		FActiveGameplayEffectHandle GE_Converted_Handle; // 0x3EE0(0x8)
		double NPC_Death_Time; // 0x3EE8(0x8)
		float ScaleMeshInOrOutPlayRate; // 0x3EF0(0x4)
		bool AllowSkipScaleOutIfNotRecentlyRendered; // 0x3EF4(0x1)
		unsigned char UnknownData63_6[0x3]; // 0x3EF5(0x3) UNKNOWN PROPERTY
		FMulticastInlineDelegate NPCAlertLevelUpdated; // 0x3EF8(0x10)
		FGameplayTagContainer GameplayTagsToBlockHitReact; // 0x3F08(0x20)
		FGameplayTag GCInstantDeathTag; // 0x3F28(0x4)
		unsigned char UnknownData64_6[0x4]; // 0x3F2C(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate NPCPickupGrabInitiated; // 0x3F30(0x10)
		UContextualAnimSceneAsset CAS_Interaction_Petting; // 0x3F40(0x8)
		UContextualAnimSceneAsset CAS_Interaction_Feeding; // 0x3F48(0x8)
		UContextualAnimSceneAsset CAS_Interaction_Taming; // 0x3F50(0x8)
		TWeakObjectPtr Athena_GameState_SoftClass; // 0x3F58(0x20)
		FMulticastInlineDelegate NPCEnteredWaterBody; // 0x3F78(0x10)
		bool NPC_Apply_Deep_Water_Enter_Exit_Burst_GC; // 0x3F88(0x1)
		unsigned char UnknownData65_6[0x3]; // 0x3F89(0x3) UNKNOWN PROPERTY
		FGameplayTag Enter_Deep_Water; // 0x3F8C(0x4)
		FGameplayTag Exit_Deep_Water; // 0x3F90(0x4)
		bool NPC_Client_Apply_Water_Enter_Exit_Burst_GC; // 0x3F94(0x1)
		unsigned char UnknownData66_6[0x3]; // 0x3F95(0x3) UNKNOWN PROPERTY
		FGameplayTag GameplayCue_SystemInstantDeath; // 0x3F98(0x4)
		bool RunningInstantDeathCue; // 0x3F9C(0x1)
		unsigned char UnknownData67_6[0x3]; // 0x3F9D(0x3) UNKNOWN PROPERTY
		FGameplayTag GCInstantDeathTagTwo; // 0x3FA0(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C");
			return ret;
		}

		void Orphaned(bool& IsOrphaned, AFortPawn& AttachedPawn); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B078500
		void ShouldRunInstantDeathCue(FGameplayTagContainer DeathTags, AActor Instigator, AActor DamageCauser, bool& Result); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07B900
		void NPC GetPreviousAlertLevelInfo(TEnumAsByte& AlertLevel, FGameplayTag& AlertLevelTag, bool& ValidDataFound); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B077F00
		void NPC AlertLevelUpdatedClient(); // Flags: Protected|BlueprintCallable|BlueprintEvent 0x15D1B074A00
		void UpdateTrackedActorStateFromCurrentAlertLevel(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B07E700
		void RemoveLibraryCollection(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07BF00
		void Check Tag(FGameplayTagContainer Tag Container, bool& ShouldDefault); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B076100
		void UpdateSoundLibraryCollection(bool AddLibraries, bool& ValidLibraries); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B07A600
		void TryShowHealthBar(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B07AC00
		void OnRep_NPC Death Time(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B078900
		void PlayStateChangeAudio(TEnumAsByte Index); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07C200
		void IsConverted(bool& IsConverted); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B074E00
		void NPC GhostCollisionSettings(bool NoCollisionForRanged, bool NoCollisionForMelee, bool NoCollisionForProjectiles, bool OnlyOverlapCollisionForPawns); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B077B00
		bool CanUpdateSoundLib(TArray& TargetArray); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B076200
		void PlayAdditiveHitReacts(FVector& Hit Direction, UAnimMontage Anim Montage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07C500
		void NPC DamageRemovesIdlePhaseTagGE(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B078300
		void GetSoundFoleyLibrary(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B075300
		void NPC CanBeInteractedWith(bool& CanInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B074600
		void NPC CheckForDespawnIfStaleToPlayers(AFortPlayerPawn ClosestFortPlayerPawn); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B074500
		void NPC SetCanDropLoot(bool CanDropLoot); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B076A00
		void NPC GetSafeZonePhase(int32_t& SafeZonePhase); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B077E00
		void OnRep_NPC Leader(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B078800
		void Play Water Splash at Water Surface(AFortWaterBodyActor Water Body, FGameplayTag GameplayCueTag); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B07C600
		void ResetMaterialFromDeath(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B07BC00
		void OnRep_SelectedPrimitiveDataFloat(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B078600
		void CheckSoundLibraryRemoved(TArray& Libraries); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B075F00
		void CheckSoundLibraryAdded(TArray& Libraries); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B076000
		void UpdateSoundLibrary(TEnumAsByte Alert Level); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07A700
		void NPC ClearOutTargetSlots(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B074300
		void NPC UpdateInteract(bool CanInteract, bool& EnabledInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07A400
		void NPC HasLeader?(bool& HasLeader?, AActor& Leader); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B077900
		void NPC SetLeader(AActor Leader, bool& Success?, AActor& LeaderSet); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B076900
		void NPC AttemptToSetLeader(AActor PossibleLeader, EUnconvertReason UnconvertReason); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B074700
		void SetPrimitiveDataFloat(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07BA00
		void SelectPrimitiveDataFloat(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07BB00
		void StoreOriginalGravityAndRotation(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07B400
		void NPC DisableIntroPhaseBehavior(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B078200
		void NPC DamageAttemptDisableIntroPhaseBehavior(FGameplayTagContainer DamageTags); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B078400
		void NPC TargetSlotIsUsingOverride(TEnumAsByte TargetSlotType, AActor TargetWeWantToSlotOnto, bool& Override); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B076500
		void NPC TargetSlotInfo(TEnumAsByte TargetSlotType, AActor TargetWeWantToSlotOnto, int32_t& TargetSlotCount, int32_t& TargetSlotMax, int32_t& NPC TargetSlotsRequired, bool& TargetSlotsMaxOrMore, bool& TargetSlotCountIsExactlyMax, bool& NPC IsTargetSlotOwner, bool& NPC HasSpaceToSlotOnTarget, TEnumAsByte& TargetSlotTypeOut, UClass& TargetSlotCountingGE, FScalableFloat& AI TargetSlotSizeHF, FScalableFloat& AI TargetSlotDurationHF, UClass& TargetSlotOverrideGE, UClass& TargetSlotOwnerGE, UClass& TargetSlotCountingMaxedGE); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B076600
		void NPC CheckIsInSafeZone(bool& TestSucceeded, bool& isInSafeZone); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B074400
		void NPC HandleAlertLevelVoice(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B077A00
		void NPC TryToDropLootOnDeath(FGameplayTagContainer DamageTags, bool& CanDropLoot); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B076400
		void NPC ApplyGameplayEffectWithMMRScaling(AActor Actor, UClass GE Class); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B074900
		void NPC SetLootCollectionPhaseCompleteToBlackboard(bool LootCollectionPhaseComplete); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B076800
		void NPC ResetOriginalRotationRate(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B076E00
		void NPC ResetOriginalGravityScale(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B076F00
		void NPC SetReturnGatheredLootToBlackboard(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B076700
		void NPC GetScalableFloatHotfixValue(FScalableFloat& ScalableFloatHotfix, double AtLevel, bool& AsBool, int32_t& AsIntRounded, double& AsFloat); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B077C00
		void NPC ScalableFloatIsValid(FScalableFloat& ScalableFloat, bool& Valid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B076D00
		void NPC PickupDropped(AFortPickup FortPickupDropped); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B077200
		void NPC PickupGrabbed_Destroyed(AActor ActorGrabbed); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B077000
		void NPC PickupGrabbed(AFortPickup FortPickupGrabbed); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B077100
		void OnRep_NPC BestLootRarityInInventory(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B078A00
		void NPC SendGameplayCuePickupGrabbed(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B076C00
		void NPC PawnDebugMessage(FString String, bool OnlyWhenDebug); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B077300
		void NPC GetInventoryInformation(bool& HasItemInInventory, int32_t& TotalNumberOfInventoryItems, int32_t& LastInventoryItemIndex, bool& HasEnoughItemsToDeliver, bool& ConsumedEnoughItemsToBeConsideredFull); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B078000
		void NPC SetBestLootRarityInInventory(EFortRarity& NPC BestLootRarityInInventory); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B076B00
		void OnRep_NPC_AlertLevel(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B078700
		void NPC GetAlertLevelInfo(TEnumAsByte& AlertLevel, FGameplayTag& AlertLevelTag, bool& ValidDataFound); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B078100
		void NPC ApplyRecentlyDamagedTagGE(UClass RecentlyDamagedOverride); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B074800
		bool ShouldUpdateSkeletalMesh(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07B800
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D1B07E600
		void Timeline_ScaleMeshInOrOut__FinishedFunc(); // Flags: BlueprintEvent 0x15D1B07B100
		void Timeline_ScaleMeshInOrOut__UpdateFunc(); // Flags: BlueprintEvent 0x15D1B07B000
		void WidgetVisibilityChanged(bool bVisible); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07E500
		void NPC ParentLaunchVehicle(AActor Vehicle, FVector Velocity); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B077500
		void TestLoot(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07B200
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D1B079300
		void NPC UpdateHealthBarComponentVisibility(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07A500
		void ReceivePossessed(AController NewController); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x15D1B07C000
		void ReceiveEndPlay(TEnumAsByte EndPlayReason); // Flags: Event|Protected|BlueprintEvent 0x15D1B077D00
		void RequestUpdateNPCAlertLevel(TEnumAsByte NPC_AlertLevel, TEnumAsByte Reason); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07BD00
		void NPCAlertLevelChangedClient(TEnumAsByte NPC_AlertLevel); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07A300
		void NPC InitializeIdleVO(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B077800
		void TriggerIdleVO(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07AD00
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D1B079200
		void NPCEnableHealthBars(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B07A000
		void NPCDisableHealthBars(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B07A100
		void Debug_AlertLevel_ForceLevel(TEnumAsByte NewNPC_AlertLevel); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075D00
		void Debug_AlertLevel_ClearDebug(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075E00
		void Debug_ForceAlertLevel_Invalid(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075A00
		void Debug_ForceAlertLevel_Unaware(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075800
		void Debug_ForceAlertLevel_NA(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075900
		void Debug_ForceAlertLevel_Alerted(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075B00
		void Debug_ForceAlertLevel_Aggressive(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075C00
		void HandleInteracts(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075100
		void NPC Pawn Interact(AFortAIPawn AI, AFortPlayerController InteractingPlayerController, TEnumAsByte InteractionBeingAttempted); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B077400
		void On NPC PawnInteractedWith(AActor AIPawn, AFortPlayerPawn InteractingPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B079800
		void OnBeginDeepWaterInteraction(FVector WaterSurfaceLocation, float WaterDepth, AWaterBody WaterBody); // Flags: Event|Public|BlueprintEvent 0x15D1B079600
		void NPC LeaderSet(bool Success?, AActor Leader, EUnconvertReason UnconvertReason); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B077700
		void TestIsInSafeZone(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07B300
		void GrantStartingItems(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075200
		void TryToDespawnDueToStorm(bool Reset Timer); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07AB00
		void InitializeTestInSafeZone(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B074F00
		void DespawnDueToStorm(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075700
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D1B07C100
		void OnDamageServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D1B079400
		void TriggerDeathFX(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07AF00
		void OnEndDance(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B079100
		void OnBeginDance(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B079700
		void End Music Tracker(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075600
		void BeginMusicTracker(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B076300
		void StopUpdatingHealthBarWidget(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07B500
		void RemoveSoundSystemLibraries(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07BE00
		void AddSoundSystemLibraries(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B072200
		void InitializeInventory(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075000
		void StartUpdatingHleathBarWidget(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07B700
		void NPC AlertLevelChangedServer(TEnumAsByte NPCAlertLevel); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B074B00
		void OnPawnHealthChanged_Event(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B078B00
		void OnEnteredWaterBody(AFortWaterBodyActor WaterBody, bool bIsFirstBody); // Flags: Event|Public|BlueprintEvent 0x15D1B078F00
		void OnExitedWaterBody(AFortWaterBodyActor WaterBody, bool bIsLastBody); // Flags: Event|Public|BlueprintEvent 0x15D1B078D00
		void LuredOnServer(TEnumAsByte AlertLevel); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B074C00
		void LuredInterest(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B074D00
		void PlayEnterWaterSplash(AFortWaterBodyActor Water Body); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B07C400
		void PlayExitWaterSplash(AFortWaterBodyActor Water Body); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B07C300
		void TryWaterInteractionDrown(bool CalledFromDeepWaterInteraction); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07AA00
		void StopTestingIsInSafeZone(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07B600
		void NPCScaleMeshIn(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B079C00
		void NPCScaleMeshOut(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B079A00
		void TriggerDespawnAbility(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07AE00
		void NPC MulticastGameplayCueDeath(bool ShouldRunInstantDeathCue); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B077600
		void UpdateSoundLibFoley(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D1B07A800
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D1B079500
		void AdditiveHitReactDelay(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B072300
		void UpdateCustomDepth(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07A900
		void OnEndDeepWaterInteraction(FVector PreviousWaterSurfaceLocation, float WaterDepth, AWaterBody WaterBody); // Flags: Event|Public|BlueprintEvent 0x15D1B079000
		void ForceUpdateCustomDepth(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B075400
		void OnEnteredWaterBodyClient(AFortWaterBodyActor WaterBody, bool bIsFirstBody); // Flags: Event|Public|BlueprintEvent 0x15D1B078E00
		void OnExitedWaterBodyClient(AFortWaterBodyActor WaterBody, bool bIsLastBody); // Flags: Event|Public|BlueprintEvent 0x15D1B078C00
		void ExecuteUbergraph_NPC_Pawn_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D1B075500
		void NPCEnteredWaterBody__DelegateSignature(AFortWaterBodyActor Water Body, bool Entering Water ?); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B079F00
		void NPCPickupGrabInitiated__DelegateSignature(AFortPickup FortPickupGrabbed); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B079D00
		void NPCAlertLevelUpdated__DelegateSignature(TEnumAsByte NPC Alert Level); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B07A200
		void NPCPawnInteractWithDispatcher__DelegateSignature(AActor AIPawn, AFortPlayerPawn InteractingPlayerPawn); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B079E00
		void NPCScaleMeshOutCompleted__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B079900
		void NPCScaleMeshInCompleted__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B079B00
	};


	// Class /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C
	// Inherited from ANPC_Pawn_Parent_C -> AFortAIPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x1AC (0x4150 - 0x3FA4)
	class ANPC_Pawn_Wildlife_Parent_C : public ANPC_Pawn_Parent_C	
	{
	public:
		unsigned char UnknownData09_3[0x4]; // 0x3FA4(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x3FA8(0x8)
		UFortCharacterPartsComponent FortCharacterParts; // 0x3FB0(0x8)
		UNiagaraComponent Wildlife_FootDust; // 0x3FB8(0x8)
		UFortPawnComponent_Convert ConvertComponent; // 0x3FC0(0x8)
		TWeakObjectPtr Layer_Idle; // 0x3FC8(0x20)
		TWeakObjectPtr Layer_Locomotion; // 0x3FE8(0x20)
		TWeakObjectPtr Layer_Jump; // 0x4008(0x20)
		char LeaderTeam; // 0x4028(0x1)
		unsigned char UnknownData10_6[0x7]; // 0x4029(0x7) UNKNOWN PROPERTY
		USoundEffectSourcePresetChain VocalSourceEffectChainOverride; // 0x4030(0x8)
		bool bTamingEnabled; // 0x4038(0x1)
		unsigned char UnknownData11_6[0x7]; // 0x4039(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnPickupGrabbed_Destroyed; // 0x4040(0x10)
		bool bCanBeInteractedWithWhileTamed; // 0x4050(0x1)
		unsigned char UnknownData12_6[0x3]; // 0x4051(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GE_Quest_Converted_Handle; // 0x4054(0x8)
		unsigned char UnknownData13_6[0x4]; // 0x405C(0x4) UNKNOWN PROPERTY
		UClass GE_Quest_Converted_Irwin; // 0x4060(0x8)
		FMulticastInlineDelegate ConvertedDispatcher; // 0x4068(0x10)
		bool bIsBeingRidden; // 0x4078(0x1)
		bool NPCStatusWidgetShouldDisplayDamage; // 0x4079(0x1)
		unsigned char UnknownData14_6[0x6]; // 0x407A(0x6) UNKNOWN PROPERTY
		UClass GE_GoalSelectionWhileTamed; // 0x4080(0x8)
		FGameplayTagContainer T_GoalSelectionWhileTamed; // 0x4088(0x20)
		double CurrentEnergy; // 0x40A8(0x8)
		FGameplayTag IrwinSlidingGC; // 0x40B0(0x4)
		bool bLeaderSetSuccess; // 0x40B4(0x1)
		unsigned char UnknownData15_6[0x3]; // 0x40B5(0x3) UNKNOWN PROPERTY
		FGameplayTag JumpLandSoundLibTag; // 0x40B8(0x4)
		FGameplayTag TameSoundLibTag; // 0x40BC(0x4)
		USoundBase SoundIndicatorSound_Unridden; // 0x40C0(0x8)
		USoundBase SoundIndicatorSound_Ridden; // 0x40C8(0x8)
		bool OverrideIncomingDmg; // 0x40D0(0x1)
		unsigned char UnknownData16_6[0x7]; // 0x40D1(0x7) UNKNOWN PROPERTY
		double OverridenIncomingDmgAmount; // 0x40D8(0x8)
		FMulticastInlineDelegate OnModifiedDamageReceived; // 0x40E0(0x10)
		double ColorVariation; // 0x40F0(0x8)
		char Default_Unconvert_Reason; // 0x40F8(0x1)
		unsigned char UnknownData17_6[0x7]; // 0x40F9(0x7) UNKNOWN PROPERTY
		FScalableFloat StuckBouncing_UnstuckEnabled; // 0x4100(0x28)
		int32_t StuckBouncing_LaunchCount; // 0x4128(0x4)
		int32_t StuckBouncing_MinLaunchCount; // 0x412C(0x4)
		FActiveGameplayEffectHandle StuckBouncing_GeHandle; // 0x4130(0x8)
		UClass StuckBouncing_GE; // 0x4138(0x8)
		double StuckBouncing_UnstuckVelocityMaxZRotationAngle; // 0x4140(0x8)
		double StuckBouncing_UnstuckVelocity; // 0x4148(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C");
			return ret;
		}

		void ApplyVariation(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07D500
		void SetColorVariation(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D41F91A00
		FVector OnLaunchCharacter(FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D1B07EF00
		void TryShowHealthBar(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F91700
		bool BlueprintCanInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D1B07D200
		void PlayStateChangeAudio(TEnumAsByte Index); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F91E00
		void PlayAdditiveHitReacts(FVector& Hit Direction, UAnimMontage Anim Montage); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F91F00
		float BlueprintModifyIncomingDamage(float Damage, FGameplayTagContainer& DamageTags, FGameplayEffectContextHandle& EffectContext, AController EventInstigator, AActor DamageCauser); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07D100
		void NPCStatusWidget_UpdateKeepVisible(bool ShouldKeepVisible); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07FA00
		void CanBeInteractedWithWhenTamed(bool& bCanInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D1B07CD00
		void NPC PickupGrabbed_Destroyed(AActor ActorGrabbed); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D1B07FC00
		void SetTamingEnabled(bool EnableTaming); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F91900
		void NPC CanBeInteractedWith(bool& CanInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07FE00
		void AttachAndApplyVocalFX(FSoundLibraryPlayResult& SoundLibraryResult); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D1B07D300
		void Play Water Splash at Water Surface(AFortWaterBodyActor Water Body, FGameplayTag GameplayCueTag); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F92000
		bool IsValidAutoFireTarget(AActor Attacker); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D1B07C800
		void Play Sound Lib(FGameplayTag Event Name); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F92100
		void UpdateTamingIndicator(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F91600
		void OnRep_LeaderTeam(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07E900
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D41F91500
		void OnLoaded_9DC5FDA543FAF13BB29E95AA78B28A06(UClass Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07EE00
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D41F91D00
		void LinkAnimationLayers(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07C700
		void AsyncLinkAnimationLayer(TWeakObjectPtr AnimationLayer); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07D400
		void OnCustomizationsLoaded_BP(); // Flags: Event|Protected|BlueprintEvent 0x15D1B07F400
		void On NPC PawnInteractedWith(AActor AIPawn, AFortPlayerPawn InteractingPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07F800
		void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_0_ConvertedEvent__DelegateSignature(AFortPawn InstigatorPawn, AFortPawn ConvertedPawn); // Flags: BlueprintEvent 0x15D1B07D000
		void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(AFortPawn UnconvertedPawn, EUnconvertReason UnconvertReason); // Flags: BlueprintEvent 0x15D1B07CF00
		void NPC AlertLevelChangedServer(TEnumAsByte NPCAlertLevel); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07FF00
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D1B07F100
		void NPC LeaderSet(bool Success?, AActor Leader, EUnconvertReason UnconvertReason); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07FD00
		void BndEvt__SoundLibrary_Component_K2Node_ComponentBoundEvent_2_OnSoundLibraryPlayEvent__DelegateSignature(FSoundLibraryPlayResult& Results, USoundLibraryContext Context); // Flags: HasOutParms|BlueprintEvent 0x15D1B07CE00
		void OnBeingControlledChanged(bool bControlled); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D1B07F500
		void OnApplyEffectOptimization(int32_t NewBudgetValue); // Flags: Event|Public|BlueprintEvent 0x15D1B07F600
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D1B07F300
		void NPC UpdateHealthBarComponentVisibility(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07FB00
		void OnPawnHealthChanged_Event(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07EB00
		void On Pawn Focused(AFortPawn FocusedPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07F700
		void HideStatus(); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07C900
		void OnSlidingStateChanged(bool bNewSlidingState); // Flags: Event|Protected|BlueprintEvent 0x15D1B07E800
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D1B07F200
		void OnLanded(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D1B07F000
		void OnOutOfConvertResistanceServer(float ConvertDamageDone, FGameplayTagContainer& SourceTags, FGameplayEffectContextHandle& EffectContext, AController EffectInstigator, AActor EffectCauser); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D1B07EC00
		void RestoreConvertResistance(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F91B00
		void CE_UpdateSurfaceType(UActorComponent Component, bool bReset); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07CC00
		void On Customization Applied(TScriptInterface Value); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07F900
		void ReceiveEndPlay(TEnumAsByte EndPlayReason); // Flags: Event|Protected|BlueprintEvent 0x15D41F91C00
		void ExecuteUbergraph_NPC_Pawn_Wildlife_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D1B07CA00
		void OnModifiedDamageReceived__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B07ED00
		void ConvertedDispatcher__DelegateSignature(bool Converted, AFortPawn InstigatorPawn); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B07CB00
		void OnPickupGrabbed_Destroyed__DelegateSignature(ANPC_Pawn_Wildlife_Parent_C WildlifePawn, AActor ActorGrabbed); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D1B07EA00
	};


	// Class /Game/Athena/HUD/Actors/NPCConvertedIndicatorMarker.NPCConvertedIndicatorMarker_C
	// Inherited from UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x5E0 - 0x5B8)
	class UNPCConvertedIndicatorMarker_C : public UAthenaMarkedActorIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5B8(0x8)
		UImage IrwinIndicator; // 0x5C0(0x8)
		UConvertedMarkerInfo_C RidingMarkerInfo; // 0x5C8(0x8)
		FLinearColor CachedColor; // 0x5D0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/NPCConvertedIndicatorMarker.NPCConvertedIndicatorMarker_C");
			return ret;
		}

		void OnSetMarkerData(FFortWorldMarkerData& FortWorldMarkerData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D1B07D700
		void OnPingCommandEvent(PingCommandType CommandType); // Flags: BlueprintCallable|BlueprintEvent 0x15D1B07D800
		void ExecuteUbergraph_NPCConvertedIndicatorMarker(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D1B07D900
	};


	// Class /Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C
	// Inherited from APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x2B8 (0x5FA8 - 0x5CF0)
	class APlayerPawn_Athena_Generic_C : public APlayerPawn_Athena_Generic_Parent_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5CF0(0x8)
		UParticleSystemComponent Effect_WaterInteraction_FX; // 0x5CF8(0x8)
		bool IsInWater; // 0x5D00(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x5D01(0x7) UNKNOWN PROPERTY
		FRotator RunWalkParticleRotation; // 0x5D08(0x18)
		int32_t WaterCounter; // 0x5D20(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x5D24(0x4) UNKNOWN PROPERTY
		double Tick_Delta_Seconds; // 0x5D28(0x8)
		USoundBase Sound_Shield_Impact; // 0x5D30(0x8)
		USoundBase Sound_Shield_Destroyed; // 0x5D38(0x8)
		USoundBase Sound_Shield_Destroyed_1P; // 0x5D40(0x8)
		USoundBase Sound_Shield_FullyCharged; // 0x5D48(0x8)
		USoundBase Sound_Shield_StartRecharge; // 0x5D50(0x8)
		bool BodyValid; // 0x5D58(0x1)
		bool BackpackValid; // 0x5D59(0x1)
		bool HatValid; // 0x5D5A(0x1)
		bool FaceValid; // 0x5D5B(0x1)
		bool CharmValid; // 0x5D5C(0x1)
		bool HeadValid; // 0x5D5D(0x1)
		unsigned char UnknownData09_6[0x2]; // 0x5D5E(0x2) UNKNOWN PROPERTY
		TArray TempArray; // 0x5D60(0x10)
		USceneComponent Sound_Player_Hit; // 0x5D70(0x8)
		UClass SpeechBubbleWidgetClass; // 0x5D78(0x8)
		FText LastSpeechText; // 0x5D80(0x10)
		double Time_when_you_ll_be_able_to_splash_again; // 0x5D90(0x8)
		AActor CurrentWaterMeshActor; // 0x5D98(0x8)
		FHitResult WaterTraceHitLocation; // 0x5DA0(0xF8)
		FVector StableVelocityVector; // 0x5E98(0x18)
		UParticleSystem PlayerRunTemplate_Ground; // 0x5EB0(0x8)
		UParticleSystem PlayerWalkTemplate_Ground; // 0x5EB8(0x8)
		UParticleSystem PlayerRunTemplate_Water; // 0x5EC0(0x8)
		UParticleSystem PlayerWalkTemplate_Water; // 0x5EC8(0x8)
		USkeletalMesh Pawn_Charm_Skeletal_Mesh; // 0x5ED0(0x8)
		UMaterialInterface WeaponMaterialOverride; // 0x5ED8(0x8)
		bool TickWaterLevel; // 0x5EE0(0x1)
		unsigned char UnknownData10_6[0x7]; // 0x5EE1(0x7) UNKNOWN PROPERTY
		UTextureRenderTarget2D WetnessDepthTexture; // 0x5EE8(0x8)
		UMaterialInstanceDynamic WaterLevelMID; // 0x5EF0(0x8)
		UMaterialInstanceDynamic WaterDecayMID; // 0x5EF8(0x8)
		bool Was_RTT_Enabled_Var_Set; // 0x5F00(0x1)
		bool Is_RTT_Enabled; // 0x5F01(0x1)
		unsigned char UnknownData11_6[0x6]; // 0x5F02(0x6) UNKNOWN PROPERTY
		double StartingMinCapsuleShadowVis; // 0x5F08(0x8)
		double InstigatorCheckDistanceSqrd; // 0x5F10(0x8)
		double SlideDustActivateSpeed; // 0x5F18(0x8)
		bool CanSpawnSlideKickupFX_; // 0x5F20(0x1)
		unsigned char UnknownData12_6[0x7]; // 0x5F21(0x7) UNKNOWN PROPERTY
		UParticleSystem Effect_Player_ShieldActivate; // 0x5F28(0x8)
		UParticleSystem Effect_PLayer_ShieldBreak; // 0x5F30(0x8)
		bool GhostMode; // 0x5F38(0x1)
		unsigned char UnknownData13_6[0x7]; // 0x5F39(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate AnimNotify_Begin; // 0x5F40(0x10)
		FMulticastInlineDelegate AnimNotify_End; // 0x5F50(0x10)
		USoundBase Sound_Shield_Destroyed_2D; // 0x5F60(0x8)
		USoundBase Sound_Shield_Destroyed_Crit_2D; // 0x5F68(0x8)
		FMulticastInlineDelegate PlayDamageEffect; // 0x5F70(0x10)
		double ReppedCapsuleExtraHalfHeight; // 0x5F80(0x8)
		double CachedCapsuleHalfHeight; // 0x5F88(0x8)
		FMulticastInlineDelegate OnCharacterPartsMIDInitialized; // 0x5F90(0x10)
		USkeletalMeshComponent NullPart_Mesh; // 0x5FA0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C");
			return ret;
		}

		void Melee_Effect_Color(FVector& Melee_Color_Set); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92200
		void OnRep_CapsuleEnlarged(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F95700
		void PlayShieldDestroyedSound(FGameplayCueParameters& GameplayCueParameters); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F95400
		void ReInitFrontendPetDisplay(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F95200
		void Are the wind and water RTT passes enabled(bool& NewParam); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F93300
		void DisableWaterLevelTick(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F92E00
		void Create and Duplicate Effect Poseable Skeletal Mesh(UMaterialInterface Material to Apply, TArray& Empty MID Array, int32_t TranslucentSortPriority, UPoseableMeshComponent& PoseableMesh, TEnumAsByte CustomBodyType, USkeletalMeshComponent PartMesh); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F93000
		void SlaveAMeshToTheBody(USkeletalMeshComponent Mesh, USkeletalMeshComponent Master); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F95100
		void Create and Duplicate Effect Skeletal Meshes Parent(USkeletalMeshComponent& DuplicatedSkeletalMeshComponent, UMaterialInterface Material to Apply, TArray& Empty MID Array, int32_t TranslucentSortPriority, USkeletalMeshComponent MeshPart, TEnumAsByte CustomBodyType); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F92F00
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D41F94F00
		void MeleeSwingRight(bool First Right); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F96100
		void MeleeSwingLeft(bool First Left); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F96300
		void MeleeSwingRight_End(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F96000
		void MeleeSwingLeft_End(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F96200
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D41F95D00
		void OnLanded(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D41F95B00
		void OnWeaponEquipped(AFortWeapon NewWeapon, AFortWeapon PrevWeapon); // Flags: Event|Public|BlueprintEvent 0x15D41F95600
		void OnCharacterPartsReinitialized(); // Flags: Event|Protected|BlueprintEvent 0x15D41F95E00
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92B00
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92A00
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent 0x15D41F95300
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D41F95C00
		void Exited/Entered WaterVolume(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F92C00
		void CharacterDestroyed(AActor DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F93100
		void BindOnDestroyed(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F93200
		void AnimTrailsNotify(bool bActive); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D41F93400
		void AnimTrailsDisable(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D41F93500
		void GameplayCue.Abilities.SpookyMist.Loop(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92900
		void GameplayCue.Shield.PotionConsumed(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92500
		void GameplayCue.Damage.Shielded(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92800
		void GameplayCue.Shield.Destroyed(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92600
		void GameplayCue.Shield.Reapplied(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92400
		void GameplayCue.Loop.Shadow.Bomb(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F92700
		void ToggleLandFX(bool NewHidden); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D41F95000
		void OnMovementStyleChanged(TEnumAsByte PreviousMovementStyle, TEnumAsByte NewMovementStyle); // Flags: Event|Public|BlueprintEvent 0x15D41F95A00
		void Hide VFX In Frontend Hologram(bool isFrontEndHologram); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F92300
		void OnPart(AFortPlayerPawn Pawn, UCustomCharacterPart Part, USkeletalMeshComponent MeshPart, TEnumAsByte PartType); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F95900
		void OnPartApplied(AFortPlayerPawn Pawn, UCustomCharacterPart Part, USkeletalMeshComponent MeshPart, TEnumAsByte PartType); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F95800
		void ExecuteUbergraph_PlayerPawn_Athena_Generic(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D41F92D00
		void OnCharacterPartsMIDInitialized__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F95F00
		void PlayDamageEffect__DelegateSignature(FGameplayTagContainer Damage Tags, FHitResult Hit Info, AFortPawn Instigated By, AActor Damage Causer); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F95500
		void AnimNotify_End__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F93600
		void AnimNotify_Begin__DelegateSignature(bool bActive); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F93700
	};


	// Class /Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C
	// Inherited from APlayerPawn_Athena_Generic_C -> APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x9D4 (0x697C - 0x5FA8)
	class APlayerPawn_Athena_C : public APlayerPawn_Athena_Generic_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5FA8(0x8)
		UFortContrailsComponent FortContrails; // 0x5FB0(0x8)
		UFortUnderwaterDamageComponent FortUnderwaterDamage; // 0x5FB8(0x8)
		float Timeline_0_BlendWeight_A4943458400C3662DB243099F9EAC7E8; // 0x5FC0(0x4)
		TEnumAsByte Timeline_0__Direction_A4943458400C3662DB243099F9EAC7E8; // 0x5FC4(0x1)
		unsigned char UnknownData31_6[0x3]; // 0x5FC5(0x3) UNKNOWN PROPERTY
		UTimelineComponent Timeline; // 0x5FC8(0x8)
		USkeletalMeshComponent TargetHead; // 0x5FD0(0x8)
		USkeletalMeshComponent TargetBody; // 0x5FD8(0x8)
		TArray PawnHeadMaterials; // 0x5FE0(0x10)
		TArray PawnBodyMaterials; // 0x5FF0(0x10)
		FGameplayTagContainer TC_FlakVest; // 0x6000(0x20)
		FGameplayEventData Event_Data; // 0x6020(0xB0)
		FGameplayTag EventSpawnEffect; // 0x60D0(0x4)
		bool IsMale; // 0x60D4(0x1)
		unsigned char UnknownData32_6[0x3]; // 0x60D5(0x3) UNKNOWN PROPERTY
		AFortWeapon MenuGoingCommandowWeapon; // 0x60D8(0x8)
		USoundBase SafeZonePassThroughSound; // 0x60E0(0x8)
		bool bHasBeenOutsideSafeZone; // 0x60E8(0x1)
		unsigned char UnknownData33_6[0x3]; // 0x60E9(0x3) UNKNOWN PROPERTY
		FLinearColor ThreatColor; // 0x60EC(0x10)
		unsigned char UnknownData34_6[0x4]; // 0x60FC(0x4) UNKNOWN PROPERTY
		USoundBase PlayerKilledSound; // 0x6100(0x8)
		UParticleSystemComponent WindDebrisParticles; // 0x6108(0x8)
		UParticleSystemComponent FallingRainParticles; // 0x6110(0x8)
		UParticleSystemComponent StormAuraParticles; // 0x6118(0x8)
		FVector LightningSpawnLocation; // 0x6120(0x18)
		double LightningIntensityMin; // 0x6138(0x8)
		double LightningIntensityMax; // 0x6140(0x8)
		AActor SafeZoneActor; // 0x6148(0x8)
		double LightningIntensity; // 0x6150(0x8)
		UPointLightComponent RandomLightningLight; // 0x6158(0x8)
		double LightningTimelinePlaySpeedMin; // 0x6160(0x8)
		double LightningTimelinePlaySpeedMax; // 0x6168(0x8)
		double LightningFlashDiameter; // 0x6170(0x8)
		double LightningFlashHeight; // 0x6178(0x8)
		double LightningFlashRepeatDelayMin; // 0x6180(0x8)
		double LightningFlashRepeatDelayMax; // 0x6188(0x8)
		AEmitterCameraLensEffectBase RainCameraLensParticles; // 0x6190(0x8)
		double _ChanceOfLightningMesh; // 0x6198(0x8)
		bool ShowInvulnerableVisuals; // 0x61A0(0x1)
		unsigned char UnknownData35_6[0x7]; // 0x61A1(0x7) UNKNOWN PROPERTY
		UAudioComponent StormAudioLoop_Inst; // 0x61A8(0x8)
		double StormAudioVolume; // 0x61B0(0x8)
		UAudioComponent FallingAudioLoop_Inst; // 0x61B8(0x8)
		bool bIsPlayingFallingSound; // 0x61C0(0x1)
		unsigned char UnknownData36_6[0x7]; // 0x61C1(0x7) UNKNOWN PROPERTY
		double PlayerAttributes_Speed_Walk; // 0x61C8(0x8)
		double PlayerAttributes_Speed_Run; // 0x61D0(0x8)
		double PlayerAttributes_Speed_Sprint; // 0x61D8(0x8)
		int32_t MaxTrailsLOD; // 0x61E0(0x4)
		unsigned char UnknownData37_6[0x4]; // 0x61E4(0x4) UNKNOWN PROPERTY
		UPostProcessComponent MobilePostProcess; // 0x61E8(0x8)
		bool bIsOutsideSafeZoneCached; // 0x61F0(0x1)
		unsigned char UnknownData38_6[0x7]; // 0x61F1(0x7) UNKNOWN PROPERTY
		TArray ResOutMaterials; // 0x61F8(0x10)
		ADuplicateResOutMesh_C RezInFXActor; // 0x6208(0x8)
		bool bQueueRezIn; // 0x6210(0x1)
		unsigned char UnknownData39_6[0x7]; // 0x6211(0x7) UNKNOWN PROPERTY
		ADuplicateResOutMesh_C RezOutFXActor; // 0x6218(0x8)
		bool bQueueRezOut; // 0x6220(0x1)
		bool bWasEverInWarmUp; // 0x6221(0x1)
		bool bStormAudioCleanedUp; // 0x6222(0x1)
		unsigned char UnknownData40_6[0xD]; // 0x6223(0xD) UNKNOWN PROPERTY
		FTransform Box_Local_Transform; // 0x6230(0x60)
		double BoundsRadius; // 0x6290(0x8)
		UPointLightComponent TeleportationPointLight; // 0x6298(0x8)
		double MaxLightIntensity; // 0x62A0(0x8)
		FName Socket_MeshTop; // 0x62A8(0x4)
		FName Socket_MeshBot; // 0x62AC(0x4)
		FName MIDParam_Transition; // 0x62B0(0x4)
		FName MIDParam_DissolvePercent; // 0x62B4(0x4)
		FName MIDParam_DissolveDirection; // 0x62B8(0x4)
		FName MIDParam_DissolveBaseLoc; // 0x62BC(0x4)
		FName MIDParam_DissolveDistance; // 0x62C0(0x4)
		FName MIDParam_DissolveFirstSpawn; // 0x62C4(0x4)
		UMaterialInterface Mat_CharacterDissolve; // 0x62C8(0x8)
		TArray DissolveMIDs; // 0x62D0(0x10)
		bool bUseNewTeleportFX; // 0x62E0(0x1)
		unsigned char UnknownData41_6[0x3]; // 0x62E1(0x3) UNKNOWN PROPERTY
		FGameplayTag OutsideSafeZoneGameplayCueTag; // 0x62E4(0x4)
		int32_t SafeZonePhase; // 0x62E8(0x4)
		int32_t WhichSafeZoneTag; // 0x62EC(0x4)
		bool bOutsideSafeZoneGameplayCueActive; // 0x62F0(0x1)
		unsigned char UnknownData42_6[0x7]; // 0x62F1(0x7) UNKNOWN PROPERTY
		FScalableFloat SafeZoneDamageScalableFloat; // 0x62F8(0x28)
		bool bFrontendPartyInProgress; // 0x6320(0x1)
		bool bLockOnInteractionComplete; // 0x6321(0x1)
		unsigned char UnknownData43_6[0x6]; // 0x6322(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate ResIn; // 0x6328(0x10)
		FMulticastInlineDelegate ResOut; // 0x6338(0x10)
		FMulticastInlineDelegate SwingRight; // 0x6348(0x10)
		FMulticastInlineDelegate SwingLeft; // 0x6358(0x10)
		bool bSkeletalArrayReady; // 0x6368(0x1)
		unsigned char UnknownData44_6[0x3]; // 0x6369(0x3) UNKNOWN PROPERTY
		int32_t CurDissolveSetupAttempt; // 0x636C(0x4)
		USoundBase DBNOEnterSound; // 0x6370(0x8)
		FMulticastInlineDelegate onFadeToWhiteTeleported; // 0x6378(0x10)
		bool Is_Ashton; // 0x6388(0x1)
		unsigned char UnknownData45_6[0x7]; // 0x6389(0x7) UNKNOWN PROPERTY
		UParticleSystemComponent Ashton; // 0x6390(0x8)
		FMulticastInlineDelegate SwingRightEnd; // 0x6398(0x10)
		FMulticastInlineDelegate SwingLeftEnd; // 0x63A8(0x10)
		FGameplayTag PhoneGhostCue; // 0x63B8(0x4)
		FGameplayTag WhiteoutCue; // 0x63BC(0x4)
		FGameplayTag OutsideSafeZoneCue; // 0x63C0(0x4)
		FGameplayTag OutsideSafeZone2Cue; // 0x63C4(0x4)
		FGameplayTag OutsideSafeZone3Cue; // 0x63C8(0x4)
		bool PlayRespawnFXOnSpawn; // 0x63CC(0x1)
		unsigned char UnknownData46_6[0x3]; // 0x63CD(0x3) UNKNOWN PROPERTY
		AFortPlayerPawnAthena PlayerPawnAthena; // 0x63D0(0x8)
		FMulticastInlineDelegate SwingRight2; // 0x63D8(0x10)
		FMulticastInlineDelegate SwingLeft2; // 0x63E8(0x10)
		bool TestProceduralWaterInIsolation; // 0x63F8(0x1)
		bool Is_First_Water_Body; // 0x63F9(0x1)
		bool Is_Last_Water_Body; // 0x63FA(0x1)
		unsigned char UnknownData47_6[0x5]; // 0x63FB(0x5) UNKNOWN PROPERTY
		double AccumulatedNormalizedDiveSpeed; // 0x6400(0x8)
		FGameplayTag WaterSprintBoostTag; // 0x6408(0x4)
		unsigned char UnknownData48_6[0x4]; // 0x640C(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate CCPM_isHiddenInProp; // 0x6410(0x10)
		TMap PawnHighlights; // 0x6420(0x50)
		FPawnHighlight Current_Highlight; // 0x6470(0x30)
		UObject Current_Highlight_Source; // 0x64A0(0x8)
		FPawnHighlight Invulnerable_Highlight; // 0x64A8(0x30)
		bool IsGalileo; // 0x64D8(0x1)
		unsigned char UnknownData49_6[0x7]; // 0x64D9(0x7) UNKNOWN PROPERTY
		FScalableFloat HotFixSnow; // 0x64E0(0x28)
		TSet NoSnowPlaylists; // 0x6508(0x50)
		FGameplayTag GalileoPlaylistTag; // 0x6558(0x4)
		unsigned char UnknownData50_6[0x4]; // 0x655C(0x4) UNKNOWN PROPERTY
		TArray WeaponMIDs; // 0x6560(0x10)
		int32_t AmountOfTimesToAttemptRestoreMats; // 0x6570(0x4)
		FGameplayTag TC_PawnAthenaNPC; // 0x6574(0x4)
		double HitGlowBrightnessScalar; // 0x6578(0x8)
		TArray CurrentWeaponMaterials; // 0x6580(0x10)
		TArray CurrentWeaponMeshes; // 0x6590(0x10)
		TArray WeaponDissolveMIDs; // 0x65A0(0x10)
		double HitGlowBrightnessScalar_Mobile; // 0x65B0(0x8)
		FGameplayTag TC_PawnAthenaDecoy; // 0x65B8(0x4)
		unsigned char UnknownData51_6[0x4]; // 0x65BC(0x4) UNKNOWN PROPERTY
		double ScaleRate; // 0x65C0(0x8)
		FGameplayTagContainer TetherQuestTag; // 0x65C8(0x20)
		FName FirefliesTag; // 0x65E8(0x4)
		unsigned char UnknownData52_6[0x4]; // 0x65EC(0x4) UNKNOWN PROPERTY
		FTransform RightSideRim_Transform; // 0x65F0(0x60)
		USpotLightComponent Right_Side_Rim_Light; // 0x6650(0x8)
		double Rim_light_Shadow_Bias; // 0x6658(0x8)
		double Rim_Light_Intensity; // 0x6660(0x8)
		FRotator PlayerAimRotation; // 0x6668(0x18)
		FScalableFloat ControlRotationReplicationTickRate; // 0x6680(0x28)
		FGameplayTag Elimination_Rez_Sequence_GC; // 0x66A8(0x4)
		FGameplayTag Creative_Respawn_Teleportation_GC; // 0x66AC(0x4)
		FGameplayTag Teleport_In_GC; // 0x66B0(0x4)
		unsigned char UnknownData53_6[0x4]; // 0x66B4(0x4) UNKNOWN PROPERTY
		double RimLightDistanceFromCamera; // 0x66B8(0x8)
		FLinearColor Rim_Light_Color___Night; // 0x66C0(0x10)
		FLinearColor Rim_Light_Color___Day; // 0x66D0(0x10)
		FGameplayTag PhoneModeratorModeGameplayCue; // 0x66E0(0x4)
		FGameplayTag PhoneInvulnerableGameplayCue; // 0x66E4(0x4)
		bool Swinging_HandsUp; // 0x66E8(0x1)
		bool Swinging_LockedToHip; // 0x66E9(0x1)
		unsigned char UnknownData54_6[0x6]; // 0x66EA(0x6) UNKNOWN PROPERTY
		double InputDragCoefficient; // 0x66F0(0x8)
		bool ToggleSwingNativized; // 0x66F8(0x1)
		unsigned char UnknownData55_6[0x7]; // 0x66F9(0x7) UNKNOWN PROPERTY
		UAudioComponent SwingingSound; // 0x6700(0x8)
		UCurveFloat Swinging_ReelingInCurve; // 0x6708(0x8)
		UCurveFloat Swinging_NotReelingInCurve; // 0x6710(0x8)
		FVector Swinging_OriginalVecToTarget; // 0x6718(0x18)
		bool Swinging_ReelingIn; // 0x6730(0x1)
		unsigned char UnknownData56_6[0x7]; // 0x6731(0x7) UNKNOWN PROPERTY
		double Swinging_Goal_Length; // 0x6738(0x8)
		UCurveFloat Swinging_ReelingTimeCurve; // 0x6740(0x8)
		bool Swinging_ColliderBigger; // 0x6748(0x1)
		unsigned char UnknownData57_6[0x7]; // 0x6749(0x7) UNKNOWN PROPERTY
		TArray SoundParams; // 0x6750(0x10)
		bool Swinging_UseNewRotationAlgorithm; // 0x6760(0x1)
		unsigned char UnknownData58_6[0x7]; // 0x6761(0x7) UNKNOWN PROPERTY
		FVector AttachedWallInverseNormal; // 0x6768(0x18)
		FVector VelocityOnSlideStart; // 0x6780(0x18)
		double SlideStartTime; // 0x6798(0x8)
		double MaxSlideTime; // 0x67A0(0x8)
		UCurveVector WallSlidingVelocityMultiplierCurve; // 0x67A8(0x8)
		UCurveFloat WallSlidingAddedDownwardVelocityMultiplierCurve; // 0x67B0(0x8)
		double WallSlidingAddedDownwardVelocityMax; // 0x67B8(0x8)
		FVector AttachedWallNormal; // 0x67C0(0x18)
		FVector WallSlidingVelocity; // 0x67D8(0x18)
		double DesiredDistanceToAttachedWall; // 0x67F0(0x8)
		double MinGroundSlopeToLeaveAttachedWall; // 0x67F8(0x8)
		FFortGameplayAbilityMontageInfo OverrideSearchMontageInfo; // 0x6800(0x58)
		bool Is_Hidding_CharacterParrts; // 0x6858(0x1)
		unsigned char UnknownData59_6[0x7]; // 0x6859(0x7) UNKNOWN PROPERTY
		double RimlightCVARBoost; // 0x6860(0x8)
		bool Rimlight_Enabled; // 0x6868(0x1)
		unsigned char UnknownData60_6[0x7]; // 0x6869(0x7) UNKNOWN PROPERTY
		FString LCVar_Name; // 0x6870(0x10)
		APhysicalRimlight_C PhysicalRimlightActor; // 0x6880(0x8)
		FScalableFloat UGC_RimLightIntensity; // 0x6888(0x28)
		USoundBase SFX_WaterExit_3P; // 0x68B0(0x8)
		USoundBase SFX_WaterExit_1P; // 0x68B8(0x8)
		USoundBase SFX_WaterEntry_3P; // 0x68C0(0x8)
		USoundBase SFX_WaterEntry_1P; // 0x68C8(0x8)
		FScalableFloat EnableDecayRow; // 0x68D0(0x28)
		double CeilingHeight; // 0x68F8(0x8)
		FVector BAProtoVelocity; // 0x6900(0x18)
		FScalableFloat HF_TetherMultiplierHorz; // 0x6918(0x28)
		FScalableFloat HF_TetherMultiplierVert; // 0x6940(0x28)
		FGameplayTag Teleport_In_GC_Frontend; // 0x6968(0x4)
		unsigned char UnknownData61_6[0x4]; // 0x696C(0x4) UNKNOWN PROPERTY
		FTimerHandle Re_apply_Highlight_Timer; // 0x6970(0x8)
		FGameplayTag Style_Transfer_GC_Frontend; // 0x6978(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C");
			return ret;
		}

		void PlayDeathEffects(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9E000
		void UGC BindRimLightIntensityChange(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D40571E00
		void UGC InitRimlightIntensity(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D40571D00
		void UpdateRimlightIntensity(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D40571B00
		void SetMaterialRimlightIntensity(double Multiplier); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9C900
		void SetPhysicalRimlightIntensity(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9FF00
		void Rimlight Setup(FString CVarName); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9CD00
		void GetRightAxis(double& Return Value); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F99700
		void GetForwardAxis(double& Return Value); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F99A00
		void AttemptToSetRimLight(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F97100
		void GetPawnIsInLocalSquad(bool& IsInLocalSquad); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F99800
		void Swinging_AttachLocation(FVector& Location, bool& AttachPointExists); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9F400
		void Swinging_ResetMeshTransform(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9F200
		void Swinging_SetJumpHeight(double Jump ZVelocity); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9F100
		void IsSwingGrounded(bool& IsSwingingGrounded); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F99000
		FVector SwingingVectorToAttachPoint(FString caller ID); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F9EE00
		void Swinging_StopReelingIn(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9EF00
		void Swinging_StartReelingIn(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9F000
		FVector Swing_GetStartPoint(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9F700
		void IsSwingAttached(bool& IsSwingAttached); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F99100
		void SwingDetached(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9F500
		void SwingAttached(FVector AttachLocation, AActor AttachedActor); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9F600
		void IsSwinging(bool& IsSwinging); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F98F00
		void Swinging_CheckGrounded(bool& Grounded?, FVector& HitNormal, double& Distance); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9F300
		void K2_UpdateCustomMovement(float DeltaTime); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F98E00
		void handleCvarsUpdated(FString CVarName); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F99600
		void OnRep_PlayerAimRotation(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9AC00
		void GetAimPoint(FRotator& ControlRotation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F99B00
		bool PawnIsDecoy(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F9E300
		bool PawnIsNPC(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F9E200
		void RemoveSkeletalMeshComponentsFromWeaponObject(AFortWeapon WeaponObject); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9D200
		void AddSkeletalMeshComponentsFromWeaponObject(AFortWeapon WeaponObject); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F97700
		void GalileoMaterialSetup(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F96700
		void Get Highest Priority Highlight(UObject& Source, FPawnHighlight& Top Priority); // Flags: Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F99C00
		void Highlight Pawn from Source(UObject Source, FPawnHighlight Highlight, bool Only Update If Current); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F99400
		void Remove Pawn Highlight from Source(UObject Source); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9D600
		void ApplyPawnHighlight(UObject Source, FPawnHighlight HitGlow); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D41F97200
		void OnRep_PlayRespawnFXOnSpawn(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9AB00
		void LockonSearchCompleteTimedOut(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F98C00
		void OnLockOnSearchCompleted(bool& bConsumeEvent); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9B200
		void SetPartyInProgress(bool bIsPartyInProgress); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9C800
		void CleanUpTeleportationFXLight(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F96E00
		void RestoreCharacterMats(bool& bFullyCompleted); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9CE00
		void SetPetHidden(bool NewHidden); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9C700
		void SetupDissolveFx(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9FB00
		void CleanupDissolveFX(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F96F00
		void UpdateDissolveFx(double Scalar_Transition, double Scalar_ZHeight, double Scalar_LightIntensity); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D40571C00
		void SpawnTeleportationLight(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9FA00
		void FindBounds(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F96800
		void QueueTeleportOut(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9DD00
		void QueueTeleportIn(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9DE00
		void OnStartLongInteract(AActor ReceivingActor, bool& Out_bConsumeEvent, bool& Out_bSkipSetInteractDuration, bool& Out_bSkipStartAnimation, EItemInteractionType& Out_ItemInteractionType); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D41F9A700
		void InWarmup(bool& bInWarmup); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F99300
		void StopLoopingAudio(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9F800
		void EnableWaterAudio(bool Is Entering Water); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F96C00
		void GetLocationInCircle_XY(FVector& LocationLocalSpace); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D41F99900
		void UserConstructionScript(); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D40571A00
		void Timeline_0__FinishedFunc(); // Flags: BlueprintEvent 0x15D40572000
		void Timeline_0__UpdateFunc(); // Flags: BlueprintEvent 0x15D40571F00
		void OnReady_978607004CDEB137CACF38831BECEF40(AFortGameStateAthena GameState, UFortPlaylist Playlist, FGameplayTagContainer& PlaylistContextTags); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9AE00
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent 0x15D41F9DA00
		void SafeZoneStatusChanged(); // Flags: Event|Public|BlueprintEvent 0x15D41F9CC00
		void GameplayCue.Athena.Equipping(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9A300
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D41F9BE00
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D41F9DB00
		void GameplayCue.Athena.Player.BeingRevivedFromDBNO(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9A200
		void RemoveStormFX(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9D100
		void ReceivePossessed(AController NewController); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x15D41F9D700
		void GameplayCue.Abilities.Activation.DBNOResurrect(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F96500
		void OnEnteredWaterVolume(FVector& WaterSurfaceLocation); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D41F9B800
		void OnExitedWaterVolume(FVector& WaterSurfaceLocation); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D41F9B600
		void NotifyTeammateSkydivedFromBus(); // Flags: Event|Public|BlueprintEvent 0x15D41F98700
		void ReceiveEndPlay(TEnumAsByte EndPlayReason); // Flags: Event|Protected|BlueprintEvent 0x15D41F9D900
		void OnLeftReplayRelevancy(); // Flags: Event|Public|BlueprintEvent 0x15D41F9B300
		void OnEnteredReplayRelevancy(); // Flags: Event|Public|BlueprintEvent 0x15D41F9BA00
		void OnCharacterCustomizationCompleted(AFortPlayerPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F98500
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9A500
		void OnResInDuringWarmup(); // Flags: BlueprintCosmetic|Event|Public|BlueprintCallable|BlueprintEvent 0x15D41F9A900
		void AddStormFX(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F97600
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F96400
		void SetSafeZonePhaseAndGameplayCueTag(int32_t InSafeZonePhase, bool bSpawnGameplayCue); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9FE00
		void SetSafeZoneTagWhenChanged(int32_t NewWhichSafeZoneTag, FGameplayTag GameplayTag, bool bSpawnGameplayCue); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9FD00
		void OnOutsideSafeZonePhaseChanged(int32_t SafeZonePhase); // Flags: Event|Public|BlueprintEvent 0x15D41F9B000
		void RemoveSafeZoneGameplayCue(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9D400
		void OnReceivedStormSurgeDamage(); // Flags: Event|Public|BlueprintEvent 0x15D41F9AD00
		void MeleeSwingLeft(bool First Left); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F98B00
		void MeleeSwingRight(bool First Right); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F98900
		void GameplayCue.Abilities.Activation.DBNOEnter(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F96600
		void ActivateInvincibleVisuals(double duration); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F97A00
		void GameplayCue.Athena.Reloading(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9A100
		void TeleportInNSeconds(double SecondsTillTeleport, FVector DestLocation, FRotator DestRotation); // Flags: BlueprintCallable|BlueprintEvent 0x15D40572100
		void ClientRunSnowGC(bool Instant); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent 0x15D41F96D00
		void WhiteoutAndTeleport(FVector DestLocation, FRotator DestRotation, bool Instant, double Gravity); // Flags: BlueprintCallable|BlueprintEvent 0x15D40571900
		void GameplayCue.Athena.Boost(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9A400
		void OnCreativeStopGhost(); // Flags: Event|Public|BlueprintEvent 0x15D41F9C100
		void OnCreativeStartGhost(); // Flags: Event|Public|BlueprintEvent 0x15D41F9C300
		void MeleeSwingLeft_End(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F98A00
		void MeleeSwingRight_End(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F98800
		void AddSafeZoneGameplayCue(); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent 0x15D41F97800
		void RemoveSafeZoneGameplayCueServerToClient(); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent 0x15D41F9D300
		void OnSuccessfulBuildingEdit(); // Flags: Event|Public|BlueprintEvent 0x15D41F9A600
		void Play Respawn FX(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9E100
		void OnSpawnImmunityTimeReset(); // Flags: Event|Public|BlueprintEvent 0x15D41F9A800
		void OnEnteredWaterBody(AFortWaterBodyActor WaterBody, bool bIsFirstBody); // Flags: Event|Public|BlueprintEvent 0x15D41F9B900
		void OnExitedWaterBody(AFortWaterBodyActor WaterBody, bool bIsLastBody); // Flags: Event|Public|BlueprintEvent 0x15D41F9B700
		void OnBeginWaterSprintBoost(); // Flags: Event|Public|BlueprintEvent 0x15D41F98600
		void isHiddingInProp(bool IsHidden); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D41F99200
		void OnLandscapeCheckFailedAndTeleported(); // Flags: Event|Public|BlueprintEvent 0x15D41F9B400
		void ScalePlayerUp(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D41F9CA00
		void ScalePlayerDown(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D41F9CB00
		void OnTetheredExitPressed(); // Flags: Event|Public|BlueprintEvent 0x15D41F9E700
		void OnTetheredExitReleased(); // Flags: Event|Public|BlueprintEvent 0x15D41F9E600
		void OnTetherStarted(APawn LastTetherPawn); // Flags: Event|Public|BlueprintEvent 0x15D41F9E400
		void OnTetherEnded(APawn LastTetherPawn); // Flags: Event|Public|BlueprintEvent 0x15D41F9E500
		void StartAImRotationTick(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9F900
		void EndRotationTick(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F96B00
		void ReplicateAimRotation(FRotator PlayerAimRotation); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D41F98D00
		void AimTick(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F97500
		void GameplayCue.Damage(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F9A000
		void GameplayCue.Healing(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F99E00
		void GameplayCue.Damage.Shielded(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F99F00
		void GameplayCue.Shield.PotionConsumed(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D41F99D00
		void SetupColdTag(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9FC00
		void ApplyColdTag(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F97400
		void ApplyColdTag_Retry(UFortAbilitySystemComponent AbilitySystemComponent, AFortPlayerPawn AffectedPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F97300
		void OnCreativeModeratorModeActivate(); // Flags: Event|Public|BlueprintEvent 0x15D41F9C500
		void OnCreativeModeratorModeDeactivate(); // Flags: Event|Public|BlueprintEvent 0x15D41F9C400
		void OnCreativeStartInvulnerable(); // Flags: Event|Public|BlueprintEvent 0x15D41F9C200
		void OnCreativeStopInvulnerable(); // Flags: Event|Public|BlueprintEvent 0x15D41F9C000
		void AddHighlightFromSource(UObject Source, FPawnHighlight Highlight, bool OnlyUpdateIfCurrent); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F97900
		void RemoveHighlightFromSource(UObject Source); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D41F9D500
		void ReceiveHit(UPrimitiveComponent MyComp, AActor Other, UPrimitiveComponent OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D41F9D800
		void OnDisplayHitNotify(float DamageDealt, bool bCriticalHit, bool bFatalHit, bool bShieldHit, AActor HitActor, FGameplayTagContainer HitTags, FVector HitLocation); // Flags: Event|Public|BlueprintEvent 0x15D41F9BC00
		void Hide Character Parts(bool IsHidden); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F99500
		void OnPart(AFortPlayerPawn Pawn, UCustomCharacterPart Part, USkeletalMeshComponent MeshPart, TEnumAsByte PartType); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9AF00
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D41F9BD00
		void OnDBNOStateChanged_Event(AFortPawn FortPawn, bool bInIsDBNO); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9BF00
		void OnEnteredOrExitedWaterVolume(bool bEntered, FVector WaterSurfaceLocation); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9BB00
		void PlayWaterEnterExitAudioAndFX(FVector WaterSurfaceLocation); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9DF00
		void OnMovementStyleChanged(TEnumAsByte PreviousMovementStyle, TEnumAsByte NewMovementStyle); // Flags: Event|Public|BlueprintEvent 0x15D41F9B100
		void OnCharacterPartsReinitialized(); // Flags: Event|Protected|BlueprintEvent 0x15D41F9C600
		void Event Materials Refreshed(AFortPlayerPawn PlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F96A00
		void OnResInDuringStyleTransference(); // Flags: BlueprintCosmetic|Event|Public|BlueprintCallable|BlueprintEvent 0x15D41F9AA00
		void Re-apply Highlight(); // Flags: BlueprintCallable|BlueprintEvent 0x15D41F9DC00
		void ExecuteUbergraph_PlayerPawn_Athena(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D41F96900
		void CCPM_isHiddenInProp__DelegateSignature(bool IsHidden); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F97000
		void SwingLeft2__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9ED00
		void SwingRight2__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9EA00
		void SwingLeftEnd__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9EB00
		void SwingRightEnd__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9E800
		void onFadeToWhiteTeleported__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9B500
		void SwingLeft__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9EC00
		void SwingRight__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9E900
		void ResOut__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9CF00
		void ResIn__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D41F9D000
	};


	// Class /Game/Athena/AI/Phoebe/BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C
	// Inherited from APlayerPawn_Athena_C -> APlayerPawn_Athena_Generic_C -> APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x18 (0x6994 - 0x697C)
	class ABP_PlayerPawn_Athena_Phoebe_C : public APlayerPawn_Athena_C	
	{
	public:
		unsigned char UnknownData02_3[0x4]; // 0x697C(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x6980(0x8)
		FName AIEvaluator_CharacterLaunchedKeyName; // 0x6988(0x4)
		bool bUseCosmeticVariants; // 0x698C(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x698D(0x3) UNKNOWN PROPERTY
		int32_t CosmeticVariantID; // 0x6990(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Phoebe/BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C");
			return ret;
		}

		void ComputeCosmeticVariantID(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D40570500
		void AssignCosmeticVariant(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D40570600
		void OnCharacterCustomizationCompleted(AFortPlayerPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D40570300
		void ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe(int32_t EntryPoint); // Flags: Final 0x15D40570400
	};


	// Class /Game/Athena/AI/NPCs/Base/Abilities/GAB_ApplyFullBodyHit_NonParticipant.GAB_ApplyFullBodyHit_NonParticipant_C
	// Inherited from UGAB_GenericApplyFullBodyHit_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x0 (0xBB1 - 0xBB1)
	class UGAB_ApplyFullBodyHit_NonParticipant_C : public UGAB_GenericApplyFullBodyHit_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/Abilities/GAB_ApplyFullBodyHit_NonParticipant.GAB_ApplyFullBodyHit_NonParticipant_C");
			return ret;
		}

		void PickFullBodyHitMontageSection(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BA800
	};


	// Class /Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C
	// Inherited from ABP_PlayerPawn_Athena_Phoebe_C -> APlayerPawn_Athena_C -> APlayerPawn_Athena_Generic_C -> APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x264 (0x6BF8 - 0x6994)
	class ABP_PlayerPawn_NonParticipant_C : public ABP_PlayerPawn_Athena_Phoebe_C	
	{
	public:
		unsigned char UnknownData08_3[0x4]; // 0x6994(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x6998(0x8)
		UFortPawnComponent_AIPatrol FortPawnComponent_AIPatrol; // 0x69A0(0x8)
		UFortAthenaAlertStateComponent FortAthenaAlertState; // 0x69A8(0x8)
		UAudioComponent VOAudioComponent; // 0x69B0(0x8)
		bool UseAlertness; // 0x69B8(0x1)
		bool UseVO; // 0x69B9(0x1)
		bool UseIdleVO; // 0x69BA(0x1)
		bool UseDropExtraLootOnDeath; // 0x69BB(0x1)
		bool UseFullBodyHitReact; // 0x69BC(0x1)
		bool UseChangedTargetReplication; // 0x69BD(0x1)
		bool UseAlertSound; // 0x69BE(0x1)
		EAlertLevel AlertLevel; // 0x69BF(0x1)
		EAlertLevel OldAlertLevel; // 0x69C0(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x69C1(0x3) UNKNOWN PROPERTY
		FGameplayTag GameplayCueAlertState; // 0x69C4(0x4)
		UClass GE_NPC_Status_Stressed_Infinite; // 0x69C8(0x8)
		UClass GE_NPC_Status_Stressed_Cooldown; // 0x69D0(0x8)
		double MinDistanceToTargetToPlayCombatAlertAnimation; // 0x69D8(0x8)
		FScalableFloat MinIdleVODelay; // 0x69E0(0x28)
		FScalableFloat MaxIdleVODelay; // 0x6A08(0x28)
		FName LootTierNameToSpawnWhenDead; // 0x6A30(0x4)
		FName LootTier_Medium; // 0x6A34(0x4)
		FName LootTier_Shell; // 0x6A38(0x4)
		FName LootTier_Heavy; // 0x6A3C(0x4)
		FName LootTier_Light; // 0x6A40(0x4)
		FName LootTier_Rockets; // 0x6A44(0x4)
		UFortGameplayDataTrackerComponentManager DataTrackerComponentManager; // 0x6A48(0x8)
		FGameplayTag AlertLevelUnawareTag; // 0x6A50(0x4)
		FGameplayTag AlertLevelAlertedTag; // 0x6A54(0x4)
		FGameplayTag AlertLevelAggressiveTag; // 0x6A58(0x4)
		FGameplayTag TC_DisguiseTag; // 0x6A5C(0x4)
		UClass GE_RemoveDisguise; // 0x6A60(0x8)
		UFortAbilitySet HitReactAbilitySet; // 0x6A68(0x8)
		UAnimMontage DefaultFullbodyHitReactionMontage; // 0x6A70(0x8)
		UFortPatrolAnimAsset CurrentPatrolAnimAsset; // 0x6A78(0x8)
		UClass PatrolLayerAnimBP; // 0x6A80(0x8)
		TArray PatrolAnimSetPairs; // 0x6A88(0x10)
		bool bShouldDoFullAnimationUpdate; // 0x6A98(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x6A99(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GEDuelHandle; // 0x6A9C(0x8)
		unsigned char UnknownData11_6[0x4]; // 0x6AA4(0x4) UNKNOWN PROPERTY
		UClass GE_DuelTag; // 0x6AA8(0x8)
		AFortPlayerPawn Challenger; // 0x6AB0(0x8)
		UClass OverrideLayerAnimBP; // 0x6AB8(0x8)
		UFortPatrolAnimAsset FallbackPatrolAnimAsset; // 0x6AC0(0x8)
		bool bIsInVehicleThatSupportsNoAlertState; // 0x6AC8(0x1)
		unsigned char UnknownData12_6[0x3]; // 0x6AC9(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GE_Quest_Converted_Handle; // 0x6ACC(0x8)
		unsigned char UnknownData13_6[0x4]; // 0x6AD4(0x4) UNKNOWN PROPERTY
		UClass GE_Quest_Converted_HireNPC; // 0x6AD8(0x8)
		USoundBase DeathFX_Sound; // 0x6AE0(0x8)
		AFortPawn PawnConverter; // 0x6AE8(0x8)
		FGameplayTagContainer TagsToApplyOnConvertedPawn; // 0x6AF0(0x20)
		FGameplayTagContainer TagsToApplyOnConvertingPawn; // 0x6B10(0x20)
		USoundLibrary PawnSoundLibrary; // 0x6B30(0x8)
		bool RemoveTagsOnUnconverted; // 0x6B38(0x1)
		unsigned char UnknownData14_6[0x7]; // 0x6B39(0x7) UNKNOWN PROPERTY
		UFortAbilitySet GASToApplyOnConvertedPawn; // 0x6B40(0x8)
		bool RemoveGASOnUnconverted; // 0x6B48(0x1)
		unsigned char UnknownData15_6[0x7]; // 0x6B49(0x7) UNKNOWN PROPERTY
		FFortAbilitySetHandle HNDL_EquippedAbilitySet; // 0x6B50(0x38)
		AActor NewTargetActor; // 0x6B88(0x8)
		FMulticastInlineDelegate OnTargetChanged; // 0x6B90(0x10)
		FMulticastInlineDelegate OnAlertLevelChanged; // 0x6BA0(0x10)
		FMulticastInlineDelegate OnDeath; // 0x6BB0(0x10)
		FTimerHandle IdleVOTimerHandle; // 0x6BC0(0x8)
		FScalableFloat UseMotionMatchingForPatrols; // 0x6BC8(0x28)
		FGameplayTag TagEventVOTrigger; // 0x6BF0(0x4)
		FGameplayTag VOSoundBankTag; // 0x6BF4(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C");
			return ret;
		}

		void OnRep_VOSoundBankTag(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BFB00
		void PlayDeathEffects(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BF600
		void SetNPCAnimSpeedScalar(double SpeedScalar); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BEB00
		void SoundLibrarySetup(bool IsAdding); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BE900
		void HandlePawnUnconverted(AFortPawn UnconvertedPawn); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BD600
		void HandlePawnConverted(AFortPawn InstigatorPawn, AFortPawn ConvertedPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D402BD700
		void PlayAlertLevelVO(EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BF700
		void HandleAlertStateUpdates(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D402BD800
		void OnRep_bIsInVehicleThatSupportsNoAlertState(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BFD00
		void UpdateAlertStateVehicleCheck(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D3FBE2100
		void ClientOnTargetChanged(AActor NewTarget); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BDF00
		void GetIconPlacement(AActor SelfActor, AActor ViewingActor, FVector& OutLocation, FVector& OutExtents); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D402BD900
		void ClientOnAlertLevelChanged(EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BE000
		void InitializeAnimInstanceSettings(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BD500
		void UpdatePatrolAnimSet(AFortWeapon NewWeapon); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D3FBE2000
		void GetCurrentFullbodyHitReactionMontage(UAnimMontage& CurrentMontage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D402BDA00
		void SetDataTrackerActorStateFromAlertLevel(EAlertLevel AlertLevel); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D402BEC00
		void DataTrackerSetup(bool Is Registering); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BDE00
		void SetupLootTierNameWithWeapon(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D402BEA00
		void AlertLevelChanged(EAlertLevel OldAlertLevel, EAlertLevel InputPin); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BE600
		void PlayVoiceComponentSoundByTag(FGameplayTag SoundBankTag, UAudioComponent& AudioComponent); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D402BF500
		void SetAlertedStateGameplayCue(bool Alerted, bool Combat); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D402BEE00
		void OnRep_NewTargetActor(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BFC00
		void OnRep_AlertLevel(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BFE00
		void UserConstructionScript(); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D3FBE1F00
		void EventReceived_B49137724EF50A4A93D3CD91A40FC1F7(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BDD00
		void AttemptPlayVocalReinforcementSound(FGameplayTagContainer MetadataTagContainer); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BE500
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D402BF300
		void OnDBNOStateChanged_Event(AFortPawn FortPawn, bool bInIsDBNO); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BCC00
		void ActivateAlertDBNOCleanUp(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BA600
		void OnAlertLEvelCHangedEvent(AFortAthenaAIBotController BotController, EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BCF00
		void TriggerIdleVO(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BE800
		void OnWeaponEquipped(AFortWeapon NewWeapon, AFortWeapon PrevWeapon); // Flags: Event|Public|BlueprintEvent 0x15D402BF800
		void ReceiveEndPlay(TEnumAsByte EndPlayReason); // Flags: Event|Protected|BlueprintEvent 0x15D402BF100
		void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(UPrimitiveComponent HitComponent, AActor OtherActor, UPrimitiveComponent OtherComp, FVector NormalImpulse, FHitResult& Hit); // Flags: HasOutParms|BlueprintEvent 0x15D402BE300
		void OnCharacterCustomizationCompleted(AFortPlayerPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BCD00
		void GameplayCue.Player.Interrogation.Voice.PickedUp(TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D402BDB00
		void OnWeaponAttachmentChangedDelegate_Event(AFortWeapon NewWeapon, AFortWeapon PrevWeapon); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BF900
		void ChallengerDied(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BE100
		void SetChallenger(AFortPlayerPawn Challenger); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BED00
		void LinkPatrolAnimLayer(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BD300
		void LinkOverrideAnimLayer(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BD400
		void OnAnimInputEvent(UFortAnimInputEvent AnimInputEvent); // Flags: Event|Public|BlueprintEvent 0x15D402BCE00
		void ReLinkAnimLayer(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BF000
		void PlayVoiceSoundByTag(FGameplayTag SoundBankTag); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D402BF400
		void OnEnteredVehicleEvent(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BC800
		void OnExitedVehicleEvent(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BFF00
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D402BCA00
		void BndEvt__BP_PlayerPawn_NonParticipant_ConvertComponent_K2Node_ComponentBoundEvent_1_ConvertedEvent__DelegateSignature(AFortPawn InstigatorPawn, AFortPawn ConvertedPawn); // Flags: BlueprintEvent 0x15D402BE400
		void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(AFortPawn UnconvertedPawn, EUnconvertReason UnconvertReason); // Flags: BlueprintEvent 0x15D402BE200
		void OnExitedVehicle(); // Flags: Event|Public|BlueprintEvent 0x15D402BC700
		void OnDied_Event(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BC900
		void AiTargetChanged(AActor OldTarget, AActor NewTarget); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BE700
		void SetActorForInteraction(AActor ForwardInteractionActor); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D402BEF00
		void On Multicast Play Voice Sound By Tag(FGameplayTag SoundBankTag); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D402BD100
		void ListenForVOEvent(); // Flags: BlueprintCallable|BlueprintEvent 0x15D402BD200
		void ExecuteUbergraph_BP_PlayerPawn_NonParticipant(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D402BDC00
		void OnDeath__DelegateSignature(EDeathCause Cause); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D402BCB00
		void OnAlertLevelChanged__DelegateSignature(EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D402BD000
		void OnTargetChanged__DelegateSignature(AActor NewTarget); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D402BFA00
	};


	// Class /Game/Athena/GameplayCueNotifies/GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C
	// Inherited from AFortGameplayCueNotifyAthena_AIAlertState -> AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x58 (0xAA8 - 0xA50)
	class AGCNL_AthenaAI_NonParticipant_AlertState_C : public AFortGameplayCueNotifyAthena_AIAlertState	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA50(0x8)
		FLinearColor IconColorAlert; // 0xA58(0x10)
		FLinearColor IconColorThreatend; // 0xA68(0x10)
		double AnimationLength; // 0xA78(0x8)
		FLinearColor IconColorAlertInner; // 0xA80(0x10)
		USoundBase Hostile_Combat_Sound; // 0xA90(0x8)
		USoundBase SearchingSound; // 0xA98(0x8)
		USoundBase Non_hostile_Combat_Sound; // 0xAA0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C");
			return ret;
		}

		void AnimateAlertIcon(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D3FBE1000
		void Play Alert Sound(AActor TargetedActor); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D3FBE0C00
		void OnApplication(AActor MyTarget, FGameplayCueParameters& Parameters, TArray& ParticleComponents, TArray& AudioComponents, ULegacyCameraShake BurstCameraShakeInstance, ADecalActor BurstDecalInstance); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D3FBE0E00
		void OnIconVisible(AActor Target); // Flags: Event|Protected|BlueprintEvent 0x15D3FBE0D00
		void ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D3FBE0F00
	};


	// Class /Game/Athena/Items/QuestInteractables/AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaQuestFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/QuestInteractables/AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C");
			return ret;
		}

		void Athena_PlayQuestRewardFeedback_WithSoundAtQuestActorLocation(bool PlayFX_onPlayer?, USoundBase Success_Sound, UNiagaraSystem Success_Niagara, UForceFeedbackEffect Success_Shake, AActor QuestActor, AFortPlayerPawn PlayerPawn, FTransform Effect_Transform, UObject __WorldContext); // Flags: Static|Public|BlueprintCallable|BlueprintEvent 0x15D6678A100
		void Athena_CheckActorHasTags(AActor TargetActor, FGameplayTagContainer TagsToCheck, bool OnlyExactMatch, UObject __WorldContext, bool& bDidActorHaveTags); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66ED8B00
		void Athena_PartyAssistCheck(AFortPlayerController PlayerController, FName ObjectiveBackendName, UObject __WorldContext, bool& bIsAssistingObjective, bool& bIsValidPlayerController); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6678D300
		void Athena_PlayQuestRewardFeedback(bool PlayFX_onPlayer?, USoundBase Success_Sound, UNiagaraSystem Success_Niagara, UForceFeedbackEffect Success_Shake, AActor QuestActor, AFortPlayerPawn PlayerPawn, FTransform Effect_Transform, UObject __WorldContext); // Flags: Static|Public|BlueprintCallable|BlueprintEvent 0x15D6678D700
		bool Athena_IsCreativeOrPlaygroundPlaylist(FGameplayTagContainer& TagContainer, UObject __WorldContext); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66ED8100
		void Athena_CheckCreativeMode(AGameStateBase InGameState, UObject __WorldContext, bool& CanCompleteQuest); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66ED8900
		void Athena_QuestObjectiveCounter(AFortPlayerController FortPlayerControllerAthena, UFortQuestItemDefinition ObjectiveItem, FDataTableRowHandle ObjectiveStat, UObject __WorldContext, int32_t& QuestCountAchieved, int32_t& QuestCountRequired, bool& CountSuccessfullyReturned); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6678DD00
		void Athena_GiveQuestUpdateToPlayers(UFortQuestItemDefinition InQuestItemRef, FName ObjectiveBackendName, FDataTableRowHandle ObjectiveStatEvent, TArray& PlayerControllersForUpdate, UObject __WorldContext); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D43D38600
		void Athena_CheckQuestAndObjectiveCompletionMP(TArray& InPlayerControlle, UFortQuestItemDefinition InQuestItemRef, FName ObjectiveBackendName, UObject __WorldContext, bool& QuestIsValid, bool& QuestCompleted, bool& ObjectiveCompleted); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66A8B900
		void Athena_CheckQuestAndObjectiveCompletion(AFortPlayerController InPlayerControlle, UFortQuestItemDefinition InQuestItemRef, FName ObjectiveBackendName, UObject __WorldContext, bool& QuestIsValid, bool& QuestCompleted, bool& ObjectiveCompleted); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D43D3C600
		void Athena_HasPlayerCompletedQuest(AFortPlayerController InPlayerControlle, UFortQuestItemDefinition InQuestItemRef, UObject __WorldContext, bool& HasQuest, bool& QuestCompleted); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D43D38800
		void Athena Has Quest(AFortPlayerController InPlayerControlle, UFortQuestItemDefinition InQuestItemRef, UObject __WorldContext, bool& PlayerHasQuest); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66ED9200
	};


	// Class /Game/Athena/Cosmetics/Sprays/BP_SprayDecal.BP_SprayDecal_C
	// Inherited from AFortSprayDecalInstance -> ABuildingSMActor -> ABuildingActor -> AActor -> UObject
	// Size: 0xB2 (0xC82 - 0xBD0)
	class ABP_SprayDecal_C : public AFortSprayDecalInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xBD0(0x8)
		double DecalFadeoutTime; // 0xBD8(0x8)
		UDecalComponent EmissiveDecal; // 0xBE0(0x8)
		UMaterialInstanceDynamic EmissiveDecalMID; // 0xBE8(0x8)
		double DecalSize; // 0xBF0(0x8)
		UMaterialInterface EmissiveMatSource; // 0xBF8(0x8)
		double DecalDepth; // 0xC00(0x8)
		UAthenaSprayItemDefinition SprayAsset; // 0xC08(0x8)
		int32_t LoadsOutstanding; // 0xC10(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC14(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr DecalTextureOverrideSoft; // 0xC18(0x20)
		UTexture2D DecalTextureOverride; // 0xC38(0x8)
		FLinearColor BannerPrimaryColor; // 0xC40(0x10)
		FLinearColor BannerSecondaryColor; // 0xC50(0x10)
		AFortPlayerController SpawningPlayerController; // 0xC60(0x8)
		TArray NearbyBuildingActors; // 0xC68(0x10)
		double SpawnStartTimeDelay; // 0xC78(0x8)
		bool bIsFrontEndPreview; // 0xC80(0x1)
		bool bDestroyOnTrapPlaced; // 0xC81(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Cosmetics/Sprays/BP_SprayDecal.BP_SprayDecal_C");
			return ret;
		}

		void Initialize Spray Spawned from Gameplay(double InDecalSize, UAthenaSprayItemDefinition InSprayAsset, AFortPlayerController InSpawningPlayerController); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66ED2600
		void AddBoxCollisionForCreative(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66ED3200
		void FindNearbyBuildingActorsAndBindDelegates(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6891D600
		void UnbindAndClearNearbyBuildingActors(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66ED7F00
		void OnRep_DecalFadeoutTime(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66A8C700
		FUniqueNetIdRepl GetInstigatorPlayerId(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66ED4800
		void CreateDecalComponents(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66ED6400
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D817B9700
		void OnLoaded_F8AB699B4D8DD22B5A0409B608B7D6FA(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D6678FA00
		void OnLoaded_F925FF00475A018319C73E9FB1540BC6(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D6678ED00
		void OnReady_B252FED346EAB98D54D786BD15C1CC7B(AFortGameStateAthena GameState, UFortPlaylist Playlist, FGameplayTagContainer& PlaylistContextTags); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66A8FF00
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D66A8CB00
		void OnSprayAssetReplicatedDown(); // Flags: BlueprintCallable|BlueprintEvent 0x15D80437700
		void OnSprayInfoReady(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D66A8C800
		void StartSprayFadeOutDueToNewPlacement(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D66A8C900
		void OnNearbyWallDied(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D66784200
		void OnNearbyWallDamaged(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D66ED4500
		void OnBounceOccurs(); // Flags: Event|Public|BlueprintEvent 0x15D6678FC00
		void OnNearbyTrapPlaced(ABuildingTrap Trap, bool bDetatched); // Flags: BlueprintCallable|BlueprintEvent 0x15D66A81200
		void PostLevelSaveSpawnCleanup(); // Flags: Event|Public|BlueprintEvent 0x15D66A8CA00
		void OnWallDestoryed(AActor DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent 0x15D80437800
		void ExecuteUbergraph_BP_SprayDecal(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6891D500
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp_NoJump.GE_Athena_HidingProp_ExitingProp_NoJump_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_ExitingProp_NoJump_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp_NoJump.GE_Athena_HidingProp_ExitingProp_NoJump_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Chrome_Surface.GE_SurfaceChange_Chrome_Surface_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Chrome_Surface_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Chrome_Surface.GE_SurfaceChange_Chrome_Surface_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava.GE_SurfaceChange_Lava_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava.GE_SurfaceChange_Lava_C");
			return ret;
		}
	};


	// Class /Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Shield.GE_SiphonEffect_Shield_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SiphonEffect_Shield_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Shield.GE_SiphonEffect_Shield_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GE_DudeBro_Vent.GE_DudeBro_Vent_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DudeBro_Vent_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GE_DudeBro_Vent.GE_DudeBro_Vent_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_Passive.GE_Athena_ZipLine_Passive_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_ZipLine_Passive_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_Passive.GE_Athena_ZipLine_Passive_C");
			return ret;
		}
	};


	// Class /Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Heal.GE_SiphonEffect_Heal_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SiphonEffect_Heal_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Heal.GE_SiphonEffect_Heal_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GE_WilliePete_PlayerLaunch_ApplyGC.GE_WilliePete_PlayerLaunch_ApplyGC_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_WilliePete_PlayerLaunch_ApplyGC_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GE_WilliePete_PlayerLaunch_ApplyGC.GE_WilliePete_PlayerLaunch_ApplyGC_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_BlockMovement.GA_Athena_HidingProp_BlockMovement_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_Athena_HidingProp_BlockMovement_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_BlockMovement.GA_Athena_HidingProp_BlockMovement_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D67093200
		void ExecuteUbergraph_GA_Athena_HidingProp_BlockMovement(int32_t EntryPoint); // Flags: Final 0x15D67093300
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_GettingInProp.GE_Athena_HidingProp_GettingInProp_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_GettingInProp_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_GettingInProp.GE_Athena_HidingProp_GettingInProp_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Suppress.GE_SurfaceChange_Ice_Suppress_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Ice_Suppress_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Suppress.GE_SurfaceChange_Ice_Suppress_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered_PassiveTriggered.GA_Athena_Tethered_PassiveTriggered_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x14 (0xB54 - 0xB40)
	class UGA_Athena_Tethered_PassiveTriggered_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTag GCN_BoostTag; // 0xB48(0x4)
		FGameplayTag GCN_JumpTag; // 0xB4C(0x4)
		FGameplayTag ZiplineExit; // 0xB50(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered_PassiveTriggered.GA_Athena_Tethered_PassiveTriggered_C");
			return ret;
		}

		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D67097900
		void ExecuteUbergraph_GA_Athena_Tethered_PassiveTriggered(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D67097800
	};


	// Class /Game/Athena/DrivableVehicles/GE_AthenaInVehicle.GE_AthenaInVehicle_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_AthenaInVehicle_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GE_AthenaInVehicle.GE_AthenaInVehicle_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp.GE_Athena_HidingProp_ExitingProp_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_ExitingProp_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp.GE_Athena_HidingProp_ExitingProp_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Sand_Surface.GE_SurfaceChange_Sand_Surface_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Sand_Surface_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Sand_Surface.GE_SurfaceChange_Sand_Surface_C");
			return ret;
		}
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_DBNO_HealthBonus.GE_Athena_DBNO_HealthBonus_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_DBNO_HealthBonus_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_DBNO_HealthBonus.GE_Athena_DBNO_HealthBonus_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ThrownConsumables/GE_ThrownConsumable_InWindup.GE_ThrownConsumable_InWindup_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ThrownConsumable_InWindup_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ThrownConsumables/GE_ThrownConsumable_InWindup.GE_ThrownConsumable_InWindup_C");
			return ret;
		}
	};


	// Class /Game/Athena/HUD/Duel/GA_DuelObserver.GA_DuelObserver_C
	// Inherited from UFortGameplayAbility_ObserveDuels -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB58 - 0xB50)
	class UGA_DuelObserver_C : public UFortGameplayAbility_ObserveDuels	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Duel/GA_DuelObserver.GA_DuelObserver_C");
			return ret;
		}

		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D67099A00
		void OnDuelChange(EDuelState NewDuelState, FDuelOverlayData& ChangedDuelOverlayData); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D67099900
		void ExecuteUbergraph_GA_DuelObserver(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D67099B00
	};


	// Class /Game/Athena/DrivableVehicles/GA_AthenaExitVehicle.GA_AthenaExitVehicle_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x30 (0xB70 - 0xB40)
	class UGA_AthenaExitVehicle_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTag Keep_DBNO_players_in_Vehicles; // 0xB48(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xB4C(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer Event_Damage_Died_Tags; // 0xB50(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_AthenaExitVehicle.GA_AthenaExitVehicle_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D67099000
		void ExecuteUbergraph_GA_AthenaExitVehicle(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D67099100
	};


	// Class /Game/Athena/DrivableVehicles/GA_AthenaEnterVehicle.GA_AthenaEnterVehicle_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_AthenaEnterVehicle_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_AthenaEnterVehicle.GA_AthenaEnterVehicle_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D67098D00
		void ExecuteUbergraph_GA_AthenaEnterVehicle(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D67098E00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_HidingProp_DestroyStructure.GE_HidingProp_DestroyStructure_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_HidingProp_DestroyStructure_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_HidingProp_DestroyStructure.GE_HidingProp_DestroyStructure_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Gameplay/Sword/GE_Blade_LeapSlam_BuildingDestroy.GE_Blade_LeapSlam_BuildingDestroy_C
	// Inherited from UGET_DirectPhysicalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Blade_LeapSlam_BuildingDestroy_C : public UGET_DirectPhysicalDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Gameplay/Sword/GE_Blade_LeapSlam_BuildingDestroy.GE_Blade_LeapSlam_BuildingDestroy_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/B_WilliePete_WaterBodyChild.B_WilliePete_WaterBodyChild_C
	// Inherited from AFortWaterBodyActor -> AWaterBody -> AActor -> UObject
	// Size: 0x10 (0x408 - 0x3F8)
	class AB_WilliePete_WaterBodyChild_C : public AFortWaterBodyActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3F8(0x8)
		UArrowComponent Debug; // 0x400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/B_WilliePete_WaterBodyChild.B_WilliePete_WaterBodyChild_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D67098900
		void ExecuteUbergraph_B_WilliePete_WaterBodyChild(int32_t EntryPoint); // Flags: Final 0x15D67098A00
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GA_SurfaceChange_Ice_IceCheckOnTimer.GA_SurfaceChange_Ice_IceCheckOnTimer_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x20 (0xB60 - 0xB40)
	class UGA_SurfaceChange_Ice_IceCheckOnTimer_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn FortPlayerPawn; // 0xB48(0x8)
		FTimerHandle TraceTimer; // 0xB50(0x8)
		FTimerHandle OffIceTimer; // 0xB58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GA_SurfaceChange_Ice_IceCheckOnTimer.GA_SurfaceChange_Ice_IceCheckOnTimer_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D67098700
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D67098500
		void TraceForTerrain(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709C500
		void RemoveIceGE(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709C600
		void ExecuteUbergraph_GA_SurfaceChange_Ice_IceCheckOnTimer(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D67098800
	};


	// Class /Game/Athena/Items/Consumables/ThrownConsumables/IceGrenade/GA_Athena_RemoveIceFeetOnWater.GA_Athena_RemoveIceFeetOnWater_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x10 (0xB50 - 0xB40)
	class UGA_Athena_RemoveIceFeetOnWater_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn Fort_Player_Pawn; // 0xB48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ThrownConsumables/IceGrenade/GA_Athena_RemoveIceFeetOnWater.GA_Athena_RemoveIceFeetOnWater_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6709C300
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6709C200
		void On Movement Mode Changed(ACharacter Character, TEnumAsByte PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709C100
		void ExecuteUbergraph_GA_Athena_RemoveIceFeetOnWater(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6709C400
	};


	// Class /Game/Athena/DrivableVehicles/GA_Vehicle_ExitHoldEvent.GA_Vehicle_ExitHoldEvent_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x30 (0xB70 - 0xB40)
	class UGA_Vehicle_ExitHoldEvent_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTag EquippingCue; // 0xB48(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xB4C(0x4) UNKNOWN PROPERTY
		AFortPlayerController PlayerController; // 0xB50(0x8)
		UAbilityTask_WaitGameplayEvent OnHoldExitStartedAsyncTask; // 0xB58(0x8)
		UAbilityTask_WaitGameplayEvent OnHoldExitStoppedAsyncTask; // 0xB60(0x8)
		FActiveGameplayEffectHandle GameplayEffectHandle; // 0xB68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_Vehicle_ExitHoldEvent.GA_Vehicle_ExitHoldEvent_C");
			return ret;
		}

		void EventReceived_7AE1D485464AEC7EB429C3877D33AF69(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709BF00
		void EventReceived_209BF560404B83EBEAA8DD8090C443AC(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709C000
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6709BC00
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6709BB00
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent 0x15D6709BD00
		void On Enter Vehicle Passenger(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709B900
		void On Enter Vehicle Driver(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709BA00
		void On Fully Exit Vehicle(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6709B800
		void ExecuteUbergraph_GA_Vehicle_ExitHoldEvent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6709BE00
	};


	// Class /Game/Athena/Items/ForagedItems/Rift/GE_Rift_Athena_Teleport.GE_Rift_Athena_Teleport_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Rift_Athena_Teleport_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/ForagedItems/Rift/GE_Rift_Athena_Teleport.GE_Rift_Athena_Teleport_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/AthenaConsumablesSharedFunctionLibrary.AthenaConsumablesSharedFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaConsumablesSharedFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/AthenaConsumablesSharedFunctionLibrary.AthenaConsumablesSharedFunctionLibrary_C");
			return ret;
		}

		void Get Actor Forward Cardinal Direction(AActor Actor, UObject __WorldContext, TEnumAsByte& OutCardinalDirection, double& OutYaw); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6709DD00
		void IsOverlappingDeployableBlockVolume(UObject WorldContextObject, float BlockingAreaCheckRadius, FVector Location, FName ItemSpecificBlockingTag, UObject __WorldContext, bool& bOverlapping); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 0x15D6709DC00
	};


	// Class /Game/Athena/Playlists/DefaultModifiers/GE_DefaultResourceCap.GE_DefaultResourceCap_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DefaultResourceCap_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Playlists/DefaultModifiers/GE_DefaultResourceCap.GE_DefaultResourceCap_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GE_ZipLine_Damage_Structure.GE_ZipLine_Damage_Structure_C
	// Inherited from UGET_DirectPhysicalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ZipLine_Damage_Structure_C : public UGET_DirectPhysicalDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GE_ZipLine_Damage_Structure.GE_ZipLine_Damage_Structure_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_LandedOn.GA_Athena_HidingProp_LandedOn_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x58 (0xB98 - 0xB40)
	class UGA_Athena_HidingProp_LandedOn_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FScalableFloat HidingEnabled; // 0xB48(0x28)
		FScalableFloat Hiding_Enable_From_Landing; // 0xB70(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_LandedOn.GA_Athena_HidingProp_LandedOn_C");
			return ret;
		}

		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6709CE00
		void ExecuteUbergraph_GA_Athena_HidingProp_LandedOn(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6709CF00
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice.GE_SurfaceChange_Ice_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Ice_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice.GE_SurfaceChange_Ice_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Snow.GE_SurfaceChange_Snow_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Snow_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Snow.GE_SurfaceChange_Snow_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Linger.GE_SurfaceChange_Ice_Linger_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Ice_Linger_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Linger.GE_SurfaceChange_Ice_Linger_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_ReachedEnd.GA_Athena_ZipLine_ReachedEnd_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xF8 (0xC38 - 0xB40)
	class UGA_Athena_ZipLine_ReachedEnd_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB48(0x8)
		FScalableFloat MaxLateralSpeed; // 0xB50(0x28)
		FVector ImpulseVec; // 0xB78(0x18)
		FScalableFloat JumpVertStrength; // 0xB90(0x28)
		FScalableFloat LateralDamping; // 0xBB8(0x28)
		FScalableFloat MaxZiplineVel; // 0xBE0(0x28)
		bool Debug; // 0xC08(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC09(0x7) UNKNOWN PROPERTY
		FScalableFloat MinJumpVertStrength; // 0xC10(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_ReachedEnd.GA_Athena_ZipLine_ReachedEnd_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6709EC00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6709ED00
		void ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd(int32_t EntryPoint); // Flags: Final 0x15D6709EE00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/HidingProp_CameraModifier.HidingProp_CameraModifier_C
	// Inherited from UCameraModifier -> UObject
	// Size: 0x8 (0x50 - 0x48)
	class UHidingProp_CameraModifier_C : public UCameraModifier	
	{
	public:
		AFortPlayerPawn Pawn; // 0x48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/HidingProp_CameraModifier.HidingProp_CameraModifier_C");
			return ret;
		}

		void BlueprintModifyCamera(float DeltaTime, FVector ViewLocation, FRotator ViewRotation, float FOV, FVector& NewViewLocation, FRotator& NewViewRotation, float& NewFOV); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66801B00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_Teleporting.GE_Athena_HidingProp_Teleporting_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_Teleporting_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_Teleporting.GE_Athena_HidingProp_Teleporting_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GAT_Athena_PurpleStuff.GAT_Athena_PurpleStuff_C
	// Inherited from UGAT_TriggeredAbility_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x13 (0xB60 - 0xB4D)
	class UGAT_Athena_PurpleStuff_C : public UGAT_TriggeredAbility_C	
	{
	public:
		unsigned char UnknownData01_3[0x3]; // 0xB4D(0x3) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0xB50(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GAT_Athena_PurpleStuff.GAT_Athena_PurpleStuff_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D66804200
		void ExecuteUbergraph_GAT_Athena_PurpleStuff(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66800100
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Health.GE_Athena_PurpleStuff_Health_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_PurpleStuff_Health_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Health.GE_Athena_PurpleStuff_Health_C");
			return ret;
		}
	};


	// Class /Game/Athena/DrivableVehicles/GA_AthenaInVehicle.GA_AthenaInVehicle_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x28 (0xB68 - 0xB40)
	class UGA_AthenaInVehicle_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTagContainer ExitTag; // 0xB48(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_AthenaInVehicle.GA_AthenaInVehicle_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D66803F00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D66804000
		void ExecuteUbergraph_GA_AthenaInVehicle(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66804100
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_HidingInProp.GA_Athena_HidingProp_HidingInProp_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x54 (0xB94 - 0xB40)
	class UGA_Athena_HidingProp_HidingInProp_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTagContainer ChangeEquipmentTag; // 0xB48(0x20)
		FScalableFloat Row_bDisablePlayerCollision; // 0xB68(0x28)
		float WaitForRequiredTagTime; // 0xB90(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_HidingInProp.GA_Athena_HidingProp_HidingInProp_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D66802B00
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D66802A00
		void GrapplerFailSafe(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66802C00
		void EndAbilityIfMissingTag(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66802E00
		void ExecuteUbergraph_GA_Athena_HidingProp_HidingInProp(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66802D00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_HidingInProp.GE_Athena_HidingProp_HidingInProp_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_HidingInProp_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_HidingInProp.GE_Athena_HidingProp_HidingInProp_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GE_DudebroDamageWallsLOTS.GE_DudebroDamageWallsLOTS_C
	// Inherited from UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DudebroDamageWallsLOTS_C : public UGet_DirectDamageParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GE_DudebroDamageWallsLOTS.GE_DudebroDamageWallsLOTS_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Wildlife_Knockback_Player.GA_NPC_Wildlife_Knockback_Player_C
	// Inherited from UGAB_GenericApplyKnockback_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x0 (0xC69 - 0xC69)
	class UGA_NPC_Wildlife_Knockback_Player_C : public UGAB_GenericApplyKnockback_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Wildlife_Knockback_Player.GA_NPC_Wildlife_Knockback_Player_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tether_DamageStructure.GE_Athena_Tether_DamageStructure_C
	// Inherited from UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Tether_DamageStructure_C : public UGet_DirectDamageParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tether_DamageStructure.GE_Athena_Tether_DamageStructure_C");
			return ret;
		}
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_DBNO_Bleed.GE_Athena_DBNO_Bleed_C
	// Inherited from UGET_PeriodicEnergyDamage_C -> UGET_PeriodicPhysicalDamage_C -> UGET_PeriodicDamageParent_C -> UGET_AfflictedParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_DBNO_Bleed_C : public UGET_PeriodicEnergyDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_DBNO_Bleed.GE_Athena_DBNO_Bleed_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Shields.GE_Athena_PurpleStuff_Shields_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_PurpleStuff_Shields_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Shields.GE_Athena_PurpleStuff_Shields_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GA_DudeBro_Vent.GA_DudeBro_Vent_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x44 (0xB84 - 0xB40)
	class UGA_DudeBro_Vent_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		USkeletalMeshComponent VehicleSkelMesh; // 0xB48(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB50(0x8)
		double GravFloorAltitude; // 0xB58(0x8)
		double UpwardLaunchVelocity; // 0xB60(0x8)
		TArray VentsHitBeforeLanding; // 0xB68(0x10)
		int32_t NumVentsToHitForQuest; // 0xB78(0x4)
		FGameplayTag Tag_to_Check; // 0xB7C(0x4)
		FGameplayTag VentBlocked; // 0xB80(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GA_DudeBro_Vent.GA_DudeBro_Vent_C");
			return ret;
		}

		void ActuallyCleanPlayerUp(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66809E00
		void Added_4065C3B14D35BDC4C0608DB5BD4A1EBA(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66809D00
		void PlayerCapsuleHit(UPrimitiveComponent HitComponent, AActor OtherActor, UPrimitiveComponent OtherComp, FVector NormalImpulse, FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66809800
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D66809B00
		void MovementModeChangedDelegate_Event(ACharacter Character, TEnumAsByte PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent 0x15D66809900
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D66809A00
		void ExecuteUbergraph_GA_DudeBro_Vent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66809C00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_TeleportCoolDown.GE_Athena_HidingProp_TeleportCoolDown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_TeleportCoolDown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_TeleportCoolDown.GE_Athena_HidingProp_TeleportCoolDown_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_DamageCoolDown.GE_SurfaceChange_Lava_DamageCoolDown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_DamageCoolDown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_DamageCoolDown.GE_SurfaceChange_Lava_DamageCoolDown_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage.GE_SurfaceChange_Lava_Damage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_Damage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage.GE_SurfaceChange_Lava_Damage_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage_Periodic.GE_SurfaceChange_Lava_Damage_Periodic_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_Damage_Periodic_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage_Periodic.GE_SurfaceChange_Lava_Damage_Periodic_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GAB_SurfaceChange.GAB_SurfaceChange_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x2E8 (0xE28 - 0xB40)
	class UGAB_SurfaceChange_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		bool Debug; // 0xB48(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xB49(0x7) UNKNOWN PROPERTY
		FScalableFloat RemovalDelay; // 0xB50(0x28)
		FScalableFloat IcySurfacesEnabled; // 0xB78(0x28)
		FGameplayTagContainer HasIce; // 0xBA0(0x20)
		UClass GE_SurfaceChange_Ice; // 0xBC0(0x8)
		UClass GE_SurfaceChange_Snow; // 0xBC8(0x8)
		UClass GE_SurfaceChange_Lava; // 0xBD0(0x8)
		AFortPawn AvatarPawn; // 0xBD8(0x8)
		FGameplayTagContainer IceTags; // 0xBE0(0x20)
		FGameplayTagContainer LavaTags; // 0xC00(0x20)
		FGameplayTagContainer SnowTags; // 0xC20(0x20)
		FGameplayTagContainer SandTags; // 0xC40(0x20)
		FGameplayTagContainer ChromeTags; // 0xC60(0x20)
		double LavaBounceMultiplier; // 0xC80(0x8)
		double RandomAngleOffset; // 0xC88(0x8)
		FScalableFloat RandomConeAngle; // 0xC90(0x28)
		FScalableFloat FacingAngleVelocityComponent; // 0xCB8(0x28)
		FScalableFloat BaseVerticalBounceVelocity; // 0xCE0(0x28)
		FScalableFloat BaseLateralBounceVelocity; // 0xD08(0x28)
		FScalableFloat MaxBounceMultiplier; // 0xD30(0x28)
		FScalableFloat BounceMultiplierStepAmount; // 0xD58(0x28)
		FRandomStream RandomAngleStream; // 0xD80(0x8)
		FGameplayTag LavaBounceCue; // 0xD88(0x4)
		FGameplayTag EventTag_SandUnburrow; // 0xD8C(0x4)
		FScalableFloat IceLingerDuration; // 0xD90(0x28)
		FGameplayTagContainer PreviousSurfaceTagContainer; // 0xDB8(0x20)
		UAsyncAction_StartListeningToStatefulEvent GamePhaseUpdatedAsyncTask; // 0xDD8(0x8)
		FGameplayTagContainer LavaPeriodicDamageTags; // 0xDE0(0x20)
		FScalableFloat LavaPeriodicDamageEnabled; // 0xE00(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GAB_SurfaceChange.GAB_SurfaceChange_C");
			return ret;
		}

		void HandleLavaPeriodicDamageGE(UFortMovementComp_Character FortMovementComp, UFortSurfaceTrackingComponent FortSurfaceTrackingComp); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66808900
		bool ShouldRemoveLavaPeriodicDamage(UFortMovementComp_Character FortMovementComp, UFortSurfaceTrackingComponent FortSurfaceTrackingComp); // Flags: Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6680C000
		bool ShouldApplyLavaPeriodicDamage(UFortMovementComp_Character FortMovementComp, UFortSurfaceTrackingComponent FortSurfaceTrackingComp); // Flags: Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6680C100
		void OnRep_ReplicatedRandomAngle(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6680C300
		void SurfaceCleanup(bool AddLingeringEffects, TEnumAsByte SurfaceType); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6680BF00
		void LavaBounce(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66808500
		void HotfixableGEApplication(FScalableFloat& Input, UClass GameplayEffectAppliedOnTrue, UClass GameplayEffectAppliedOnFalse, FActiveGameplayEffectHandle& GE Handle); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66808800
		void SurfaceCleanupSpecial(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6680BE00
		void OnEventStateCleared_392FFBA342A999104DC902825BE7B094(UAsyncAction_StartListeningToStatefulEvent ProxyObject); // Flags: BlueprintCallable|BlueprintEvent 0x15D6680C400
		void OnSavedEventStateExists_392FFBA342A999104DC902825BE7B094(UAsyncAction_StartListeningToStatefulEvent ProxyObject); // Flags: BlueprintCallable|BlueprintEvent 0x15D6680C200
		void OnEventReceived_392FFBA342A999104DC902825BE7B094(UAsyncAction_StartListeningToStatefulEvent ProxyObject); // Flags: BlueprintCallable|BlueprintEvent 0x15D6680C500
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D66808700
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D66808600
		void MovementModeChanged(ACharacter Character, TEnumAsByte PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent 0x15D6680C600
		void GamePhaseChanged(EAthenaGamePhase GamePhase); // Flags: BlueprintCallable|BlueprintEvent 0x15D66808A00
		void ExecuteUbergraph_GAB_SurfaceChange(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66808B00
	};


	// Class /Game/Athena/Items/Consumables/Grenade/BP_ProjectileTrajectory_Athena.BP_ProjectileTrajectory_Athena_C
	// Inherited from ABP_ProjectileTrajectory_C -> AFortProjectileTrajectory -> AActor -> UObject
	// Size: 0x0 (0x30A - 0x30A)
	class ABP_ProjectileTrajectory_Athena_C : public ABP_ProjectileTrajectory_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/BP_ProjectileTrajectory_Athena.BP_ProjectileTrajectory_Athena_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_Jump.GA_Athena_ZipLine_Jump_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xA0 (0xBE0 - 0xB40)
	class UGA_Athena_ZipLine_Jump_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB48(0x8)
		FScalableFloat MaxLateralSpeed; // 0xB50(0x28)
		FVector ImpulseVec; // 0xB78(0x18)
		FScalableFloat JumpVertStrength; // 0xB90(0x28)
		FScalableFloat JumpLateralDamper; // 0xBB8(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_Jump.GA_Athena_ZipLine_Jump_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D5F950600
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D5F950500
		void ExecuteUbergraph_GA_Athena_ZipLine_Jump(int32_t EntryPoint); // Flags: Final 0x15D5F950700
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/SplineZipline/BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C
	// Inherited from AFortAthenaSplineZipline -> AFortAthenaZipline -> AFortAthenaZiplineBase -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x128 (0xDC8 - 0xCA0)
	class ABP_Athena_Environmental_ZipLine_Spline_C : public AFortAthenaSplineZipline	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xCA0(0x8)
		USphereComponent EndPointInteractSphere; // 0xCA8(0x8)
		USphereComponent StartPointInteractSphere; // 0xCB0(0x8)
		UStaticMesh SplineStaticMesh; // 0xCB8(0x8)
		double TangentSmoothStrength; // 0xCC0(0x8)
		bool AutoSmoothTangents; // 0xCC8(0x1)
		TEnumAsByte ForwardMeshAxis; // 0xCC9(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xCCA(0x6) UNKNOWN PROPERTY
		FVector MotorOffset; // 0xCD0(0x18)
		ABuildingActor PoleA; // 0xCE8(0x8)
		ABuildingActor PoleB; // 0xCF0(0x8)
		FVector PoleASocketLocation; // 0xCF8(0x18)
		FVector PoleBSocketLocation; // 0xD10(0x18)
		int32_t LowerPointID; // 0xD28(0x4)
		int32_t HigherPointID; // 0xD2C(0x4)
		FVector HigherEndLocation; // 0xD30(0x18)
		FVector LowerEndLocation; // 0xD48(0x18)
		double AutoLinearFactorLow; // 0xD60(0x8)
		double AutoLinearFactorHigh; // 0xD68(0x8)
		double AutoSplineTangentLengthCoef; // 0xD70(0x8)
		double AutoSplineTangentHorizCoef; // 0xD78(0x8)
		double AutoSplineTangentVertCoef; // 0xD80(0x8)
		bool Auto_Set_Spline_Ends; // 0xD88(0x1)
		bool Auto_Set_Spline_Mids; // 0xD89(0x1)
		unsigned char UnknownData03_6[0x6]; // 0xD8A(0x6) UNKNOWN PROPERTY
		TArray SplineMaterials; // 0xD90(0x10)
		FGameplayTagContainer BlockInteractTags; // 0xDA0(0x20)
		double TilingDivisor; // 0xDC0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/SplineZipline/BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C");
			return ret;
		}

		void GetMIDForSplineMeshComp(USplineMeshComponent SplineMeshComp, int32_t ElementIndex, UMaterialInstanceDynamic& Mid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F955900
		void UpdateSplineMeshMaterials(USplineMeshComponent SplineMeshComp, int32_t SplineIndex); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F955100
		void CreateSplineMesh(int32_t FirstPoint, int32_t SecondPoint); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F955C00
		void SetInteractionCollision(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F955300
		void SetCableTilingBySplineLength(UMeshComponent Target); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F955400
		bool BlueprintCanInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted, TEnumAsByte InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D5F955F00
		void GetAutoHorizAndVertVectors(FVector highVector, FVector LowVector, FVector& VertVec, FVector& HorizVec); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F955A00
		void Calc Auto Location At Alpha(double InAlpha, bool DrawDebug, FVector& PointLocation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F955E00
		void SetSplinePositionAndTangent(bool SetPosition, bool SetTangent, int32_t ID); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F955200
		void CalculatePositionOfPoles(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F955D00
		void AutoSmoothTanget(FVector Tangent, FVector PointA, FVector PointB, FVector& SmoothedTangent); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D5F956200
		void AddSplineMeshSegment(USplineMeshComponent& SplineMeshSegment); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F956300
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5F955000
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D5F955500
		void HandlePoleDied(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F955800
		void OnZipliningStarted(AFortPlayerPawn InteractingPawn, UPrimitiveComponent InteractComponent); // Flags: Event|Public|BlueprintEvent 0x15D5F955700
		void OnZipliningStopped(AFortPlayerPawn InteractingPawn, UPrimitiveComponent InteractComponent, float ZiplineUsageDuration); // Flags: Event|Public|BlueprintEvent 0x15D5F955600
		void ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline(int32_t EntryPoint); // Flags: Final 0x15D5F955B00
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline.PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C
	// Inherited from AFortAthenaSplineZipline -> AFortAthenaZipline -> AFortAthenaZiplineBase -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x139 (0xDD9 - 0xCA0)
	class APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C : public AFortAthenaSplineZipline	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xCA0(0x8)
		UStaticMesh SplineStaticMesh; // 0xCA8(0x8)
		double TangentSmoothStrength; // 0xCB0(0x8)
		bool AutoSmoothTangents; // 0xCB8(0x1)
		TEnumAsByte ForwardMeshAxis; // 0xCB9(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xCBA(0x6) UNKNOWN PROPERTY
		FVector MotorOffset; // 0xCC0(0x18)
		AActor PoleA; // 0xCD8(0x8)
		AActor PoleB; // 0xCE0(0x8)
		FVector PoleASocketLocation; // 0xCE8(0x18)
		FVector PoleBSocketLocation; // 0xD00(0x18)
		int32_t LowerPointID; // 0xD18(0x4)
		int32_t HigherPointID; // 0xD1C(0x4)
		FVector HigherEndLocation; // 0xD20(0x18)
		FVector LowerEndLocation; // 0xD38(0x18)
		double AutoLinearFactorLow; // 0xD50(0x8)
		double AutoLinearFactorHigh; // 0xD58(0x8)
		double AutoSplineTangentLengthCoef; // 0xD60(0x8)
		double AutoSplineTangentHorizCoef; // 0xD68(0x8)
		double AutoSplineTangentVertCoef; // 0xD70(0x8)
		bool Auto_Set_Spline_Ends; // 0xD78(0x1)
		bool Auto_Set_Spline_Mids; // 0xD79(0x1)
		unsigned char UnknownData03_6[0x6]; // 0xD7A(0x6) UNKNOWN PROPERTY
		TArray SplineMaterials; // 0xD80(0x10)
		FGameplayTagContainer BlockInteractTags; // 0xD90(0x20)
		double TilingDivisor; // 0xDB0(0x8)
		TArray SplineMeshComponents; // 0xDB8(0x10)
		TArray PlayerPawnArray; // 0xDC8(0x10)
		bool Debug; // 0xDD8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline.PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C");
			return ret;
		}

		void RemovePlayerFromZipliningArray(AFortPlayerPawn& Item); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F957C00
		void AddPlayerToZipliningArray(AFortPlayerPawn& NewItem); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F954600
		void SetCableTilingBySplineLength(UMeshComponent Target); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F957B00
		bool BlueprintCanInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted, TEnumAsByte InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D5F954300
		void GetAutoHorizAndVertVectors(FVector highVector, FVector LowVector, FVector& VertVec, FVector& HorizVec); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F958100
		void Calc Auto Location At Alpha(double InAlpha, bool DrawDebug, FVector& PointLocation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F958400
		void SetSplinePositionAndTangent(bool SetPosition, bool SetTangent, int32_t ID); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F957A00
		void CalculatePositionOfPoles(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F958300
		void AutoSmoothTanget(FVector Tangent, FVector PointA, FVector PointB, FVector& SmoothedTangent); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D5F954400
		void AddSplineMeshSegment(USplineMeshComponent& SplineMeshSegment); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F954500
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5F957900
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D5F957D00
		void WaitThenSetDynamicSpline(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F957800
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D5F958000
		void OnZipliningStarted(AFortPlayerPawn InteractingPawn, UPrimitiveComponent InteractComponent); // Flags: Event|Public|BlueprintEvent 0x15D5F957F00
		void OnZipliningStopped(AFortPlayerPawn InteractingPawn, UPrimitiveComponent InteractComponent, float ZiplineUsageDuration); // Flags: Event|Public|BlueprintEvent 0x15D5F957E00
		void ExecuteUbergraph_PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D5F958200
	};


	// Class /Game/Athena/Items/Consumables/Parents/GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C
	// Inherited from UFortGameplayAbility_ConsumableThrowParent -> UFortGameplayAbility_ThrowTrajectory -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x18C (0x1004 - 0xE78)
	class UGA_Athena_Consumable_Throw_Parent_C : public UFortGameplayAbility_ConsumableThrowParent	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xE78(0x8)
		bool AbilityKeyPressed; // 0xE80(0x1)
		bool InThrowWindup; // 0xE81(0x1)
		unsigned char UnknownData07_6[0x6]; // 0xE82(0x6) UNKNOWN PROPERTY
		FScalableFloat bIsEnabled; // 0xE88(0x28)
		FGameplayTagContainer Tag_BlockAbilityActivation; // 0xEB0(0x20)
		bool bIsSecondaryFire; // 0xED0(0x1)
		bool bThrowInstantly; // 0xED1(0x1)
		unsigned char UnknownData08_6[0x6]; // 0xED2(0x6) UNKNOWN PROPERTY
		FScalableFloat ProjectileGravityScale; // 0xED8(0x28)
		FScalableFloat ProjectileSpeed; // 0xF00(0x28)
		ABP_ProjectileTrajectory_C TrajectoryIndicator; // 0xF28(0x8)
		UClass TrajectoryIndicatorClass; // 0xF30(0x8)
		double TrajectoryUpdateInterval; // 0xF38(0x8)
		UAnimMontage CookMontage; // 0xF40(0x8)
		UAnimMontage CookMontage1P; // 0xF48(0x8)
		UAnimMontage ThrowMontage; // 0xF50(0x8)
		UAnimMontage ThrowMontage1P; // 0xF58(0x8)
		double TrajectoryTimeStep; // 0xF60(0x8)
		int32_t TrajectoryMaxSteps; // 0xF68(0x4)
		FName TrajectoryCollisionProfileName; // 0xF6C(0x4)
		UClass GE_InWindup; // 0xF70(0x8)
		UClass CameraMode; // 0xF78(0x8)
		bool ReturnPhysicalMaterial; // 0xF80(0x1)
		unsigned char UnknownData09_6[0x7]; // 0xF81(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer Tags_UseNullFailedActivateReason; // 0xF88(0x20)
		bool bIsThrowing; // 0xFA8(0x1)
		bool SpawnedOnEquip; // 0xFA9(0x1)
		unsigned char UnknownData10_6[0x2]; // 0xFAA(0x2) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle Handle_GE_InWindup; // 0xFAC(0x8)
		bool bPreventDeploymentInBlockAreas; // 0xFB4(0x1)
		unsigned char UnknownData11_6[0x3]; // 0xFB5(0x3) UNKNOWN PROPERTY
		float DeployableBlockingAreaCheckRadius; // 0xFB8(0x4)
		unsigned char UnknownData12_6[0x4]; // 0xFBC(0x4) UNKNOWN PROPERTY
		FVector DeployableBlockingAreaCheckOffset; // 0xFC0(0x18)
		float Trajectory_Max_Distance_Between_Spline_Points; // 0xFD8(0x4)
		int32_t Trajectory_Max_Bounces; // 0xFDC(0x4)
		float Trajectory_Initial_Distance; // 0xFE0(0x4)
		bool Projectile_Trajectory_Data_Initialized; // 0xFE4(0x1)
		unsigned char UnknownData13_6[0x3]; // 0xFE5(0x3) UNKNOWN PROPERTY
		UFortAbilityTask_PlayMontageWaitTarget ThrowMontageAsyncTask; // 0xFE8(0x8)
		TArray TrajectoryIgnoredWorldActors; // 0xFF0(0x10)
		FName UniqueBlockDeploymentTag; // 0x1000(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Parents/GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C");
			return ret;
		}

		bool ShouldOnlyShowTrajectoryOnUse(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D5F958F00
		AFortProjectileTrajectory SpawnTrajectoryIndicator(bool bSpawnOnEquip); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F958E00
		UClass GetProjectileTrajectoryActor(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D5F95A500
		void GetProjectileTrajectoryPoints(TArray& OutSplinePoints, TArray& OutSplineTangents, FHitResult& OutHitResult); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D5F95A400
		void IsAbilityBlocked(bool& bIsBlocked); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D5F95A200
		void Get Throw Montage(UAnimMontage& Montage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F956700
		void GetCookMontage(UAnimMontage& Montage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F956600
		void CalculateProjectileTrajectory(AFortPawn Instigator, FVector InitialLocation, FVector InitialVelocity, FHitResult& OutHitResult, TArray& OutSplinePoints, TArray& OutSplineTangents); // Flags: Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 0x15D5F956E00
		bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayAbilitySpecHandle Handle, FGameplayTagContainer& RelevantTags); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D5F959F00
		void IsTrajectoryLocationValid(TArray& SplinePoints, TArray& SplineTangents, FHitResult TrajectoryHitResult, bool& bIsLocationValid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D5F95A100
		void OnUpdateTrajectory(TArray& SplinePoints, TArray& SplineTangents, FHitResult TrajectoryHitResult); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F959300
		void AddValidCamera(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F956F00
		void K2_OverrideFailedReason(FGameplayTagContainer& FailedReason, FGameplayTagContainer& OverridenFailedReason); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F959D00
		void GetProjectileInitialGravityScaleToUse(double& GravityScaleToUse); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D5F956500
		void GetProjectileInitialSpeedToUse(double& ProjectileSpeedToUse); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D5F956400
		void CleanupTrajectory(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F956C00
		void PostThrowCleanup(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D5F959200
		void UpdateTrajectorySpline(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F958900
		void SetupDummyProjectile(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F959000
		void PrethrowSetup(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D5F959100
		void Completed_01C5B37D48E3DC6F82DDC58640CE2A27(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F956A00
		void Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F956D00
		void Triggered_01C5B37D48E3DC6F82DDC58640CE2A27(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D5F958B00
		void OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0(float TimeHeld); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959600
		void EventReceived_E3F1B58D4D7A664CB557709F9DAE3C9F(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F956900
		void OnSync_9C8FDC8044B1444580A9809C231F294D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959500
		void OnCancelled_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959900
		void OnInterrupted_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959700
		void OnBlendOut_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959A00
		void OnBlendedIn_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959B00
		void OnCompleted_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959800
		void OnSync_9EB4FE09402E9C3EFFEFC699136D00E3(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F959400
		void InitTrajectoryVariables(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5F95A300
		void ThrowMontageStarted(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F958D00
		void OnAbilityInputReleased(); // Flags: Event|Protected|BlueprintEvent 0x15D5F959C00
		void ThrowProjectile(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5F958C00
		void UpdateTrajectory(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5F958A00
		void CleanupTrajectoryIndicatorOnUnequip(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5F956B00
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D5F959E00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D5F95A000
		void ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D5F956800
	};


	// Class /Game/Athena/Playlists/DefaultModifiers/GE_DefaultTurboBuildSettings.GE_DefaultTurboBuildSettings_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DefaultTurboBuildSettings_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Playlists/DefaultModifiers/GE_DefaultTurboBuildSettings.GE_DefaultTurboBuildSettings_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_GettingInProp.GA_Athena_HidingProp_GettingInProp_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_Athena_HidingProp_GettingInProp_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_GettingInProp.GA_Athena_HidingProp_GettingInProp_C");
			return ret;
		}

		void Triggered_48F6DF3C4B1DB1F251B2C48A13F1870E(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66924800
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D66924900
		void ExecuteUbergraph_GA_Athena_HidingProp_GettingInProp(int32_t EntryPoint); // Flags: Final 0x15D66924A00
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tethered.GE_Athena_Tethered_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Tethered_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tethered.GE_Athena_Tethered_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered.GA_Athena_Tethered_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8C (0xBCC - 0xB40)
	class UGA_Athena_Tethered_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FActiveGameplayEffectHandle GE_TetheredHandle; // 0xB48(0x8)
		AFortPlayerPawn OwningFortPlayerPawn; // 0xB50(0x8)
		double maxSpeedToPlayGCN; // 0xB58(0x8)
		FGameplayTag GCTagPlayerLand; // 0xB60(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xB64(0x4) UNKNOWN PROPERTY
		UClass StructureDamageGE; // 0xB68(0x8)
		FGameplayTag SmashGC; // 0xB70(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xB74(0x4) UNKNOWN PROPERTY
		FScalableFloat BreakStructuresOnTetherEnabled; // 0xB78(0x28)
		FScalableFloat BreakStructuresOnTetherRange; // 0xBA0(0x28)
		FGameplayTag Event_FishingForceEnd; // 0xBC8(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered.GA_Athena_Tethered_C");
			return ret;
		}

		void BreakNearbyStructures(FVector ForwardVector, double OffsetForward); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66927600
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D66927400
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D66927300
		void MovementModeChangedDelegate_Event(ACharacter Character, TEnumAsByte PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent 0x15D66927200
		void BreakBuildingsAtPlayerInDirectionOfTether(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66927700
		void ExecuteUbergraph_GA_Athena_Tethered(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66927500
	};


	// Class /Game/Athena/Items/ForagedItems/Rift/GA_Rift_Athena_Skydive.GA_Rift_Athena_Skydive_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xF8 (0xC38 - 0xB40)
	class UGA_Rift_Athena_Skydive_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		UAnimMontage FallingAnimation; // 0xB48(0x8)
		double Hangtimee; // 0xB50(0x8)
		USkeletalMeshComponent VehicleSkelMesh; // 0xB58(0x8)
		FScalableFloat HangTime; // 0xB60(0x28)
		FGameplayTag EventTag; // 0xB88(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xB8C(0x4) UNKNOWN PROPERTY
		FScalableFloat KickFromVehicle_; // 0xB90(0x28)
		USoundBase LocalPlayerSound; // 0xBB8(0x8)
		UClass GameplayCueGE; // 0xBC0(0x8)
		AFortPlayerPawn PlayerPawn; // 0xBC8(0x8)
		bool bHolstered; // 0xBD0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xBD1(0x3) UNKNOWN PROPERTY
		FName RiftSkydiveHolster; // 0xBD4(0x4)
		FVector ImpulseStrength; // 0xBD8(0x18)
		bool bNeedsInputEnable; // 0xBF0(0x1)
		unsigned char UnknownData05_6[0x7]; // 0xBF1(0x7) UNKNOWN PROPERTY
		FTimerHandle SafetyTimer; // 0xBF8(0x8)
		FVector NewVar; // 0xC00(0x18)
		FGameplayTagContainer UnblockTagsIfPassenger; // 0xC18(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/ForagedItems/Rift/GA_Rift_Athena_Skydive.GA_Rift_Athena_Skydive_C");
			return ret;
		}

		void RemoveSkydivingGameplayEffect(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6692F000
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x15D6692FB00
		void OnCancelled_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F800
		void OnInterrupted_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F500
		void OnBlendOut_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F900
		void OnBlendedIn_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692FA00
		void OnCompleted_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F700
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6692FC00
		void SetPlayerToSkydive(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692EF00
		void OnDestroyed_Event(AActor DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F600
		void OnPawnEnteredWater(AFortPlayerPawn FortPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F300
		void OnPawnLanded(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6692F200
		void HandleForceEnd(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692FD00
		void OnZiplineStateChanged(bool bIsZiplining, AFortPlayerPawn FortPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F100
		void OnMovementModeChanged(ACharacter Character, TEnumAsByte PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent 0x15D6692F400
		void ExecuteUbergraph_GA_Rift_Athena_Skydive(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6692FE00
	};


	// Class /Game/Athena/HUD/AthenaEliminationIndicator.AthenaEliminationIndicator_C
	// Inherited from UAthenaEliminationIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x5E8 - 0x5C0)
	class UAthenaEliminationIndicator_C : public UAthenaEliminationIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5C0(0x8)
		UWidgetAnimation Outro; // 0x5C8(0x8)
		UWidgetAnimation Intro; // 0x5D0(0x8)
		UImage Arrow; // 0x5D8(0x8)
		UImage Image_Diamondpulse; // 0x5E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/AthenaEliminationIndicator.AthenaEliminationIndicator_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D68806500
		void ExecuteUbergraph_AthenaEliminationIndicator(int32_t EntryPoint); // Flags: Final 0x15D68806400
	};


	// Class /Game/Athena/Tutorial/Contextual/ContextTutorialIndicator.ContextTutorialIndicator_C
	// Inherited from UAthenaContextTutorialIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x111 (0x709 - 0x5F8)
	class UContextTutorialIndicator_C : public UAthenaContextTutorialIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5F8(0x8)
		UWidgetAnimation ST_in_bounce; // 0x600(0x8)
		UWidgetAnimation ST_Text_Out_Fast; // 0x608(0x8)
		UWidgetAnimation ST_Marker_Out02; // 0x610(0x8)
		UWidgetAnimation ST_Marker_Out01; // 0x618(0x8)
		UWidgetAnimation ST_Text_Out; // 0x620(0x8)
		UWidgetAnimation ST_Text_in; // 0x628(0x8)
		UWidgetAnimation ST_Arrow_Disappear; // 0x630(0x8)
		UWidgetAnimation ST_Arrow_Bounce; // 0x638(0x8)
		UWidgetAnimation ST_Arrow_Transition; // 0x640(0x8)
		UWidgetAnimation ST_Out_Arrow_Marker; // 0x648(0x8)
		UWidgetAnimation ST_Marker_FadeIN; // 0x650(0x8)
		UWidgetAnimation ST_Arrow_Fade; // 0x658(0x8)
		UWidgetAnimation ST_in_Spin_Arrow_Marker; // 0x660(0x8)
		UWidgetAnimation ST_DiamondBox_Fade; // 0x668(0x8)
		UWidgetAnimation ST_Diamond_Disappear; // 0x670(0x8)
		UWidgetAnimation ST_Marker_MoveReaction; // 0x678(0x8)
		UWidgetAnimation ST_in_DiamondBox_Spin; // 0x680(0x8)
		UWidgetAnimation ST_Marker_Idle; // 0x688(0x8)
		UWidgetAnimation ST_in_Diamond_Spin; // 0x690(0x8)
		UWidgetAnimation ST_border; // 0x698(0x8)
		UWidgetAnimation ST_in; // 0x6A0(0x8)
		UImage Circle; // 0x6A8(0x8)
		UImage Circle; // 0x6B0(0x8)
		UCommonTextBlock Description; // 0x6B8(0x8)
		UEditableTextBox DescriptionOLD; // 0x6C0(0x8)
		UImage Icon; // 0x6C8(0x8)
		UImage Icon; // 0x6D0(0x8)
		UImage Image_SmallIndicator; // 0x6D8(0x8)
		UImage Image_SmallIndicator_Child; // 0x6E0(0x8)
		UImage Sign; // 0x6E8(0x8)
		UImage Sign; // 0x6F0(0x8)
		UImage White_Box_Child; // 0x6F8(0x8)
		UImage White_Box_Solo; // 0x700(0x8)
		bool bIntroAnimationDone; // 0x708(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Tutorial/Contextual/ContextTutorialIndicator.ContextTutorialIndicator_C");
			return ret;
		}

		void Finished_FBBD6B5248E73C61005758B21F90D160(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68809C00
		void Finished_191D6D204EA6EF5125923CB749C84A4A(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68809F00
		void Finished_5FDAD1724A4ABC34EC3B7F9D90839344(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68809E00
		void Finished_6F1BBAF94537A4D7945ED5A452FC1188(); // Flags: BlueprintCallable|BlueprintEvent 0x15D68809D00
		void PlayOutAnimation(); // Flags: Event|Public|BlueprintEvent 0x15D68809900
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6880A100
		void SetIndicatorText(FText& Text); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D68809800
		void PlayBounceAnimation(); // Flags: Event|Public|BlueprintEvent 0x15D68809B00
		void PlayInAnimation(); // Flags: Event|Public|BlueprintEvent 0x15D68809A00
		void ExecuteUbergraph_ContextTutorialIndicator(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6880A000
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GA_Athena_Slurp_OLD.GA_Athena_Slurp_OLD_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x30 (0xB70 - 0xB40)
	class UGA_Athena_Slurp_OLD_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB48(0x8)
		int32_t IncreCheck; // 0xB50(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xB54(0x4) UNKNOWN PROPERTY
		double MaxTicks; // 0xB58(0x8)
		FTimerHandle TimerHandle; // 0xB60(0x8)
		double TickRate; // 0xB68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GA_Athena_Slurp_OLD.GA_Athena_Slurp_OLD_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6880B600
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6880B500
		void ApplyHealthOrShield(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6880B800
		void ExecuteUbergraph_GA_Athena_Slurp_OLD(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6880B700
	};


	// Class /Game/Athena/BuildingActors/Props/Building/ActorBlueprints/Containers/Athena_Prop_ParentBuildingContainerBlueprint.Athena_Prop_ParentBuildingContainerBlueprint_C
	// Inherited from ABuildingProp -> ABuildingTimeOfDayLights -> ABuildingAutoNav -> ABuildingSMActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x110 (0xCE8 - 0xBD8)
	class AAthena_Prop_ParentBuildingContainerBlueprint_C : public ABuildingProp	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xBD8(0x8)
		bool DebugWind; // 0xBE0(0x1)
		unsigned char UnknownData06_6[0x7]; // 0xBE1(0x7) UNKNOWN PROPERTY
		TArray IntenseWindMaterialsForPreview; // 0xBE8(0x10)
		UStaticMeshComponent Wind_Intensity_Debug_Mesh; // 0xBF8(0x8)
		TArray OriginalMaterials; // 0xC00(0x10)
		UMaterialInstanceDynamic Debug_TempMaterial; // 0xC10(0x8)
		double DebugWindYaw; // 0xC18(0x8)
		double Debug_Wind_Intensity; // 0xC20(0x8)
		bool Set_Max_Actor_Scale; // 0xC28(0x1)
		unsigned char UnknownData07_6[0x7]; // 0xC29(0x7) UNKNOWN PROPERTY
		double Max_Scale; // 0xC30(0x8)
		bool Disable_TOD_Lights_and_Material_Emissive_Values; // 0xC38(0x1)
		bool Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0xC39(0x1)
		bool Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_; // 0xC3A(0x1)
		unsigned char UnknownData08_6[0x5]; // 0xC3B(0x5) UNKNOWN PROPERTY
		UStaticMesh AlternateShadowStaticMesh; // 0xC40(0x8)
		bool Animate_Emissive_and_Lights_Over_Time; // 0xC48(0x1)
		unsigned char UnknownData09_6[0x7]; // 0xC49(0x7) UNKNOWN PROPERTY
		TArray CodeControlled_EmissiveColor; // 0xC50(0x10)
		TArray CodeControlled_LightConeOpacity; // 0xC60(0x10)
		FDayPhaseFloats Light_Intensity_Over_Time_of_Day_; // 0xC70(0x10)
		double Day_Phase_Transition_Length; // 0xC80(0x8)
		FDayPhaseFloats Emissive_Intensity_Over_Time_of_Day; // 0xC88(0x10)
		double Volumetric_Light_Scattering_Intensity; // 0xC98(0x8)
		bool Cast_Volumetric_Shadows; // 0xCA0(0x1)
		bool Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls; // 0xCA1(0x1)
		bool Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls; // 0xCA2(0x1)
		unsigned char UnknownData10_6[0x5]; // 0xCA3(0x5) UNKNOWN PROPERTY
		UCurveFloat LightAnimationCurve; // 0xCA8(0x8)
		double CodeControlled_Animation_Curve_Animation_Length; // 0xCB0(0x8)
		int32_t CodeControlled_NumberOfMaterials; // 0xCB8(0x4)
		unsigned char UnknownData11_6[0x4]; // 0xCBC(0x4) UNKNOWN PROPERTY
		TArray NewVar; // 0xCC0(0x10)
		double Random_Time_Scale_Percent; // 0xCD0(0x8)
		double CodeControlled_CurrentPlayLength; // 0xCD8(0x8)
		double Snow_Coverage_Amount; // 0xCE0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/BuildingActors/Props/Building/ActorBlueprints/Containers/Athena_Prop_ParentBuildingContainerBlueprint.Athena_Prop_ParentBuildingContainerBlueprint_C");
			return ret;
		}

		void GetTimeOfDayBlueprintDefaultVariables(FTimeOfDayBlueprintDefaultVariables& OutVariables); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6880ED00
		void UserConstructionScript(); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6AFC2100
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6880E800
		void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation); // Flags: Event|Public|BlueprintEvent 0x15D6880EA00
		void Loop Animation Curve(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6880EC00
		void OnBounceAnimationUpdate(FFortBounceData& Data); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D6880EB00
		void OnSetSearched(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6880E900
		void ExecuteUbergraph_Athena_Prop_ParentBuildingContainerBlueprint(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6880EE00
	};


	// Class /Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_Grenade_Base.B_Prj_Athena_Grenade_Base_C
	// Inherited from AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x186 (0xCAE - 0xB28)
	class AB_Prj_Athena_Grenade_Base_C : public AFortProjectileBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB28(0x8)
		UNiagaraComponent NS_Fuse_Particle; // 0xB30(0x8)
		UFortCollisionAudioComponent FortCollisionAudio; // 0xB38(0x8)
		URotatingMovementComponent RotatingMovement; // 0xB40(0x8)
		UStaticMeshComponent Mesh; // 0xB48(0x8)
		UAudioComponent GrenadeFuse_AudioComponent; // 0xB50(0x8)
		UParticleSystemComponent Effect_Distance; // 0xB58(0x8)
		TWeakObjectPtr P_Explosion; // 0xB60(0x20)
		USoundBase Cue_ExplosionSound; // 0xB80(0x8)
		TWeakObjectPtr P_Explosion_Water; // 0xB88(0x20)
		int32_t NumberOfBouncesTillExplode; // 0xBA8(0x4)
		int32_t CurrentNumberOfBounces; // 0xBAC(0x4)
		USoundBase Cue_GrenadeFuseSound; // 0xBB0(0x8)
		double BouncePawnAgainstPawnGravityScale; // 0xBB8(0x8)
		UForceFeedbackEffect ExplosionForceFeedbackNear; // 0xBC0(0x8)
		UForceFeedbackEffect ExplosionForceFeedbackFar; // 0xBC8(0x8)
		USoundBase Cue_Bounce; // 0xBD0(0x8)
		UClass ExplosionCameraShake; // 0xBD8(0x8)
		double FuseTime; // 0xBE0(0x8)
		double ExplosionRadius; // 0xBE8(0x8)
		FRotator Explosion_Rotation; // 0xBF0(0x18)
		UAudioComponent WaterFuseAudioComponent; // 0xC08(0x8)
		USoundBase Water_Debris_Explosion; // 0xC10(0x8)
		USoundBase Splash_Sound; // 0xC18(0x8)
		UTexture SoundIndicatorIcon; // 0xC20(0x8)
		FTimerHandle FuseIndicatorTimer; // 0xC28(0x8)
		TWeakObjectPtr NS_Explosion; // 0xC30(0x20)
		TWeakObjectPtr NS_Explosion_Water; // 0xC50(0x20)
		EFXType FXType; // 0xC70(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC71(0x7) UNKNOWN PROPERTY
		UFXSystemAsset VFX_Explosion; // 0xC78(0x8)
		UFXSystemAsset VFX_Explosion_Water; // 0xC80(0x8)
		FTimerHandle FuseTimer_; // 0xC88(0x8)
		UNiagaraSystem NS_HitWater; // 0xC90(0x8)
		USoundBase WaterFuseSound; // 0xC98(0x8)
		UFXSystemAsset FX_Physical_Surface; // 0xCA0(0x8)
		int32_t PhysicalSurfaceID; // 0xCA8(0x4)
		bool bShowFuseSoundIndicator; // 0xCAC(0x1)
		TEnumAsByte E_Surface_Type; // 0xCAD(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_Grenade_Base.B_Prj_Athena_Grenade_Base_C");
			return ret;
		}

		void PhysicalSurfaceCheck(int32_t Physical Surface ID, bool& CheckedPhysicalSurfaceID); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6AFCE500
		void GetExplosion(bool InWater, UFXSystemAsset& FX System); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6AFCAB00
		void FuseEnded(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6AFCAC00
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D6AFCDF00
		void OnLoaded_6A6D02914DCE95902837C994D84D08EA(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCA600
		void OnLoaded_6A6D02914DCE95902837C994C3BE7DC5(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCA700
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6AFCE300
		void OnStop(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D6AFCE600
		void Stop_Rotation(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCE000
		void OnExploded(TArray& HitActors, TArray& HitResults); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D6AFCA800
		void OnBounce(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D6AFCA900
		void ReceiveAnyDamage(float Damage, UDamageType DamageType, AController InstigatedBy, AActor DamageCauser); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x15D6AFCE400
		void OnResumeSimulation(); // Flags: Event|Public|BlueprintEvent 0x15D6AFCE700
		void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent OverlappedComponent, AActor OtherActor, UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent 0x15D6AFCAF00
		void Splash(AFortWaterBodyActor WaterBody, UFortWaterInteractionComponent WaterInteractionComponent, bool bIsFirstBody); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D6AFCE100
		void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(AFortWaterBodyActor WaterBody, UFortWaterInteractionComponent WaterInteractionComponent, bool bIsFirstBody); // Flags: BlueprintEvent 0x15D6AFCAE00
		void Held Water Impact(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D6AFCAA00
		void ShowFuseIndicator(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCE200
		void AysncLoad(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCB000
		void ExecuteUbergraph_B_Prj_Athena_Grenade_Base(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6AFCAD00
	};


	// Class /Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C
	// Inherited from AB_Prj_Athena_Grenade_Base_C -> AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x56 (0xD04 - 0xCAE)
	class AB_Prj_Athena_FragGrenade_C : public AB_Prj_Athena_Grenade_Base_C	
	{
	public:
		unsigned char UnknownData04_3[0x2]; // 0xCAE(0x2) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0xCB0(0x8)
		UNiagaraComponent NS_Object_FloatingInWater; // 0xCB8(0x8)
		UBP_SurfaceTypeSoundComponent_C BP_SurfaceTypeSoundComponent; // 0xCC0(0x8)
		float PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD; // 0xCC8(0x4)
		TEnumAsByte PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD; // 0xCCC(0x1)
		unsigned char UnknownData05_6[0x3]; // 0xCCD(0x3) UNKNOWN PROPERTY
		UTimelineComponent PreExploWarning; // 0xCD0(0x8)
		FGameplayTag FeedbackCue; // 0xCD8(0x4)
		unsigned char UnknownData06_6[0x4]; // 0xCDC(0x4) UNKNOWN PROPERTY
		UNiagaraSystem Niagara_Bounse; // 0xCE0(0x8)
		TEnumAsByte PreExplodeOptimization; // 0xCE8(0x1)
		unsigned char UnknownData07_6[0x7]; // 0xCE9(0x7) UNKNOWN PROPERTY
		double PreExplodeRampTime; // 0xCF0(0x8)
		FName GrenadeFuseParamName; // 0xCF8(0x4)
		float PreExplodeTimerRampFrequency; // 0xCFC(0x4)
		float PreExplodeTimerAccumulatedRampTime; // 0xD00(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C");
			return ret;
		}

		void PreExploWarning__FinishedFunc(); // Flags: BlueprintEvent 0x15D6AFCD000
		void PreExploWarning__UpdateFunc(); // Flags: BlueprintEvent 0x15D6AFCCF00
		void FuseEnded(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6AFCD400
		void OnExploded(TArray& HitActors, TArray& HitResults); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D6AFCD200
		void OnBounce(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D6AFCD300
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6AFCCE00
		void Pre Explo Audio Tell(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCD100
		void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature(AFortWaterBodyActor WaterBody, UFortWaterInteractionComponent WaterInteractionComponent, bool bIsFirstBody); // Flags: BlueprintEvent 0x15D6AFCD700
		void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_3_WaterInteractionOnExitWater__DelegateSignature(AFortWaterBodyActor WaterBody, UFortWaterInteractionComponent WaterInteractionComponent, bool bIsLastBody); // Flags: BlueprintEvent 0x15D6AFCD600
		void TimerPreExplode(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCCD00
		void ExecuteUbergraph_B_Prj_Athena_FragGrenade(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6AFCD500
	};


	// Class /Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_Rethrow.GA_Athena_Grenade_Rethrow_C
	// Inherited from UGA_Athena_Consumable_Throw_Parent_C -> UFortGameplayAbility_ConsumableThrowParent -> UFortGameplayAbility_ThrowTrajectory -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x2C (0x1030 - 0x1004)
	class UGA_Athena_Grenade_Rethrow_C : public UGA_Athena_Consumable_Throw_Parent_C	
	{
	public:
		unsigned char UnknownData02_3[0x4]; // 0x1004(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1008(0x8)
		AFortProjectileBase Projectile; // 0x1010(0x8)
		double TossDelay; // 0x1018(0x8)
		FName HolsterId; // 0x1020(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x1024(0x4) UNKNOWN PROPERTY
		double PostThrowEndDelay; // 0x1028(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_Rethrow.GA_Athena_Grenade_Rethrow_C");
			return ret;
		}

		void DetachProjectile(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6AFCFF00
		void AttachProjectile(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6AFCCA00
		void Completed_3B7299CC49B6C5C075996A9C8DDF315F(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6AFCC700
		void Cancelled_3B7299CC49B6C5C075996A9C8DDF315F(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6AFCC800
		void Triggered_3B7299CC49B6C5C075996A9C8DDF315F(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6AFCF800
		void OnFinish_B295E6694DBD8B2B2478A38EA60F5624(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCFB00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6AFCFD00
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6AFCFC00
		void ThrowProjectile(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCF900
		void RethrowProjectile(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6AFCFA00
		void AttemptSpawnThrownProjectile(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x15D6AFCC900
		void ExecuteUbergraph_GA_Athena_Grenade_Rethrow(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6AFCFE00
	};


	// Class /Game/Athena/HUD/Team/RebootCardIndicator.RebootCardIndicator_C
	// Inherited from UAthenaRebootCardIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x618 - 0x5E8)
	class URebootCardIndicator_C : public UAthenaRebootCardIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5E8(0x8)
		UBorder Border_Nameplate; // 0x5F0(0x8)
		UImage burst; // 0x5F8(0x8)
		UImage Image_RebootIcon; // 0x600(0x8)
		USpacer IndicatorSpacer; // 0x608(0x8)
		UHorizontalBox RebootCountdownContainer; // 0x610(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Team/RebootCardIndicator.RebootCardIndicator_C");
			return ret;
		}

		void bp_UpdateCountdownText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6AFCF200
		void HandleDisplayForSelf(bool bSelf); // Flags: Event|Protected|BlueprintEvent 0x15D6AFCF000
		void ExecuteUbergraph_RebootCardIndicator(int32_t EntryPoint); // Flags: Final 0x15D6AFCF100
	};


	// Class /Game/Athena/HUD/Team/RebootVanIndicator.RebootVanIndicator_C
	// Inherited from UAthenaRebootVanIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x608 - 0x5C8)
	class URebootVanIndicator_C : public UAthenaRebootVanIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5C8(0x8)
		UWidgetAnimation Intro; // 0x5D0(0x8)
		UBorder Border_Nameplate; // 0x5D8(0x8)
		UImage Icon; // 0x5E0(0x8)
		UImage Image_RebootIcon; // 0x5E8(0x8)
		UImage Image_SmallIndicator; // 0x5F0(0x8)
		UImage Image_Van; // 0x5F8(0x8)
		USpacer IndicatorSpacer; // 0x600(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Team/RebootVanIndicator.RebootVanIndicator_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6AFCEF00
		void ExecuteUbergraph_RebootVanIndicator(int32_t EntryPoint); // Flags: Final 0x15D6AFCEE00
	};


	// Class /Game/Athena/Apollo/Water/Blueprints/BP_FluidSim_FN.BP_FluidSim_FN_C
	// Inherited from ABP_FluidSim_01_C -> ABP_FluidSimParent_C -> AActor -> UObject
	// Size: 0x1C0 (0x790 - 0x5D0)
	class ABP_FluidSim_FN_C : public ABP_FluidSim_01_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5D0(0x8)
		FFluidForceDynamic BoatForceSettings; // 0x5D8(0x70)
		FFluidForceDynamic PlayerForceSettings; // 0x648(0x70)
		FFluidForceDynamic MechForceSettings; // 0x6B8(0x70)
		TArray RelevantFortPawns; // 0x728(0x10)
		bool Use_FN_Pawn_Forces; // 0x738(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x739(0x7) UNKNOWN PROPERTY
		TMap VehicleTypeMap; // 0x740(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Apollo/Water/Blueprints/BP_FluidSim_FN.BP_FluidSim_FN_C");
			return ret;
		}

		void GetFortnitePawnForces(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B171800
		void GetLocalPawn(APawn& Pawn); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6B171700
		void GetPlayerPawnForces(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B171600
		void ExecuteUbergraph_BP_FluidSim_FN(int32_t EntryPoint); // Flags: Final 0x15D6B171900
	};


	// Class /Game/Athena/Apollo/Environments/Landscape/Water/FortWaterBodyBP.FortWaterBodyBP_C
	// Inherited from AFortWaterBodyActor -> AWaterBody -> AActor -> UObject
	// Size: 0x10 (0x408 - 0x3F8)
	class AFortWaterBodyBP_C : public AFortWaterBodyActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3F8(0x8)
		ABP_FluidSim_FN_C FluidSimBP; // 0x400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Apollo/Environments/Landscape/Water/FortWaterBodyBP.FortWaterBodyBP_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6B171000
		void OnReceivedBulletImpact(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D6B171100
		void ExecuteUbergraph_FortWaterBodyBP(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B171200
	};


	// Class /Game/Athena/Asteria/Environments/Water/Asteria_Waterbody_Ocean_Parent.Asteria_Waterbody_Ocean_Parent_C
	// Inherited from AFortWaterBodyBP_C -> AFortWaterBodyActor -> AWaterBody -> AActor -> UObject
	// Size: 0x10 (0x418 - 0x408)
	class AAsteria_Waterbody_Ocean_Parent_C : public AFortWaterBodyBP_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x408(0x8)
		UFortSplineWaterAudioComponent FortSplineWaterAudio; // 0x410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Asteria/Environments/Water/Asteria_Waterbody_Ocean_Parent.Asteria_Waterbody_Ocean_Parent_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6B170D00
		void ExecuteUbergraph_Asteria_Waterbody_Ocean_Parent(int32_t EntryPoint); // Flags: Final 0x15D6B170F00
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_FallDamageImmunityFX.GE_Athena_ZipLine_FallDamageImmunityFX_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_ZipLine_FallDamageImmunityFX_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_FallDamageImmunityFX.GE_Athena_ZipLine_FallDamageImmunityFX_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_SmashParent.GA_Athena_ZipLine_SmashParent_C
	// Inherited from UFortGameplayAbility_ZiplineSmashBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xB8 (0xC10 - 0xB58)
	class UGA_Athena_ZipLine_SmashParent_C : public UFortGameplayAbility_ZiplineSmashBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB58(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB60(0x8)
		double UpdateIntervalForSmashVolume; // 0xB68(0x8)
		UClass StructureDamageGE; // 0xB70(0x8)
		ABP_ZipLine_Athena_Harness_C ZiplineHarness; // 0xB78(0x8)
		AFortAthenaZipline Zipline; // 0xB80(0x8)
		UPrimitiveComponent ZiplineInteractComponent; // 0xB88(0x8)
		TEnumAsByte DrivingCustomMovementMode; // 0xB90(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xB91(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle FallImmunityGEFX; // 0xB94(0x8)
		FGameplayTag AttachVFXCue; // 0xB9C(0x4)
		FGameplayTag SmashCue; // 0xBA0(0x4)
		FGameplayTag T_Swimming; // 0xBA4(0x4)
		FGameplayTag T_Falling; // 0xBA8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xBAC(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer TagsThatBlockFallImmunityRemoval; // 0xBB0(0x20)
		FTimerHandle TH_DelayFallDamageRemoval; // 0xBD0(0x8)
		FTimerHandle SurroundingsCheckTimerHandle; // 0xBD8(0x8)
		FGameplayTag ZiplineExitTag; // 0xBE0(0x4)
		unsigned char UnknownData05_6[0x4]; // 0xBE4(0x4) UNKNOWN PROPERTY
		FVector Smash_Box_Extent; // 0xBE8(0x18)
		double SmashBoxPosAdditionalZ; // 0xC00(0x8)
		UClass GE_Ziplining_Passive; // 0xC08(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_SmashParent.GA_Athena_ZipLine_SmashParent_C");
			return ret;
		}

		void Get Zipline Motor Offset(FVector& Offset); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17C000
		void GetZiplineRotationForMotor(FRotator& Rotation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17BD00
		void Get Zipline Pole A Socket Loc(FVector& PoleBSocketLoc); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17BF00
		void Get Zipline Pole B Socket Loc(FVector& PoleBSocketLoc); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17BE00
		void CheckForQuestProgress(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B178800
		void CheckMotor(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B178700
		void Spawn Motor(AActor PlayerPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B17AE00
		void BreakNearbyStructures(AFortPlayerPawn PlayerPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B178900
		void Removed_A0F18316443E5C5267615C9692274B36(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B000
		void TagCountChanged_746A0F5B4A118C50DFD0AFB393033385(int32_t TagCount); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17A600
		void SurroundingsCheck(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17AB00
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B17B900
		void OnPawnLanded_Bind(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17B300
		void HandleZiplineStateChanged(bool bIsZiplining, AFortPlayerPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17BA00
		void RemoveFallDamageImmunity(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17AF00
		void OnEnterVehicle_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B500
		void ZipliningComplete(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17E600
		void OnEnteredAircraft_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B600
		void OnBeginSkydiving_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B700
		void DelaySpawnMotor(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B178600
		void BindEvent(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B178A00
		void SwimmingStarted(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17A700
		void EnterWaterExit(AFortPlayerPawn FortPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17C600
		void HandleClientSplineZiplineStateChanged(bool bIsZiplining, AFortPlayerPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17BC00
		void SplineZiplineMovementModeDelayOver(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17AD00
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6B17B800
		void Remove Fall Damage Immunity Delayed(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B100
		void EndAsyncBreakNearbyStructuresOverlap(TArray& OverlapActors); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B178500
		void SurroundingsCheck_SmashObjects(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17A900
		void SurroundingsCheck_MotorCheck(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17AA00
		void SurruondingsCheck_VehicleCheck(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17A800
		void StartSurroundingsCheck(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17AC00
		void OnPawnDied(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B400
		void GameplayTagEvent_ZiplineEnter(FGameplayEventData& EventData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17C200
		void GameplayTagEvent_ZiplineExit(FGameplayEventData& EventData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17C100
		void GameplayEvent_ZiplineEnter_BeginZiplining(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17C300
		void FallingTagRemoved(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17C400
		void Pre_BeginZiplinging(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17B200
		void HandleGameplayEventTag(FGameplayEventData& EventData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B17BB00
		void ZiplinePostBegin_Event(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B17E700
		void ExecuteUbergraph_GA_Athena_ZipLine_SmashParent(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B17C500
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_Smash.GA_Athena_ZipLine_Smash_C
	// Inherited from UGA_Athena_ZipLine_SmashParent_C -> UFortGameplayAbility_ZiplineSmashBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x0 (0xC10 - 0xC10)
	class UGA_Athena_ZipLine_Smash_C : public UGA_Athena_ZipLine_SmashParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_Smash.GA_Athena_ZipLine_Smash_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_Teleport.GA_Athena_HidingProp_Teleport_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x98 (0xBD8 - 0xB40)
	class UGA_Athena_HidingProp_Teleport_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FMulticastInlineDelegate NewEventDispatcher; // 0xB48(0x10)
		AB_HidingProp_C HidingProp; // 0xB58(0x8)
		AB_HidingProp_C TargetTeleporter; // 0xB60(0x8)
		FGameplayTagContainer T_HudElementToHide; // 0xB68(0x20)
		FGameplayTag TargetPropTeleportingCue; // 0xB88(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xB8C(0x4) UNKNOWN PROPERTY
		FTimerHandle WobbleHandle; // 0xB90(0x8)
		FGameplayTag WobbleCue; // 0xB98(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xB9C(0x4) UNKNOWN PROPERTY
		double ServerWorldTime; // 0xBA0(0x8)
		FGameplayTag EnterCue; // 0xBA8(0x4)
		FGameplayTag HidingInPropTag; // 0xBAC(0x4)
		FGameplayTagContainer ChangeEquipmentTag; // 0xBB0(0x20)
		FActiveGameplayEffectHandle TeleportingGEOnPlayer; // 0xBD0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_Teleport.GA_Athena_HidingProp_Teleport_C");
			return ret;
		}

		void Added_FD079A2341CDD832DF47CD975DFC3BB3(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E1500
		void OnComplete_EE0FA6804073079396C44591432259C0(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E0D00
		void Added_67FE14EA4DF2D8C2DB494AA89443681B(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E1800
		void Added_CB8220A04B74338E758C11B7371D4630(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E1700
		void Added_F96D6DD549939CA425D2D1BE1AD32090(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E1600
		void EventReceived_ABAD14334D754F46E9037882BF0256B6(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E1400
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E0F00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E1000
		void QuestUpdate(AFortPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E0B00
		void Wobble(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E0A00
		void OnPawnDied(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E0C00
		void GrapplerFailSafe(AFortPawn FortPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E1100
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent 0x15D6B2E1200
		void ExecuteUbergraph_GA_Athena_HidingProp_Teleport(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B2E1300
		void NewEventDispatcher_0__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6B2E0E00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C
	// Inherited from AFortHidingProp -> ABuildingProp -> ABuildingTimeOfDayLights -> ABuildingAutoNav -> ABuildingSMActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x5D8 (0x1208 - 0xC30)
	class AB_HidingProp_C : public AFortHidingProp	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xC30(0x8)
		USceneComponent ProjectileLocation_ForwardVector; // 0xC38(0x8)
		UStaticMeshComponent LandedOnCollisionMesh; // 0xC40(0x8)
		USphereComponent Sphere; // 0xC48(0x8)
		USceneComponent HideLocation_ForwardVector; // 0xC50(0x8)
		float Loot_MovementTimeline_Forward_0FC694AE4A45D691CB6BD5A8CD00E521; // 0xC58(0x4)
		float Loot_MovementTimeline_Z_0FC694AE4A45D691CB6BD5A8CD00E521; // 0xC5C(0x4)
		TEnumAsByte Loot_MovementTimeline__Direction_0FC694AE4A45D691CB6BD5A8CD00E521; // 0xC60(0x1)
		unsigned char UnknownData13_6[0x7]; // 0xC61(0x7) UNKNOWN PROPERTY
		UTimelineComponent Loot_MovementTimeline; // 0xC68(0x8)
		FScalableFloat Enabled; // 0xC70(0x28)
		FScalableFloat HidingEnabled; // 0xC98(0x28)
		FScalableFloat PlayerLimit; // 0xCC0(0x28)
		FScalableFloat TeleportEnabled; // 0xCE8(0x28)
		FScalableFloat CanTeleport; // 0xD10(0x28)
		TArray HidingPlayers; // 0xD38(0x10)
		FGameplayTag EnterGameplayCue; // 0xD48(0x4)
		FGameplayTag ExitGameplayCue; // 0xD4C(0x4)
		FGameplayTag LandedOnGameplayCue; // 0xD50(0x4)
		unsigned char UnknownData14_6[0x4]; // 0xD54(0x4) UNKNOWN PROPERTY
		UMaterialInstanceDynamic Mid; // 0xD58(0x8)
		FGameplayTag RustleGameplayCue; // 0xD60(0x4)
		FGameplayTag ExitGameplayCue_Player; // 0xD64(0x4)
		FGameplayTag WhileEnteringGameplayCue; // 0xD68(0x4)
		unsigned char UnknownData15_6[0x4]; // 0xD6C(0x4) UNKNOWN PROPERTY
		double ObstructionTraceLength; // 0xD70(0x8)
		TArray DestroyObjectTypes; // 0xD78(0x10)
		TArray Array; // 0xD88(0x10)
		int32_t int; // 0xD98(0x4)
		unsigned char UnknownData16_6[0x4]; // 0xD9C(0x4) UNKNOWN PROPERTY
		FVector DeimosPropSpawnerOffset; // 0xDA0(0x18)
		bool FixedEntranceDirection; // 0xDB8(0x1)
		unsigned char UnknownData17_6[0x7]; // 0xDB9(0x7) UNKNOWN PROPERTY
		double MaxInteractAngle; // 0xDC0(0x8)
		FVector WobbleLocationOffset; // 0xDC8(0x18)
		double InteractBelowPropDistance; // 0xDE0(0x8)
		TMap HiddenPlayersAndEnterTimes; // 0xDE8(0x50)
		AFortPawn LastPawnToInteract; // 0xE38(0x8)
		AB_HidingProp_C TargetTeleporter; // 0xE40(0x8)
		FGameplayTag TeleporterEnterGameplayCue; // 0xE48(0x4)
		FGameplayTag TeleporterExitGameplayCue; // 0xE4C(0x4)
		FGameplayTag LoopingTeleportingCue; // 0xE50(0x4)
		FGameplayTag GC_Wobble; // 0xE54(0x4)
		FTimerHandle WobbleTimerHandle; // 0xE58(0x8)
		TArray BlockEntranceTags; // 0xE60(0x10)
		TArray BlockExitTags; // 0xE70(0x10)
		UAnimMontage EnterAnimMontage; // 0xE80(0x8)
		UAnimMontage ExitAnimMontage; // 0xE88(0x8)
		AFortPawn LastPawnToHide; // 0xE90(0x8)
		FGameplayTag TeleportingStateGC; // 0xE98(0x4)
		bool RandomWobbleNormal; // 0xE9C(0x1)
		bool SingleOccupant; // 0xE9D(0x1)
		bool Teleporting; // 0xE9E(0x1)
		bool JumpOut; // 0xE9F(0x1)
		UClass GE_OnExitingPropNoJump_BlockActions; // 0xEA0(0x8)
		bool DestroyInNonSpyLTM; // 0xEA8(0x1)
		bool ActiveInSpyLTM; // 0xEA9(0x1)
		unsigned char UnknownData18_6[0x6]; // 0xEAA(0x6) UNKNOWN PROPERTY
		TArray ForceAllowInteractTags; // 0xEB0(0x10)
		FGameplayTag IsTeleporter; // 0xEC0(0x4)
		FGameplayTag ContainsPlayerRepNof; // 0xEC4(0x4)
		FVector ObstructionTraceExtents; // 0xEC8(0x18)
		FVector ObstructionTraceStartOffSet; // 0xEE0(0x18)
		double ExitLaunchVelocity; // 0xEF8(0x8)
		FVector AdditionalLaunchVelocity; // 0xF00(0x18)
		FVector Obstruction_Trace_End; // 0xF18(0x18)
		FVector FixedEntraceObstructionTraceEndOffset; // 0xF30(0x18)
		bool isActiveTeleportExit; // 0xF48(0x1)
		unsigned char UnknownData19_6[0x7]; // 0xF49(0x7) UNKNOWN PROPERTY
		UClass GE_TeleportAbilityGranted; // 0xF50(0x8)
		bool DisableWhenSubmergedInWater; // 0xF58(0x1)
		unsigned char UnknownData20_6[0x7]; // 0xF59(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer DisableWhenSubmergedExceptionTags; // 0xF60(0x20)
		TArray NonCosmeticPawns; // 0xF80(0x10)
		UClass CameraModifier; // 0xF90(0x8)
		FVector NewVar; // 0xF98(0x18)
		AActor Pawn; // 0xFB0(0x8)
		FVector Loot_CachedActorForward; // 0xFB8(0x18)
		TArray Loot_VectorOffsets; // 0xFD0(0x10)
		bool SpawnedLoot; // 0xFE0(0x1)
		unsigned char UnknownData21_6[0x7]; // 0xFE1(0x7) UNKNOWN PROPERTY
		double Loot_MoveForwardDistance; // 0xFE8(0x8)
		double Loot_MoveUpDistance; // 0xFF0(0x8)
		double Loot_SpawnRadius; // 0xFF8(0x8)
		FVector Loot_SpawnOffset; // 0x1000(0x18)
		bool ShouldSpawnLoot; // 0x1018(0x1)
		unsigned char UnknownData22_6[0x7]; // 0x1019(0x7) UNKNOWN PROPERTY
		FString Loot_Tier_Group; // 0x1020(0x10)
		bool SetEntranceRotation; // 0x1030(0x1)
		unsigned char UnknownData23_6[0x7]; // 0x1031(0x7) UNKNOWN PROPERTY
		UClass PropSpecificEffectToApplyToHiders; // 0x1038(0x8)
		FScalableFloat RustlesPerWobble; // 0x1040(0x28)
		FScalableFloat RustleWobbleRadius; // 0x1068(0x28)
		FScalableFloat EnterWobbleRadius; // 0x1090(0x28)
		double NonJumpExitDistance; // 0x10B8(0x8)
		UClass Camera_Mode; // 0x10C0(0x8)
		bool MoveToActorOnEnter; // 0x10C8(0x1)
		bool IgnorePhysicsBodyCollisionOnEnter; // 0x10C9(0x1)
		bool bCanRustleAndWobble; // 0x10CA(0x1)
		bool SkipRestoreCameraViewTargetOnStopHiding; // 0x10CB(0x1)
		bool SkipRootMotionMovementOnStopHiding; // 0x10CC(0x1)
		unsigned char UnknownData24_6[0x3]; // 0x10CD(0x3) UNKNOWN PROPERTY
		FRotator AddedSetEntranceRotation; // 0x10D0(0x18)
		double MoveToActorDelayOnEnter; // 0x10E8(0x8)
		double MoveToActorDurationOverride; // 0x10F0(0x8)
		FMarkedActorDisplayInfo MarkerDisplay; // 0x10F8(0xA0)
		FVector MarkerPositionOffset; // 0x1198(0x18)
		bool ObstructionTraceByObject; // 0x11B0(0x1)
		unsigned char UnknownData25_6[0x7]; // 0x11B1(0x7) UNKNOWN PROPERTY
		FScalableFloat Hiding_Enable_From_Landing; // 0x11B8(0x28)
		FScalableFloat HidingEnabled; // 0x11E0(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C");
			return ret;
		}

		bool BlueprintOnLocalInteract(AFortPlayerPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E0200
		void GetObstructionTraceParams(ACharacter InCharacter, FVector& TraceStart, FVector& TraceEnd, FVector& TraceExtents, FRotator& TraceOrientation, TArray& ActorsToIgnore); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6B2E3700
		void Get Obstruction Objects(bool TraceByChannel, FVector Start, FVector End, FVector HalfSize, FRotator orientation, TArray& ActorsToIgnore, TArray& OutHits); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E3B00
		FVector GetMarkerPositionOffset(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B2E3900
		FMarkedActorDisplayInfo GetMarkerDisplayData(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B2E3A00
		void GetTurnClientCameraCollisionOnDelayTime(double& Delay); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6B2E3500
		void Can Hide by Falling(AActor OtherActor, bool& CanHide, AFortPlayerPawn& aFortPlayerPawn); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E4100
		void Player Getting in Prop(AFortPawn FortPawn, bool& Is Getting In); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B2E6200
		void Player Hidden in Prop(AFortPawn Fort Pawn, bool& IsHidden); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B2E6100
		void LocalOnFailedInteract(AFortPlayerPawn InteractingPawn); // Flags: Event|Public|BlueprintCallable|BlueprintEvent|Const 0x15D6B2E2C00
		float GetMinDistanceFromInteraction(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B2E3800
		void GetPlayerLimit(int32_t& PlayerLimit); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B2E3600
		void Allow Cosmetics For Pawn(AFortPawn& Pawn, bool& Allow); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E0800
		void OnRep_ContainsPlayer(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E2500
		void OnRep_IsTeleporter(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E2300
		bool CheckCanUsePassage(UObject Object); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E4000
		bool IsInInfiltrationLTM(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6B2E3000
		void OnRep_Teleporting(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E2200
		FText BlueprintGetFailedInteractionString(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B2E0600
		void RemoveHiddenPlayer(AFortPawn FortPawn); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B2E5C00
		void AddHiddenPlayer(AFortPawn FortPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E0900
		void OnRep_HidingPlayers(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E2400
		bool BlueprintGetInteractionTime(AFortPawn InteractingPawn, float& OutInteractionTime, TEnumAsByte InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B2E0400
		FText BlueprintGetInteractionString(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B2E0500
		bool BlueprintCanInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted, TEnumAsByte InteractionType); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B2E0700
		void Loot_MovementTimeline__FinishedFunc(); // Flags: BlueprintEvent 0x15D6B2E2B00
		void Loot_MovementTimeline__UpdateFunc(); // Flags: BlueprintEvent 0x15D6B2E2A00
		void OnReady_64CBF02E419FF250B433D5B2A6E5D744(AFortGameStateAthena GameState, UFortPlaylist Playlist, FGameplayTagContainer& PlaylistContextTags); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E2600
		void OnCurieActive_F2BFC8C54691C42FB5230BA7B7DEE141(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E2900
		void BlueprintOnInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x15D6B2E0300
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D6B2E2800
		void BndEvt__S_Athena_Launchpad_Collision_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent OverlappedComponent, AActor OtherActor, UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent 0x15D6B2E0100
		void LandedOnHayStack(AFortPlayerPawn PlayerPawn, double Z Velocity Mag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E2F00
		void LaunchPlayersOffTop(AFortPlayerPawn PlayerPawn); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D6B2E2D00
		void ReceiveActorBeginOverlap(AActor OtherActor); // Flags: Event|Public|BlueprintEvent 0x15D6B2E6000
		void StopHidingLoop(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E5900
		void HidingPlayerCountChanged(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E3400
		void InteractEnter(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D6B2E3100
		void EndHidingAnalyticSession(AFortPawn FortPawn, EEnvironmentalItemEndReason EndReason); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E3F00
		void WatchForPlayerDeath(AFortPawn FortPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E5500
		void Pawn Died(AActor DamagedActor, float Damage, AController InstigatedBy, AActor DamageCauser, FVector HitLocation, UPrimitiveComponent FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E6300
		void StopHiding(AFortPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E5A00
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E5F00
		void Teleport(AActor Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E5800
		void IgnorePawnCollision(AFortPawn Target, double InIgnoreDuration); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 0x15D6B2E3300
		void ToggleCameraCollisionForClients(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent 0x15D6B2E5700
		void StartHiding(AFortPawn InteractingPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E5B00
		void TurnClientCameraCollisionOn(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E5600
		void AddGameplayCue(FGameplayTag GameplayCueTag, FGameplayCueParameters& CueParameters); // Flags: Net|NetReliableNetMulticast|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6709FC00
		void RemoveGameplayCue(FGameplayTag GameplayCueTag, FGameplayCueParameters& CueParameters); // Flags: Net|NetReliableNetMulticast|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E5D00
		void ExecuteGameplayCue(FGameplayTag GameplayCueTag, FGameplayCueParameters& CueParameters); // Flags: Net|NetReliableNetMulticast|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E3D00
		void OnMatchStarted(); // Flags: Event|Public|BlueprintEvent 0x15D6B2E2700
		void Launch Pickups(TArray& Array, AActor Pawn); // Flags: Net|NetReliableNetMulticast|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E2E00
		void EntranceBlockedByUndamageable(AFortPlayerPawn PlayerPawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E3E00
		void IgnorePhysicsCollisionDamage(AFortPawn Target, double Ignore Duration); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E3200
		void BP_HandleExitPressed(AFortPlayerPawn TargetPlayerPawn); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E4200
		void ExecuteUbergraph_B_HidingProp(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B2E3C00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GE_WilliePete_PlayerLaunch_Granted.GE_WilliePete_PlayerLaunch_Granted_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_WilliePete_PlayerLaunch_Granted_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GE_WilliePete_PlayerLaunch_Granted.GE_WilliePete_PlayerLaunch_Granted_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ApplyTeleportGA.GE_Athena_HidingProp_ApplyTeleportGA_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_ApplyTeleportGA_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ApplyTeleportGA.GE_Athena_HidingProp_ApplyTeleportGA_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GA_WilliePete_PlayerLaunch.GA_WilliePete_PlayerLaunch_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x78 (0xBB8 - 0xB40)
	class UGA_WilliePete_PlayerLaunch_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawnAthena OwningPawn; // 0xB48(0x8)
		UAnimMontage ExitMontage; // 0xB50(0x8)
		FScalableFloat LaunchHeightValue; // 0xB58(0x28)
		AB_HidingProp_WilliePete_C WilliePeteLauncher; // 0xB80(0x8)
		FGameplayTagContainer PlayerLaunchTag; // 0xB88(0x20)
		UClass GE_WilliePete_PlayerLaunch_ApplyGC; // 0xBA8(0x8)
		AFortPlayerPawnAthena TeleportExitPlayer; // 0xBB0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GA_WilliePete_PlayerLaunch.GA_WilliePete_PlayerLaunch_C");
			return ret;
		}

		void StructureTraceLoop(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E8200
		void BreakBlockingStructure(AActor HitActor); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E4C00
		void OnNotifyEnd_A0F03A1445141EA659E282AFE77CEA62(FGameplayTag NotifyTag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E8400
		void OnNotifyBegin_A0F03A1445141EA659E282AFE77CEA62(FGameplayTag NotifyTag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E4300
		void OnCancelled_A0F03A1445141EA659E282AFE77CEA62(FGameplayTag NotifyTag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E4600
		void OnInterrupted_A0F03A1445141EA659E282AFE77CEA62(FGameplayTag NotifyTag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E4400
		void OnBlendOut_A0F03A1445141EA659E282AFE77CEA62(FGameplayTag NotifyTag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E4700
		void OnCompleted_A0F03A1445141EA659E282AFE77CEA62(FGameplayTag NotifyTag); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E4500
		void Redeploy Glider(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E8300
		void End Skydive(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E4B00
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E4800
		void ActorHit(AActor SelfActor, AActor OtherActor, FVector NormalImpulse, FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E5300
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent 0x15D6B2E4900
		void ExecuteUbergraph_GA_WilliePete_PlayerLaunch(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B2E4A00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/B_HidingProp_WilliePete.B_HidingProp_WilliePete_C
	// Inherited from AB_HidingProp_C -> AFortHidingProp -> ABuildingProp -> ABuildingTimeOfDayLights -> ABuildingAutoNav -> ABuildingSMActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x24A (0x1452 - 0x1208)
	class AB_HidingProp_WilliePete_C : public AB_HidingProp_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1208(0x8)
		UStaticMeshComponent overlapCylinder; // 0x1210(0x8)
		UAudioComponent WilliePete_Ambient_Loop; // 0x1218(0x8)
		UStaticMeshComponent Geyser; // 0x1220(0x8)
		UStaticMeshComponent S_Whirlpool_01; // 0x1228(0x8)
		UParticleSystemComponent P_WilliePete_SurfaceVerticalSplash; // 0x1230(0x8)
		UFortProjectileMovementComponent OverlappedFortProjectileMovementComponent; // 0x1238(0x8)
		UProjectileMovementComponent OverlappedStandardProjectileMovementComponent; // 0x1240(0x8)
		AActor TeleportingNonPawn; // 0x1248(0x8)
		FHitResult SphereOverlapResult; // 0x1250(0xF8)
		double ProjectileSpeedCeiling; // 0x1348(0x8)
		FRotator ProjectileExitFVectorRotation; // 0x1350(0x18)
		int32_t WaterLevel; // 0x1368(0x4)
		FGameplayTag GC_Exit; // 0x136C(0x4)
		FGameplayTag GC_Enter; // 0x1370(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x1374(0x4) UNKNOWN PROPERTY
		FScalableFloat EnabledValue; // 0x1378(0x28)
		FScalableFloat LaunchHeightValue; // 0x13A0(0x28)
		AFortPlayerPawnAthena LaunchPawn; // 0x13C8(0x8)
		FActiveGameplayEffectHandle LaunchGrantedEffectHandle; // 0x13D0(0x8)
		FGameplayTagContainer T_Quest; // 0x13D8(0x20)
		UClass SpawnedWaterBody; // 0x13F8(0x8)
		FGameplayTag GC_ScreenFX; // 0x1400(0x4)
		bool isOnTestMap; // 0x1404(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x1405(0x3) UNKNOWN PROPERTY
		USoundBase Launch_Sound; // 0x1408(0x8)
		FVector AdjustedLocation; // 0x1410(0x18)
		bool skipAnimForLaunch; // 0x1428(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x1429(0x7) UNKNOWN PROPERTY
		AFortPlayerPawnAthena ExitingPawn; // 0x1430(0x8)
		UMovementComponent OverlappedMovementComponent; // 0x1438(0x8)
		double ProjectileSpeedMult; // 0x1440(0x8)
		double PickupSpeedMult; // 0x1448(0x8)
		bool bSetSilentDie; // 0x1450(0x1)
		bool bSetSpawnedWaterBody; // 0x1451(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/B_HidingProp_WilliePete.B_HidingProp_WilliePete_C");
			return ret;
		}

		void OnRep_bSetSpawnedWaterBody(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E7800
		void OnRep_bSetSilentDie(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E7900
		void HelperLocationLogger(FString InString); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B2E7E00
		void OnRep_AdjustedLocation(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B2E7A00
		void TeleportExitSpeed(FVector ExitFVector, double EnterSpeed, double OverrideSpeed, double MinimumSpeed, bool ForceSpeedOverride, FVector& TeleportExitVelocity); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6B2E7300
		void OnReady_74044DD44988556292500EB8F289359F(AFortGameStateAthena GameState, UFortPlaylist Playlist, FGameplayTagContainer& PlaylistContextTags); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E7B00
		void Non Pawn Actor Destroyed(AActor DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E7D00
		void Non Pawn Teleport(AActor TeleportingActor); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E7C00
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E7700
		void Remove GE(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E7600
		void BndEvt__overlapCylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent OverlappedComponent, AActor OtherActor, UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent 0x15D6B2E8100
		void Complete Setup(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E8000
		void StopHiding(AFortPawn Pawn); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E7400
		void ResetGravity(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E7500
		void ExecuteUbergraph_B_HidingProp_WilliePete(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B2E7F00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_JumpOut.GA_Athena_HidingProp_JumpOut_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_Athena_HidingProp_JumpOut_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_JumpOut.GA_Athena_HidingProp_JumpOut_C");
			return ret;
		}

		bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayAbilitySpecHandle Handle, FGameplayTagContainer& RelevantTags); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B2E6700
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B2E6800
		void ExecuteUbergraph_GA_Athena_HidingProp_JumpOut(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B2E6900
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_Hide.GA_Athena_HidingProp_Hide_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x170 (0xCB0 - 0xB40)
	class UGA_Athena_HidingProp_Hide_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn PlayerPawn; // 0xB48(0x8)
		AB_HidingProp_C HidingProp; // 0xB50(0x8)
		UAnimMontage Enter_Anim_Montage; // 0xB58(0x8)
		FGameplayTag GC_Wobble; // 0xB60(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xB64(0x4) UNKNOWN PROPERTY
		FScalableFloat ExitBlockShootDelay; // 0xB68(0x28)
		FGameplayTagContainer TC_Quest; // 0xB90(0x20)
		FGameplayTagContainer TC_PlayerOwned; // 0xBB0(0x20)
		FScalableFloat RustleMinDelay; // 0xBD0(0x28)
		FScalableFloat RustleMaxDelay; // 0xBF8(0x28)
		AFortPlayerController PlayerController; // 0xC20(0x8)
		FGameplayTagContainer HidingInPropTag; // 0xC28(0x20)
		FGameplayTagContainer GettingInPropTag; // 0xC48(0x20)
		FGameplayTag CurieBurningTag; // 0xC68(0x4)
		bool AllowCosmetics; // 0xC6C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xC6D(0x3) UNKNOWN PROPERTY
		FGameplayTag DisallowCosmeticsTag; // 0xC70(0x4)
		bool LandedOnProp; // 0xC74(0x1)
		unsigned char UnknownData05_6[0x3]; // 0xC75(0x3) UNKNOWN PROPERTY
		FTimerHandle LockOnTimer; // 0xC78(0x8)
		FVector HideLocationForwardVectorWorldPos; // 0xC80(0x18)
		FRotator HideLocationForwardVectorWorldRot; // 0xC98(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_Hide.GA_Athena_HidingProp_Hide_C");
			return ret;
		}

		void SetAvatarHiddenInGame(bool New Hidden); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B2E9200
		void SetCosmeticsAllowed(bool Allowed); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B2E9100
		void Completed_75B60D4B43DAA553E4C21EA3D2E3AD03(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E9F00
		void Cancelled_75B60D4B43DAA553E4C21EA3D2E3AD03(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2EA000
		void Triggered_75B60D4B43DAA553E4C21EA3D2E3AD03(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B2E9000
		void OnTimedOutAndDestinationReached_859E251740F1C46B914344A9FC343B19(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9400
		void OnTimedOut_859E251740F1C46B914344A9FC343B19(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9600
		void OnTimedOutAndDestinationReached_8010F4C64221E8F497C6559558420C32(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9500
		void OnTimedOut_8010F4C64221E8F497C6559558420C32(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9700
		void Added_F049BFC743FE176042ECD98641AFE2B9(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2EA100
		void Added_35C56E354FE08855A837E0BDFB150F20(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E6500
		void Added_CD24BC554E955808A88A5B809807A94E(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E6400
		void Added_E60D990647FDAB06895E738C7A2BAE7E(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2EA300
		void Added_D329D9924DF9DF1B79D0738C6CB8EBA1(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2EA500
		void Added_1D4A49874AC422976CAC2C9155DDA736(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E6600
		void EventReceived_8C4C6D7442A0B18F41B269995833ED85(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9C00
		void Added_D54881A34BC79E85BE563BA220DD924D(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2EA400
		void Added_EAA3FC0B4E27CDA8B4F3289DF7EA9E90(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2EA200
		void OnFinished_35C1D63345930DB9A5BDB7BED8B808BF(bool DestinationReached, bool TimedOut, FVector FinalTargetLocation); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9800
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B2E9A00
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent 0x15D6B2E9900
		void RustleLoop(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9300
		void End(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9E00
		void WobbleHidingProp(double NormalizedMagnitude); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E8F00
		void Event_LockOnProp(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B2E9D00
		void ExecuteUbergraph_GA_Athena_HidingProp_Hide(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B2E9B00
	};


	// Class /Game/Athena/Items/EnvironmentalItems/SCMachine/BGA_Athena_SCMachine_Pickup.BGA_Athena_SCMachine_Pickup_C
	// Inherited from ABuildingGameplayActorSpawnChip -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0xEB (0xB9B - 0xAB0)
	class ABGA_Athena_SCMachine_Pickup_C : public ABuildingGameplayActorSpawnChip	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xAB0(0x8)
		UCapsuleComponent OverlapCollision; // 0xAB8(0x8)
		UStaticMeshComponent ParentMesh; // 0xAC0(0x8)
		UFortLinkToActorComponent FortLinkToActor; // 0xAC8(0x8)
		UAudioComponent SC_Machine_Memory_Card_Loop_Cue; // 0xAD0(0x8)
		UParticleSystemComponent SpawninEffect; // 0xAD8(0x8)
		UStaticMeshComponent BackgroundGlow; // 0xAE0(0x8)
		UStaticMeshComponent Card; // 0xAE8(0x8)
		int32_t UnHide; // 0xAF0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xAF4(0x4) UNKNOWN PROPERTY
		double DelayBeforeUnhide; // 0xAF8(0x8)
		char OwnerTeam; // 0xB00(0x1)
		unsigned char UnknownData05_6[0x7]; // 0xB01(0x7) UNKNOWN PROPERTY
		FTimerHandle Timer_DestroyPickup; // 0xB08(0x8)
		FScalableFloat Row_PickupLife; // 0xB10(0x28)
		FText InteractText; // 0xB38(0x10)
		UParticleSystem SpawnOutParticle; // 0xB48(0x8)
		USoundBase PickupSound; // 0xB50(0x8)
		bool SpawnSoundPlayed; // 0xB58(0x1)
		unsigned char UnknownData06_6[0x7]; // 0xB59(0x7) UNKNOWN PROPERTY
		USoundBase SpawnInSound; // 0xB60(0x8)
		bool IsPendingKill; // 0xB68(0x1)
		bool HideAndKill; // 0xB69(0x1)
		unsigned char UnknownData07_6[0x6]; // 0xB6A(0x6) UNKNOWN PROPERTY
		FScalableFloat Row_PickUpInteractTime; // 0xB70(0x28)
		bool IsDelayingDeath; // 0xB98(0x1)
		bool OwnerDiedInVortex; // 0xB99(0x1)
		bool CollectedPickup; // 0xB9A(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/SCMachine/BGA_Athena_SCMachine_Pickup.BGA_Athena_SCMachine_Pickup_C");
			return ret;
		}

		bool BuildDataRegistryResolverScope(TArray& InOutResolverScopes, int32_t& InOutPriority); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 0x15D6B853600
		UObject GetCacheContextOverride(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B852F00
		void Enable Hide and Kill(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B853100
		void Mark as Pending Kill(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B852C00
		void Mark Spawn Sound As Played(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B852B00
		void Set Un Hide(int32_t UnHide); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B852400
		void Mark As Collected(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B852D00
		void OnRep_CollectedPickup(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B852800
		bool BlueprintGetInteractionTime(AFortPawn InteractingPawn, float& OutInteractionTime, TEnumAsByte InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B853A00
		bool CanHandleCleanupEvents(); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B853500
		void OnRep_HideAndKill(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B852700
		bool ShouldDie(float Damage, AController EventInstigator, AActor DamageCauser, bool bIsTest, FGameplayEffectContextHandle& EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B852300
		FText BlueprintGetInteractionString(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D6B853B00
		bool BlueprintCanInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted, TEnumAsByte InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D6B853C00
		void OnRep_UnHide(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B852600
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D6B856300
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D6B852500
		void DestroyPickup(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B853200
		void BlueprintOnInteract(AFortPawn InteractingPawn, TEnumAsByte InteractionBeingAttempted); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x15D6B853900
		void CollectPickup(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B853400
		void OnDestroyPickup(); // Flags: Event|Protected|BlueprintEvent 0x15D6B852900
		void SpawnSound(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B852200
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 0x15D6B852A00
		void HideAndKillPickup(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B852E00
		void DelayDestroyPickup(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B853300
		void BndEvt__Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent OverlappedComponent, AActor OtherActor, UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent 0x15D6B853700
		void BndEvt__BGA_Athena_SCMachine_Pickup_FortLinkToActor_K2Node_ComponentBoundEvent_4_OnLinkedActorDestroyed__DelegateSignature(AActor DamageCauser); // Flags: BlueprintEvent 0x15D6B853800
		void ExecuteUbergraph_BGA_Athena_SCMachine_Pickup(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B853000
	};


	// Class /Game/Athena/Items/EnvironmentalItems/SCMachine/GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x80 (0xBC0 - 0xB40)
	class UGA_Athena_SCMachine_Passive_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawnAthena PlayerPawn; // 0xB48(0x8)
		FVector SpawnZOffset; // 0xB50(0x18)
		FGameplayTag BlockChipSpawnTag; // 0xB68(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xB6C(0x4) UNKNOWN PROPERTY
		FScalableFloat DropRebootCards; // 0xB70(0x28)
		FScalableFloat ShouldAutoCollectCards; // 0xB98(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/SCMachine/GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C");
			return ret;
		}

