#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Athena
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Struct /Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x827 (0x828 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_151 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData06_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		UBlendProfile __BlendProfile; // 0x18(0x8)
		UCurveFloat __CurveFloat; // 0x20(0x8)
		EAlphaBlendOption __EnumProperty; // 0x28(0x1)
		EBlendListTransitionType __EnumProperty; // 0x29(0x1)
		unsigned char UnknownData08_6[0x6]; // 0x2A(0x6) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x30(0x10)
		FName __NameProperty; // 0x40(0x4)
		int32_t __IntProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		int32_t __IntProperty; // 0x4C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x50(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x51(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		int32_t __IntProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		int32_t __IntProperty; // 0x68(0x4)
		bool __BoolProperty; // 0x6C(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x6D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x70(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x74(0x2C)
		float __FloatProperty; // 0xA0(0x4)
		bool __BoolProperty; // 0xA4(0x1)
		EAnimSyncMethod __EnumProperty; // 0xA5(0x1)
		TEnumAsByte __ByteProperty; // 0xA6(0x1)
		unsigned char UnknownData11_6[0x1]; // 0xA7(0x1) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0xA8(0x18)
		FName __NameProperty; // 0xC0(0x4)
		FName __NameProperty; // 0xC4(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xC8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x148(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x160(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x190(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7F8(0x30)
	};


	// Struct /Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1B (0x1C - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_152 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
		float __FloatProperty; // 0x18(0x4)
	};


	// Struct /Game/Athena/AI/Pawns/NPC/Parents/Struct_NPC_TargetSlots.Struct_NPC_TargetSlots
	// Size: 0x78 (0x78 - 0x0)
	struct FStruct_NPC_TargetSlots	
	{
	public:
		TEnumAsByte TargetSlotType_6_B268C50140F4F849CE916EA5DB4A30E7; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UClass TargetSlotCountingGE_7_F6007B01441781AB71302C91A1C4CFD2; // 0x8(0x8)
		FScalableFloat AITargetSlotSizeHF_8_E81162534B067D58D70AE9AC8B4B1F98; // 0x10(0x28)
		FScalableFloat AITargetSlotDurationHF_14_A9B6ED4D4072D7BB507AA5A14118FA5B; // 0x38(0x28)
		UClass TargetSlotOverrideGE_11_6C40525043B50B2B696580B362A65DB3; // 0x60(0x8)
		UClass TargetSlotOwnerGE_17_19F50D8848750D3BC118D9BBD861CAA1; // 0x68(0x8)
		UClass TargetSlotCountingMaxedGE_19_BF1E1EF24CCA642F87D4379BB916F271; // 0x70(0x8)
	};


	// Struct /Game/Athena/Items/PhysicsActors/PhysicsTreeLog/PhysicsLogAnalyticsStruct.PhysicsLogAnalyticsStruct
	// Size: 0x6C (0x6C - 0x0)
	struct FPhysicsLogAnalyticsStruct	
	{
	public:
		FString InstanceName_29_E13A3CF84B9151E7004D9B8C51FD00B9; // 0x0(0x10)
		FString FelledBy_2_076924F44337FDE90F8B5C9C7645CDF2; // 0x10(0x10)
		FVector FelledAtLocation_7_87D469DB42BC3085780226AC3B154AD1; // 0x20(0x18)
		float FelledAtMatchTime_17_701A35DB42F8DA247CDC50AC58CCCD4E; // 0x38(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
		FVector DestroyedAtLocation_33_93747681485FCEB2F9D50B8F2C9BA72B; // 0x40(0x18)
		float DestroyedAtMatchTime_31_1DCF4002426A45C86050D4B13C85632F; // 0x58(0x4)
		float DamageToPlayers_20_F701392440AAC7AC33A8B2BCAEB3C5D0; // 0x5C(0x4)
		float DamageToStructures_22_636FABDE409E1A51BAF808863B05D213; // 0x60(0x4)
		float DamageToVehicles_24_69A07F714B43DF853CA180B441A6A29C; // 0x64(0x4)
		float DamageToAI_26_9671D0A943425BB2EC73159C0B19C99D; // 0x68(0x4)
	};


	// Struct /Game/Athena/HUD/Vehicles/Dashboard/STRUCT_WarningData.STRUCT_WarningData
	// Size: 0x40 (0x40 - 0x0)
	struct FSTRUCT_WarningData	
	{
	public:
		FText WarningText_2_8C8B54C740E74BC85C1346BD21F3BDF5; // 0x0(0x10)
		UMaterialInstance Image_5_4F84EB8C4E689D497CBDF7A68AFEB2D9; // 0x10(0x8)
		int32_t Priority_8_8C9CED6445FCED6BA9A5E08BF207F6A3; // 0x18(0x4)
		bool ShowBolt_11_8617663F4B68570A07EC6C94883ACC0A; // 0x1C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
		FLinearColor TextShadowColor_15_3EBAAB0244AAD10D6A220FBDD9D8499B; // 0x20(0x10)
		FLinearColor TextOutlineColor_18_439E79DA4234BD56DD175DB209F6325D; // 0x30(0x10)
	};


	// Struct /Game/Athena/DrivableVehicles/Hoverboard/JackalVehicle_Hoverboard_Base_AnimBP.JackalVehicle_Hoverboard_Base_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1F47 (0x1F48 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_153 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData10_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		EAnimSyncMethod __EnumProperty; // 0xC(0x1)
		unsigned char UnknownData11_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		unsigned char UnknownData12_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x20(0x10)
		TArray __ArrayProperty; // 0x30(0x10)
		TArray __ArrayProperty; // 0x40(0x10)
		FName __NameProperty; // 0x50(0x4)
		unsigned char UnknownData13_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x58(0x10)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		float __FloatProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		unsigned char UnknownData14_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x80(0x10)
		FName __NameProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		FName __NameProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		FName __NameProperty; // 0xA0(0x4)
		int32_t __IntProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		FName __NameProperty; // 0xB8(0x4)
		unsigned char UnknownData15_6[0x4]; // 0xBC(0x4) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0xC0(0x10)
		FName __NameProperty; // 0xD0(0x4)
		FName __NameProperty; // 0xD4(0x4)
		FName __NameProperty; // 0xD8(0x4)
		int32_t __IntProperty; // 0xDC(0x4)
		FName __NameProperty; // 0xE0(0x4)
		int32_t __IntProperty; // 0xE4(0x4)
		FName __NameProperty; // 0xE8(0x4)
		int32_t __IntProperty; // 0xEC(0x4)
		TArray __ArrayProperty; // 0xF0(0x10)
		TArray __ArrayProperty; // 0x100(0x10)
		FName __NameProperty; // 0x110(0x4)
		FName __NameProperty; // 0x114(0x4)
		int32_t __IntProperty; // 0x118(0x4)
		bool __BoolProperty; // 0x11C(0x1)
		unsigned char UnknownData16_6[0x3]; // 0x11D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x120(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x124(0x2C)
		float __FloatProperty; // 0x150(0x4)
		EAnimSyncMethod __EnumProperty; // 0x154(0x1)
		TEnumAsByte __ByteProperty; // 0x155(0x1)
		unsigned char UnknownData17_6[0x2]; // 0x156(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x158(0x4)
		unsigned char UnknownData18_6[0x4]; // 0x15C(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x160(0x18)
		UBlendProfile __BlendProfile; // 0x178(0x8)
		UCurveFloat __CurveFloat; // 0x180(0x8)
		bool __BoolProperty; // 0x188(0x1)
		EAlphaBlendOption __EnumProperty; // 0x189(0x1)
		EBlendListTransitionType __EnumProperty; // 0x18A(0x1)
		unsigned char UnknownData19_6[0x5]; // 0x18B(0x5) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x190(0x10)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1A0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x220(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x4A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x5C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x5F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x8C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x9B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x9E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xA48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xA78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xAA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xAD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xB08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xC58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xC88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xFB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x10A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x11C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x12B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x12E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x13D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x14C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x14F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x15B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x15E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x16A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x16D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x17C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x17F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x18B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x18E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x19A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x19D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1AC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1AF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1BB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1CA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1CD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1E28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1E58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1E88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1EB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1EE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F18(0x30)
	};


	// Struct /Game/Athena/DrivableVehicles/Hoverboard/JackalVehicle_Hoverboard_Base_AnimBP.JackalVehicle_Hoverboard_Base_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x29 (0x2A - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_154 : public FAnimBlueprintMutableData	
	{
	public:
		char __ByteProperty; // 0x1(0x1)
		char __ByteProperty; // 0x2(0x1)
		bool __BoolProperty; // 0x3(0x1)
		bool __BoolProperty; // 0x4(0x1)
		bool __BoolProperty; // 0x5(0x1)
		bool __BoolProperty; // 0x6(0x1)
		char __ByteProperty; // 0x7(0x1)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		bool __BoolProperty; // 0x10(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x14(0x4)
		bool __BoolProperty; // 0x18(0x1)
		bool __BoolProperty; // 0x19(0x1)
		bool __BoolProperty; // 0x1A(0x1)
		bool __BoolProperty; // 0x1B(0x1)
		bool __BoolProperty; // 0x1C(0x1)
		bool __BoolProperty; // 0x1D(0x1)
		bool __BoolProperty; // 0x1E(0x1)
		bool __BoolProperty; // 0x1F(0x1)
		bool __BoolProperty; // 0x20(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x24(0x4)
		char __ByteProperty; // 0x28(0x1)
		bool __BoolProperty; // 0x29(0x1)
	};


	// Struct /Game/Athena/UI/InGame/Creative/MinigameButtonsStateConfiguration.MinigameButtonsStateConfiguration
	// Size: 0x3 (0x3 - 0x0)
	struct FMinigameButtonsStateConfiguration	
	{
	public:
		ESlateVisibility StartGameButtonVisibility_2_A8F0D2EE4929A012666673A9FC2F5E2D; // 0x0(0x1)
		bool StartGameButtonEnabled_7_BCF1568A422A98FEDED17095BA9BCAF7; // 0x1(0x1)
		ESlateVisibility EndGameButtonVisibility_4_69F5349A450461AE04DCF28769B22A75; // 0x2(0x1)
	};


	// Struct /Game/Athena/UI/InGame/Creative/MinigameButtonsWidgetSwitcherConfiguration.MinigameButtonsWidgetSwitcherConfiguration
	// Size: 0x30 (0x30 - 0x0)
	struct FMinigameButtonsWidgetSwitcherConfiguration	
	{
	public:
		UIconTextButton_C ActiveEndGameButton_2_812C87B8402C7BC4323914AD8FDD64F6; // 0x0(0x8)
		UIconTextButton_C ActiveStartGameButton_4_45F4B61749EA43855B677DA300707712; // 0x8(0x8)
		FText StartGameText_7_DBD136CD4CFF6CF47BDEC296F2D41CD6; // 0x10(0x10)
		FText PleaseWaitText_9_9B95F2E543B39EB9CEE7779AFDA2B9CA; // 0x20(0x10)
	};

}
