#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Abilities
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Struct /Game/Abilities/Player/Pawns/CharacterPartMidArrayStruct.CharacterPartMidArrayStruct
	// Size: 0x18 (0x18 - 0x0)
	struct FCharacterPartMidArrayStruct	
	{
	public:
		TEnumAsByte PartType_5_EBDFFF5740627902CC51DD966B8EE419; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray MID_7_A0D19AC74319389A5DF2019166F976F0; // 0x8(0x10)
	};


	// Struct /Game/Abilities/Player/Pawns/MenuScreen_Athena.MenuScreen_Athena_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x289F (0x28A0 - 0x1)
	struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData09_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		TEnumAsByte __ByteProperty; // 0x10(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x14(0x4)
		EAnimSyncMethod __EnumProperty; // 0x18(0x1)
		TEnumAsByte __ByteProperty; // 0x19(0x1)
		unsigned char UnknownData11_6[0x2]; // 0x1A(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		unsigned char UnknownData12_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x28(0x10)
		TArray __ArrayProperty; // 0x38(0x10)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		unsigned char UnknownData13_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x58(0x10)
		TArray __ArrayProperty; // 0x68(0x10)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		int32_t __IntProperty; // 0x80(0x4)
		EBlendListTransitionType __EnumProperty; // 0x84(0x1)
		unsigned char UnknownData14_6[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0x88(0x10)
		UBlendProfile __BlendProfile; // 0x98(0x8)
		UCurveFloat __CurveFloat; // 0xA0(0x8)
		EAlphaBlendOption __EnumProperty; // 0xA8(0x1)
		EBlendListTransitionType __EnumProperty; // 0xA9(0x1)
		unsigned char UnknownData15_6[0x6]; // 0xAA(0x6) UNKNOWN PROPERTY
		TArray __ArrayProperty; // 0xB0(0x10)
		TArray __ArrayProperty; // 0xC0(0x10)
		FName __NameProperty; // 0xD0(0x4)
		FName __NameProperty; // 0xD4(0x4)
		int32_t __IntProperty; // 0xD8(0x4)
		bool __BoolProperty; // 0xDC(0x1)
		unsigned char UnknownData16_6[0x3]; // 0xDD(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xE0(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xE4(0x2C)
		float __FloatProperty; // 0x110(0x4)
		bool __BoolProperty; // 0x114(0x1)
		EAnimSyncMethod __EnumProperty; // 0x115(0x1)
		TEnumAsByte __ByteProperty; // 0x116(0x1)
		unsigned char UnknownData17_6[0x1]; // 0x117(0x1) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x118(0x18)
		FName __NameProperty; // 0x130(0x4)
		FName __NameProperty; // 0x134(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x138(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1B8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x2C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x2F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xA10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xA40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xA70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xAA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xAD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xB60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xB90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xBC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xBF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xC50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xC80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xCB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xCE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xD10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xD40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xD70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xDA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xDD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xE00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xE30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xE60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xE90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xEC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xEF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xF20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xF50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xF80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xFE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1010(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1040(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1070(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x10D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1100(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x11C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x11F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x12B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x12E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x13A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x13D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x14F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x16A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x16D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x17C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x17F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x18B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x18E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x19A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x19D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1A00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1A30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1A60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1A90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1AC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1AF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1B20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1B50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1B80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1BB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1BE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1C10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1C40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1C70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1CA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1CD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1D00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1D30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1D60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1DC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1DF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1EB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1EE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1F10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1F40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1F70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1FA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1FD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x20C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x20F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x21B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x21E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x2210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x2240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x22A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x22D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x23C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x23F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x2450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x2480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x24B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x24E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x25A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x25D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x2600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x26C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x26F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x2780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x27B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x27E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x2810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x2840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2870(0x30)
	};


	// Struct /Game/Abilities/Player/Pawns/MenuScreen_Athena.MenuScreen_Athena_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1B8 (0x1B9 - 0x1)
	struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		bool __BoolProperty; // 0x2(0x1)
		unsigned char UnknownData14_6[0x1]; // 0x3(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
		char __ByteProperty; // 0x18(0x1)
		char __ByteProperty; // 0x19(0x1)
		char __ByteProperty; // 0x1A(0x1)
		unsigned char UnknownData15_6[0x1]; // 0x1B(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
		char __ByteProperty; // 0x44(0x1)
		char __ByteProperty; // 0x45(0x1)
		char __ByteProperty; // 0x46(0x1)
		char __ByteProperty; // 0x47(0x1)
		char __ByteProperty; // 0x48(0x1)
		char __ByteProperty; // 0x49(0x1)
		unsigned char UnknownData16_6[0x2]; // 0x4A(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		float __FloatProperty; // 0x60(0x4)
		char __ByteProperty; // 0x64(0x1)
		char __ByteProperty; // 0x65(0x1)
		char __ByteProperty; // 0x66(0x1)
		unsigned char UnknownData17_6[0x1]; // 0x67(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x68(0x4)
		float __FloatProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		float __FloatProperty; // 0x74(0x4)
		float __FloatProperty; // 0x78(0x4)
		char __ByteProperty; // 0x7C(0x1)
		char __ByteProperty; // 0x7D(0x1)
		unsigned char UnknownData18_6[0x2]; // 0x7E(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x80(0x4)
		char __ByteProperty; // 0x84(0x1)
		unsigned char UnknownData19_6[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x88(0x4)
		float __FloatProperty; // 0x8C(0x4)
		float __FloatProperty; // 0x90(0x4)
		float __FloatProperty; // 0x94(0x4)
		float __FloatProperty; // 0x98(0x4)
		float __FloatProperty; // 0x9C(0x4)
		float __FloatProperty; // 0xA0(0x4)
		float __FloatProperty; // 0xA4(0x4)
		float __FloatProperty; // 0xA8(0x4)
		float __FloatProperty; // 0xAC(0x4)
		float __FloatProperty; // 0xB0(0x4)
		float __FloatProperty; // 0xB4(0x4)
		float __FloatProperty; // 0xB8(0x4)
		char __ByteProperty; // 0xBC(0x1)
		unsigned char UnknownData20_6[0x3]; // 0xBD(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xC0(0x4)
		float __FloatProperty; // 0xC4(0x4)
		float __FloatProperty; // 0xC8(0x4)
		float __FloatProperty; // 0xCC(0x4)
		char __ByteProperty; // 0xD0(0x1)
		char __ByteProperty; // 0xD1(0x1)
		char __ByteProperty; // 0xD2(0x1)
		char __ByteProperty; // 0xD3(0x1)
		float __FloatProperty; // 0xD4(0x4)
		float __FloatProperty; // 0xD8(0x4)
		float __FloatProperty; // 0xDC(0x4)
		float __FloatProperty; // 0xE0(0x4)
		float __FloatProperty; // 0xE4(0x4)
		char __ByteProperty; // 0xE8(0x1)
		char __ByteProperty; // 0xE9(0x1)
		char __ByteProperty; // 0xEA(0x1)
		unsigned char UnknownData21_6[0x1]; // 0xEB(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0xEC(0x4)
		float __FloatProperty; // 0xF0(0x4)
		float __FloatProperty; // 0xF4(0x4)
		float __FloatProperty; // 0xF8(0x4)
		float __FloatProperty; // 0xFC(0x4)
		char __ByteProperty; // 0x100(0x1)
		char __ByteProperty; // 0x101(0x1)
		char __ByteProperty; // 0x102(0x1)
		unsigned char UnknownData22_6[0x1]; // 0x103(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x104(0x4)
		float __FloatProperty; // 0x108(0x4)
		float __FloatProperty; // 0x10C(0x4)
		float __FloatProperty; // 0x110(0x4)
		float __FloatProperty; // 0x114(0x4)
		float __FloatProperty; // 0x118(0x4)
		char __ByteProperty; // 0x11C(0x1)
		char __ByteProperty; // 0x11D(0x1)
		unsigned char UnknownData23_6[0x2]; // 0x11E(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x120(0x4)
		char __ByteProperty; // 0x124(0x1)
		unsigned char UnknownData24_6[0x3]; // 0x125(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x128(0x4)
		float __FloatProperty; // 0x12C(0x4)
		float __FloatProperty; // 0x130(0x4)
		float __FloatProperty; // 0x134(0x4)
		float __FloatProperty; // 0x138(0x4)
		float __FloatProperty; // 0x13C(0x4)
		float __FloatProperty; // 0x140(0x4)
		float __FloatProperty; // 0x144(0x4)
		char __ByteProperty; // 0x148(0x1)
		char __ByteProperty; // 0x149(0x1)
		char __ByteProperty; // 0x14A(0x1)
		unsigned char UnknownData25_6[0x1]; // 0x14B(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x14C(0x4)
		float __FloatProperty; // 0x150(0x4)
		float __FloatProperty; // 0x154(0x4)
		bool __BoolProperty; // 0x158(0x1)
		unsigned char UnknownData26_6[0x3]; // 0x159(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x15C(0x4)
		float __FloatProperty; // 0x160(0x4)
		int32_t __IntProperty; // 0x164(0x4)
		int32_t __IntProperty; // 0x168(0x4)
		float __FloatProperty; // 0x16C(0x4)
		float __FloatProperty; // 0x170(0x4)
		float __FloatProperty; // 0x174(0x4)
		float __FloatProperty; // 0x178(0x4)
		float __FloatProperty; // 0x17C(0x4)
		float __FloatProperty; // 0x180(0x4)
		float __FloatProperty; // 0x184(0x4)
		float __FloatProperty; // 0x188(0x4)
		char __ByteProperty; // 0x18C(0x1)
		char __ByteProperty; // 0x18D(0x1)
		unsigned char UnknownData27_6[0x2]; // 0x18E(0x2) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x190(0x4)
		int32_t __IntProperty; // 0x194(0x4)
		float __FloatProperty; // 0x198(0x4)
		float __FloatProperty; // 0x19C(0x4)
		float __FloatProperty; // 0x1A0(0x4)
		float __FloatProperty; // 0x1A4(0x4)
		float __FloatProperty; // 0x1A8(0x4)
		float __FloatProperty; // 0x1AC(0x4)
		float __FloatProperty; // 0x1B0(0x4)
		float __FloatProperty; // 0x1B4(0x4)
		char __ByteProperty; // 0x1B8(0x1)
	};

}
