#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Characters
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Default.TeamID_Default_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_Default_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Default.TeamID_Default_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Lime.TeamID_Lime_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_Lime_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Lime.TeamID_Lime_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Orange.TeamID_Orange_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_Orange_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Orange.TeamID_Orange_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_10_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_10_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_10_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_12_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_12_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_12_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_11_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_11_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_11_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_14_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_14_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_14_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_13_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_13_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_13_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_16_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_16_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_16_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_15_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_15_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_15_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_18_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_18_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_18_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_17_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_17_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_17_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_19_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_19_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_19_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_21_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_21_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_21_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_20_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_20_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_20_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_22_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_22_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_22_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_23_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_23_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_23_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_24_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_24_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_24_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_25_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_25_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_25_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_26_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_26_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_26_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_30_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_30_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_30_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_29_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_29_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_29_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_28_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_28_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_28_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_27_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_27_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_27_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_31_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_31_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_31_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_32_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_32_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_32_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_33_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_33_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_33_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_34_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_34_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_34_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_35_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_35_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_35_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_36_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_36_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_36_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_37_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_37_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_37_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_38_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_38_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_38_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_39_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_39_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_39_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_40_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_40_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_40_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_41_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_41_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_41_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_43_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_43_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_43_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_42_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_42_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_42_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_45_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_45_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_45_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_44_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_44_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_44_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_46_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_46_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_46_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_48_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_48_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_48_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_47_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_47_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_47_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_50_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_50_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_50_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_49_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_49_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_49_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_03.TeamID_PvP_03_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_03_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_03.TeamID_PvP_03_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_07.TeamID_PvP_07_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_07_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_07.TeamID_PvP_07_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_06.TeamID_PvP_06_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_06_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_06.TeamID_PvP_06_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_05.TeamID_PvP_05_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_05_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_05.TeamID_PvP_05_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_04.TeamID_PvP_04_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_04_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_04.TeamID_PvP_04_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_08.TeamID_PvP_08_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_08_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_08.TeamID_PvP_08_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_09.TeamID_PvP_09_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_09_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_09.TeamID_PvP_09_C");
			return ret;
		}
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/VehicleAnimLayerInterface.VehicleAnimLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVehicleAnimLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/VehicleAnimLayerInterface.VehicleAnimLayerInterface_C");
			return ret;
		}

		void VehicleFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& VehicleFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B593700
		void VehicleSplitBodyOverride(FPoseLink InPoseSplitBody, FPoseLink InPoseUpperAndLowerBody, FPoseLink InPoseUpperAndLowerBodyRemoveRoot, FPoseLink& VehicleSplitBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B593400
		void VehicleLowerBodyOverride(FPoseLink InPoseLowerBodyDefault, FPoseLink InPoseUpperBody, FPoseLink& VehicleLowerBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B593500
		void VehicleFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& VehicleFullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B593600
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/SecondMovementModeLayerInterface.SecondMovementModeLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USecondMovementModeLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/SecondMovementModeLayerInterface.SecondMovementModeLayerInterface_C");
			return ret;
		}

		void SecondMovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& SecondMovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B593000
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ProceduralLayeringAnimInterface.ProceduralLayeringAnimInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UProceduralLayeringAnimInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ProceduralLayeringAnimInterface.ProceduralLayeringAnimInterface_C");
			return ret;
		}

		void ProceduralAdditivePose(FPoseLink InSourceLocomotionPose, FPoseLink InMotionMatchingPose, FPoseLink InProceduralLayeredPose, FPoseLink& ProceduralAdditivePose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B592F00
		void ProceduralLayeredPose(FPoseLink InLocomotionPose, FPoseLink InPassThroughPose, FPoseLink& ProceduralLayeredPose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B592E00
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/PlayerAnimOverrideLayerInterface.PlayerAnimOverrideLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UPlayerAnimOverrideLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/PlayerAnimOverrideLayerInterface.PlayerAnimOverrideLayerInterface_C");
			return ret;
		}

		void PreLegIK(FPoseLink InPose, FPoseLink& PreLegIK); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B592B00
		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B592D00
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B592C00
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ItemAnimLayerInterface.ItemAnimLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UItemAnimLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ItemAnimLayerInterface.ItemAnimLayerInterface_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B596100
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595900
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B596000
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B592200
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595700
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595500
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595400
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595600
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595800
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595A00
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595200
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595E00
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595D00
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B596200
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B596300
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595C00
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595B00
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595F00
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B595300
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C
	// Inherited from UFortPlayerProceduralAdjustmentsAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x75E4 (0x8494 - 0xEB0)
	class UPlayer_ProceduralAdjustments_AnimBP_C : public UFortPlayerProceduralAdjustmentsAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xEB0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xEB8(0xC)
		unsigned char UnknownData02_6[0x4]; // 0xEC4(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xEC8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xED0(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0xED8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xEF8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xFA8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xFC8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1078(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1098(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1148(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1168(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1218(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1238(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x12E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1308(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x13B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x13D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1488(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1558(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1578(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1628(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1648(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x16F8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1718(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1738(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1758(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1778(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1828(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1848(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18F8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1918(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1938(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1958(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1978(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A48(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1AF8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BA8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1BC8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C78(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C98(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D48(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1D68(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1D88(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1EB0(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1FD8(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1FF8(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2120(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2248(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2370(0x128)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2498(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2548(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2568(0x128)
		FFortAnimNode_SlopeWarping FortAnimGraphNode_SlopeWarping; // 0x2690(0x2E8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2978(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2998(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x29B8(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2A00(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2A20(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2A40(0x20)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2A60(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2B10(0xC8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2BD8(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2D00(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2E28(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2F10(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3038(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x3160(0xE8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3248(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x32F8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3370(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3398(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x33C0(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x33E0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x34C8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x35B0(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3698(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x37C0(0x128)
		FAnimNode_Root AnimGraphNode_Root; // 0x38E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3908(0xB0)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x39B8(0x128)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3AE0(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3B28(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3B48(0x48)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3B90(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3CB8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3CD8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3CF8(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3D18(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3E40(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3F68(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4090(0x128)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x41B8(0x48)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4200(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4328(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4348(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4470(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4598(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x45B8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4630(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4658(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4680(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x46A8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x46D0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4718(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x4740(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4760(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4780(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x48A8(0x128)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x49D0(0xB0)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4A80(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x4AA0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4AC0(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4BE8(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4C08(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4C28(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4D50(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4D70(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4D90(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4DB8(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4EE0(0x128)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5008(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5030(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5078(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5128(0x78)
		FAnimNode_Root AnimGraphNode_Root; // 0x51A0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x51C0(0xB0)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5270(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5290(0xE8)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x5378(0x100)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x5478(0x100)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5578(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5660(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5748(0xE8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5830(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5850(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5938(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5A20(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5B48(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5C30(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5D18(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5E40(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5F28(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6050(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6178(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x62A0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6388(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6470(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6558(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6640(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6728(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6810(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x68F8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x69E0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6AC8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6BB0(0xE8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6C98(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6CE0(0x78)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6D58(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6D78(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6DA0(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6DC8(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6DE8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6E08(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6E28(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6E70(0x28)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x6E98(0x100)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6F98(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6FB8(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6FD8(0xE8)
		FAnimNode_Root AnimGraphNode_Root; // 0x70C0(0x20)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x70E0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x7128(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7218(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7290(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7308(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7330(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7378(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x73C0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7438(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7460(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7528(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x75A0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x75C8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x75F0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x76B8(0xC8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x7780(0x128)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x78A8(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x78D0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x78F0(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7938(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7958(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7980(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x79F8(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7A40(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7AF0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7B68(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7B90(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7C58(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7C80(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7D48(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7D70(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7E38(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F00(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F28(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F50(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7F78(0x78)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x7FF0(0xB0)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x80A0(0x100)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x81A0(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8268(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8288(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x82B0(0xC8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8378(0x20)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8398(0xC0)
		bool IsHidingInProp; // 0x8458(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x8459(0x7) UNKNOWN PROPERTY
		FVector RightHandOverride; // 0x8460(0x18)
		FVector LeftHandOverride; // 0x8478(0x18)
		FName EmoteAnimOffsetCurveName; // 0x8490(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C");
			return ret;
		}

		void PreLegIK(FPoseLink InPose, FPoseLink& PreLegIK); // Flags: HasOutParms|BlueprintCallable 0x15D6B59A300
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D6B597A00
		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable 0x15D6B597C00
		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D6B597500
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D6B596700
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B597300
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B596F00
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B597000
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B597700
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B597600
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B597100
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B597200
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B596600
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D6B596E00
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D6B596C00
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D6B596A00
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D6B596800
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D6B596900
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D6B596B00
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D6B597800
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D6B597400
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D6B596D00
		void PostIKAdjustmentsLayer(FPoseLink InPosePostIkAdjustments, FPoseLink& PostIKAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59A500
		void PreIKAdjustmentsLayer(FPoseLink InPosePreIKAdjustments, FPoseLink& PreIKAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59A400
		void PlevisAndFeetAdjustmentsLayer(FPoseLink InPosePelvisAndFeetAdjustments, FPoseLink& PlevisAndFeetAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B596400
		void PushCannonAdjustmentsLayer(FPoseLink InPosePushCannonAdjustments, FPoseLink& PushCannonAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59A200
		void ParaGliderAdjustmentsLayer(FPoseLink InPoseParaGliderAdjustments, FPoseLink& ParaGliderAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B596500
		void HandIKFixUpLayer(FPoseLink InPoseHandIk, FPoseLink& HandIKFixUpLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B597900
		void AnimGraph(FPoseLink InPosePostTurnInPlace, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B597D00
		void ExecuteUbergraph_Player_ProceduralAdjustments_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D6B597B00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C
	// Inherited from UFortPlayerProceduralLayeringAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x5B2B (0x727B - 0x1750)
	class UPlayer_ProceduralLayering_AnimBP_C : public UFortPlayerProceduralLayeringAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1750(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1758(0x28)
		FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x1780(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1788(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1790(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1798(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17B8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1868(0xB0)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1918(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1958(0x48)
		FAnimNode_BoneMask AnimGraphNode_BoneMask; // 0x19A0(0xF8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1A98(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1B88(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1C00(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1C28(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C50(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1C98(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CC0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CE0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D90(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E40(0xB0)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1EF0(0x20)
		FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x1F10(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2038(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2120(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2208(0xE8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x22F0(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2310(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x23F8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x24E0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x25C8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x26B0(0xE8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2798(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x27C0(0x28)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x27E8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x28D0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x29B8(0xE8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2AA0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2AC8(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2AF0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2B10(0x20)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x2B30(0x100)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x2C30(0x100)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2D30(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2D58(0x48)
		FAnimNode_BlendStackInput AnimGraphNode_BlendStackInput; // 0x2DA0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2DC8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2DF0(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2EB8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2EE0(0xC8)
		FAnimNode_Root AnimGraphNode_BlendStackResult; // 0x2FA8(0x20)
		FAnimNode_BlendStack AnimGraphNode_BlendStack; // 0x2FC8(0x130)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x30F8(0x78)
		FAnimNode_PoseSearchHistoryCollector AnimGraphNode_PoseSearchHistoryCollector; // 0x3170(0x2D8)
		unsigned char UnknownData02_6[0x8]; // 0x3448(0x8) UNKNOWN PROPERTY
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x3450(0x530)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3980(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x39F8(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3A70(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3B38(0x78)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3BB0(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3CA0(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3CE8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3D60(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3D88(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3DB0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3E28(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3E50(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x3E78(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x3E98(0x40)
		FAnimNode_Root AnimGraphNode_Root; // 0x3ED8(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3EF8(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3F70(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3FE8(0x78)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4060(0x120)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4180(0x120)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x42A0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4350(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4400(0xB0)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x44B0(0x1E0)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x4690(0x1E0)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x4870(0x1E0)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4A50(0x20)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x4A70(0x1E0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4C50(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4C98(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4CB8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4CD8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4CF8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4D18(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4D38(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4D58(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4D80(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4DA8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4DC8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4DE8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E10(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E38(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4E60(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E80(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4EA8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4EC8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4EE8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4F10(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4F38(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4F58(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4F78(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4FA0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4FC8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5010(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x5038(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5058(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x50D0(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5180(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x51C8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x51E8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5208(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5228(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5250(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5278(0x20)
		FAnimNode_CopyBoneAdvanced AnimGraphNode_CopyBoneAdvanced; // 0x5298(0x128)
		FAnimNode_CopyBoneAdvanced AnimGraphNode_CopyBoneAdvanced; // 0x53C0(0x128)
		FAnimNode_CopyBoneAdvanced AnimGraphNode_CopyBoneAdvanced; // 0x54E8(0x128)
		FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x5610(0x128)
		FAnimNode_Root AnimGraphNode_Root; // 0x5738(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5758(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5808(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x58B8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5980(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5A48(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5A68(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5AE0(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5B08(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5B28(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5C50(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5D78(0x128)
		unsigned char UnknownData03_7[0x13DB]; // 0x5EA0(0x13DB) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C");
			return ret;
		}

		void ProceduralLayeredPose(FPoseLink InLocomotionPose, FPoseLink InPassThroughPose, FPoseLink& ProceduralLayeredPose); // Flags: HasOutParms|BlueprintCallable 0x15D6B59AE00
		void ProceduralAdditivePose(FPoseLink InSourceLocomotionPose, FPoseLink InMotionMatchingPose, FPoseLink InProceduralLayeredPose, FPoseLink& ProceduralAdditivePose); // Flags: HasOutParms|BlueprintCallable 0x15D6B59AF00
		void BasePose(FPoseLink& BasePose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B500
		void CopyMotionLayer(FPoseLink CopyMotion_InBaseLocomotionPose, FPoseLink CopyMotion_InBasePose, FPoseLink CopyMotion_InLayeredLocomotionPose, FPoseLink& CopyMotionLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B300
		void CopyBoneLayer(FPoseLink InCopyBoneLayerPose, FPoseLink& CopyBoneLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B400
		void ProceduralLayering(FPoseLink ProcLayer_InBaseLocomotionPose, FPoseLink ProcLayer_InLayeredLocomotionPose, FPoseLink ProcLayer_InBasePose, FPoseLink& ProceduralLayering); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59AD00
		void AdditiveLayering(FPoseLink AddLayer_InLocomotionPose, FPoseLink AddLayer_InItemPose, FPoseLink AddLayer_InBasePose, FPoseLink AddLayer_InLayeredLocomotionPose, FPoseLink InPoseSourcePose, FPoseLink& AdditiveLayering); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B700
		void Layering(FPoseLink Layer_InBaseLocomotionPose, FPoseLink Layer_InItemPose, FPoseLink& Layering); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B100
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B600
		void OnUpdateBlendStack_PreNativize(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59B000
		void UpdateNoWeaponBasePose_PreNativize(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B59AC00
		void ExecuteUbergraph_Player_ProceduralLayering_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D6B59B200
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C
	// Inherited from UFortZiplineAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1B28 (0x2228 - 0x700)
	class UPlayer_ZipLine_AnimBP_C : public UFortZiplineAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x700(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x708(0x70)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x778(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x780(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x788(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x858(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x878(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x928(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x948(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x9F8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xA18(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xAC8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xAE8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xB98(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xBB8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xC68(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC88(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xD38(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0xD58(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD78(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDC0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xE08(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xE50(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xE98(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0xEE0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xF00(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF48(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF90(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xFD8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1020(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x1068(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1088(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1138(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1158(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1208(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1228(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1248(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1268(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1288(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1338(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1358(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1408(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x14B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1588(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1658(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1678(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16F0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1718(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1740(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1788(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x17D0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1818(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1860(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x18A8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18F0(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x19E0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1A28(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1A70(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1AB8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1B00(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1B48(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1B68(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1B90(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1C00(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1CC8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1D90(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1DD8(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x1DF8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1EC0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1F30(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1FF8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2018(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x20E0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x21A8(0x78)
		double PivotAnimBlendTime; // 0x2220(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E300
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D6B59D500
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E100
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59DD00
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59DE00
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E500
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E400
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59DF00
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E000
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D6B59D400
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D6B59DC00
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D6B59DA00
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D6B59D800
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D6B59D600
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D6B59D700
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D6B59D900
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E600
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D6B59E200
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D6B59DB00
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59A600
		void ExecuteUbergraph_Player_ZipLine_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D6B59E700
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x4D8 (0x18E8 - 0x1410)
	class UPlayer_SourcePose_AnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1418(0x88)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14A0(0x8)
		FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x14A8(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1550(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1558(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1578(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x15C0(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1608(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1648(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1688(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16C8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1710(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1758(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1798(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x17E0(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1820(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1860(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x18A0(0x48)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59CB00
		void ResetBlendListNode(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B59C900
		void ExecuteUbergraph_Player_SourcePose_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D6B59CA00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_RigidBodyPBA_AnimBP_Template.Player_RigidBodyPBA_AnimBP_Template_C
	// Inherited from UAnimInstance -> UObject
	// Size: 0xF0 (0x4A8 - 0x3B8)
	class UPlayer_RigidBodyPBA_AnimBP_Template_C : public UAnimInstance	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x3B8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x3C0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x3C8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x3D0(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x3D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3F8(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_RigidBodyPBA_AnimBP_Template.Player_RigidBodyPBA_AnimBP_Template_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B59FF00
		void ExecuteUbergraph_Player_RigidBodyPBA_AnimBP_Template(int32_t EntryPoint); // Flags: Final 0x15D6B59FE00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C
	// Inherited from UFortGoopAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1718 (0x1DE8 - 0x6D0)
	class UPlayer_Goop_AnimBP_C : public UFortGoopAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x6D0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6D8(0x50)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x728(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x730(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x738(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x758(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x808(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x828(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x8D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x8F8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x9A8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9C8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xA78(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xA98(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xB48(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xB68(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xC18(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC38(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xCE8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD08(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD50(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD98(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDE0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xE28(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0xE70(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xE90(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xED8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF20(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF68(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xFB0(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0xFF8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1018(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1038(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x10E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1108(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x11B8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x11D8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x11F8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1218(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1238(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x12E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1308(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x13B8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1468(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1488(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1538(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1558(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1608(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1628(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1650(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1678(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x16C0(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1788(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x17D0(0x70)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1840(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1868(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1930(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19A0(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x19C0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1A88(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1B50(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1BC0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1BE0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1CA8(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x1D20(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E41800
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D75E40A00
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41600
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41200
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41300
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41A00
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41900
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41400
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E41500
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E40900
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D75E41100
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D75E40F00
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E40D00
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E40B00
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D75E40C00
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D75E40E00
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E41B00
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E41700
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D75E41000
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E41D00
		void ExecuteUbergraph_Player_Goop_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E41C00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C
	// Inherited from UFortFirstPersonAdditivesAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x398 (0x17B8 - 0x1420)
	class UPlayer_FirstPersonAdditives_AnimBP_C : public UFortFirstPersonAdditivesAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1428(0xC)
		unsigned char UnknownData01_6[0x4]; // 0x1434(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1438(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1440(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1448(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1468(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1490(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14B8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1500(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1548(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15B8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1620(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1640(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1708(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E40200
		void ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E40100
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C
	// Inherited from UFortPlayerInAirAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x3508 (0x4928 - 0x1420)
	class UPlayer_InAir_AnimBP_C : public UFortPlayerInAirAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1428(0x80)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14A8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14B0(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x14B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1588(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1658(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1678(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1728(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1748(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17F8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1818(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18C8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18E8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1998(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x19B8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A68(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A88(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AA8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AC8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1AE8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B98(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1BB8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C68(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C88(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CA8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CC8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CE8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D98(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1DB8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E68(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F18(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F38(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1FE8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2008(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x20B8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x20D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2120(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2168(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x21B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x21F8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2240(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2288(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2298(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22E0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2328(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2370(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2390(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23D8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2420(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2468(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24B0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x24F8(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2540(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2550(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2598(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x25E0(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2628(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2648(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2690(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x26D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2720(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2768(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27B0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x27F8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2840(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2888(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2898(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28E0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2928(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2970(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2990(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2A40(0x78)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2AB8(0xF0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D60(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D88(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2DD0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2DF0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2E38(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2E58(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2EA0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2EC0(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2F88(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2FB0(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3078(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3118(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3140(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3168(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3190(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x31B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x31E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3208(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3230(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3258(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3320(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3330(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x33F0(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x34B8(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x35A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x35F0(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3610(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x36D8(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x36E8(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x37A8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3870(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x38B8(0xF0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x39A8(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x39C8(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3A90(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3AA0(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x3B60(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3C28(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3D18(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3D60(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3D80(0xC8)
		unsigned char UnknownData01_6[0x8]; // 0x3E48(0x8) UNKNOWN PROPERTY
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x3E50(0x420)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4270(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x42E0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x43A8(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x43F0(0x120)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4510(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4600(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4610(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4700(0x10)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4710(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x47D8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4820(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4848(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4890(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x48B8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4900(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E43A00
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D75E42C00
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43800
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43400
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43500
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43C00
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43B00
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43600
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E43700
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E42B00
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D75E43300
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D75E43100
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E42F00
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E42D00
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D75E42E00
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D75E43000
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E43D00
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E43900
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D75E43200
		void JumpUpAdditive(FPoseLink& JumpUpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E42900
		void JumpLoopAdditive(FPoseLink& JumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E42A00
		void FallAdditive(FPoseLink& FallAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E43E00
		void AnimGraph(FPoseLink SourcePose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E44000
		void ExecuteUbergraph_Player_InAir_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E43F00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C
	// Inherited from UFortSprintAnimInstance -> UFortLocomotionAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1480 (0x28E0 - 0x1460)
	class UPlayer_Sprint_AnimBP_C : public UFortSprintAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1460(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1468(0x2C)
		unsigned char UnknownData02_6[0x4]; // 0x1494(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1498(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14A0(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x14A8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1518(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1540(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1568(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15B0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x15F8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1640(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1660(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x16A8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16F0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1738(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1758(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1780(0xC8)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1848(0xB0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x18F8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1968(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1A30(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1AF8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1B40(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B88(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1BD0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C18(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C60(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1CA8(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1D70(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1E38(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1E80(0xC8)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x1F48(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1F90(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1FB8(0xF0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x20A8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2118(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2188(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x21D0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x21F8(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x2220(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2268(0xF0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2358(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2378(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2440(0x78)
		unsigned char UnknownData03_6[0x8]; // 0x24B8(0x8) UNKNOWN PROPERTY
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x24C0(0x420)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E42400
		void ExecuteUbergraph_Player_Sprint_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E42300
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/MovementModeLayerInterface.MovementModeLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UMovementModeLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/MovementModeLayerInterface.MovementModeLayerInterface_C");
			return ret;
		}

		void MovementMode_InAirOverride(FPoseLink InSource_Pose, FPoseLink InAirPose, FPoseLink& MovementMode_InAirOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45800
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45B00
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45A00
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45900
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45500
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45700
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45600
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_FirstPersonAdditives_AnimBP_Template.Player_FirstPersonAdditives_AnimBP_Template_C
	// Inherited from UAnimInstance -> UObject
	// Size: 0xF0 (0x4A8 - 0x3B8)
	class UPlayer_FirstPersonAdditives_AnimBP_Template_C : public UAnimInstance	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x3B8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x3C0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x3C8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x3D0(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x3D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3F8(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_FirstPersonAdditives_AnimBP_Template.Player_FirstPersonAdditives_AnimBP_Template_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45400
		void ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP_Template(int32_t EntryPoint); // Flags: Final 0x15D75E45300
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C
	// Inherited from UFortLocomotionAdditivesAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x42B8 (0x5748 - 0x1490)
	class UPlayer_LocomotionAdditives_AnimBP_C : public UFortLocomotionAdditivesAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1490(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1498(0x188)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1620(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1628(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1630(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1650(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1700(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1720(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17F0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18A0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1970(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1990(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A40(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A60(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BE0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C00(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C20(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C40(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C60(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1DE0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E00(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E20(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E40(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E60(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F30(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FE0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2090(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2160(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2180(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2230(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2250(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2300(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x23B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x23D0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2480(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2530(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2550(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2600(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2620(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x26D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x26F0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x27A0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x27C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2870(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2890(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2940(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x29F0(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x2A10(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2AD8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2B20(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2B68(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2B78(0xC0)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2C38(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2CF8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D40(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2D88(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2DA8(0xC8)
		FAnimNode_Root AnimGraphNode_Root; // 0x2E70(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F08(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F30(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2FA0(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3010(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3058(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x30A0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3110(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3130(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x31A0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x31E8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3258(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x32C8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3310(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3380(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x33C8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3438(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x34A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x34F0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3510(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3538(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3600(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3670(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x36E0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3728(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3770(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x37E0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3828(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3898(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x38E0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3950(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3998(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3A08(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3A78(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3AC0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3AE0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3BA8(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3C20(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3C68(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3C90(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3D58(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3D68(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3E58(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3E68(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3F58(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3F68(0xF0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4058(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4080(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4120(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4148(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4170(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4198(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x41C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x41E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4210(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4238(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4260(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4288(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4300(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4328(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4350(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4398(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x43E0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4428(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4470(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x44B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4500(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4548(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4590(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x45D8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x45F8(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4620(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4668(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4758(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x47A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x47E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4830(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4878(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4898(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x48C0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4908(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x49F8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4A40(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4A88(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4AD0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4B18(0x20)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4B38(0x120)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4C58(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C80(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4CC8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4D10(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4D58(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4E48(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4E90(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4ED8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4F20(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4F68(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4F88(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4FB0(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x4FF8(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x50B8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5100(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x51F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5238(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5280(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x52C8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5310(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5330(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5358(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5378(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x53A0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x53C0(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5488(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x54A8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5570(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x55E8(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5660(0xC8)
		bool IsSnowman; // 0x5728(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x5729(0x7) UNKNOWN PROPERTY
		double StartAnimBlendTime; // 0x5730(0x8)
		double PivotAnimBlendTime; // 0x5738(0x8)
		double CrouchPlayRate; // 0x5740(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E44B00
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D75E47F00
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44900
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44500
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44600
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44D00
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44C00
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44700
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E44800
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E47E00
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D75E44400
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D75E48400
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E48200
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E48000
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D75E48100
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D75E48300
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E44E00
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E44A00
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D75E44300
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E47900
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable 0x15D75E47A00
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable 0x15D75E47800
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E47B00
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E47C00
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E47D00
		void IdleAdditiveLayer(FPoseLink& IdleAdditiveLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E44F00
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E45100
		void ExecuteUbergraph_Player_LocomotionAdditives_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E45000
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x24E8 (0x38F8 - 0x1410)
	class UPlayer_FullBodyAimOffsets_AnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1418(0x18)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1430(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1438(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1440(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1460(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1510(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1530(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x15E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1600(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x16B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x16D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1780(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1850(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1870(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1920(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1940(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x19F0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A10(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A30(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A70(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B40(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C10(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C30(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C70(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D40(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1DF0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1EA0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1EC0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F70(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F90(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2040(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2060(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2110(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x21C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x21E0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2290(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2340(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2360(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2410(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2430(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x24E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2500(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x25B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x25D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2680(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x26A0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2750(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2800(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2820(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x28D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x28F0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x29A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2A50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2A70(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2B20(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2BD0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2C80(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2CA0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2D50(0x20)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2D70(0x118)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2E88(0x118)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2FA0(0xC0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3060(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x30D8(0xB0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3188(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x31B0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x31D8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x31F8(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3220(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3298(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3360(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3428(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3450(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3478(0x28)
		FAnimNode_ResetRoot AnimGraphNode_ResetRoot; // 0x34A0(0xD8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3578(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3598(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x35B8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3630(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3658(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x36A0(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x36C8(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3790(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3840(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38B8(0x28)
		double __CustomProperty_Pitch_61C65E4944F5DB18DC8B6496B9622A88; // 0x38E0(0x8)
		double __CustomProperty_Yaw_61C65E4944F5DB18DC8B6496B9622A88; // 0x38E8(0x8)
		double __CustomProperty_AimOffsetAlpha_61C65E4944F5DB18DC8B6496B9622A88; // 0x38F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E46E00
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A200
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E46C00
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E46800
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E46900
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E47000
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E46F00
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E46A00
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E46B00
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A100
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D75E46700
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D75E46500
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A500
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A300
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A400
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D75E46400
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E47100
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E46D00
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D75E46600
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49C00
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable 0x15D75E49D00
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable 0x15D75E49B00
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49E00
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49F00
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A000
		void VehicleFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& VehicleFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49900
		void VehicleLowerBodyOverride(FPoseLink InPoseLowerBodyDefault, FPoseLink InPoseUpperBody, FPoseLink& VehicleLowerBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49800
		void VehicleSplitBodyOverride(FPoseLink InPoseSplitBody, FPoseLink InPoseUpperAndLowerBody, FPoseLink InPoseUpperAndLowerBodyRemoveRoot, FPoseLink& VehicleSplitBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49700
		void VehicleFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& VehicleFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E49A00
		void FullBodyAimingOffsetsLayer(FPoseLink InFullBodyAimOffsetsBasePose, FPoseLink& FullBodyAimingOffsetsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E47200
		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E47400
		void ExecuteUbergraph_Player_FullBodyAimOffsets_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E47300
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C
	// Inherited from UFortWalkAnimInstance -> UFortLocomotionAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x3DE0 (0x52E0 - 0x1500)
	class UPlayer_LowerBodyJog_AnimBP_C : public UFortWalkAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1500(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1508(0x130)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1638(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1640(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1648(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1668(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1718(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1738(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1808(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1988(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x19A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A78(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B48(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C18(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C38(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C78(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D48(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1DF8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E18(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E38(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E78(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F48(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FF8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x20A8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20C8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2178(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2198(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2248(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2268(0x70)
		FAnimNode_Root AnimGraphNode_Root; // 0x22D8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x22F8(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2340(0xB0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x23F0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2460(0x70)
		FAnimNode_Root AnimGraphNode_Root; // 0x24D0(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x24F0(0x70)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2560(0xB0)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x2610(0x200)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2810(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2830(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2850(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2898(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2908(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2978(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x29C0(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2A30(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2A78(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2A98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C00(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D40(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2DB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2DE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E30(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2E58(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2EA0(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2F50(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2F98(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2FE0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3028(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3070(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3090(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x30D8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x30F8(0x20)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x3118(0x200)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3318(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3360(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3410(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x34C0(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3570(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3620(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3668(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x36B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x36F8(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3718(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3760(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3810(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3858(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x38A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x38E8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3930(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3950(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3970(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3990(0x128)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3AB8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3B00(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B48(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B90(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3BD8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3C20(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3C68(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3CB0(0xF0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3DA0(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3E50(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3E98(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3EE0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3F28(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3F48(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3F68(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3F88(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x40B0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x40D0(0x20)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x40F0(0x200)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x42F0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4338(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4380(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x43C8(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4488(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x44D0(0xB0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4580(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x45A0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x45C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4610(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4658(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x46A0(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4768(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4788(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x47A8(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x48D0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x48F0(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4918(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4938(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4958(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4A80(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4AA0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4B68(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4C30(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x4CF8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4DC0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4E30(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4EA0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4EE8(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4FB0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4FF8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5040(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5060(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5128(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x51A0(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5250(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5298(0x28)
		double JogStartPosition; // 0x52C0(0x8)
		double CrouchPlayRate; // 0x52C8(0x8)
		double PivotAnimBlendTime; // 0x52D0(0x8)
		double StartAnimBlendTime; // 0x52D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E48C00
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D75E4C300
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48A00
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48600
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48700
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48E00
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48D00
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48800
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E48900
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4C200
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D75E48500
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D620BC800
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E4C600
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E4C400
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D75E4C500
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D86D58800
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E48F00
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E48B00
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D620BC700
		void Movement_HeavyWeapon(FPoseLink& Movement_HeavyWeapon); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4C000
		void Movement_Crouching(FPoseLink& Movement_Crouching); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4C100
		void Movement_Standing(FPoseLink& Movement_Standing); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4BF00
		void AnimGraph(FPoseLink UpperBody, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E49100
		void ExecuteUbergraph_Player_LowerBodyJog_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E49000
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C
	// Inherited from UFortPlayerLandingAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x24D8 (0x38F8 - 0x1420)
	class UPlayer_Land_AnimBP_C : public UFortPlayerLandingAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1428(0x30)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1458(0x8)
		FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x1460(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1508(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1510(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1530(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x15E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1600(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x16B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x16D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1780(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1850(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1870(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1920(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1940(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x19F0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A10(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A30(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A70(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B40(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C10(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C58(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1CA0(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CB0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1CD0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1D18(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1D60(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D70(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1D90(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1DD8(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1E20(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E30(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E50(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F00(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F20(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FD0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2080(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2150(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2170(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2220(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2240(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2288(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22D0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2318(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2360(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x23A8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x23F0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2438(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2480(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x24C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2510(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2558(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25A0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x25E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2630(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2678(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26C0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2708(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2750(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2798(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27E0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2828(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2870(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28B8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2900(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2948(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2990(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29D8(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2A20(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2AD0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2AF0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2B38(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x2B80(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2CA0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2CE8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2D30(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D78(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2DC0(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2E08(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F18(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2F40(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3008(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3028(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x30F0(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3110(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x31D8(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x31F8(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3208(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x32C8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x3390(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3458(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x34A0(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3590(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x35D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3620(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3668(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x36B0(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x36F8(0xC0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x37B8(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x37C8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3810(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3830(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B500
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A700
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B300
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4AF00
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B000
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B700
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B600
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B100
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B200
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A600
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D75E4AE00
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D75E4AC00
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E4AA00
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A800
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D75E4A900
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D75E4AB00
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B800
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D75E4B400
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D75E4AD00
		void FallLandAdditive(FPoseLink& FallLandAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4B900
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4BB00
		void OnLandingBecomesRelevant(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4E800
		void OnLandingUpdate(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D75E4E700
		void ExecuteUbergraph_Player_Land_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E4BA00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C
	// Inherited from UFortPlayerDBNOCarriedAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x2078 (0x2638 - 0x5C0)
	class UPlayer_DBNOCarried_AnimBP_C : public UFortPlayerDBNOCarriedAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5C0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x5C8(0x4C)
		unsigned char UnknownData02_6[0x4]; // 0x614(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x618(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x620(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x628(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x648(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x668(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x790(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x900(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x948(0xC8)
		FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xA10(0x260)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xC70(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB8(0x28)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xCE0(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD20(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xD40(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xDB0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xE78(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xF40(0x70)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xFB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xFD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1000(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1028(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1050(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1078(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x10A0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10C8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1110(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x11D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1220(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1240(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1288(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x12D0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1340(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1408(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1450(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1518(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1560(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1580(0x40)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1608(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1650(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1698(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1720(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1768(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1788(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x17D0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1898(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x18E0(0xC8)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x19A8(0x40)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x19E8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1A30(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1A78(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1AB8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B00(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1B48(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1B90(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1BD8(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C18(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C60(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1CA8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1CF0(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1D38(0x40)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1D78(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1DC0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1DE0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1E28(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1EF0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1F38(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1F58(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2020(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x2040(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2080(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x20A0(0xC8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2168(0x20)
		unsigned char UnknownData03_6[0x8]; // 0x2188(0x8) UNKNOWN PROPERTY
		FAnimNode_Trail AnimGraphNode_Trail; // 0x2190(0x2A0)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x2430(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x2478(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x24C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2508(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2550(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x25C8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x25F0(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2618(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4F900
		void ExecuteUbergraph_Player_DBNOCarried_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E4F800
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C
	// Inherited from UFortPlayerBuildingAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x4E0 (0x9B0 - 0x4D0)
	class UPlayer_BuildingPose_AnimBP_C : public UFortPlayerBuildingAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x4D0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4D8(0x5)
		unsigned char UnknownData01_6[0x3]; // 0x4DD(0x3) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x4E0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x4E8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x4F0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x510(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x538(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x560(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x588(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5F8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x640(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x688(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6D0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x718(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x760(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7A8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x858(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8A0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8C0(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8E8(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4F500
		void ExecuteUbergraph_Player_BuildingPose_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E4F400
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNO_AnimBP.Player_DBNO_AnimBP_C
	// Inherited from UFortDBNOAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x8C9 (0xDA9 - 0x4E0)
	class UPlayer_DBNO_AnimBP_C : public UFortDBNOAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x4E0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4E8(0x18)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x500(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x508(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x510(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x530(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x558(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x580(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x620(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x648(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x670(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x698(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6C0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x708(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x728(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x770(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x790(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7D8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7F8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x868(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x888(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8D0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8F0(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x918(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x9E0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xAA8(0x70)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xB18(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xC40(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xC60(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xC80(0x128)
		bool AdjustLargeBody; // 0xDA8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNO_AnimBP.Player_DBNO_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4F200
		void ExecuteUbergraph_Player_DBNO_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D75E4F100
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x6F0 (0x1B00 - 0x1410)
	class UPlayer_FreeFlying_AnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1418(0x48)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1460(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1468(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1470(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1490(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x14B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1500(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1548(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1590(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x15D8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1620(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1690(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1758(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1778(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x17C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1808(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1850(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1898(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x18E0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1950(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1A18(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1A38(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66972100
		void ExecuteUbergraph_Player_FreeFlying_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D66972000
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C
	// Inherited from UFortSkydivingAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x8B22 (0x93E2 - 0x8C0)
	class UPlayer_SkyDiveAndGlide_AnimBP_C : public UFortSkydivingAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x8C0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x8C8(0x42C)
		unsigned char UnknownData01_6[0x4]; // 0xCF4(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xCF8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xD00(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0xD08(0x20)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xD28(0x10)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD38(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xD80(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xE48(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xF10(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xF80(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xFF0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1100(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1148(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1210(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1258(0x48)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x12A0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x12E8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1308(0xC8)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x13D0(0x10)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x13E0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1428(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1498(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1508(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x15D0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1618(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1688(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1750(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x17C0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1888(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x18F8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1968(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x19D8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1A48(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1AB8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1B28(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1B98(0xC8)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1C60(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1CA8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1CC8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1D90(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1E08(0x78)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1ED0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F48(0x28)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1F70(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2030(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x20A0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2110(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x21D8(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x22A0(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2360(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x23D0(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2440(0x48)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2488(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x24D0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2540(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x25B0(0x70)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2620(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2668(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26F8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2740(0x20)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2760(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2838(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2880(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2918(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2940(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2968(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2990(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2A08(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2A30(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2AA0(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2B10(0xC0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2BD0(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2C98(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2D58(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2DC8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2E38(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F00(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2F70(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F90(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3000(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3048(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x30B8(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3100(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x31C0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3230(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x32A0(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3360(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x33D0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3440(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3508(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x35D0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3640(0x20)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x3660(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3670(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3690(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3758(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3780(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x37F0(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3810(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38D8(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3900(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3970(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3990(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3A58(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3A78(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3AA0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3B68(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3BD8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3CA0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3D10(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3D80(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3DA0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3E10(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3ED8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3F48(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3F68(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4030(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4058(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x40C8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4138(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x41A8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4218(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4288(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x42F8(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4368(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x43B0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x43F8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4440(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x44B0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4520(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4590(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4658(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4720(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4768(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x47B0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x47F8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4868(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4888(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x48F8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4968(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x49D8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4A48(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4AB8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4B28(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4B98(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C08(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C50(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C98(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4CE0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4D50(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4E18(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4E88(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4ED0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4F18(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4FE0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5050(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5098(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x50B8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5180(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x51C8(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5210(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5238(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5260(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5288(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5300(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5328(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5350(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5378(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x53A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x53C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x53F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5418(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5440(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5468(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5490(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x54B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x54E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5508(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5530(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5558(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5580(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x55C8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x55E8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5630(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5650(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5698(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x56B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5700(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5720(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5730(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5750(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5818(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5838(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5880(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x58C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5910(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5958(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x59A0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x59E8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5A08(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5A78(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5AE8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5B58(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5BC8(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5C38(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5C80(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5CC8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5D10(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5D30(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5D40(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5D60(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5E28(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5E50(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5F18(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5F88(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5FA8(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6070(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6138(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x61A8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6270(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x62E0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6350(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6370(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x63B8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6428(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6498(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6560(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6628(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6698(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6708(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6728(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x67F0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x68B8(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6980(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x69A8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6A18(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6A88(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6AF8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6B68(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6BD8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6C48(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6CB8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6D28(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6D98(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6E08(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6E78(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6EE8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6F58(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6FC8(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x7038(0xC0)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x70F8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7140(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7188(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x71D0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7218(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7260(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x72A8(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7370(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7438(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7480(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x74C8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7510(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7580(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x75A0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7610(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7680(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x76F0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7760(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x77D0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7840(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x78B0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7920(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7968(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x79B0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x79F8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7A68(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7B30(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7BA0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7BE8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7C30(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7CF8(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7D68(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7DB0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x7DD0(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7E98(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7EB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7EE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7FA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7FD0(0x28)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x7FF8(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8008(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8028(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8098(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8108(0xC0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x81C8(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8290(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8350(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x83C0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8430(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x84F8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8568(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8588(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x85F8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8640(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x86B0(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x86F8(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x87B8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8828(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8898(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8958(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x89C8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8A38(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8B00(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8BC8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8C38(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8C58(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8CA0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8D10(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8D80(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8E48(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8E90(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8F58(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8F80(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8FA0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x9068(0x70)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x90D8(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x9100(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9120(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x91E8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9208(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x92D0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x92F0(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9318(0xC8)
		bool ParaGlide_TriggerAnim; // 0x93E0(0x1)
		bool BlockAnimRule; // 0x93E1(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66971F00
		void ExecuteUbergraph_Player_SkyDiveAndGlide_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D66971E00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_Proto_AnimBP.Player_InAir_Proto_AnimBP_C
	// Inherited from UFortPlayerInAirAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x3288 (0x46A8 - 0x1420)
	class UPlayer_InAir_Proto_AnimBP_C : public UFortPlayerInAirAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1428(0x88)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14B0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14B8(0x8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1570(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1590(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1640(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1660(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1710(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1730(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1800(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1980(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19A0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19C0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AB0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1AD0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B80(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BA0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BC0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BE0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CB0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CD0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D80(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E30(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E50(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F00(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F20(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1FD0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1FF0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2038(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2080(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x20C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2110(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2158(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x21A0(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x21B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x21F8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2240(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2288(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22F0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2338(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2380(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23C8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2410(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2458(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2468(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24B0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x24F8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2540(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2560(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25A8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x25F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2638(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2680(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26C8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2710(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2758(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x27A0(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x27B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27F8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2840(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2888(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x28A8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2958(0x78)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x29D0(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2AC0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2AE0(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2B08(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D88(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2DB0(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2E78(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2E88(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2F48(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3010(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3100(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3148(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3168(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3230(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3240(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3300(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x33C8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3410(0xF0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3500(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3520(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x35E8(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x35F8(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x36B8(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3780(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3870(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x38B8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x38D8(0xC8)
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x39A0(0x420)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3DC0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3E70(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3E90(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3F00(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x3F48(0x120)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4068(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4158(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4168(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4258(0x10)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4268(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4290(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42E0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4308(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4350(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4370(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x43B8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x43D8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4448(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4468(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4530(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4578(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x45A0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x45E8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4610(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4658(0x28)
		bool InAir_Jumping; // 0x4680(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x4681(0x7) UNKNOWN PROPERTY
		AFortPlayerController FortPlayerController; // 0x4688(0x8)
		float PlayerVelocity; // 0x4690(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x4694(0x4) UNKNOWN PROPERTY
		double CrappyTempFlaotTarget; // 0x4698(0x8)
		double CrappyTempFloat; // 0x46A0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_Proto_AnimBP.Player_InAir_Proto_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6700
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE9B00
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6500
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADEA300
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADEA400
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6900
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6800
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADEA500
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6400
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE9A00
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D7ADEA200
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D7ADEA000
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE9E00
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE9C00
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE9D00
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE9F00
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6A00
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D7ADE6600
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D7ADEA100
		void JumpUpAdditive(FPoseLink& JumpUpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ADE9800
		void JumpLoopAdditive(FPoseLink& JumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ADE9900
		void FallAdditive(FPoseLink& FallAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ADE6B00
		void AnimGraph(FPoseLink SourcePose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ADE7300
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent 0x15D7ADE7100
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_E40FAFA845278A1E059C6C994794E1D1(); // Flags: BlueprintEvent 0x15D7ADE6D00
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_0CC6851B4F8E3664299328A4F5897FC6(); // Flags: BlueprintEvent 0x15D7ADE6F00
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_3546925B456E275E991CE08EFFBD987A(); // Flags: BlueprintEvent 0x15D7ADE6E00
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_045CF7A54FE6B606710C0488ECF4F4DC(); // Flags: BlueprintEvent 0x15D7ADE7000
		void BlueprintInitializeAnimation(); // Flags: Event|Public|BlueprintEvent 0x15D7ADE7200
		void ExecuteUbergraph_Player_InAir_Proto_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D7ADE6C00
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C
	// Inherited from UFortPlayerDebugAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x48 (0x578 - 0x530)
	class UPlayer_PropertiesDebug_AnimBP_C : public UFortPlayerDebugAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x530(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x538(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x540(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x548(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x568(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ADE8700
		void ExecuteUbergraph_Player_PropertiesDebug_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D7ADE8600
	};


	// Class /Game/Characters/Player/Blueprints/FortPlayerAnimComponentBP.FortPlayerAnimComponentBP_C
	// Inherited from UFortPlayerAnimationComponent -> UActorComponent -> UObject
	// Size: 0x0 (0x11D0 - 0x11D0)
	class UFortPlayerAnimComponentBP_C : public UFortPlayerAnimationComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Blueprints/FortPlayerAnimComponentBP.FortPlayerAnimComponentBP_C");
			return ret;
		}
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C
	// Inherited from UFortPlayerTacticalStateAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x2D80 (0x41C0 - 0x1440)
	class UPlayer_TacticalState_AnimBP_C : public UFortPlayerTacticalStateAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1440(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1448(0x2C)
		unsigned char UnknownData01_6[0x4]; // 0x1474(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1478(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1480(0x8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1488(0x10)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1498(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14E0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1528(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1570(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15B8(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1668(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x16B0(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x16F8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1718(0x70)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1788(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x17B0(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1878(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1898(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1960(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1988(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x19B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x19D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A00(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1AA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1AC8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1AF0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1B38(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1B58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1B80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1BA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1BD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1BF8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C20(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C68(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1CB0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1CF8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1D18(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1D60(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1DA8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1DF0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1E10(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1E58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1EA0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1EE8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1F08(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1F50(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1F98(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1FE0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2000(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2048(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2090(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x20D8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20F8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2120(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x21E8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2208(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2230(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2258(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2280(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2320(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2348(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2390(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x23D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2420(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2440(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2488(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2518(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2538(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2580(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25C8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2610(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2630(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2678(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26C0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2708(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2728(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2770(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2800(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2820(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2868(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x28F8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2918(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2960(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29F0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2A10(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2A58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2AA0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2AE8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B08(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2B30(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2BF8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C18(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2C40(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2C88(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2CA8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2CF0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D10(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2D58(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2D78(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2E40(0x78)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2EB8(0xB0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F68(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2FD8(0xC8)
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x30A0(0x530)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x35D0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3680(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x36F8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3720(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3768(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x37B0(0xC8)
		FAnimNode_Root AnimGraphNode_Root; // 0x3878(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3898(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x38B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x38E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3908(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3930(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3958(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3980(0x28)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x39A8(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3AC8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3B10(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3B30(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B58(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3BA0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3BC0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3C08(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3C28(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3CF0(0x48)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3D38(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3E00(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3EC8(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3F10(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3F88(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3FB0(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3FD8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4048(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4110(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C");
			return ret;
		}

		void WeaponBoneFixLayer(FPoseLink InPose, FPoseLink& WeaponBoneFixLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E2400
		void TacticalSprintLayer(FPoseLink InPoseTacticalSprint, FPoseLink& TacticalSprintLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E2500
		void AnimGraph(FPoseLink InPoseTacticalState, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E2700
		void ExecuteUbergraph_Player_TacticalState_AnimBP(int32_t EntryPoint); // Flags: Final 0x15D641E2600
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
	// Inherited from UFortPlayerAnimInstance -> UFortAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0xEBF4 (0x10694 - 0x1AA0)
	class UFortnite_M_Avg_Player_AnimBlueprint_C : public UFortPlayerAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1AA0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1AA8(0x1A8)
		FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x1C50(0x8)
		FAnimSubsystem_SharedLinkedAnimLayers AnimBlueprintExtension_SharedLinkedAnimLayers; // 0x1C58(0x28)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1C80(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1C88(0x8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C90(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D40(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D60(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E10(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1EC0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1EE0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F90(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2040(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x20F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2110(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x21C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2270(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2290(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2340(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x23F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2410(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x24C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x24E0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2590(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x25B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2660(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2680(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2730(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2750(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2800(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x28B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x28D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2980(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x29A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2A50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2A70(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2B20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2B40(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2BF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2C10(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2CC0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2CE0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2D90(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2DB0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2E60(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2F10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2F30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2FE0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3000(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3020(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3040(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3060(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3110(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3130(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x31E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3200(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x32B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x32D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3380(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x33A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3450(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3470(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3520(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3540(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3560(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3580(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x35A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3650(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3670(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3720(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3740(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x37F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3810(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x38C0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3970(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3A20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3A40(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3AF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x3B10(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3BC0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3C70(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3C90(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3CD8(0x20)
		FAnimNode_StrideWarping AnimGraphNode_StrideWarping; // 0x3CF8(0x240)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3F38(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3F58(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3FD0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4080(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4130(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x41E0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4258(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4280(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x42F8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4320(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x43E8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4410(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4458(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4480(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x44A8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4570(0x48)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x45B8(0x38)
		FAnimNode_Root AnimGraphNode_Root; // 0x45F0(0x20)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4610(0xF0)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x4700(0xB8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x47B8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4868(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x48E0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x4908(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4928(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x49F0(0x38)
		FAnimNode_Root AnimGraphNode_Root; // 0x4A28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4A48(0xB0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4AF8(0xC8)
		FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x4BC0(0x78)
		FAnimNode_Root AnimGraphNode_Root; // 0x4C38(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4C58(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4D08(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4DB8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E30(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4E58(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x4F20(0x38)
		FAnimNode_Root AnimGraphNode_Root; // 0x4F58(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4F78(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4FC0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5070(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x50E8(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x5110(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x51C8(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x51F0(0x20)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x5210(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5258(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x5280(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5318(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5340(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5368(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5390(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x53B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5400(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5420(0xC8)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x54E8(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x54F8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5518(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5540(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5568(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x55B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x55F8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5618(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x56E0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5758(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5780(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5848(0x48)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5890(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5958(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x59D0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x59F8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5A20(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5A48(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5B38(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5BB0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5BD8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5C00(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x5C28(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5C70(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x5CE8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5DB0(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5E78(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5F68(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5FE0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6008(0x28)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6030(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x60E0(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x61A8(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x61D0(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x62C0(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x6308(0x20)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6328(0xF0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6418(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x64E0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6528(0xF0)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6618(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6660(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6728(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x67F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6838(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6880(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x68C8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6910(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6958(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x69A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x69E8(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6A30(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6AE0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B58(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B80(0x28)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6BA8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6C58(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6CD0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6CF8(0x28)
		FFortAnimNode_CurveFilterSlot FortAnimGraphNode_CurveFilterSlot; // 0x6D20(0x98)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6DB8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6E80(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6EC8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6F78(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6FF0(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7038(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x70B0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x70D8(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x7100(0x20)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7120(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7168(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x71B0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x71F8(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7220(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7268(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x72B0(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x73A0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x73E8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7410(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7458(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x74A0(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x74E8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7598(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7610(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7638(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7660(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7688(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x76D0(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x77C0(0x78)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7838(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7880(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x78A8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x78D0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x7918(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0x7A08(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7A28(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7AD8(0x48)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x7B20(0xB8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7BD8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7CA0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7D18(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7D40(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x7D68(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7D88(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7E38(0x78)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x7EB0(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F68(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7F90(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7FD8(0x28)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x8000(0x38)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x8038(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0x8128(0x20)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x8148(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x8238(0x10)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x8248(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x8290(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x8380(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x8390(0x48)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x83D8(0xB8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8490(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x84B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x84E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8508(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8530(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8558(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8580(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x85A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x85D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x85F8(0x28)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x8620(0x38)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x8658(0xB8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8710(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8730(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x87A0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8810(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8880(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x88C8(0x70)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8938(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8980(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8A48(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x8A68(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8A78(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8A98(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x8B60(0xB0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8C10(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8CD8(0x20)
		FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x8CF8(0x128)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x8E20(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8E68(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x8E88(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x8F00(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8F78(0x28)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8FA0(0xC0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9060(0x28)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x9088(0xC0)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x9148(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9190(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x91B8(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x91E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9200(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x92B0(0x78)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x9328(0x38)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9360(0x78)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x93D8(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9490(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x94B8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x9580(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x9648(0x38)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x9680(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9748(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x97C0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x97E8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9810(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x9838(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9880(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x98C8(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x98F0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9968(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9990(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x99B8(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9A70(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9A98(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9AE0(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9B90(0x48)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9BD8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9BF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C98(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x9CC0(0x128)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x9DE8(0x120)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x9F08(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9F28(0x20)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x9F48(0x200)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA148(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xA190(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA1D8(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xA220(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA2E0(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xA328(0xB0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xA3D8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA3F8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA420(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA468(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xA4B0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xA4F8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xA5C0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA5E0(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xA608(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xA628(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xA6F0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA7B8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xA800(0xF0)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xA8F0(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xA910(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA988(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA9B0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xA9D8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAA20(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xAA48(0x128)
		FAnimNode_Root AnimGraphNode_Root; // 0xAB70(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xAB90(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xAC40(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xACF0(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xADA0(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xADE8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAE60(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAE88(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xAEB0(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xAFA0(0x48)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xAFE8(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xAFF8(0xF0)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB0E8(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB1D8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xB200(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xB248(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB2C0(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xB2E8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB360(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB388(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB3B0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB3D8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB400(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xB428(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB470(0xF0)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB560(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xB650(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xB698(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB6E0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB708(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB730(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB758(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB780(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xB870(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB8B8(0xF0)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB9A8(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBA98(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBAC0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xBAE8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBB30(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBB58(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBB80(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBBA8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xBBD0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xBC18(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0xBD08(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xBD28(0xB0)
		FAnimNode_Slot AnimGraphNode_Slot; // 0xBDD8(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xBE20(0x78)
		FAnimNode_Slot AnimGraphNode_Slot; // 0xBE98(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xBEE0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBF58(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xBF80(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xBFC8(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0xBFF0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC038(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xC060(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC0D8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xC188(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC200(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xC228(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC2F0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC318(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xC340(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC3B8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xC3E0(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0xC428(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC470(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0xC498(0x20)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xC4B8(0x118)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xC5D0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xC618(0x48)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xC660(0x118)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xC778(0x118)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC890(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xC940(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC9B8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xC9E0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xCA08(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0xCA30(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xCA50(0x78)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCAC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCAF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB40(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCBB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCBE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCC08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCC30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCC58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCC80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCCA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCCD0(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xCCF8(0xB8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xCDB0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xCE78(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xCF40(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xCF68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCF90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCFB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCFE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD008(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD030(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD058(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD080(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD0A8(0x48)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xD0F0(0x38)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD128(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xD150(0xB8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD208(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD228(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD250(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD278(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD2A0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD2C8(0x28)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xD2F0(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD300(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD348(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xD370(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD438(0x20)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xD458(0x38)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD490(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xD4B8(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD580(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xD5A8(0xB8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD660(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD680(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xD6A8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD770(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xD790(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD858(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD878(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD8A0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xD8E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD930(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD978(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD998(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD9E0(0x20)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xDA00(0x38)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xDA38(0xB8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xDAF0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDB10(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xDB58(0x20)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xDB78(0x38)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xDBB0(0xB8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xDC68(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xDC88(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xDD50(0x38)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xDD88(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0xDE00(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xDEC8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xDF90(0x78)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xE008(0x38)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xE040(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0xE108(0x38)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xE140(0xB8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xE1F8(0x48)
		FFortAnimNode_ScaleCharacterBones FortAnimGraphNode_ScaleCharacterBones; // 0xE240(0xD8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xE318(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xE338(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xE358(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xE420(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xE4E8(0xC8)
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0xE5B0(0x530)
		FAnimNode_Slot AnimGraphNode_Slot; // 0xEAE0(0x48)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xEB28(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xEBF0(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xECB8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xECE0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xEDA8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xEE70(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xEF38(0xC8)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xF000(0xB8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xF0B8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xF180(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xF248(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xF270(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xF298(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0xF2C0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xF308(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xF3F8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xF470(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xF498(0xC8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xF560(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xF580(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xF5A0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xF5C8(0x48)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xF610(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xF738(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xF860(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xF988(0x128)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xFAB0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xFAD8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xFB00(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xFB28(0x28)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0xFB50(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xFB98(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xFBB8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xFC80(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xFCF8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xFD40(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xFD68(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xFE30(0xC8)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xFEF8(0xB8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xFFB0(0x48)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xFFF8(0xB8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x100B0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x10128(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x10150(0xB8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x10208(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x10280(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x102A8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x102F0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x10318(0x48)
		FFortAnimInput_AdjustedAim __CustomProperty_InputParam_68C70D6347F81F8476C87EA798A19370; // 0x10360(0x268)
		bool __CustomProperty_ParaGlide_TriggerAnim_EE06BC0D4AF7A3598BB824A5286F89C8; // 0x105C8(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x105C9(0x3) UNKNOWN PROPERTY
		FName __CustomProperty_EmoteAnimOffsetCurveName_D066576F42932FCE06C5E8B658C15225; // 0x105CC(0x4)
		FVector __CustomProperty_LeftHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x105D0(0x18)
		FVector __CustomProperty_RightHandOverride_D066576F42932FCE06C5E8B658C15225; // 0x105E8(0x18)
		bool __CustomProperty_IsHidingInProp_D066576F42932FCE06C5E8B658C15225; // 0x10600(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x10601(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate MenuScreenDispatcher; // 0x10608(0x10)
		double StartAnimBlendTime; // 0x10618(0x8)
		double PivotAnimBlendTime; // 0x10620(0x8)
		double CrouchPlayRate; // 0x10628(0x8)
		bool IsSnowman; // 0x10630(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x10631(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate Indigo_Boost; // 0x10638(0x10)
		bool ParaGlide_UseAltGliderCam; // 0x10648(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x10649(0x7) UNKNOWN PROPERTY
		FVector LeftHandOverride; // 0x10650(0x18)
		FVector RightHandOverride; // 0x10668(0x18)
		bool ParaGlide_TriggerAnim; // 0x10680(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x10681(0x3) UNKNOWN PROPERTY
		FName EmoteAnimOffsetCurveName; // 0x10684(0x4)
		float TorsoLocomotionWeight; // 0x10688(0x4)
		float ArmLeftLocomotionWeight; // 0x1068C(0x4)
		float ArmRightLocomotionWeight; // 0x10690(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C");
			return ret;
		}

		void SecondMovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& SecondMovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E6E00
		void ProceduralLayeredPose(FPoseLink InLocomotionPose, FPoseLink InPassThroughPose, FPoseLink& ProceduralLayeredPose); // Flags: HasOutParms|BlueprintCallable 0x15D641E7200
		void ProceduralAdditivePose(FPoseLink InSourceLocomotionPose, FPoseLink InMotionMatchingPose, FPoseLink InProceduralLayeredPose, FPoseLink& ProceduralAdditivePose); // Flags: HasOutParms|BlueprintCallable 0x15D641E7300
		void MovementMode_InAirOverride(FPoseLink InSource_Pose, FPoseLink InAirPose, FPoseLink& MovementMode_InAirOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E7800
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D641E7B00
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E7A00
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E7900
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable 0x15D641E7400
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable 0x15D641E7700
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E7600
		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable 0x15D641E5800
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E5200
		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E4C00
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable 0x15D641E4400
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E4B00
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable 0x15D641E4F00
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable 0x15D641E8400
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable 0x15D641E8200
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable 0x15D641E8100
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable 0x15D641E8300
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable 0x15D641E8000
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4A00
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4600
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4700
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4E00
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4D00
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4800
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E4900
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable 0x15D641E7F00
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable 0x15D641E4500
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable 0x15D641E4300
		void VehicleFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& VehicleFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E6900
		void VehicleSplitBodyOverride(FPoseLink InPoseSplitBody, FPoseLink InPoseUpperAndLowerBody, FPoseLink InPoseUpperAndLowerBodyRemoveRoot, FPoseLink& VehicleSplitBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E6600
		void VehicleFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& VehicleFullBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E6800
		void VehicleLowerBodyOverride(FPoseLink InPoseLowerBodyDefault, FPoseLink InPoseUpperBody, FPoseLink& VehicleLowerBodyOverride); // Flags: HasOutParms|BlueprintCallable 0x15D641E6700
		void ProceduralLayeringStep2(FPoseLink InSourceLocomotionPose, FPoseLink In_MotionMatchingPose, FPoseLink InProceduralLayeredPose, FPoseLink& ProceduralLayeringStep2); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E7000
		void FirstPersonAdditives(FPoseLink InPoseFirstPersonAdditives, FPoseLink& FirstPersonAdditives); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E5400
		void ADSLeanAdditiveLayer(FPoseLink InPoseSourcePosePreAimOffsets, FPoseLink& ADSLeanAdditiveLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D75E4FA00
		void ProceduralLayeringStep1(FPoseLink InPoseProceduralLayering, FPoseLink InPoseMotionMatchingLoco, FPoseLink& ProceduralLayeringStep1); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E7100
		void RigidBodyPBAProto(FPoseLink InPoseRigidBodyPBA, FPoseLink& RigidBodyPBAProto); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E6F00
		void SourcePoseLayer(FPoseLink InSourcePoseInput, FPoseLink& SourcePoseLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E6C00
		void UpperBodyAdjustmentsLayer(FPoseLink InPoseUpperBodyAdjustments, FPoseLink InPosePostUpperBodySlot, FPoseLink InMotionMatching, FPoseLink& UpperBodyAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E6B00
		void FullBodySlotLayer(FPoseLink InFullBodyPose, FPoseLink& FullBodySlotLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E5100
		void DebugLayer(FPoseLink InPoseDebug, FPoseLink& DebugLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E5700
		void FacialCurvesLayer(FPoseLink InPoseFacialCurves, FPoseLink& FacialCurvesLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E5500
		void FullBodyAdditivesLayer(FPoseLink InPoseFullBodyAdditives, FPoseLink& FullBodyAdditivesLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E5300
		void LocomotionLayer(FPoseLink InSourcePoseLoco, FPoseLink MotionMatchingLocoPose, FPoseLink& LocomotionLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E7E00
		void LowerBodyBlendLayer(FPoseLink BasePose, FPoseLink LowerBody, FPoseLink& LowerBodyBlendLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E7D00
		void SourcePoseAdjustmentsLayer(FPoseLink InSourcePose, FPoseLink InMotionMatchingPose, FPoseLink& SourcePoseAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E6D00
		void UpperBodyAimingOffsetsLayer(FPoseLink InPose, FPoseLink& UpperBodyAimingOffsetsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E6A00
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D641E2200
		void AnimNotify_Melee_Swing_L(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E6000
		void AnimNotify_Melee_Swing_R(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5D00
		void AnimNotify_playFacialAnim(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5900
		void AnimNotify_IndigoLaunch(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E6100
		void AnimNotify_Melee_Swing_L_End(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5E00
		void AnimNotify_Melee_Swing_R_End(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5B00
		void AnimNotify_Melee_Swing_L(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5F00
		void AnimNotify_Melee_Swing_R(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5C00
		void AnimNotify_CreateToolFlyModeLoop_Entered(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E6300
		void AnimNotify_CreateToolFlyModeStart_Entered(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E6200
		void AnimNotify_OpenGlider(); // Flags: BlueprintCallable|BlueprintEvent 0x15D641E5A00
		void ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint(int32_t EntryPoint); // Flags: Final 0x15D641E5600
		void Indigo_Boost__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D641E5000
		void MenuScreenDispatcher__DelegateSignature(UFortPlayerAnimInstance CharPart); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D641E7C00
	};


	// Class /Game/Characters/Player/Blueprints/FortPlayerLinkedAnimGraphComponentBP.FortPlayerLinkedAnimGraphComponentBP_C
	// Inherited from UFortLinkedAnimGraphComponent -> UActorComponent -> UObject
	// Size: 0x0 (0x298 - 0x298)
	class UFortPlayerLinkedAnimGraphComponentBP_C : public UFortLinkedAnimGraphComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Blueprints/FortPlayerLinkedAnimGraphComponentBP.FortPlayerLinkedAnimGraphComponentBP_C");
			return ret;
		}
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C
	// Inherited from UFortSwimmingLayerAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x4788 (0x51B8 - 0xA30)
	class USwimmingAnimBP_C : public UFortSwimmingLayerAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA30(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xA38(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xAE0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xAE8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0xAF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xB10(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xBC0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xC70(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC90(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD40(0x48)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xD88(0x118)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xEA0(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xEE8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xF98(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1010(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1038(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x1060(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1080(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1130(0xB0)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x11E0(0x118)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x12F8(0x118)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1410(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1438(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1460(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1488(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14B0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1520(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1540(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1588(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15F0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1610(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1658(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1678(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1740(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17B8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1800(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1828(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1918(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1940(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1988(0xC0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1A48(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1AC0(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1AE8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1B30(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1B58(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C20(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C68(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1CB0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CD8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CF8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1DA8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1E20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2000(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2028(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2050(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2078(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x20A0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x20C0(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x21E8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2208(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2230(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2258(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2280(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22A8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x22F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2338(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2380(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x23A0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2410(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2430(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2478(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2498(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2560(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2580(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x25F0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2610(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2638(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2658(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2680(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x26A0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2768(0x78)
