#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: FortniteGame
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Struct FortniteGame.AircraftFlightInfo
	// Size: 0x48 (0x48 - 0x0)
	struct FAircraftFlightInfo	
	{
	public:
		FVector_NetQuantize100 FlightStartLocation; // 0x0(0x18)
		FRotator FlightStartRotation; // 0x18(0x18)
		float FlightSpeed; // 0x30(0x4)
		float TimeTillFlightEnd; // 0x34(0x4)
		float TimeTillDropStart; // 0x38(0x4)
		float TimeTillDropEnd; // 0x3C(0x4)
		bool bEjectPlayersAtDropZoneExit; // 0x40(0x1)
		bool bVisiblePostAthenaAircraftPhase; // 0x41(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x42(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortMutatorAudioStinger
	// Size: 0x10 (0x10 - 0x0)
	struct FFortMutatorAudioStinger	
	{
	public:
		USoundCue SoundCue; // 0x0(0x8)
		float LoopTimeBeforeFade; // 0x8(0x4)
		float FadeTime; // 0xC(0x4)
	};


	// Struct FortniteGame.AthenaGameMessageData
	// Size: 0x48 (0x48 - 0x0)
	struct FAthenaGameMessageData	
	{
	public:
		EAthenaGameMsgType MsgType; // 0x0(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FText MsgText; // 0x8(0x10)
		USoundCue MsgSound; // 0x18(0x8)
		UMediaSource MsgMediaSource; // 0x20(0x8)
		float MsgDelay; // 0x28(0x4)
		bool bIsTeamBased; // 0x2C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
		int32_t TeamIndex; // 0x30(0x4)
		float DisplayTime; // 0x34(0x4)
		EAthenaGameMessageDataFlags MessageFlags; // 0x38(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
		APlayerController TargetPlayerController; // 0x40(0x8)
	};


	// Struct FortniteGame.UraniumRoundData
	// Size: 0x18 (0x18 - 0x0)
	struct FUraniumRoundData	
	{
	public:
		int8_t CurrentRoundNumber; // 0x0(0x1)
		int8_t CurrentRoundCheckPoint; // 0x1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		TArray SingleRoundInfos; // 0x8(0x10)
	};


	// Struct FortniteGame.UraniumSingleRoundInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FUraniumSingleRoundInfo	
	{
	public:
		char RoundTeamWinner; // 0x0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FText RoundName; // 0x8(0x10)
		USoundBase RoundSound; // 0x18(0x8)
		int32_t PointsForWinning; // 0x20(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.UraniumPOIData
	// Size: 0x14 (0x14 - 0x0)
	struct FUraniumPOIData	
	{
	public:
		FGameplayTag POITag; // 0x0(0x4)
		TWeakObjectPtr SplineActor; // 0x4(0x8)
		TWeakObjectPtr CameraActor; // 0xC(0x8)
	};


	// Struct FortniteGame.ReplicatedPhysicsPawnState
	// Size: 0x80 (0x80 - 0x0)
	struct FReplicatedPhysicsPawnState	
	{
	public:
		FVector_NetQuantize100 Translation; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FQuat Rotation; // 0x20(0x20)
		FVector_NetQuantize10 LinearVelocity; // 0x40(0x18)
		FVector_NetQuantize10 AngularVelocity; // 0x58(0x18)
		char Context; // 0x70(0xE)
		unsigned char UnknownData03_7[0x2]; // 0x7E(0x2) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleTransformInfo
	// Size: 0x38 (0x38 - 0x0)
	struct FVehicleTransformInfo	
	{
	public:
		FVector Location; // 0x0(0x18)
		FRotator Rotation; // 0x18(0x18)
		uint32_t Context; // 0x30(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleRuntimeModifiers
	// Size: 0x18 (0x18 - 0x0)
	struct FVehicleRuntimeModifiers	
	{
	public:
		char DataVersion; // 0x0(0x1)
		bool bHasInfiniteFuel : 1; // 0x1:0(0x1)
		bool bSupportCosmeticWrap : 1; // 0x1:1(0x1)
		unsigned char UnknownData01_5[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float WaterDestructionDelay; // 0x4(0x4)
		float SelfDestructTime; // 0x8(0x4)
		float MaxTimeExplosion; // 0xC(0x4)
		float MaxTimeZeroHealth; // 0x10(0x4)
		float MaxTimeSelfDestructCleanup; // 0x14(0x4)
	};


	// Struct FortniteGame.AthenaVehicleShootingCone
	// Size: 0x8 (0x8 - 0x0)
	struct FAthenaVehicleShootingCone	
	{
	public:
		float YawConstraint; // 0x0(0x4)
		float PitchConstraint; // 0x4(0x4)
	};


	// Struct FortniteGame.FortAthenaVehicleInputStateUnreliable
	// Size: 0x38 (0x38 - 0x0)
	struct FFortAthenaVehicleInputStateUnreliable	
	{
	public:
		float ForwardAlpha; // 0x0(0x4)
		float RightAlpha; // 0x4(0x4)
		float PitchAlpha; // 0x8(0x4)
		float LookUpDelta; // 0xC(0x4)
		float TurnDelta; // 0x10(0x4)
		float SteerAlpha; // 0x14(0x4)
		float GravityOffset; // 0x18(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		FVector_NetQuantize100 MovementDir; // 0x20(0x18)
	};


	// Struct FortniteGame.VehicleDamageablePart
	// Size: 0x18 (0x18 - 0x0)
	struct FVehicleDamageablePart	
	{
	public:
		int32_t ConfigIndex; // 0x0(0x4)
		FName BoneName; // 0x4(0x4)
		FName ShapeName; // 0x8(0x4)
		float Health; // 0xC(0x4)
		bool bConsideredCriticalHit; // 0x10(0x1)
		bool bStayDisabledDuringTireMod; // 0x11(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x12(0x2) UNKNOWN PROPERTY
		float MaxHealthOverride; // 0x14(0x4)
	};


	// Struct FortniteGame.VehicleToggleablePart
	// Size: 0x8 (0x8 - 0x0)
	struct FVehicleToggleablePart	
	{
	public:
		FName ShapeName; // 0x0(0x4)
		bool bEnabled; // 0x4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.InteractionType
	// Size: 0x48 (0x48 - 0x0)
	struct FInteractionType	
	{
	public:
		TEnumAsByte InteractionType; // 0x0(0x1)
		TEnumAsByte InteractionBeingAttempted; // 0x1(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		TWeakObjectPtr RequestingPawn; // 0x4(0x8)
		TWeakObjectPtr RequestingPlayerController; // 0xC(0x8)
		unsigned char UnknownData04_6[0x8]; // 0x14(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr InteractComponent; // 0x1C(0x8)
		TWeakObjectPtr OptionalObjectData; // 0x24(0x8)
		unsigned char UnknownData05_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		FVector InteractPoint; // 0x30(0x18)
	};


	// Struct FortniteGame.SpawnerInfoForcedCosmetics
	// Size: 0x48 (0x48 - 0x0)
	struct FSpawnerInfoForcedCosmetics	
	{
	public:
		FGameplayTag BodyTag; // 0x0(0x4)
		FGameplayTag BodyPaintedTag; // 0x4(0x4)
		FLinearColor BodyColor; // 0x8(0x10)
		FGameplayTag WheelTag; // 0x18(0x4)
		FGameplayTag WheelPaintedTag; // 0x1C(0x4)
		FGameplayTag SkinTag; // 0x20(0x4)
		FGameplayTag SkinPaintedTag; // 0x24(0x4)
		FLinearColor SkinColor; // 0x28(0x10)
		FGameplayTag BoosterTag; // 0x38(0x4)
		FGameplayTag BoosterPaintedTag; // 0x3C(0x4)
		FGameplayTag DriftTrailTag; // 0x40(0x4)
		FGameplayTag DriftTrailPaintedTag; // 0x44(0x4)
	};


	// Struct FortniteGame.VehicleWheelFXInfo
	// Size: 0x10 (0x10 - 0x0)
	struct FVehicleWheelFXInfo	
	{
	public:
		float WheelRadiusWithTire; // 0x0(0x4)
		float WheelRadiusNoTire; // 0x4(0x4)
		float WheelWidthWithTire; // 0x8(0x4)
		float WheelWidthNoTire; // 0xC(0x4)
	};


	// Struct FortniteGame.TireInfo
	// Size: 0x270 (0x270 - 0x0)
	struct FTireInfo	
	{
	public:
		USkeletalMesh WheelMesh; // 0x0(0x8)
		FName TireBoneName; // 0x8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UStaticMesh UndercarriageCollisionStaticMesh; // 0x10(0x8)
		FRuntimeSpringsInfo SpringTuning; // 0x18(0x20)
		FRuntimeTerrainHandlingInfo RoadBehavior; // 0x38(0x14)
		FRuntimeTerrainHandlingInfo DirtBehavior; // 0x4C(0x14)
		FRuntimeTerrainHandlingInfo GrassBehavior; // 0x60(0x14)
		FRuntimeTerrainHandlingInfo SnowBehavior; // 0x74(0x14)
		FRuntimeTerrainHandlingInfo IceBehavior; // 0x88(0x14)
		FRuntimeTerrainHandlingInfo MudBehavior; // 0x9C(0x14)
		TMap WheelFXInfos; // 0xB0(0x50)
		TMap WheelAttachInfos; // 0x100(0x50)
		float PoppedTireSpringLength; // 0x150(0x4)
		float PoppedTireSpringStiff; // 0x154(0x4)
		float PoppedTireSpringDamp; // 0x158(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x15C(0x4) UNKNOWN PROPERTY
		FScalableFloat MaxDriveInclineAngle; // 0x160(0x28)
		float UprightRollStiff; // 0x188(0x4)
		float UprightRollDamp; // 0x18C(0x4)
		float UprightPitchStiff; // 0x190(0x4)
		float UprightPitchDamp; // 0x194(0x4)
		float UprightYawStiff; // 0x198(0x4)
		float UprightYawDamp; // 0x19C(0x4)
		float MidAxleForwardAdjust; // 0x1A0(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x1A4(0x4) UNKNOWN PROPERTY
		FScalableFloat TireHealth; // 0x1A8(0x28)
		FScalableFloat WaterTopSpeedMultiplier; // 0x1D0(0x28)
		FScalableFloat PontoonScaleRadiusPerTick; // 0x1F8(0x28)
		TArray DamageablePartShapeNames; // 0x220(0x10)
		FName CollisionBoneName; // 0x230(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x234(0x4) UNKNOWN PROPERTY
		USoundWave TireDirtLoop; // 0x238(0x8)
		USoundWave TireGrassLoop; // 0x240(0x8)
		USoundWave TireRoadLoop; // 0x248(0x8)
		USoundBase SuspensionLight; // 0x250(0x8)
		USoundBase SuspensionMedium; // 0x258(0x8)
		USoundBase SuspensionHeavy; // 0x260(0x8)
		UClass AppliedGameplayEffect; // 0x268(0x8)
	};


	// Struct FortniteGame.VehicleWheelAttachInfo
	// Size: 0x48 (0x48 - 0x0)
	struct FVehicleWheelAttachInfo	
	{
	public:
		FRotator WheelRotation; // 0x0(0x18)
		FVector WheelScale; // 0x18(0x18)
		FVector WheelLocationAdjustment; // 0x30(0x18)
	};


	// Struct FortniteGame.RuntimeTerrainHandlingInfo
	// Size: 0x14 (0x14 - 0x0)
	struct FRuntimeTerrainHandlingInfo	
	{
	public:
		float PushForceMultiplier; // 0x0(0x4)
		float BrakeForceMultiplier; // 0x4(0x4)
		float TopSpeedMultiplier; // 0x8(0x4)
		float FrontTireFriction; // 0xC(0x4)
		float RearTireFriction; // 0x10(0x4)
	};


	// Struct FortniteGame.RuntimeSpringsInfo
	// Size: 0x20 (0x20 - 0x0)
	struct FRuntimeSpringsInfo	
	{
	public:
		float SpringStiffMultiplier; // 0x0(0x4)
		float SpringDampMultiplier; // 0x4(0x4)
		float SpringLengthMultiplier; // 0x8(0x4)
		float RearSpringLengthMultiplier; // 0xC(0x4)
		float TireZOffset; // 0x10(0x4)
		float TireZOffset_B; // 0x14(0x4)
		float WheelRadiusF; // 0x18(0x4)
		float WheelRadiusB; // 0x1C(0x4)
	};


	// Struct FortniteGame.VehicleSpecificUIDetails
	// Size: 0x20 (0x20 - 0x0)
	struct FVehicleSpecificUIDetails	
	{
	public:
		UClass WidgetClass; // 0x0(0x8)
		EUIExtensionSlot Slot; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		TArray ValidSeats; // 0x10(0x10)
	};


	// Struct FortniteGame.ActiveVehicleUI
	// Size: 0x18 (0x18 - 0x0)
	struct FActiveVehicleUI	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		UUserWidget ActiveWidget; // 0x10(0x8)
	};


	// Struct FortniteGame.VehicleCosmeticInfo
	// Size: 0x30 (0x30 - 0x0)
	struct FVehicleCosmeticInfo	
	{
	public:
		AFortPlayerPawn MostRecentCosmeticSourcePawn; // 0x0(0x8)
		AFortPlayerPawn PawnAssociatedWithWrap; // 0x8(0x8)
		UAthenaItemWrapDefinition ActiveCosmeticWrap; // 0x10(0x8)
		TArray SpawnedCosmeticComponents; // 0x18(0x10)
		ACustomItemWrapModifier ItemWrapModifier; // 0x28(0x8)
	};


	// Struct FortniteGame.FortAttributeInitializationKey
	// Size: 0x8 (0x8 - 0x0)
	struct FFortAttributeInitializationKey	
	{
	public:
		FName AttributeInitCategory; // 0x0(0x4)
		FName AttributeInitSubCategory; // 0x4(0x4)
	};


	// Struct FortniteGame.VehicleTargetOrientation
	// Size: 0x48 (0x48 - 0x0)
	struct FVehicleTargetOrientation	
	{
	public:
		FVector UpVector; // 0x0(0x18)
		FVector ForwardVector; // 0x18(0x18)
		FVector Location; // 0x30(0x18)
	};


	// Struct FortniteGame.RecentlyHitBuildingActorsData
	// Size: 0x10 (0x10 - 0x0)
	struct FRecentlyHitBuildingActorsData	
	{
	public:
		ABuildingActor Building; // 0x0(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.RecentlyHitActorsData
	// Size: 0xC (0xC - 0x0)
	struct FRecentlyHitActorsData	
	{
	public:
		TWeakObjectPtr Actor; // 0x0(0x8)
		unsigned char UnknownData01_7[0x4]; // 0x8(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ReplicatedAthenaVehicleAttributes
	// Size: 0x20 (0x20 - 0x0)
	struct FReplicatedAthenaVehicleAttributes	
	{
	public:
		float FrontLateralFrictionScale; // 0x0(0x4)
		float RearLateralFrictionScale; // 0x4(0x4)
		float BrakeForceTractionScale; // 0x8(0x4)
		float ForwardForceTractionScale; // 0xC(0x4)
		float SlopeAntigravityScale; // 0x10(0x4)
		float TopSpeedScale; // 0x14(0x4)
		float VehicleGravityScale; // 0x18(0x4)
		bool bBrakeBeforeReverse; // 0x1C(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaCarPlayerSlotUnreplicated
	// Size: 0x8 (0x8 - 0x0)
	struct FAthenaCarPlayerSlotUnreplicated	
	{
	public:
		UInputComponent Input; // 0x0(0x8)
	};


	// Struct FortniteGame.AthenaCarPlayerSlot
	// Size: 0x1B0 (0x1B0 - 0x0)
	struct FAthenaCarPlayerSlot	
	{
	public:
		FName SeatSocket; // 0x0(0x4)
		FName SeatChoiceSocket; // 0x4(0x4)
		FName SeatIndicatorSocket; // 0x8(0x4)
		unsigned char UnknownData10_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FText SeatChoiceDisplayText; // 0x10(0x10)
		FName SeatCollision; // 0x20(0x4)
		unsigned char UnknownData11_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		TArray ExitSockets; // 0x28(0x10)
		FAthenaVehicleShootingCone ShootingCone; // 0x38(0x8)
		USoundBase SoundOnEnter; // 0x40(0x8)
		USoundBase SoundOnExit; // 0x48(0x8)
		UClass AnimInstanceOverride; // 0x50(0x8)
		UClass AnimLayerOverride; // 0x58(0x8)
		bool bUsePerSeatAnimInstanceOverride : 1; // 0x60:0(0x1)
		bool bIsSelectable : 1; // 0x60:1(0x1)
		bool bUseGroundMotion : 1; // 0x60:2(0x1)
		bool bUseVehicleIsOnGround : 1; // 0x60:3(0x1)
		bool bCanEmote : 1; // 0x60:4(0x1)
		bool bCanCarryDBNOPlayer : 1; // 0x60:5(0x1)
		bool bForceCrouch : 1; // 0x60:6(0x1)
		bool bPlayEnterSoundForTransition : 1; // 0x60:7(0x1)
		bool bPlayExitSoundForTransition : 1; // 0x61:0(0x1)
		bool bIsPushDriver : 1; // 0x61:1(0x1)
		bool bCanOnlyFireWhenTargeting : 1; // 0x61:2(0x1)
		bool bIsOccupantEnclosed : 1; // 0x61:3(0x1)
		bool bCanLeanOutOfWindow : 1; // 0x61:4(0x1)
		unsigned char UnknownData12_5[0x6]; // 0x62(0x6) UNKNOWN PROPERTY
		FVector ActorSpaceCameraOffset; // 0x68(0x18)
		FVector VehicleSpaceCameraOffset; // 0x80(0x18)
		float SlopeCompensationCameraOffset; // 0x98(0x4)
		unsigned char UnknownData13_6[0x4]; // 0x9C(0x4) UNKNOWN PROPERTY
		FVector StandingFiringOffset; // 0xA0(0x18)
		FVector CrouchingFiringOffset; // 0xB8(0x18)
		FVector EmoteOffset; // 0xD0(0x18)
		TWeakObjectPtr Player; // 0xE8(0x8)
		TScriptInterface ControllerUser; // 0xF0(0x10)
		float PlayerEntryTime; // 0x100(0x4)
		float EnterSeatTime; // 0x104(0x4)
		bool bConstrainPawnToSeatTransform; // 0x108(0x1)
		bool bConstrainPawnToSeatDuringTransitionMontage; // 0x109(0x1)
		bool bOffsetPlayerRelativeAttachLocation; // 0x10A(0x1)
		bool bUseExitTimer; // 0x10B(0x1)
		unsigned char UnknownData14_6[0x4]; // 0x10C(0x4) UNKNOWN PROPERTY
		UFortVehicleSeatWeaponComponent WeaponComponent; // 0x110(0x8)
		float CameraPitchConstraint; // 0x118(0x4)
		float CameraYawConstraint; // 0x11C(0x4)
		TWeakObjectPtr ReservingActor; // 0x120(0x8)
		bool bReserved; // 0x128(0x1)
		unsigned char UnknownData15_6[0x7]; // 0x129(0x7) UNKNOWN PROPERTY
		TArray ActionDefForUI; // 0x130(0x10)
		ESlotEnvironmentExposure EnvironmentExposure; // 0x140(0x1)
		unsigned char UnknownData16_6[0x7]; // 0x141(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer SeatTags; // 0x148(0x20)
		FGameplayTag OperatingTurretActionTag; // 0x168(0x4)
		unsigned char UnknownData17_6[0x4]; // 0x16C(0x4) UNKNOWN PROPERTY
		TArray OverridesForCosmetics; // 0x170(0x10)
		float VehicleApexZ; // 0x180(0x4)
		int32_t SeatIndex; // 0x184(0x4)
		int32_t ExitSocketIndex; // 0x188(0x4)
		bool bOverrideVehicleExit; // 0x18C(0x1)
		unsigned char UnknownData18_6[0x3]; // 0x18D(0x3) UNKNOWN PROPERTY
		FVector SeatTransitionVector; // 0x190(0x18)
		int32_t OverridingSeatDataCount; // 0x1A8(0x4)
		unsigned char UnknownData19_7[0x4]; // 0x1AC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaCarPlayerSlotOverridesForCosmetics
	// Size: 0xA0 (0xA0 - 0x0)
	struct FAthenaCarPlayerSlotOverridesForCosmetics	
	{
	public:
		FGameplayTagQuery CosmeticsTagQuery; // 0x0(0x48)
		FAthenaCarPlayerSlotOverridesData PlayerSlotOverridesData; // 0x48(0x58)
	};


	// Struct FortniteGame.AthenaCarPlayerSlotOverridesData
	// Size: 0x58 (0x58 - 0x0)
	struct FAthenaCarPlayerSlotOverridesData	
	{
	public:
		UClass AnimInstanceOverride; // 0x0(0x8)
		UClass AnimLayerOverride; // 0x8(0x8)
		bool bUsePerSeatAnimInstanceOverride : 1; // 0x10:0(0x1)
		bool bUseGroundMotion : 1; // 0x10:1(0x1)
		bool bCanEmote : 1; // 0x10:2(0x1)
		bool bCanCarryDBNOPlayer : 1; // 0x10:3(0x1)
		bool bForceCrouch : 1; // 0x10:4(0x1)
		bool bCanOnlyFireWhenTargeting : 1; // 0x10:5(0x1)
		bool bIsOccupantEnclosed : 1; // 0x10:6(0x1)
		ESlotEnvironmentExposure EnvironmentExposure; // 0x11(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x12(0x6) UNKNOWN PROPERTY
		FGameplayTagContainer SeatTags; // 0x18(0x20)
		TArray SeatTransitions; // 0x38(0x10)
		TArray PassengerLeanSockets; // 0x48(0x10)
	};


	// Struct FortniteGame.SeatTransitionMontage
	// Size: 0x18 (0x18 - 0x0)
	struct FSeatTransitionMontage	
	{
	public:
		UAnimMontage Montage; // 0x0(0x8)
		int32_t FromSeatIndex; // 0x8(0x4)
		int32_t ToSeatIndex; // 0xC(0x4)
		bool bUseFromSeatIndex; // 0x10(0x1)
		bool bUseToSeatIndex; // 0x11(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x12(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ActionDefForUI
	// Size: 0x18 (0x18 - 0x0)
	struct FActionDefForUI	
	{
	public:
		FName InputAction; // 0x0(0x4)
		FName GamepadInputAction; // 0x4(0x4)
		FText ActionLabel; // 0x8(0x10)
	};


	// Struct FortniteGame.MarkedActorDisplayInfo
	// Inherited from FTableRowBase
	// Size: 0x98 (0xA0 - 0x8)
	struct FMarkedActorDisplayInfo : public FTableRowBase	
	{
	public:
		FText DisplayName; // 0x8(0x10)
		TWeakObjectPtr Icon; // 0x18(0x20)
		TWeakObjectPtr CustomIndicatorClass; // 0x38(0x20)
		TWeakObjectPtr CustomDetailsClass; // 0x58(0x20)
		FLinearColor PrimaryColor; // 0x78(0x10)
		USoundBase Sound; // 0x88(0x8)
		EFortMarkedActorScreenClamping ScreenClamping; // 0x90(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x91(0x3) UNKNOWN PROPERTY
		float CustomTimeToLive; // 0x94(0x4)
		UMarkedActorDisplayInfoAdditionalData AdditionalData; // 0x98(0x8)
	};


	// Struct FortniteGame.VehicleDamageablePartConfig
	// Size: 0x40 (0x40 - 0x0)
	struct FVehicleDamageablePartConfig	
	{
	public:
		FName ShapeName; // 0x0(0x4)
		FName BoneName; // 0x4(0x4)
		FGameplayTag PartTag; // 0x8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FScalableFloat MaxHealth; // 0x10(0x28)
		bool bStartsDisabled; // 0x38(0x1)
		bool bConsideredCriticalHit; // 0x39(0x1)
		unsigned char UnknownData03_7[0x6]; // 0x3A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleOverlapVolumeShape
	// Size: 0x30 (0x30 - 0x0)
	struct FVehicleOverlapVolumeShape	
	{
	public:
		FVector Extents; // 0x0(0x18)
		FVector LocalPosition; // 0x18(0x18)
	};


	// Struct FortniteGame.SMVehicleGear
	// Size: 0x130 (0x130 - 0x0)
	struct FSMVehicleGear	
	{
	public:
		unsigned char UnknownData01_7[0x18]; // 0x0(0x18) UNKNOWN PROPERTY
		FScalableFloat TopSpeedHotfixable; // 0x18(0x28)
		FScalableFloat MinSpeedHotfixable; // 0x40(0x28)
		FScalableFloat PushForceHotfixable; // 0x68(0x28)
		FScalableFloat RampTimeHotfixable; // 0x90(0x28)
		FScalableFloat SteeringAngleMultiplierHotfixable; // 0xB8(0x28)
		FScalableFloat AutoBrakeHotfixable; // 0xE0(0x28)
		FScalableFloat IgnoredGravityHotfixable; // 0x108(0x28)
	};


	// Struct FortniteGame.SpringGroundTriangle
	// Size: 0xC (0xC - 0x0)
	struct FSpringGroundTriangle	
	{
	public:
		FName Socket0; // 0x0(0x4)
		FName Socket1; // 0x4(0x4)
		FName Socket2; // 0x8(0x4)
	};


	// Struct FortniteGame.VehicleSpringInfo
	// Size: 0x2B0 (0x2B0 - 0x0)
	struct FVehicleSpringInfo	
	{
	public:
		FName SpringStart; // 0x0(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector SpringStartLocalOffset; // 0x8(0x18)
		FName ForceApplicationPoint; // 0x20(0x4)
		float SpringLength; // 0x24(0x4)
		float SpringStiff; // 0x28(0x4)
		float SpringDamp; // 0x2C(0x4)
		float SpringRadius; // 0x30(0x4)
		float MaxAccelChange; // 0x34(0x4)
		int8_t SeatSocketIndex; // 0x38(0x1)
		bool bIsLookAhead : 1; // 0x39:0(0x1)
		bool bNormalToGroundTriangle : 1; // 0x39:1(0x1)
		bool bForceAlongSpringGroundNormal : 1; // 0x39:2(0x1)
		unsigned char UnknownData06_5[0x2]; // 0x3A(0x2) UNKNOWN PROPERTY
		float LookAheadMinSpeed; // 0x3C(0x4)
		float LookAheadMaxSpeed; // 0x40(0x4)
		float LookAheadMinStiff; // 0x44(0x4)
		float LookAheadMaxStiff; // 0x48(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
		FTransform LocalStartTM; // 0x50(0x60)
		FTransform LocalApplyTM; // 0xB0(0x60)
		FHitResult Hit; // 0x110(0xF8)
		unsigned char UnknownData08_6[0x8]; // 0x208(0x8) UNKNOWN PROPERTY
		FPlane GroundPlane; // 0x210(0x20)
		float SprungMass; // 0x230(0x4)
		bool bEnabled; // 0x234(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x235(0x3) UNKNOWN PROPERTY
		FVector Start; // 0x238(0x18)
		FVector End; // 0x250(0x18)
		FVector RayDir; // 0x268(0x18)
		FVector ForcePt; // 0x280(0x18)
		FVector ForceDir; // 0x298(0x18)
	};


	// Struct FortniteGame.FortRechargingActionTimer
	// Size: 0xD8 (0xD8 - 0x0)
	struct FFortRechargingActionTimer	
	{
	public:
		unsigned char UnknownData02_7[0xA8]; // 0x0(0xA8) UNKNOWN PROPERTY
		float ChargeRate; // 0xA8(0x4)
		float ActiveExpenseRate; // 0xAC(0x4)
		float PassiveExpenseRate; // 0xB0(0x4)
		float MinActiveDuration; // 0xB4(0x4)
		float MinActivationCharge; // 0xB8(0x4)
		float ActiveCooldownTime; // 0xBC(0x4)
		float ChargeThreshold; // 0xC0(0x4)
		float Charge; // 0xC4(0x4)
		bool bIsActive; // 0xC8(0x1)
		bool bIsCharging; // 0xC9(0x1)
		bool bIsPassive; // 0xCA(0x1)
		unsigned char UnknownData03_7[0xD]; // 0xCB(0xD) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAthenaVehicleInputState
	// Size: 0x40 (0x40 - 0x0)
	struct FFortAthenaVehicleInputState	
	{
	public:
		float ForwardAlpha; // 0x0(0x4)
		float RightAlpha; // 0x4(0x4)
		float PitchAlpha; // 0x8(0x4)
		float LookUpDelta; // 0xC(0x4)
		float TurnDelta; // 0x10(0x4)
		float SteerAlpha; // 0x14(0x4)
		float GravityOffset; // 0x18(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		FVector MovementDir; // 0x20(0x18)
		bool bIsReversing : 1; // 0x38:0(0x1)
		bool bIsSprinting : 1; // 0x38:1(0x1)
		bool bIsJumping : 1; // 0x38:2(0x1)
		bool bIsBraking : 1; // 0x38:3(0x1)
		bool bIsHonking : 1; // 0x38:4(0x1)
		bool bIgnoreForwardInAir : 1; // 0x38:5(0x1)
		bool bMovementModifier0 : 1; // 0x38:6(0x1)
		bool bMovementModifier1 : 1; // 0x38:7(0x1)
		bool bMovementModifier2 : 1; // 0x39:0(0x1)
		bool bUsingGamepad : 1; // 0x39:1(0x1)
		bool bUsingTrigger : 1; // 0x39:2(0x1)
		unsigned char UnknownData03_7[0x6]; // 0x3A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PredictedDestroyedBuilding
	// Size: 0x20 (0x20 - 0x0)
	struct FPredictedDestroyedBuilding	
	{
	public:
		TScriptInterface Building; // 0x0(0x10)
		TWeakObjectPtr HitComponent; // 0x10(0x8)
		int32_t HitIndex; // 0x18(0x4)
		float Time; // 0x1C(0x4)
	};


	// Struct FortniteGame.IgnoredPawn
	// Size: 0x10 (0x10 - 0x0)
	struct FIgnoredPawn	
	{
	public:
		AFortPawn Pawn; // 0x0(0x8)
		float Time; // 0x8(0x4)
		unsigned char UnknownData01_7[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.WaterSurfaceInfo
	// Size: 0x68 (0x68 - 0x0)
	struct FWaterSurfaceInfo	
	{
	public:
		FVector WaterPlaneLocation; // 0x0(0x18)
		FVector WaterPlaneNormal; // 0x18(0x18)
		FVector WaterSurfaceLocation; // 0x30(0x18)
		float WaterDepth; // 0x48(0x4)
		int32_t WaterBodyIdx; // 0x4C(0x4)
		FVector WaterVelocity; // 0x50(0x18)
	};


	// Struct FortniteGame.PredictionReplicationProxy_SP
	// Size: 0x18 (0x18 - 0x0)
	struct FPredictionReplicationProxy_SP	
	{
	public:
		int32_t ServerFrameNumber; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray Data; // 0x8(0x10)
	};


	// Struct FortniteGame.PredictionReplicationProxy_AP
	// Size: 0x18 (0x18 - 0x0)
	struct FPredictionReplicationProxy_AP	
	{
	public:
		int32_t ClientFrameNumber; // 0x0(0x4)
		int32_t ServerFrameNumber; // 0x4(0x4)
		TArray Data; // 0x8(0x10)
	};


	// Struct FortniteGame.QuickBarData
	// Size: 0x10 (0x10 - 0x0)
	struct FQuickBarData	
	{
	public:
		TArray QuickbarSlots; // 0x0(0x10)
	};


	// Struct FortniteGame.QuickBarSlotData
	// Size: 0x80 (0x80 - 0x0)
	struct FQuickBarSlotData	
	{
	public:
		TArray AcceptedItemTypes; // 0x0(0x10)
		FGameplayTagQuery AcceptedItemTagQuery; // 0x10(0x48)
		bool bStaticSlot; // 0x58(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x59(0x7) UNKNOWN PROPERTY
		TWeakObjectPtr DefaultItem; // 0x60(0x20)
	};


	// Struct FortniteGame.CumulativeFrameTimeWithoutSleepLimits
	// Size: 0x18 (0x18 - 0x0)
	struct FCumulativeFrameTimeWithoutSleepLimits	
	{
	public:
		double FrameTimeWithoutSleep; // 0x0(0x8)
		double MaxCumulativeFrameTimeAboveThreshold; // 0x8(0x8)
		double MaxNumberOfFramesAboveThreshold; // 0x10(0x8)
	};


	// Struct FortniteGame.ItemAndCount
	// Size: 0x40 (0x40 - 0x0)
	struct FItemAndCount	
	{
	public:
		int32_t Count; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UItemDefinitionBase Item; // 0x8(0x8)
		FGuid ItemVariantGuid; // 0x10(0x10)
		TArray WeaponModSlots; // 0x20(0x10)
		TArray StateValuesConstObject; // 0x30(0x10)
	};


	// Struct FortniteGame.FortItemEntryStateValueConstObject
	// Size: 0xC (0xC - 0x0)
	struct FFortItemEntryStateValueConstObject	
	{
	public:
		FGameplayTag StateType; // 0x0(0x4)
		TWeakObjectPtr ObjectData; // 0x4(0x8)
	};


	// Struct FortniteGame.FortWeaponModSlot
	// Size: 0x10 (0x10 - 0x0)
	struct FFortWeaponModSlot	
	{
	public:
		UFortWeaponModItemDefinition WeaponMod; // 0x0(0x8)
		bool bIsDynamic; // 0x8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.HotfixVolumePlacement
	// Inherited from FTableRowBase
	// Size: 0x80 (0x88 - 0x8)
	struct FHotfixVolumePlacement : public FTableRowBase	
	{
	public:
		FString Map; // 0x8(0x10)
		FVector Center; // 0x18(0x18)
		FVector Extent; // 0x30(0x18)
		FRotator Rotation; // 0x48(0x18)
		FString GameInclude; // 0x60(0x10)
		FString GameExclude; // 0x70(0x10)
		bool bNeededOnClient; // 0x80(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x81(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaStreamIdOverride
	// Size: 0x20 (0x20 - 0x0)
	struct FAthenaStreamIdOverride	
	{
	public:
		FString SourceName; // 0x0(0x10)
		FString OverriddenId; // 0x10(0x10)
	};


	// Struct FortniteGame.AthenaVehicleOverride
	// Size: 0x50 (0x50 - 0x0)
	struct FAthenaVehicleOverride	
	{
	public:
		FString RequiredCalendarEvent; // 0x0(0x10)
		TWeakObjectPtr DefaultVehicleClass; // 0x10(0x20)
		TWeakObjectPtr OverrideVehicleClass; // 0x30(0x20)
	};


	// Struct FortniteGame.ScorePlacementTable
	// Size: 0xE0 (0xE0 - 0x0)
	struct FScorePlacementTable	
	{
	public:
		TArray Solo; // 0x0(0x10)
		TArray Duos; // 0x10(0x10)
		TArray Squads; // 0x20(0x10)
		TArray FiftyFifty; // 0x30(0x10)
		TArray LargeTeam; // 0x40(0x10)
		TArray MediumTeam; // 0x50(0x10)
		TArray QuickSolo; // 0x60(0x10)
		TArray QuickDuo; // 0x70(0x10)
		TArray QuickSquad; // 0x80(0x10)
		TArray QuickLargeTeam; // 0x90(0x10)
		TArray QuickTwoTeam; // 0xA0(0x10)
		TArray QuickMediumTeam; // 0xB0(0x10)
		TArray SinglePlacement; // 0xC0(0x10)
		TArray Default; // 0xD0(0x10)
	};


	// Struct FortniteGame.HotfixComponentTagVolumePlacement
	// Inherited from FHotfixVolumePlacement -> FTableRowBase
	// Size: 0x10 (0x98 - 0x88)
	struct FHotfixComponentTagVolumePlacement : public FHotfixVolumePlacement	
	{
	public:
		TArray ComponentTags; // 0x88(0x10)
	};


	// Struct FortniteGame.GCSettingsOverride
	// Size: 0xC (0xC - 0x0)
	struct FGCSettingsOverride	
	{
	public:
		FName PlaylistName; // 0x0(0x4)
		bool bEnableGCOnServerDuringMatch; // 0x4(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
		float GCFrequency; // 0x8(0x4)
	};


	// Struct FortniteGame.TimeOfDayOverride
	// Size: 0xC (0xC - 0x0)
	struct FTimeOfDayOverride	
	{
	public:
		FName PlaylistName; // 0x0(0x4)
		float TimeOfDay; // 0x4(0x4)
		float TimeOfDaySpeed; // 0x8(0x4)
	};


	// Struct FortniteGame.EndOfDayRecap
	// Size: 0x20 (0x20 - 0x0)
	struct FEndOfDayRecap	
	{
	public:
		int32_t DayNumber; // 0x0(0x4)
		int32_t TeamScoreAtStartOfDay; // 0x4(0x4)
		int32_t TeamScoreAtEndOfDay; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		TArray ScoreReports; // 0x10(0x10)
	};


	// Struct FortniteGame.FortPlayerScoreReport
	// Size: 0x2B0 (0x2B0 - 0x0)
	struct FFortPlayerScoreReport	
	{
	public:
		FUniqueNetIdRepl PlayerId; // 0x0(0x30)
		FString PlayerName; // 0x30(0x10)
		TWeakObjectPtr PlayerState; // 0x40(0x8)
		TEnumAsByte PlayerTeam; // 0x48(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x49(0x3) UNKNOWN PROPERTY
		FReplicatedStatValues ReplicatedStats_Campaign; // 0x4C(0x118)
		FReplicatedStatValues ReplicatedStats_Zone; // 0x164(0x118)
		int32_t InitialLevel; // 0x27C(0x4)
		int32_t InitialExperienceAmount; // 0x280(0x4)
		FFortExperienceDelta ExperienceInfoDelta; // 0x284(0x24)
		int32_t LastExperienceDeltaAmount; // 0x2A8(0x4)
		int32_t LastScoreDeltaAmount; // 0x2AC(0x4)
	};


	// Struct FortniteGame.FortExperienceDelta
	// Size: 0x24 (0x24 - 0x0)
	struct FFortExperienceDelta	
	{
	public:
		int32_t Level; // 0x0(0x4)
		int32_t Xp; // 0x4(0x4)
		int32_t BaseXPEarned; // 0x8(0x4)
		int32_t BonusXPEarned; // 0xC(0x4)
		int32_t BoostXPEarned; // 0x10(0x4)
		int32_t BoostXPMissed; // 0x14(0x4)
		int32_t RestXPEarned; // 0x18(0x4)
		int32_t GroupBoostXPEarned; // 0x1C(0x4)
		EFortIsFinalXpUpdate IsFinalXpUpdate; // 0x20(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ReplicatedStatValues
	// Size: 0x8 (0x8 - 0x0)
	struct FReplicatedStatValues	
	{
	public:
		int32_t StatValue; // 0x0(0x4)
		int32_t ScoreValue; // 0x4(0x4)
	};


	// Struct FortniteGame.BuildingContainerDebugInfo
	// Size: 0x38 (0x38 - 0x0)
	struct FBuildingContainerDebugInfo	
	{
	public:
		FVector Location; // 0x0(0x18)
		FGameplayTagContainer LocationTags; // 0x18(0x20)
	};


	// Struct FortniteGame.GameStateLootInfo
	// Size: 0x20 (0x20 - 0x0)
	struct FGameStateLootInfo	
	{
	public:
		TArray TreasureChestSpawnInfos; // 0x0(0x10)
		TArray AmmoBoxSpawnInfos; // 0x10(0x10)
	};


	// Struct FortniteGame.FortAmmoBoxSpawnInfo
	// Size: 0xA8 (0xA8 - 0x0)
	struct FFortAmmoBoxSpawnInfo	
	{
	public:
		UClass AmmoBoxClass; // 0x0(0x8)
		FScalableFloat AmmoBoxMinSpawnPercent; // 0x8(0x28)
		FScalableFloat AmmoBoxMaxSpawnPercent; // 0x30(0x28)
		FScalableFloat GoldenPoiAmmoBoxMinSpawnPercent; // 0x58(0x28)
		FScalableFloat GoldenPoiAmmoBoxMaxSpawnPercent; // 0x80(0x28)
	};


	// Struct FortniteGame.FortTreasureChestSpawnInfo
	// Size: 0xA8 (0xA8 - 0x0)
	struct FFortTreasureChestSpawnInfo	
	{
	public:
		UClass TreasureChestClass; // 0x0(0x8)
		FScalableFloat TreasureChestMinSpawnPercent; // 0x8(0x28)
		FScalableFloat TreasureChestMaxSpawnPercent; // 0x30(0x28)
		FScalableFloat GoldenPoiTreasureChestMinSpawnPercent; // 0x58(0x28)
		FScalableFloat GoldenPoiTreasureChestMaxSpawnPercent; // 0x80(0x28)
	};


	// Struct FortniteGame.AppliedHomebaseData
	// Size: 0x30 (0x30 - 0x0)
	struct FAppliedHomebaseData	
	{
	public:
		TWeakObjectPtr Source; // 0x0(0x8)
		TWeakObjectPtr Target; // 0x8(0x8)
		TArray AppliedEffects; // 0x10(0x10)
		TArray AppliedAbilitySets; // 0x20(0x10)
	};


	// Struct FortniteGame.FortAbilitySetHandle
	// Size: 0x38 (0x38 - 0x0)
	struct FFortAbilitySetHandle	
	{
	public:
		TWeakObjectPtr TargetAbilitySystemComponent; // 0x0(0x8)
		TArray GrantedAbilityHandles; // 0x8(0x10)
		TArray AppliedEffectHandles; // 0x18(0x10)
		TArray ItemGuidsForAdditionalItems; // 0x28(0x10)
	};


	// Struct FortniteGame.TeamChangeRequest
	// Size: 0x10 (0x10 - 0x0)
	struct FTeamChangeRequest	
	{
	public:
		AFortPlayerController RequestingController; // 0x0(0x8)
		char DesiredTeam; // 0x8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.OnTimeHitInfo
	// Size: 0x40 (0x40 - 0x0)
	struct FOnTimeHitInfo	
	{
	public:
		FDelegateProperty TimeCallback; // 0x0(0xC)
		unsigned char UnknownData01_7[0x34]; // 0xC(0x34) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AdditionalLevelStreamed
	// Size: 0x8 (0x8 - 0x0)
	struct FAdditionalLevelStreamed	
	{
	public:
		FName LevelName; // 0x0(0x4)
		bool bIsServerOnly; // 0x4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.Voter
	// Size: 0x40 (0x40 - 0x0)
	struct FVoter	
	{
	public:
		int32_t VoteDecision; // 0x0(0x4)
		int32_t LastVoteDecision; // 0x4(0x4)
		FUniqueNetIdRepl NetId; // 0x8(0x30)
		int32_t NumVotesCast; // 0x38(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.TieredWaveSetData
	// Size: 0x178 (0x178 - 0x0)
	struct FTieredWaveSetData	
	{
	public:
		int32_t EDOIdx; // 0x0(0x4)
		float BreatherBetweenWaves; // 0x4(0x4)
		EWaveRules WaveRules; // 0x8(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		FGameplayTag EnemyTypeToKillMod; // 0xC(0x4)
		TArray WaveMissions; // 0x10(0x10)
		float WaveLengthMod; // 0x20(0x4)
		float NumKillsMod; // 0x24(0x4)
		float KillPointsMod; // 0x28(0x4)
		float DifficultyAddMod; // 0x2C(0x4)
		int32_t TargetNumPillarsToSpawn; // 0x30(0x4)
		bool bDeferTemporaryModifiers; // 0x34(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
		TWeakObjectPtr OverrideSpawnPointsMultiplier; // 0x38(0x20)
		TWeakObjectPtr OverrideSpawnPointsCurve; // 0x58(0x20)
		TWeakObjectPtr OverrideSpawnProgression; // 0x78(0x20)
		TWeakObjectPtr OverrideUtilitiesAdjustment; // 0x98(0x20)
		TWeakObjectPtr OverrideUtilitiesFree; // 0xB8(0x20)
		TWeakObjectPtr OverrideUtilitiesLocked; // 0xD8(0x20)
		TWeakObjectPtr OverrideDistance; // 0xF8(0x20)
		TWeakObjectPtr OverrideDirectionNumber; // 0x118(0x20)
		TWeakObjectPtr OverrideModifierTags; // 0x138(0x20)
		TWeakObjectPtr OverrideTimedModifierTags; // 0x158(0x20)
	};


	// Struct FortniteGame.ActiveGameplayModifierHandle
	// Size: 0x4 (0x4 - 0x0)
	struct FActiveGameplayModifierHandle	
	{
	public:
		int32_t Handle; // 0x0(0x4)
	};


	// Struct FortniteGame.FortVoteConfig
	// Size: 0x14 (0x14 - 0x0)
	struct FFortVoteConfig	
	{
	public:
		int32_t NumVoteOptions; // 0x0(0x4)
		float VoteDuration; // 0x4(0x4)
		float FailedVoteLockOutDuration; // 0x8(0x4)
		int32_t MaxVotesAllowedPerPlayer; // 0xC(0x4)
		EFortVoteArbitratorType VoteArbitratorType; // 0x10(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAIDirectorEvent
	// Size: 0x20 (0x20 - 0x0)
	struct FFortAIDirectorEvent	
	{
	public:
		EFortAIDirectorEvent Event; // 0x0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UObject EventSource; // 0x8(0x8)
		UObject EventTarget; // 0x10(0x8)
		float EventValue; // 0x18(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VoteData
	// Size: 0x80 (0x80 - 0x0)
	struct FVoteData	
	{
	public:
		EFortVoteType VoteType; // 0x0(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FUniqueNetIdRepl VoteInstigatorNetId; // 0x8(0x30)
		FFortVoteConfig VoteConfig; // 0x38(0x14)
		float VoteStartTime; // 0x4C(0x4)
		float VoteEndTime; // 0x50(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		TArray Voters; // 0x58(0x10)
		int32_t NumVotersWithMaxVotes; // 0x68(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		FTimerHandle EndVoteTimerHandle; // 0x70(0x8)
		EFortVoteStatus VoteStatus; // 0x78(0x1)
		unsigned char UnknownData07_7[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlayerBuildableClassContainer
	// Size: 0x10 (0x10 - 0x0)
	struct FPlayerBuildableClassContainer	
	{
	public:
		TArray BuildingClasses; // 0x0(0x10)
	};


	// Struct FortniteGame.ManagedValidationArray
	// Inherited from FFastArraySerializer
	// Size: 0x18 (0x120 - 0x108)
	struct FManagedValidationArray : public FFastArraySerializer	
	{
	public:
		TArray Items; // 0x108(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x118(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ManagedValidationItem
	// Inherited from FFastArraySerializerItem
	// Size: 0x24 (0x30 - 0xC)
	struct FManagedValidationItem : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData01_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		TArray ItemId; // 0x10(0x10)
		TArray Payload; // 0x20(0x10)
	};


	// Struct FortniteGame.FortZoneMissionAlertData
	// Size: 0x30 (0x30 - 0x0)
	struct FFortZoneMissionAlertData	
	{
	public:
		TArray MissionAlertRewards; // 0x0(0x10)
		FString MissionAlertCategoryName; // 0x10(0x10)
		FString MissionAlertID; // 0x20(0x10)
	};


	// Struct FortniteGame.FortItemQuantityPair
	// Size: 0xC (0xC - 0x0)
	struct FFortItemQuantityPair	
	{
	public:
		FPrimaryAssetId ItemPrimaryAssetId; // 0x0(0x8)
		int32_t Quantity; // 0x8(0x4)
	};


	// Struct FortniteGame.FortZoneDifficultyIncreaseRewardData
	// Size: 0x10 (0x10 - 0x0)
	struct FFortZoneDifficultyIncreaseRewardData	
	{
	public:
		TArray Rewards; // 0x0(0x10)
	};


	// Struct FortniteGame.ActiveGameplayModifierArray
	// Inherited from FFastArraySerializer
	// Size: 0x28 (0x130 - 0x108)
	struct FActiveGameplayModifierArray : public FFastArraySerializer	
	{
	public:
		TArray Items; // 0x108(0x10)
		TArray DeferredGameplayModifiers; // 0x118(0x10)
		int32_t ModifierHandleGenerator; // 0x128(0x4)
		bool bSupportRuntimeModifierShutdown; // 0x12C(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x12D(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ActiveGameplayModifier
	// Inherited from FFastArraySerializerItem
	// Size: 0xCC (0xD8 - 0xC)
	struct FActiveGameplayModifier : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData03_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UFortGameplayModifierItemDefinition ModifierDef; // 0x10(0x8)
		FActiveGameplayModifierHandle ModifierHandle; // 0x18(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		TArray Mutators; // 0x20(0x10)
		int32_t Expiration; // 0x30(0x4)
		unsigned char UnknownData05_7[0xA4]; // 0x34(0xA4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ReplicatedMontageMap
	// Size: 0x18 (0x18 - 0x0)
	struct FReplicatedMontageMap	
	{
	public:
		TArray Mappings; // 0x0(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x10(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ReplicatedMontageIndexPair
	// Size: 0x10 (0x10 - 0x0)
	struct FReplicatedMontageIndexPair	
	{
	public:
		UAnimMontage Montage; // 0x0(0x8)
		int32_t Index; // 0x8(0x4)
		unsigned char UnknownData01_7[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.EvaluationResult
	// Size: 0x28 (0x28 - 0x0)
	struct FEvaluationResult	
	{
	public:
		bool bSucceeded; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FString ErrorCode; // 0x8(0x10)
		FText ErrorMessage; // 0x18(0x10)
	};


	// Struct FortniteGame.DBNOCustomSettings
	// Size: 0x40 (0x40 - 0x0)
	struct FDBNOCustomSettings	
	{
	public:
		EDBNOMutatorType Enabled; // 0x0(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float TenacityDepletionRate; // 0x4(0x4)
		float ReviveHealthPercentage; // 0x8(0x4)
		bool bAllowRevives; // 0xC(0x1)
		bool bAllowCarry; // 0xD(0x1)
		unsigned char UnknownData08_6[0x2]; // 0xE(0x2) UNKNOWN PROPERTY
		float TimeToRevive; // 0x10(0x4)
		bool bAlertTeam; // 0x14(0x1)
		bool LastManStandingMode; // 0x15(0x1)
		bool bAllowInterrogation; // 0x16(0x1)
		bool bAllowInterrogationReveal; // 0x17(0x1)
		int32_t SelectedTeam; // 0x18(0x4)
		bool bTeamAffectsAllButSelected; // 0x1C(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
		int32_t SelectedClass; // 0x20(0x4)
		bool bClassAffectsAllButSelected; // 0x24(0x1)
		ETenacityType TenacityType; // 0x25(0x1)
		unsigned char UnknownData10_6[0x2]; // 0x26(0x2) UNKNOWN PROPERTY
		float TenacityAmount; // 0x28(0x4)
		bool bOverrideInvincibilityTime; // 0x2C(0x1)
		unsigned char UnknownData11_6[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
		float DownedInvincibilityTime; // 0x30(0x4)
		bool bAllowDecayAndReset; // 0x34(0x1)
		unsigned char UnknownData12_6[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
		float ReviveProgressDecayMulti; // 0x38(0x4)
		bool bEndClientLerpWhenReviveInterrupted; // 0x3C(0x1)
		unsigned char UnknownData13_7[0x3]; // 0x3D(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlayersLeft
	// Size: 0xC (0xC - 0x0)
	struct FPlayersLeft	
	{
	public:
		int32_t Humans; // 0x0(0x4)
		int32_t Bots; // 0x4(0x4)
		int32_t Total; // 0x8(0x4)
	};


	// Struct FortniteGame.TotalPlayers
	// Size: 0xC (0xC - 0x0)
	struct FTotalPlayers	
	{
	public:
		int32_t Humans; // 0x0(0x4)
		int32_t Bots; // 0x4(0x4)
		int32_t Total; // 0x8(0x4)
	};


	// Struct FortniteGame.MeshNetworkStatus
	// Size: 0x3 (0x3 - 0x0)
	struct FMeshNetworkStatus	
	{
	public:
		bool bEnabled; // 0x0(0x1)
		bool bConnectedToRoot; // 0x1(0x1)
		EMeshNetworkNodeType GameServerNodeType; // 0x2(0x1)
	};


	// Struct FortniteGame.GameplayMutatorObjectDataArray
	// Inherited from FFastArraySerializer
	// Size: 0x10 (0x118 - 0x108)
	struct FGameplayMutatorObjectDataArray : public FFastArraySerializer	
	{
	public:
		TArray ObjectDataList; // 0x108(0x10)
	};


	// Struct FortniteGame.GameplayMutatorObjectData
	// Inherited from FFastArraySerializerItem
	// Size: 0x1C (0x28 - 0xC)
	struct FGameplayMutatorObjectData : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData02_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UObject TheObject; // 0x10(0x8)
		int32_t ObjectId; // 0x18(0x4)
		int32_t ObjectValue1; // 0x1C(0x4)
		int32_t ObjectValue2; // 0x20(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.GameplayMutatorEventData
	// Size: 0x10 (0x10 - 0x0)
	struct FGameplayMutatorEventData	
	{
	public:
		int32_t EventId; // 0x0(0x4)
		int32_t EventParam1; // 0x4(0x4)
		int32_t EventParam2; // 0x8(0x4)
		int32_t EventParam3; // 0xC(0x4)
	};


	// Struct FortniteGame.PlaylistPropertyArray
	// Inherited from FFastArraySerializer
	// Size: 0xE0 (0x1E8 - 0x108)
	struct FPlaylistPropertyArray : public FFastArraySerializer	
	{
	public:
		TArray PropertyOverrides; // 0x108(0x10)
		int32_t PlaylistReplicationKey; // 0x118(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x11C(0x4) UNKNOWN PROPERTY
		UFortPlaylistAthena BasePlaylist; // 0x120(0x8)
		UFortPlaylistAthena OverridePlaylist; // 0x128(0x8)
		TMap PropertyOverrideScopes; // 0x130(0x50)
		unsigned char UnknownData03_7[0x68]; // 0x180(0x68) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PropertyOverrideScope
	// Size: 0x10 (0x10 - 0x0)
	struct FPropertyOverrideScope	
	{
	public:
		TArray PropertyOverrides; // 0x0(0x10)
	};


	// Struct FortniteGame.PropertyOverride
	// Inherited from FFastArraySerializerItem
	// Size: 0x34 (0x40 - 0xC)
	struct FPropertyOverride : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData01_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FString PropertyScope; // 0x10(0x10)
		FString PropertyName; // 0x20(0x10)
		FString PropertyData; // 0x30(0x10)
	};


	// Struct FortniteGame.AIPawnCustomizationPreloadData
	// Size: 0x10 (0x10 - 0x0)
	struct FAIPawnCustomizationPreloadData	
	{
	public:
		float Priority; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UFortAIPawnCustomizationDefinition Customization; // 0x8(0x8)
	};


	// Struct FortniteGame.AICharacterPartsPreloadData
	// Size: 0x10 (0x10 - 0x0)
	struct FAICharacterPartsPreloadData	
	{
	public:
		float Priority; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UCustomCharacterPart CharacterPart; // 0x8(0x8)
	};


	// Struct FortniteGame.DynamicLandData
	// Size: 0xE0 (0xE0 - 0x0)
	struct FDynamicLandData	
	{
	public:
		FName Name; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector WorldPosition; // 0x8(0x18)
		float Rotation; // 0x20(0x4)
		unsigned char UnknownData03_6[0xC]; // 0x24(0xC) UNKNOWN PROPERTY
		FSlateBrush LandBrush; // 0x30(0xB0)
	};


	// Struct FortniteGame.GameMemberInfoArray
	// Inherited from FFastArraySerializer
	// Size: 0x18 (0x120 - 0x108)
	struct FGameMemberInfoArray : public FFastArraySerializer	
	{
	public:
		TArray Members; // 0x108(0x10)
		AFortGameStateAthena OwningGameState; // 0x118(0x8)
	};


	// Struct FortniteGame.GameMemberInfo
	// Inherited from FFastArraySerializerItem
	// Size: 0x34 (0x40 - 0xC)
	struct FGameMemberInfo : public FFastArraySerializerItem	
	{
	public:
		char SquadID; // 0xC(0x1)
		char TeamIndex; // 0xD(0x1)
		unsigned char UnknownData01_6[0x2]; // 0xE(0x2) UNKNOWN PROPERTY
		FUniqueNetIdRepl MemberUniqueId; // 0x10(0x30)
	};


	// Struct FortniteGame.FortWinnerPlayerData
	// Size: 0x4 (0x4 - 0x0)
	struct FFortWinnerPlayerData	
	{
	public:
		int32_t PlayerId; // 0x0(0x4)
	};


	// Struct FortniteGame.FortItemEntry
	// Inherited from FFastArraySerializerItem
	// Size: 0x19C (0x1A8 - 0xC)
	struct FFortItemEntry : public FFastArraySerializerItem	
	{
	public:
		int32_t Count; // 0xC(0x4)
		int32_t PreviousCount; // 0x10(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		UItemDefinitionBase ItemDefinition; // 0x18(0x8)
		int16_t OrderIndex; // 0x20(0x2)
		bool inventory_overflow_date : 1; // 0x22:0(0x1)
		bool bWasGifted : 1; // 0x22:1(0x1)
		bool bIsReplicatedCopy : 1; // 0x22:2(0x1)
		bool bIsDirty : 1; // 0x22:3(0x1)
		bool bUpdateStatsOnCollection : 1; // 0x22:4(0x1)
		unsigned char UnknownData04_5[0x1]; // 0x23(0x1) UNKNOWN PROPERTY
		float Durability; // 0x24(0x4)
		int32_t Level; // 0x28(0x4)
		int32_t LoadedAmmo; // 0x2C(0x4)
		int32_t PhantomReserveAmmo; // 0x30(0x4)
		int32_t PickupVariantIndex; // 0x34(0x4)
		TArray AlterationDefinitions; // 0x38(0x10)
		TArray SavedWeaponModSlots; // 0x48(0x10)
		FString ItemSource; // 0x58(0x10)
		FGuid ItemGuid; // 0x68(0x10)
		FGuid TrackerGuid; // 0x78(0x10)
		FGuid ItemVariantGuid; // 0x88(0x10)
		FDateTime DurabilityCooldownStartTime; // 0x98(0x8)
		FFortGiftingInfo GiftingInfo; // 0xA0(0x28)
		TArray StateValues; // 0xC8(0x10)
		TArray StateValuesConstObject; // 0xD8(0x10)
		TWeakObjectPtr ParentInventory; // 0xE8(0x8)
		FGameplayAbilitySpecHandle GameplayAbilitySpecHandle; // 0xF0(0x4)
		int32_t ItemVariantDataMappingIndex; // 0xF4(0x4)
		TArray AlterationInstances; // 0xF8(0x10)
		TArray WeaponModSlots; // 0x108(0x10)
		TWeakObjectPtr WrapOverride; // 0x118(0x20)
		TArray GenericAttributeValues; // 0x138(0x10)
		TArray CustomItemData; // 0x148(0x10)
		unsigned char UnknownData05_7[0x50]; // 0x158(0x50) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCustomItemData
	// Size: 0x8 (0x8 - 0x0)
	struct FFortCustomItemData	
	{
	public:
		FGameplayTag DataTag; // 0x0(0x4)
		float Value; // 0x4(0x4)
	};


	// Struct FortniteGame.FortItemEntryStateValue
	// Size: 0xC (0xC - 0x0)
	struct FFortItemEntryStateValue	
	{
	public:
		int32_t IntValue; // 0x0(0x4)
		FName NameValue; // 0x4(0x4)
		TEnumAsByte StateType; // 0x8(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGiftingInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FFortGiftingInfo	
	{
	public:
		FString PlayerName; // 0x0(0x10)
		UFortHeroType HeroType; // 0x10(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x18(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortSavedWeaponModSlot
	// Size: 0x18 (0x18 - 0x0)
	struct FFortSavedWeaponModSlot	
	{
	public:
		FString WeaponModTemplateID; // 0x0(0x10)
		bool bIsDynamic; // 0x10(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CosmeticVariantInfo
	// Size: 0x8 (0x8 - 0x0)
	struct FCosmeticVariantInfo	
	{
	public:
		FGameplayTag VariantChannelTag; // 0x0(0x4)
		FGameplayTag ActiveVariantTag; // 0x4(0x4)
	};


	// Struct FortniteGame.McpVariantChannelInfo
	// Inherited from FCosmeticVariantInfo
	// Size: 0x38 (0x40 - 0x8)
	struct FMcpVariantChannelInfo : public FCosmeticVariantInfo	
	{
	public:
		FGameplayTagContainer OwnedVariantTags; // 0x8(0x20)
		UItemDefinitionBase ItemVariantIsUsedFor; // 0x28(0x8)
		FString CustomData; // 0x30(0x10)
	};


	// Struct FortniteGame.ChoiceData
	// Size: 0x28 (0x28 - 0x0)
	struct FChoiceData	
	{
	public:
		int32_t MenuIdentifier; // 0x0(0x4)
		bool bShowCloseButton; // 0x4(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
		FText Title; // 0x8(0x10)
		TArray Items; // 0x18(0x10)
	};


	// Struct FortniteGame.ChoiceDataEntry
	// Size: 0x38 (0x38 - 0x0)
	struct FChoiceDataEntry	
	{
	public:
		FText ButtonText; // 0x0(0x10)
		FText ButtonDescription; // 0x10(0x10)
		FText ConfirmText; // 0x20(0x10)
		bool bEnabled; // 0x30(0x1)
		bool bRequireConfirmation; // 0x31(0x1)
		bool bCloseAfterSelection; // 0x32(0x1)
		unsigned char UnknownData01_7[0x5]; // 0x33(0x5) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AttributeModifierInfo
	// Size: 0x20 (0x20 - 0x0)
	struct FAttributeModifierInfo	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		UGameplayEffect InstantGEs; // 0x8(0x8)
		unsigned char UnknownData03_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BuildingWeakSpotData
	// Size: 0x50 (0x50 - 0x0)
	struct FBuildingWeakSpotData	
	{
	public:
		TWeakObjectPtr ParentObject; // 0x0(0x8)
		FVector_NetQuantizeNormal Normal; // 0x8(0x18)
		FVector_NetQuantize10 Position; // 0x20(0x18)
		int32_t HitCount; // 0x38(0x4)
		unsigned char UnknownData01_7[0x14]; // 0x3C(0x14) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VoiceChatDistanceAttenuationSettings
	// Size: 0xA0 (0xA0 - 0x0)
	struct FVoiceChatDistanceAttenuationSettings	
	{
	public:
		FVector2D DistanceRange; // 0x0(0x10)
		FRuntimeFloatCurve AttenuationCurve; // 0x10(0x88)
		float AttenuationDbAtMaxRange; // 0x98(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x9C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortRequirementsInfo
	// Size: 0x60 (0x60 - 0x0)
	struct FFortRequirementsInfo	
	{
	public:
		int32_t CommanderLevel; // 0x0(0x4)
		int32_t PersonalPowerRating; // 0x4(0x4)
		int32_t MaxPersonalPowerRating; // 0x8(0x4)
		int32_t PartyPowerRating; // 0xC(0x4)
		int32_t MaxPartyPowerRating; // 0x10(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TArray ActiveQuestDefinitions; // 0x18(0x10)
		UFortQuestItemDefinition QuestDefinition; // 0x28(0x8)
		FDataTableRowHandle ObjectiveStatHandle; // 0x30(0x10)
		UFortQuestItemDefinition UncompletedQuestDefinition; // 0x40(0x8)
		UFortItemDefinition ItemDefinition; // 0x48(0x8)
		FString EventFlag; // 0x50(0x10)
	};


	// Struct FortniteGame.CreateBuildingActorData
	// Size: 0x50 (0x50 - 0x0)
	struct FCreateBuildingActorData	
	{
	public:
		uint32_t BuildingClassHandle; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector_NetQuantize10 BuildLoc; // 0x8(0x18)
		FRotator BuildRot; // 0x20(0x18)
		bool bMirrored; // 0x38(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float SyncKey; // 0x3C(0x4)
		FBuildingClassData BuildingClassData; // 0x40(0x10)
	};


	// Struct FortniteGame.BuildingClassData
	// Size: 0x10 (0x10 - 0x0)
	struct FBuildingClassData	
	{
	public:
		UClass BuildingClass; // 0x0(0x8)
		int32_t PreviousBuildingLevel; // 0x8(0x4)
		char UpgradeLevel; // 0xC(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortRebootEligiblePartyFriendInfo
	// Size: 0x38 (0x38 - 0x0)
	struct FFortRebootEligiblePartyFriendInfo	
	{
	public:
		FUniqueNetIdRepl UserId; // 0x0(0x30)
		bool bIsPlatformFriend; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGameplayEventContainer
	// Size: 0x18 (0x18 - 0x0)
	struct FFortGameplayEventContainer	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		TArray EventRefs; // 0x8(0x10)
	};


	// Struct FortniteGame.FortGameplayEventReference
	// Size: 0x28 (0x28 - 0x0)
	struct FFortGameplayEventReference	
	{
	public:
		FFortGameplayEventObjectHandle ObjectHandle; // 0x0(0x20)
		EFortGameplayEventReferenceType EventRefType; // 0x20(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		FName EventRefMemberName; // 0x24(0x4)
	};


	// Struct FortniteGame.FortGameplayEventObjectHandle
	// Size: 0x20 (0x20 - 0x0)
	struct FFortGameplayEventObjectHandle	
	{
	public:
		FSoftObjectPath ObjectRef; // 0x0(0x18)
		int32_t ObjectTrackingGUID; // 0x18(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGameplayEventContainer_Named
	// Inherited from FFortGameplayEventContainer
	// Size: 0x8 (0x20 - 0x18)
	struct FFortGameplayEventContainer_Named : public FFortGameplayEventContainer	
	{
	public:
		FName EventName; // 0x18(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortPickupTossOverrideData
	// Size: 0x10 (0x10 - 0x0)
	struct FFortPickupTossOverrideData	
	{
	public:
		bool bIsValid; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float MinTossDist; // 0x4(0x4)
		float MaxTossDist; // 0x8(0x4)
		float SpawnDirectionConeHalfAngle; // 0xC(0x4)
	};


	// Struct FortniteGame.FortMcpCollectedItemProperties
	// Size: 0x48 (0x48 - 0x0)
	struct FFortMcpCollectedItemProperties	
	{
	public:
		FString VariantTag; // 0x0(0x10)
		TArray ContextTags; // 0x10(0x10)
		FJsonObjectWrapper Properties; // 0x20(0x20)
		EFortCollectedState SeenState; // 0x40(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x41(0x3) UNKNOWN PROPERTY
		int32_t Count; // 0x44(0x4)
	};


	// Struct FortniteGame.CompositeBool
	// Size: 0x18 (0x18 - 0x0)
	struct FCompositeBool	
	{
	public:
		bool bDefaultValue; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray ModifyingObjects; // 0x8(0x10)
	};


	// Struct FortniteGame.ItemVariantHandle
	// Size: 0x18 (0x18 - 0x0)
	struct FItemVariantHandle	
	{
	public:
		UItemDefinitionBase Item; // 0x0(0x8)
		FGuid ItemVariantGuid; // 0x8(0x10)
	};


	// Struct FortniteGame.LockOnInfo
	// Size: 0x50 (0x50 - 0x0)
	struct FLockOnInfo	
	{
	public:
		ELockOnState State; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		TWeakObjectPtr Weapon; // 0x4(0x8)
		TWeakObjectPtr LockOnTarget; // 0xC(0x8)
		unsigned char UnknownData03_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		FRotator CamRotAtTargetAcquisiton; // 0x18(0x18)
		FVector2D LockOnCoords; // 0x30(0x10)
		float TargetAcquisitionTime; // 0x40(0x4)
		float TargetLockOnTime; // 0x44(0x4)
		float TargetOutOfSightTime; // 0x48(0x4)
		float CooldownStartTime; // 0x4C(0x4)
	};


	// Struct FortniteGame.FortPersistentGameplayStatContainer
	// Size: 0x10 (0x10 - 0x0)
	struct FFortPersistentGameplayStatContainer	
	{
	public:
		TArray GameplayStats; // 0x0(0x10)
	};


	// Struct FortniteGame.FortPersistentGameplayStatValue
	// Size: 0x18 (0x18 - 0x0)
	struct FFortPersistentGameplayStatValue	
	{
	public:
		FString StatName; // 0x0(0x10)
		int32_t StatValue; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortUpdatedObjectiveStat
	// Size: 0x20 (0x20 - 0x0)
	struct FFortUpdatedObjectiveStat	
	{
	public:
		UFortQuestItemDefinition Quest; // 0x0(0x8)
		FName BackendName; // 0x8(0x4)
		int32_t StatValue; // 0xC(0x4)
		int32_t ShadowStatValue; // 0x10(0x4)
		int32_t StatDelta; // 0x14(0x4)
		int32_t CurrentStage; // 0x18(0x4)
		bool bSharedQuestUpdate; // 0x1C(0x1)
		bool bShowToast; // 0x1D(0x1)
		unsigned char UnknownData01_7[0x2]; // 0x1E(0x2) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortRewardReport
	// Size: 0x58 (0x58 - 0x0)
	struct FFortRewardReport	
	{
	public:
		FText MissionName; // 0x0(0x10)
		FText TheaterName; // 0x10(0x10)
		FText Difficulty; // 0x20(0x10)
		float DifficultyValue; // 0x30(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		TArray RewardActivities; // 0x38(0x10)
		bool bIsFinalized; // 0x48(0x1)
		unsigned char UnknownData03_7[0xF]; // 0x49(0xF) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortRewardActivity
	// Size: 0x68 (0x68 - 0x0)
	struct FFortRewardActivity	
	{
	public:
		TEnumAsByte ActivityType; // 0x0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FGuid ActivityGuid; // 0x4(0x10)
		unsigned char UnknownData05_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		FText TitleText; // 0x18(0x10)
		FText DescriptionText; // 0x28(0x10)
		float RewardDisplayTime; // 0x38(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
		TArray RewardItems; // 0x40(0x10)
		TArray MissedRewardItems; // 0x50(0x10)
		EFortCompletionResult ActivityCompletionResult; // 0x60(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		int32_t AdditionalCompletionMissionPoints; // 0x64(0x4)
	};


	// Struct FortniteGame.FortAthenaLoadout
	// Size: 0x130 (0x130 - 0x0)
	struct FFortAthenaLoadout	
	{
	public:
		unsigned char UnknownData03_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		FString BannerIconId; // 0x10(0x10)
		FString BannerColorId; // 0x20(0x10)
		UAthenaSkyDiveContrailItemDefinition SkyDiveContrail; // 0x30(0x8)
		UAthenaGliderItemDefinition Glider; // 0x38(0x8)
		UAthenaPickaxeItemDefinition Pickaxe; // 0x40(0x8)
		UAthenaCharacterItemDefinition Character; // 0x48(0x8)
		TArray CharacterVariantChannels; // 0x50(0x10)
		UAthenaBackpackItemDefinition Backpack; // 0x60(0x8)
		UAthenaLoadingScreenItemDefinition LoadingScreen; // 0x68(0x8)
		UAthenaBattleBusItemDefinition BattleBus; // 0x70(0x8)
		TArray Dances; // 0x78(0x10)
		UAthenaMusicPackItemDefinition MusicPack; // 0x88(0x8)
		UAthenaItemWrapDefinition ItemWrapOverride; // 0x90(0x8)
		TArray ItemWraps; // 0x98(0x10)
		TArray ApparelArray; // 0xA8(0x10)
		unsigned char UnknownData04_6[0x10]; // 0xB8(0x10) UNKNOWN PROPERTY
		bool bIsDefaultCharacter; // 0xC8(0x1)
		bool bForceUpdateVariants; // 0xC9(0x1)
		unsigned char UnknownData05_7[0x66]; // 0xCA(0x66) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.QueuedItemsToDropViaPickup
	// Size: 0x20 (0x20 - 0x0)
	struct FQueuedItemsToDropViaPickup	
	{
	public:
		AFortPawn DestructionPawn; // 0x0(0x8)
		int32_t TotalNumItemsToDrop; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		TArray ItemsToDrop; // 0x10(0x10)
	};


	// Struct FortniteGame.DelayedQuickBarActionContainer
	// Inherited from FFastArraySerializer
	// Size: 0x18 (0x120 - 0x108)
	struct FDelayedQuickBarActionContainer : public FFastArraySerializer	
	{
	public:
		TArray Items; // 0x108(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x118(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.DelayedQuickBarAction
	// Inherited from FFastArraySerializerItem
	// Size: 0x2C (0x38 - 0xC)
	struct FDelayedQuickBarAction : public FFastArraySerializerItem	
	{
	public:
		uint32_t ActionId; // 0xC(0x4)
		EFortDelayedQuickBarAction Action; // 0x10(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		FGuid ItemGuid; // 0x14(0x10)
		FPrimaryAssetId ItemDefinitionAssetId; // 0x24(0x8)
		EFortQuickBars QuickBarType; // 0x2C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
		int32_t QuickBarSlot; // 0x30(0x4)
		bool bForceExecution; // 0x34(0x1)
		unsigned char UnknownData05_7[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.RecentlyRemovedQuickbarInfo
	// Size: 0x20 (0x20 - 0x0)
	struct FRecentlyRemovedQuickbarInfo	
	{
	public:
		FGuid ItemGuid; // 0x0(0x10)
		int32_t RemovedFromSlot; // 0x10(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		UItemDefinitionBase ItemDefinition; // 0x18(0x8)
	};


	// Struct FortniteGame.FortDamageNumberInfo
	// Size: 0xA8 (0xA8 - 0x0)
	struct FFortDamageNumberInfo	
	{
	public:
		FVector WorldLocation; // 0x0(0x18)
		FVector HitNormal; // 0x18(0x18)
		bool bIsCriticalDamage; // 0x30(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		int32_t Damage; // 0x34(0x4)
		EFortDamageNumberType DamageNumberType; // 0x38(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float VisualDamageScale; // 0x3C(0x4)
		EFortElementalDamageType ElementalDamageType; // 0x40(0x1)
		EStatCategory ScoreType; // 0x41(0x1)
		bool bAttachScoreNumberToPlayer; // 0x42(0x1)
		unsigned char UnknownData06_6[0x5]; // 0x43(0x5) UNKNOWN PROPERTY
		UStaticMeshComponent StaticMeshComponent; // 0x48(0x8)
		TArray MeshMIDs; // 0x50(0x10)
		float MeshMIDMoveToCameraValue; // 0x60(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x64(0x4) UNKNOWN PROPERTY
		TArray DamageNumberArray; // 0x68(0x10)
		FGameplayTagContainer DamagedActorTags; // 0x78(0x20)
		TWeakObjectPtr DamagedActor; // 0x98(0x8)
		TWeakObjectPtr DamageCauser; // 0xA0(0x8)
	};


	// Struct FortniteGame.LastBuildableState
	// Size: 0x10 (0x10 - 0x0)
	struct FLastBuildableState	
	{
	public:
		UBuildingEditModeMetadata LastBuildableMetaData; // 0x0(0x8)
		bool LastBuildableMirrored; // 0x8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		int32_t LastBuildableRotationIterations; // 0xC(0x4)
	};


	// Struct FortniteGame.AIDirectorDebugInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FAIDirectorDebugInfo	
	{
	public:
		float Timestamp; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray DebugGraphData; // 0x8(0x10)
		unsigned char UnknownData03_7[0x10]; // 0x18(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleTrickInfo
	// Size: 0x198 (0x198 - 0x0)
	struct FVehicleTrickInfo	
	{
	public:
		float LastOnGroundTime; // 0x0(0x4)
		float mCreditDisabledTime; // 0x4(0x4)
		int32_t TrickScore; // 0x8(0x4)
		unsigned char UnknownData03_6[0x90]; // 0xC(0x90) UNKNOWN PROPERTY
		int32_t TrickAxisCount; // 0x9C(0x4)
		unsigned char UnknownData04_6[0x18]; // 0xA0(0x18) UNKNOWN PROPERTY
		float AirControlsAlpha; // 0xB8(0x4)
		float AirDistance; // 0xBC(0x4)
		float AirDistanceSqrd; // 0xC0(0x4)
		float AirTime; // 0xC4(0x4)
		float AirHeight; // 0xC8(0x4)
		float TimeAtLaunch; // 0xCC(0x4)
		FVector LocationAtLaunch; // 0xD0(0x18)
		FVector ForwardVectorAtLaunch; // 0xE8(0x18)
		FVector UpVectorAtLaunch; // 0x100(0x18)
		FVector FlatForwardVectorAtLaunch; // 0x118(0x18)
		FVector PrevForwardVec; // 0x130(0x18)
		FVector PrevRightVec; // 0x148(0x18)
		FVector PrevUpVec; // 0x160(0x18)
		int32_t PeterPanCount; // 0x178(0x4)
		int32_t StoopingSquirrelCount; // 0x17C(0x4)
		bool bDidPeterPan : 1; // 0x180:0(0x1)
		bool bDidStoopingSquirrel : 1; // 0x180:1(0x1)
		bool bInAirTrick : 1; // 0x180:2(0x1)
		bool bCreditTrick : 1; // 0x180:3(0x1)
		bool bTrickDeactivated : 1; // 0x180:4(0x1)
		bool bStuckLanding : 1; // 0x180:5(0x1)
		bool bDoingRotationTrick : 1; // 0x180:6(0x1)
		unsigned char UnknownData05_7[0x17]; // 0x181(0x17) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CreativeOptionVariableBase
	// Size: 0x8 (0x8 - 0x0)
	struct FCreativeOptionVariableBase	
	{
	public:
		FGameplayTag VariableTag; // 0x0(0x4)
		int32_t Value; // 0x4(0x4)
	};


	// Struct FortniteGame.GhostModeRepData
	// Size: 0x18 (0x18 - 0x0)
	struct FGhostModeRepData	
	{
	public:
		bool bInGhostMode; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UFortWorldItemDefinition GhostModeItemDef; // 0x8(0x8)
		int32_t PreviousFocusedSlot; // 0x10(0x4)
		float TimeExitedGhostMode; // 0x14(0x4)
	};


	// Struct FortniteGame.NotificationUISettings
	// Size: 0x8 (0x8 - 0x0)
	struct FNotificationUISettings	
	{
	public:
		float DisplayTime; // 0x0(0x4)
		bool bShouldOverrideVisibilitySettings; // 0x4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.RemoteViewRotSnapshotManager
	// Size: 0x48 (0x48 - 0x0)
	struct FRemoteViewRotSnapshotManager	
	{
	public:
		int32_t BufferSize; // 0x0(0x4)
		float TimeDelay; // 0x4(0x4)
		bool bUseVariableTimeDelay; // 0x8(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		float VariableTimeDelayMultiplier; // 0xC(0x4)
		float TimeBeforeDormant; // 0x10(0x4)
		float InterpSpeedWhenNoSample; // 0x14(0x4)
		unsigned char UnknownData03_7[0x30]; // 0x18(0x30) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SavedSpectatorCameras
	// Size: 0x10 (0x10 - 0x0)
	struct FSavedSpectatorCameras	
	{
	public:
		TArray Shots; // 0x0(0x10)
	};


	// Struct FortniteGame.SavedSpectatorCameraShot
	// Size: 0x250 (0x250 - 0x0)
	struct FSavedSpectatorCameraShot	
	{
	public:
		FSavedSpectatorCameraState CameraState; // 0x0(0x210)
		bool bIsShotStart; // 0x210(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x211(0x3) UNKNOWN PROPERTY
		float Timestamp; // 0x214(0x4)
		float ShotLength; // 0x218(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x21C(0x4) UNKNOWN PROPERTY
		FString Message; // 0x220(0x10)
		FText LocalisedMessage; // 0x230(0x10)
		ECameraShotNotificationTypes NotificationType; // 0x240(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x241(0x3) UNKNOWN PROPERTY
		FNotificationUISettings MessageUISettings; // 0x244(0x8)
		unsigned char UnknownData07_7[0x4]; // 0x24C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SavedSpectatorCameraState
	// Size: 0x210 (0x210 - 0x0)
	struct FSavedSpectatorCameraState	
	{
	public:
		bool bDataIsValid; // 0x0(0x1)
		ESpectatorCameraType CameraType; // 0x1(0x1)
		unsigned char UnknownData06_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FUniqueNetIdRepl FollowedPlayerUniqueId; // 0x8(0x30)
		FUniqueNetIdRepl FocusedPlayerUniqueId; // 0x38(0x30)
		FVector FocusedActorLocation; // 0x68(0x18)
		FCameraFilmbackSettings FilmbackSettings; // 0x80(0xC)
		FCameraLensSettings LensSettings; // 0x8C(0x1C)
		FCameraFocusSettings FocusSettings; // 0xA8(0x58)
		float CurrentFocalLength; // 0x100(0x4)
		float CurrentAperture; // 0x104(0x4)
		bool bAutoFocus; // 0x108(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x109(0x3) UNKNOWN PROPERTY
		float CurrentFocusDistance; // 0x10C(0x4)
		bool bAutoExposure; // 0x110(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x111(0x3) UNKNOWN PROPERTY
		float ManualExposureBias; // 0x114(0x4)
		unsigned char UnknownData09_6[0x8]; // 0x118(0x8) UNKNOWN PROPERTY
		FTransform Transform; // 0x120(0x60)
		FRotator ControlRotation; // 0x180(0x18)
		float ThirdPersonNormalizedDistance; // 0x198(0x4)
		EThirdPersonAutoFollowMode ThirdPersonAutoFollowMode; // 0x19C(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x19D(0x3) UNKNOWN PROPERTY
		float DroneSpeedIndex; // 0x1A0(0x4)
		float DroneDutchAngle; // 0x1A4(0x4)
		float ReplayPlaybackSpeed; // 0x1A8(0x4)
		bool bNamePlatesEnabled; // 0x1AC(0x1)
		bool bDisplaySessionRank; // 0x1AD(0x1)
		bool bPlayerOutlinesEnabled; // 0x1AE(0x1)
		bool bThirdPersonCamCollide; // 0x1AF(0x1)
		bool bFollowDroneDoTest; // 0x1B0(0x1)
		bool bBattleMapIsOnTimelineMode; // 0x1B1(0x1)
		unsigned char UnknownData11_6[0x6]; // 0x1B2(0x6) UNKNOWN PROPERTY
		FNamePlateFilter NamePlatesFilter; // 0x1B8(0x58)
	};


	// Struct FortniteGame.NamePlateFilter
	// Size: 0x58 (0x58 - 0x0)
	struct FNamePlateFilter	
	{
	public:
		bool bIsSet; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TSet NamePlatesToShow; // 0x8(0x50)
	};


	// Struct FortniteGame.SavedPlayerSpectatorCameraData
	// Size: 0x50 (0x50 - 0x0)
	struct FSavedPlayerSpectatorCameraData	
	{
	public:
		TMap PlayerToCameraStateMap; // 0x0(0x50)
	};


	// Struct FortniteGame.MinigamePlayer
	// Inherited from FFastArraySerializerItem
	// Size: 0xF4 (0x100 - 0xC)
	struct FMinigamePlayer : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData06_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FUniqueNetIdRepl UniquePlayerId; // 0x10(0x30)
		bool bHasValidResetData; // 0x40(0x1)
		char ClassSlotIndex; // 0x41(0x1)
		unsigned char UnknownData07_6[0x2]; // 0x42(0x2) UNKNOWN PROPERTY
		FName MinigameClassScope; // 0x44(0x4)
		float LastClassSwitchTime; // 0x48(0x4)
		float EnteredMinigameTime; // 0x4C(0x4)
		char TeamBeforeMinigameStarted; // 0x50(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x51(0x3) UNKNOWN PROPERTY
		int32_t RoundWinCount; // 0x54(0x4)
		FVector LocationBeforeMinigameStarted; // 0x58(0x18)
		FRotator RotationBeforeMinigameStarted; // 0x70(0x18)
		bool bIsLocationBeforeGameStartedBlocked; // 0x88(0x1)
		bool bWasSkydivingBeforeMinigameStarted; // 0x89(0x1)
		bool bWasFlyingBeforeMinigameStarted; // 0x8A(0x1)
		bool bIsTeleportingOrRespawningForGameplay; // 0x8B(0x1)
		bool bIsLocalPlayer; // 0x8C(0x1)
		bool bPreparingForRespawn; // 0x8D(0x1)
		bool bLeftMatchDuringPreGame; // 0x8E(0x1)
		unsigned char UnknownData09_6[0x1]; // 0x8F(0x1) UNKNOWN PROPERTY
		AFortPlayerStartCreative ClaimedPlayerStart; // 0x90(0x8)
		bool bCanClaimedStartBeOverridden; // 0x98(0x1)
		bool bIsWaitingForPersistence; // 0x99(0x1)
		unsigned char UnknownData10_6[0x6]; // 0x9A(0x6) UNKNOWN PROPERTY
		TArray TeamAndClassSlotHistory; // 0xA0(0x10)
		FString PlayerName; // 0xB0(0x10)
		char LastPlayerTeam; // 0xC0(0x1)
		unsigned char UnknownData11_7[0x3F]; // 0xC1(0x3F) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigamePlayerTeamClassSlotPair
	// Size: 0xC (0xC - 0x0)
	struct FMinigamePlayerTeamClassSlotPair	
	{
	public:
		char TeamIndex; // 0x0(0x1)
		char ClassSlotIndex; // 0x1(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float StartTimeSeconds; // 0x4(0x4)
		float EndTimeSeconds; // 0x8(0x4)
	};


	// Struct FortniteGame.UIExtension
	// Size: 0x28 (0x28 - 0x0)
	struct FUIExtension	
	{
	public:
		EUIExtensionSlot Slot; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TWeakObjectPtr WidgetClass; // 0x8(0x20)
	};


	// Struct FortniteGame.FortMinigameStatQuery
	// Size: 0x18 (0x18 - 0x0)
	struct FFortMinigameStatQuery	
	{
	public:
		UFortMinigameStatFilter Stat; // 0x0(0x8)
		EFortMinigameStatScope Scope; // 0x8(0x1)
		bool bAnyMatch : 1; // 0x9:0(0x1)
		EFortMinigameStatOperation Operation; // 0xA(0x1)
		unsigned char UnknownData02_6[0x1]; // 0xB(0x1) UNKNOWN PROPERTY
		int32_t Value; // 0xC(0x4)
		bool bStaticCount : 1; // 0x10:0(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigameEndCondition
	// Size: 0x30 (0x30 - 0x0)
	struct FMinigameEndCondition	
	{
	public:
		FFortMinigameStatQuery StatQuery; // 0x0(0x18)
		EMinigameTeamListType TeamListType; // 0x18(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		TArray TeamList; // 0x20(0x10)
	};


	// Struct FortniteGame.MingiameScoreboardRow
	// Size: 0x30 (0x30 - 0x0)
	struct FMingiameScoreboardRow	
	{
	public:
		FText Name; // 0x0(0x10)
		int32_t TeamColorIndex; // 0x10(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TArray Values; // 0x18(0x10)
		int32_t WinCount; // 0x28(0x4)
		bool bHighlight; // 0x2C(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigameScoreboardValue
	// Size: 0x10 (0x10 - 0x0)
	struct FMinigameScoreboardValue	
	{
	public:
		UFortMinigameStatFilter StatFilter; // 0x0(0x8)
		int32_t Value; // 0x8(0x4)
		bool bHighlight; // 0xC(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigameScoreboardBucketRow
	// Inherited from FMingiameScoreboardRow
	// Size: 0x18 (0x48 - 0x30)
	struct FMinigameScoreboardBucketRow : public FMingiameScoreboardRow	
	{
	public:
		int32_t Standing; // 0x30(0x4)
		int32_t BucketIndex; // 0x34(0x4)
		TArray PlayerRows; // 0x38(0x10)
	};


	// Struct FortniteGame.MinigameScoreboardPlayerRow
	// Inherited from FMingiameScoreboardRow
	// Size: 0x10 (0x40 - 0x30)
	struct FMinigameScoreboardPlayerRow : public FMingiameScoreboardRow	
	{
	public:
		AFortPlayerState PlayerState; // 0x30(0x8)
		bool bHasLeftGame; // 0x38(0x1)
		bool bHideFromDisplay; // 0x39(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x3A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigameStatRow
	// Size: 0x40 (0x40 - 0x0)
	struct FMinigameStatRow	
	{
	public:
		FText PlayerName; // 0x0(0x10)
		int32_t TeamColorIndex; // 0x10(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TArray PlayerStats; // 0x18(0x10)
		TArray CumulativePlayerStats; // 0x28(0x10)
		bool bIsTeamRow; // 0x38(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlayerStartCompatibilityInfo
	// Size: 0x5 (0x5 - 0x0)
	struct FPlayerStartCompatibilityInfo	
	{
	public:
		bool bIsCompatible; // 0x0(0x1)
		bool bDoesAllowAnyTeam; // 0x1(0x1)
		bool bIsMatchingTeam; // 0x2(0x1)
		bool bDoesAllowAnyClass; // 0x3(0x1)
		bool bIsMatchingClass; // 0x4(0x1)
	};


	// Struct FortniteGame.SpatialGamePlayActorLoadingStateUpdatedContext
	// Size: 0x10 (0x10 - 0x0)
	struct FSpatialGamePlayActorLoadingStateUpdatedContext	
	{
	public:
		AActor SpatialGameplayInterfaceActor; // 0x0(0x8)
		ESpatialLoadingState State; // 0x8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigamePlayerPersistentStartPoint
	// Size: 0x80 (0x80 - 0x0)
	struct FMinigamePlayerPersistentStartPoint	
	{
	public:
		FVector Location; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FQuat Rotation; // 0x20(0x20)
		FUniqueNetIdRepl UniqueID; // 0x40(0x30)
		bool bConsumed; // 0x70(0x1)
		unsigned char UnknownData03_7[0xF]; // 0x71(0xF) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigamePlayerBucket
	// Size: 0x48 (0x48 - 0x0)
	struct FMinigamePlayerBucket	
	{
	public:
		char TeamIdAtGameStart; // 0x0(0x1)
		char TeamIdAtRoundStart; // 0x1(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float DesiredTeamSizePercent; // 0x4(0x4)
		unsigned char UnknownData03_6[0x30]; // 0x8(0x30) UNKNOWN PROPERTY
		TArray PlayerIds; // 0x38(0x10)
	};


	// Struct FortniteGame.MinigamePostGameSettings
	// Size: 0x88 (0x88 - 0x0)
	struct FMinigamePostGameSettings	
	{
	public:
		EMinigameGameEndPostGameType PostGameType; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float PostGameDelay; // 0x4(0x4)
		bool bCustomShowScoreboard; // 0x8(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		FMinigamePostGameAnimationSettings VictoryAnimationSettings; // 0x10(0x28)
		FMinigamePostGameAnimationSettings DefeatAnimationSettings; // 0x38(0x28)
		FMinigamePostGameAnimationSettings TieAnimationSettings; // 0x60(0x28)
	};


	// Struct FortniteGame.MinigamePostGameAnimationSettings
	// Size: 0x28 (0x28 - 0x0)
	struct FMinigamePostGameAnimationSettings	
	{
	public:
		EMinigameGameEndCustomPostGameAnimationStyle Style; // 0x0(0x1)
		EMinigameGameEndCustomPostGameAnimationColorSet ColorSet; // 0x1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FText Text; // 0x8(0x10)
		FText SubText; // 0x18(0x10)
	};


	// Struct FortniteGame.FortMinigameTimes
	// Size: 0x14 (0x14 - 0x0)
	struct FFortMinigameTimes	
	{
	public:
		float SetupTime; // 0x0(0x4)
		float WarmupTime; // 0x4(0x4)
		float StartTime; // 0x8(0x4)
		float EndTime; // 0xC(0x4)
		float ResetTime; // 0x10(0x4)
	};


	// Struct FortniteGame.MinigameClassSlot
	// Size: 0x40 (0x40 - 0x0)
	struct FMinigameClassSlot	
	{
	public:
		char ClassSlotIndex; // 0x0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FText ClassName; // 0x8(0x10)
		FText ClassDescription; // 0x18(0x10)
		bool bVisibleInUI; // 0x28(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		TArray InventoryItems; // 0x30(0x10)
	};


	// Struct FortniteGame.MinigameTeam
	// Size: 0x80 (0x80 - 0x0)
	struct FMinigameTeam	
	{
	public:
		char TeamIndex; // 0x0(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FText TeamName; // 0x8(0x10)
		FText TeamDescription; // 0x18(0x10)
		int32_t TeamColorIndex; // 0x28(0x4)
		int32_t MaxInitTeamSize; // 0x2C(0x4)
		int32_t InitTeamSizeWeight; // 0x30(0x4)
		bool bHasBucketAvailable; // 0x34(0x1)
		char EliminatedCount; // 0x35(0x1)
		char TeamSize; // 0x36(0x1)
		unsigned char UnknownData04_6[0x1]; // 0x37(0x1) UNKNOWN PROPERTY
		FCreativeIconOption TeamIcon; // 0x38(0x40)
		bool bUseTeamScore; // 0x78(0x1)
		unsigned char UnknownData05_7[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CreativeIconOption
	// Size: 0x40 (0x40 - 0x0)
	struct FCreativeIconOption	
	{
	public:
		TWeakObjectPtr SmallIcon; // 0x0(0x20)
		TWeakObjectPtr LargeIcon; // 0x20(0x20)
	};


	// Struct FortniteGame.FireVolumesForMinigame
	// Size: 0x10 (0x10 - 0x0)
	struct FFireVolumesForMinigame	
	{
	public:
		AGameplayVolume FireVolume; // 0x0(0x8)
		EDeviceFireVolumeFireOption FireOption; // 0x8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigamePlayers
	// Inherited from FFastArraySerializer
	// Size: 0x18 (0x120 - 0x108)
	struct FMinigamePlayers : public FFastArraySerializer	
	{
	public:
		TArray Players; // 0x108(0x10)
		AFortMinigame Owner; // 0x118(0x8)
	};


	// Struct FortniteGame.FortPlayerDeathReport
	// Size: 0x238 (0x238 - 0x0)
	struct FFortPlayerDeathReport	
	{
	public:
		float ServerTimeForRespawn; // 0x0(0x4)
		float ServerTimeForResurrect; // 0x4(0x4)
		float LethalDamage; // 0x8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		AFortPlayerState KillerPlayerState; // 0x10(0x8)
		TWeakObjectPtr KillerPawn; // 0x18(0x8)
		float KillerHealthPercent; // 0x20(0x4)
		float KillerShieldPercent; // 0x24(0x4)
		float KillerOvershieldPercent; // 0x28(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		FFortItemEntry KillerWeapon; // 0x30(0x1A8)
		TWeakObjectPtr DamageCauser; // 0x1D8(0x8)
		bool bDroppedBackpack : 1; // 0x1E0:0(0x1)
		bool bNotifyUI : 1; // 0x1E0:1(0x1)
		unsigned char UnknownData05_5[0x7]; // 0x1E1(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer Tags; // 0x1E8(0x20)
		FVector ViewLocationAtTimeOfDeath; // 0x208(0x18)
		FRotator ViewRotationAtTimeOfDeath; // 0x220(0x18)
	};


	// Struct FortniteGame.AutorunUsageData
	// Size: 0x10 (0x10 - 0x0)
	struct FAutorunUsageData	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.HUDMessageData
	// Inherited from FAthenaGameMessageData
	// Size: 0x20 (0x68 - 0x48)
	struct FHUDMessageData : public FAthenaGameMessageData	
	{
	public:
		EHUDMessagePlacement Placement; // 0x48(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x49(0x7) UNKNOWN PROPERTY
		APlayerState PlayerState; // 0x50(0x8)
		int32_t MessageTargets; // 0x58(0x4)
		ETextTransformPolicy TextTransformPolicy; // 0x5C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x5D(0x3) UNKNOWN PROPERTY
		int32_t DisableChannel; // 0x60(0x4)
		unsigned char UnknownData05_7[0x4]; // 0x64(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortDisplayQuestUpdateData
	// Size: 0x30 (0x30 - 0x0)
	struct FFortDisplayQuestUpdateData	
	{
	public:
		FFortUpdatedObjectiveStat ObjectiveUpdated; // 0x0(0x20)
		AFortPlayerState QuestOwner; // 0x20(0x8)
		AFortPlayerState AssistingPlayer; // 0x28(0x8)
	};


	// Struct FortniteGame.GiftUINotificationInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FGiftUINotificationInfo	
	{
	public:
		TWeakObjectPtr SoftItemPtr; // 0x0(0x20)
		int32_t Count; // 0x20(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ProfileGoScenario
	// Size: 0x78 (0x78 - 0x0)
	struct FProfileGoScenario	
	{
	public:
		FString Name; // 0x0(0x10)
		FVector Position; // 0x10(0x18)
		FRotator orientation; // 0x28(0x18)
		FString OnBegin; // 0x40(0x10)
		FString OverrideCommands; // 0x50(0x10)
		FString OnEnd; // 0x60(0x10)
		bool AutoGenerated; // 0x70(0x1)
		bool SkipRunCommands; // 0x71(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x72(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortActionKeyMapping
	// Size: 0x68 (0x68 - 0x0)
	struct FFortActionKeyMapping	
	{
	public:
		FName ActionName; // 0x0(0x4)
		EFortInputActionGroup ActionGroup; // 0x4(0x1)
		ESubGame SubGameUsedIn; // 0x5(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x6(0x2) UNKNOWN PROPERTY
		FText LocalizedCategory; // 0x8(0x10)
		FText LocalizedName; // 0x18(0x10)
		FGameplayTag CategoryTag; // 0x28(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		FKey KeyBind1; // 0x30(0x18)
		FKey KeyBind2; // 0x48(0x18)
		float InputScale; // 0x60(0x4)
		bool bIsAxisMapping; // 0x64(0x1)
		unsigned char UnknownData05_7[0x3]; // 0x65(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaQuickChatActiveEntry
	// Size: 0x28 (0x28 - 0x0)
	struct FAthenaQuickChatActiveEntry	
	{
	public:
		TWeakObjectPtr Bank; // 0x0(0x8)
		TWeakObjectPtr ContextObject; // 0x8(0x8)
		int16_t ContextValue; // 0x10(0x2)
		int8_t Index; // 0x12(0x1)
		unsigned char UnknownData01_6[0x5]; // 0x13(0x5) UNKNOWN PROPERTY
		FText RequestChatText; // 0x18(0x10)
	};


	// Struct FortniteGame.AthenaRewardResult
	// Size: 0x40 (0x40 - 0x0)
	struct FAthenaRewardResult	
	{
	public:
		int32_t LevelsGained; // 0x0(0x4)
		int32_t BookLevelsGained; // 0x4(0x4)
		int32_t TotalSeasonXpGained; // 0x8(0x4)
		int32_t TotalBookXpGained; // 0xC(0x4)
		int32_t PrePenaltySeasonXpGained; // 0x10(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TArray XpMultipliers; // 0x18(0x10)
		TArray Rewards; // 0x28(0x10)
		float AntiAddictionMultiplier; // 0x38(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaAwardGroup
	// Size: 0x28 (0x28 - 0x0)
	struct FAthenaAwardGroup	
	{
	public:
		ERewardSource RewardSource; // 0x0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray Items; // 0x8(0x10)
		int32_t Score; // 0x18(0x4)
		float SeasonXp; // 0x1C(0x4)
		int32_t BookXp; // 0x20(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaMatchXpMultiplierGroup
	// Size: 0x8 (0x8 - 0x0)
	struct FAthenaMatchXpMultiplierGroup	
	{
	public:
		EAthenaMatchXpMultiplierSource Source; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		int32_t Amount; // 0x4(0x4)
	};


	// Struct FortniteGame.AthenaMatchStats
	// Size: 0xE8 (0xE8 - 0x0)
	struct FAthenaMatchStats	
	{
	public:
		FString StatBucket; // 0x0(0x10)
		FString MatchID; // 0x10(0x10)
		FString MatchEndTime; // 0x20(0x10)
		FString MatchPlatform; // 0x30(0x10)
		int32_t Stats; // 0x40(0x50)
		TArray WeaponStats; // 0x90(0x10)
		TArray XPStats; // 0xA0(0x10)
		FDynamicXpProfileStats DynamicXp; // 0xB0(0x24)
		bool bIsValid; // 0xD4(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD5(0x3) UNKNOWN PROPERTY
		FString FactionTag; // 0xD8(0x10)
	};


	// Struct FortniteGame.DynamicXpProfileStats
	// Size: 0x24 (0x24 - 0x0)
	struct FDynamicXpProfileStats	
	{
	public:
		float Timespan; // 0x0(0x4)
		int32_t BucketXp; // 0x4(0x4)
		int32_t BankXp; // 0x8(0x4)
		float BankXpMult; // 0xC(0x4)
		int32_t BoosterBucketXp; // 0x10(0x4)
		float BoosterXpMult; // 0x14(0x4)
		float DailyExcessXpMult; // 0x18(0x4)
		int32_t CurrentDayXp; // 0x1C(0x4)
		int32_t CurrentDay; // 0x20(0x4)
	};


	// Struct FortniteGame.AthenaXPStats
	// Size: 0x10 (0x10 - 0x0)
	struct FAthenaXPStats	
	{
	public:
		FName Stat; // 0x0(0x4)
		int32_t Count; // 0x4(0x4)
		int32_t GainedXP; // 0x8(0x4)
		EFortAccoladeSubtype Subtype; // 0xC(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaWeaponStats
	// Size: 0x80 (0x80 - 0x0)
	struct FAthenaWeaponStats	
	{
	public:
		FString WeaponId; // 0x0(0x10)
		int32_t Stats; // 0x10(0x6C)
		unsigned char UnknownData01_7[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlayerStateEncryptionKey
	// Size: 0x10 (0x10 - 0x0)
	struct FPlayerStateEncryptionKey	
	{
	public:
		TArray Key; // 0x0(0x10)
	};


	// Struct FortniteGame.AthenaMatchTeamStats
	// Size: 0x8 (0x8 - 0x0)
	struct FAthenaMatchTeamStats	
	{
	public:
		int32_t Place; // 0x0(0x4)
		int32_t TotalPlayers; // 0x4(0x4)
	};


	// Struct FortniteGame.AsyncTaskResult
	// Size: 0x28 (0x28 - 0x0)
	struct FAsyncTaskResult	
	{
	public:
		bool bSucceeded; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FString ErrorCode; // 0x8(0x10)
		FText ErrorMessage; // 0x18(0x10)
	};


	// Struct FortniteGame.DuelOverlayData
	// Size: 0x68 (0x68 - 0x0)
	struct FDuelOverlayData	
	{
	public:
		FText ChallengerName; // 0x0(0x10)
		FText ChallengedNPCName; // 0x10(0x10)
		TWeakObjectPtr ChallengerSocialAvatarBrushPtr; // 0x20(0x20)
		TWeakObjectPtr ChallengedNPCSocialAvatarBrushPtr; // 0x40(0x20)
		UItemDefinitionBase ChallengedNPCLootDef; // 0x60(0x8)
	};


	// Struct FortniteGame.FortWorldMarkerData
	// Inherited from FFastArraySerializerItem
	// Size: 0xDC (0xE8 - 0xC)
	struct FFortWorldMarkerData : public FFastArraySerializerItem	
	{
	public:
		FMarkerID MarkerID; // 0xC(0x8)
		unsigned char UnknownData06_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		AFortPlayerState Owner; // 0x18(0x8)
		EFortWorldMarkerType MarkerType; // 0x20(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
		FVector BasePosition; // 0x28(0x18)
		FVector BasePositionOffset; // 0x40(0x18)
		FVector WorldNormal; // 0x58(0x18)
		UItemDefinitionBase ItemDefinition; // 0x70(0x8)
		int32_t ItemCount; // 0x78(0x4)
		TWeakObjectPtr MarkedActor; // 0x7C(0x8)
		unsigned char UnknownData08_6[0x4]; // 0x84(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr MarkedActorClass; // 0x88(0x20)
		unsigned char UnknownData09_6[0x4]; // 0xA8(0x4) UNKNOWN PROPERTY
		FGameplayTag MarkerTag; // 0xAC(0x4)
		PingCommandType PingCommand; // 0xB0(0x1)
		EConvertedType TargetConvertedType; // 0xB1(0x1)
		unsigned char UnknownData10_6[0x6]; // 0xB2(0x6) UNKNOWN PROPERTY
		FFortWorldMarkerConfirmationContainer ConfirmationContainer; // 0xB8(0x10)
		bool bHeldMarkerInput : 1; // 0xC8:0(0x1)
		bool bIncludeSquad : 1; // 0xC8:1(0x1)
		bool bUseHoveredMarkerDetail : 1; // 0xC8:2(0x1)
		unsigned char UnknownData11_5[0x7]; // 0xC9(0x7) UNKNOWN PROPERTY
		TArray CustomDisplayInfos; // 0xD0(0x10)
		UFortWorldMarker MarkerInstance; // 0xE0(0x8)
	};


	// Struct FortniteGame.FortWorldMarkerConfirmationContainer
	// Size: 0x10 (0x10 - 0x0)
	struct FFortWorldMarkerConfirmationContainer	
	{
	public:
		TArray Confirmations; // 0x0(0x10)
	};


	// Struct FortniteGame.FortWorldMarkerConfirmation
	// Size: 0x14 (0x14 - 0x0)
	struct FFortWorldMarkerConfirmation	
	{
	public:
		int32_t PlayerId; // 0x0(0x4)
		FLinearColor PinColor; // 0x4(0x10)
	};


	// Struct FortniteGame.FortEncounterSettings
	// Size: 0xC0 (0xC0 - 0x0)
	struct FFortEncounterSettings	
	{
	public:
		TArray ForbiddenSpawnDirections; // 0x0(0x10)
		bool bDestroyAllBuildings; // 0x10(0x1)
		bool bDestroyPlayerBuildings; // 0x11(0x1)
		bool bValidateIfPlayerIsAtSpawnLocation; // 0x12(0x1)
		bool bMustFindSpawnPoints; // 0x13(0x1)
		bool bStopIfCantFindSpawnPoint; // 0x14(0x1)
		bool bIgnoreCollisionWhenSpawningAI; // 0x15(0x1)
		bool bTrackCombatParticipation; // 0x16(0x1)
		bool bDisplayThreatVisuals; // 0x17(0x1)
		bool bCanDespawnExpiredPawns; // 0x18(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x19(0x3) UNKNOWN PROPERTY
		float BurstSpawnThreatVisualsEndDelayOverride; // 0x1C(0x4)
		int32_t NumRiftsToUseOverride; // 0x20(0x4)
		bool bUseEQSQueryToFindAISpawnLocations : 1; // 0x24:0(0x1)
		bool bRelevantForTotalAICap : 1; // 0x24:1(0x1)
		bool bEnableRecreateRift : 1; // 0x24:2(0x1)
		bool bRespawnRiftWhenRiftDead : 1; // 0x24:3(0x1)
		bool bRandomiseQueryRiftLocations : 1; // 0x24:4(0x1)
		bool bRandomiseTopQueryRiftLocations : 1; // 0x24:5(0x1)
		bool bAvoidRepeatingRiftLocations : 1; // 0x24:6(0x1)
		bool bOverrideEqsFallback : 1; // 0x24:7(0x1)
		unsigned char UnknownData05_5[0x3]; // 0x25(0x3) UNKNOWN PROPERTY
		FEncounterEnvironmentQueryInfo EqsFallbackOverride; // 0x28(0x28)
		float PreSpawnRequeryTime; // 0x50(0x4)
		float SpawnAIIntervalTime; // 0x54(0x4)
		float SpawnRiftIntervalTime; // 0x58(0x4)
		bool bSpawnFirstRiftNoDelay; // 0x5C(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x5D(0x3) UNKNOWN PROPERTY
		UEnvQuery RiftSelectionQuery; // 0x60(0x8)
		UEnvQuery RiftSlotsEQSQueryOverride; // 0x68(0x8)
		TArray ScriptedSpawnPoints; // 0x70(0x10)
		UClass RiftClassOverride; // 0x80(0x8)
		TArray WorkingScriptedSpawnPoints; // 0x88(0x10)
		int32_t EncounterGroupID; // 0x98(0x4)
		int32_t ZoneIndex; // 0x9C(0x4)
		int32_t DifficultyIndex; // 0xA0(0x4)
		float AIDespawnDistanceOverride; // 0xA4(0x4)
		bool bAIDespawnWhenTooFar; // 0xA8(0x1)
		unsigned char UnknownData07_6[0x7]; // 0xA9(0x7) UNKNOWN PROPERTY
		TArray InjectedOverrideCategories; // 0xB0(0x10)
	};


	// Struct FortniteGame.EncounterEnvironmentQueryInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FEncounterEnvironmentQueryInfo	
	{
	public:
		UEnvQuery EnvironmentQuery; // 0x0(0x8)
		TArray QueryParams; // 0x8(0x10)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool bIsDirectional; // 0x20(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MarkerID
	// Size: 0x8 (0x8 - 0x0)
	struct FMarkerID	
	{
	public:
		int32_t PlayerId; // 0x0(0x4)
		int32_t InstanceID; // 0x4(0x4)
	};


	// Struct FortniteGame.CreativePublishOptions
	// Size: 0x48 (0x48 - 0x0)
	struct FCreativePublishOptions	
	{
	public:
		FString UserTitle; // 0x0(0x10)
		FString UserDescription; // 0x10(0x10)
		TArray DescriptionTags; // 0x20(0x10)
		bool bActivateLink; // 0x30(0x1)
		bool bClearPersistentData; // 0x31(0x1)
		bool bUseLegacyPublish; // 0x32(0x1)
		unsigned char UnknownData01_6[0x5]; // 0x33(0x5) UNKNOWN PROPERTY
		FString UserLocale; // 0x38(0x10)
	};


	// Struct FortniteGame.TimeStampedPhysicsPawnState
	// Size: 0x90 (0x90 - 0x0)
	struct FTimeStampedPhysicsPawnState	
	{
	public:
		float WorldTime; // 0x0(0x4)
		unsigned char UnknownData01_6[0xC]; // 0x4(0xC) UNKNOWN PROPERTY
		FReplicatedPhysicsPawnState PhysicsPawnState; // 0x10(0x80)
	};


	// Struct FortniteGame.CreativeIslandInfo
	// Size: 0x38 (0x38 - 0x0)
	struct FCreativeIslandInfo	
	{
	public:
		FString IslandTitle; // 0x0(0x10)
		FString IslandIntroduction; // 0x10(0x10)
		FString UserLocale; // 0x20(0x10)
		bool bUseLegacyPublish; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.QuickBarEquippedItemGuids
	// Size: 0xA4 (0xA4 - 0x0)
	struct FQuickBarEquippedItemGuids	
	{
	public:
		FGuid EquippedItemGuids; // 0x0(0xA0)
		int32_t NumEnabledSlots; // 0xA0(0x4)
	};


	// Struct FortniteGame.FortPlaysetStreamingData
	// Size: 0x40 (0x40 - 0x0)
	struct FFortPlaysetStreamingData	
	{
	public:
		FName PackageName; // 0x0(0x4)
		FName UniquePackageName; // 0x4(0x4)
		FVector Location; // 0x8(0x18)
		FRotator Rotation; // 0x20(0x18)
		bool bValid : 1; // 0x38:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MinigameSpawnData
	// Size: 0x3 (0x3 - 0x0)
	struct FMinigameSpawnData	
	{
	public:
		char Team; // 0x0(0x1)
		char ClassSlot; // 0x1(0x1)
		bool bIsSet; // 0x2(0x1)
	};


	// Struct FortniteGame.CreativePlotSessionData
	// Size: 0x14 (0x14 - 0x0)
	struct FCreativePlotSessionData	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		int32_t TimesInventoryOpened; // 0x8(0x4)
		int32_t TimesIslandMenuOpened; // 0xC(0x4)
		int32_t TimesGameStarted; // 0x10(0x4)
	};


	// Struct FortniteGame.BuildingEditAnalyticEvent
	// Size: 0x20 (0x20 - 0x0)
	struct FBuildingEditAnalyticEvent	
	{
	public:
		TEnumAsByte BuildingType; // 0x0(0x1)
		TEnumAsByte ResourceType; // 0x1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FVector Location; // 0x8(0x18)
	};


	// Struct FortniteGame.BuildingStats
	// Size: 0x24 (0x24 - 0x0)
	struct FBuildingStats	
	{
	public:
		int32_t BuildingsPlaced; // 0x0(0x4)
		int32_t WallsPlaced; // 0x4(0x4)
		int32_t StairsPlaced; // 0x8(0x4)
		int32_t FloorsPlaced; // 0xC(0x4)
		int32_t RoofsPlaced; // 0x10(0x4)
		int32_t WoodBuildingsPlaced; // 0x14(0x4)
		int32_t StoneBuildingsPlaced; // 0x18(0x4)
		int32_t MetalBuildingsPlaced; // 0x1C(0x4)
		int32_t BuildingsEdited; // 0x20(0x4)
	};


	// Struct FortniteGame.CreativeIslandData
	// Size: 0x60 (0x60 - 0x0)
	struct FCreativeIslandData	
	{
	public:
		FString McpId; // 0x0(0x10)
		FText IslandName; // 0x10(0x10)
		FOnlineLinkId IslandCode; // 0x20(0x18)
		FString GameFeatureSetName; // 0x38(0x10)
		FDateTime LastLoadedDate; // 0x48(0x8)
		FDateTime DeletedAt; // 0x50(0x8)
		bool bIsDeleted; // 0x58(0x1)
		bool bIsVKProject; // 0x59(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x5A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.LevelStreamRequestHandshakeState
	// Size: 0x1 (0x1 - 0x0)
	struct FLevelStreamRequestHandshakeState	
	{
	public:
		bool bLevelStreamingCompleted; // 0x0(0x1)
	};


	// Struct FortniteGame.TransientOverride
	// Size: 0xC (0xC - 0x0)
	struct FTransientOverride	
	{
	public:
		FName ObjectName; // 0x0(0x4)
		FName PropertyName; // 0x4(0x4)
		bool bMarkTransient; // 0x8(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.UserOptionDefinitionContainer
	// Size: 0x70 (0x70 - 0x0)
	struct FUserOptionDefinitionContainer	
	{
	public:
		FText DisplayName; // 0x0(0x10)
		FText Description; // 0x10(0x10)
		FText InteractionText; // 0x20(0x10)
		FCurveTableRowHandle InteractionSpeed; // 0x30(0x10)
		bool bRecurseBaseClassesForUserOptions; // 0x40(0x1)
		bool bPreserveInheritedUserOptionOrdering; // 0x41(0x1)
		bool bUseCustomCategories; // 0x42(0x1)
		unsigned char UnknownData02_6[0x5]; // 0x43(0x5) UNKNOWN PROPERTY
		TArray Definitions; // 0x48(0x10)
		unsigned char UnknownData03_7[0x18]; // 0x58(0x18) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.UserOptionDefinition
	// Size: 0x1A0 (0x1A0 - 0x0)
	struct FUserOptionDefinition	
	{
	public:
		TWeakObjectPtr PropertyScope; // 0x0(0x20)
		FUserOptionPropertyReference PropertyReference; // 0x20(0x30)
		FText DisplayName; // 0x50(0x10)
		FText Description; // 0x60(0x10)
		FText CustomEditorCategory; // 0x70(0x10)
		FGameplayTagContainer ImplicitCategoryTags; // 0x80(0x20)
		FGameplayTagContainer AdditionalCategoryTags; // 0xA0(0x20)
		FGameplayTagQuery RequiredContextTagQuery; // 0xC0(0x48)
		EUserOptionDefinitionContextTagQueryFailBehavior RequiredContextTagQueryFailBehavior_InEditor; // 0x108(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x109(0x7) UNKNOWN PROPERTY
		FScalableFloat SharedSettingOverride; // 0x110(0x28)
		FInstancedStruct MetaData; // 0x138(0x10)
		TEnumAsByte MenuListType; // 0x148(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x149(0x7) UNKNOWN PROPERTY
		UClass EditWidget; // 0x150(0x8)
		bool bRequireExplicitOverride; // 0x158(0x1)
		bool bDefaultOverrideValue; // 0x159(0x1)
		unsigned char UnknownData05_6[0x6]; // 0x15A(0x6) UNKNOWN PROPERTY
		FText ExplicitOverrideDisplayName; // 0x160(0x10)
		FGameplayTagContainer GrantedContextTagsWhenNotOverriden; // 0x170(0x20)
		FDataTableRowHandle DestructiveAction; // 0x190(0x10)
	};


	// Struct FortniteGame.UserOptionPropertyReference
	// Size: 0x30 (0x30 - 0x0)
	struct FUserOptionPropertyReference	
	{
	public:
		FMemberReference PropertyRef; // 0x0(0x30)
	};


	// Struct FortniteGame.BuildingActorClassData
	// Inherited from FUserOptionDefinitionContainer
	// Size: 0x88 (0xF8 - 0x70)
	struct FBuildingActorClassData : public FUserOptionDefinitionContainer	
	{
	public:
		FFortAttributeInitializationKey AttributeInitKeys; // 0x70(0x10)
		EAttributeInitLevelSource AttributeInitLevelSource; // 0x80(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x81(0x7) UNKNOWN PROPERTY
		TWeakObjectPtr NavigationLinkSoftClass; // 0x88(0x20)
		int32_t MaximumBuildingLevel; // 0xA8(0x4)
		float LifespanAfterDeath; // 0xAC(0x4)
		float HealthBarIndicatorWidth; // 0xB0(0x4)
		float HealthBarIndicatorVerticalOffset; // 0xB4(0x4)
		FName HealthBarIndicatorSocketName; // 0xB8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xBC(0x4) UNKNOWN PROPERTY
		FText BuildingActorInteractionText; // 0xC0(0x10)
		UClass InteractionOverrideWidget; // 0xD0(0x8)
		UClass SecondInteractionOverrideWidget; // 0xD8(0x8)
		UBuildingTargetingData BuildingTargetingDataOverride; // 0xE0(0x8)
		UNiagaraSystem PlayHitVfxNiagara; // 0xE8(0x8)
		bool bPreventScaling : 1; // 0xF0:0(0x1)
		bool bPlacementRequiresNoOverlaps : 1; // 0xF0:1(0x1)
		bool bHasGeometryCollectionComponent : 1; // 0xF0:2(0x1)
		bool bSupressWeaponHitVfx : 1; // 0xF0:3(0x1)
		bool bShouldPhysicsObjectComponentSimulateOnActivation : 1; // 0xF0:4(0x1)
		unsigned char UnknownData05_7[0x7]; // 0xF1(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BuildingGameplayActorAbilityDeliveryInfo
	// Size: 0xA0 (0xA0 - 0x0)
	struct FBuildingGameplayActorAbilityDeliveryInfo	
	{
	public:
		TArray DeliveryBuckets; // 0x0(0x10)
		FScalableFloat ProximityPulseInterval; // 0x10(0x28)
		FScalableFloat ProximityPrePulseTime; // 0x38(0x28)
		bool bHasGEsToApplyOnTouch : 1; // 0x60:0(0x1)
		bool bHasGEsToApplyOnExit : 1; // 0x60:1(0x1)
		bool bHasGEsToApplyOnPulseTimer : 1; // 0x60:2(0x1)
		bool bHasPersistentEffects : 1; // 0x60:3(0x1)
		unsigned char UnknownData02_5[0x7]; // 0x61(0x7) UNKNOWN PROPERTY
		ABuildingGameplayActor OwningActor; // 0x68(0x8)
		TArray DeferredTouchActorsToProcess; // 0x70(0x10)
		unsigned char UnknownData03_7[0x20]; // 0x80(0x20) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BuildingGameplayActorAbilityDeliveryBucket
	// Size: 0x90 (0x90 - 0x0)
	struct FBuildingGameplayActorAbilityDeliveryBucket	
	{
	public:
		FGameplayTag tag; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray ProximityEffectBuckets; // 0x8(0x10)
		TArray PawnPersistentAbilitySetBuckets; // 0x18(0x10)
		TArray PersistentlyAppliedAbilitySets; // 0x28(0x10)
		bool bEnabled : 1; // 0x38:0(0x1)
		bool bEnabledByDefault : 1; // 0x38:1(0x1)
		bool bHasGEsToApplyOnTouch : 1; // 0x38:2(0x1)
		bool bHasGEsToApplyOnExit : 1; // 0x38:3(0x1)
		bool bHasGEsToApplyOnPulseTimer : 1; // 0x38:4(0x1)
		bool bHasPersistentEffects : 1; // 0x38:5(0x1)
		unsigned char UnknownData03_7[0x57]; // 0x39(0x57) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAbilitySetDeliveryInfo
	// Size: 0x138 (0x138 - 0x0)
	struct FFortAbilitySetDeliveryInfo	
	{
	public:
		FFortDeliveryInfoRequirementsFilter DeliveryRequirements; // 0x0(0x128)
		TArray AbilitySets; // 0x128(0x10)
	};


	// Struct FortniteGame.FortDeliveryInfoRequirementsFilter
	// Size: 0x128 (0x128 - 0x0)
	struct FFortDeliveryInfoRequirementsFilter	
	{
	public:
		FGameplayTagRequirements SourceTagRequirements; // 0x0(0x88)
		FGameplayTagRequirements TargetTagRequirements; // 0x88(0x88)
		TEnumAsByte ApplicableTeamAffiliation; // 0x110(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x111(0x3) UNKNOWN PROPERTY
		bool bConsiderTeamAffiliationToInstigator : 1; // 0x114:0(0x1)
		unsigned char UnknownData07_5[0x3]; // 0x115(0x3) UNKNOWN PROPERTY
		TEnumAsByte ApplicableTeam; // 0x118(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x119(0x3) UNKNOWN PROPERTY
		bool bConsiderTeam : 1; // 0x11C:0(0x1)
		bool bApplyToPlayerPawns : 1; // 0x11C:1(0x1)
		bool bApplyToAIPawns : 1; // 0x11C:2(0x1)
		bool bApplyToBuildingActors : 1; // 0x11C:3(0x1)
		unsigned char UnknownData09_5[0x3]; // 0x11D(0x3) UNKNOWN PROPERTY
		EFortDeliveryInfoBuildingActorSpecification BuildingActorSpecification; // 0x120(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x121(0x3) UNKNOWN PROPERTY
		bool bApplyToGlobalEnvironmentAbilityActor : 1; // 0x124:0(0x1)
		unsigned char UnknownData11_7[0x3]; // 0x125(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ProximityBasedGEDeliveryInfoBase
	// Size: 0x138 (0x138 - 0x0)
	struct FProximityBasedGEDeliveryInfoBase	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		FFortDeliveryInfoRequirementsFilter DeliveryRequirements; // 0x8(0x128)
		EFortProximityBasedGEApplicationType ProximityApplicationType; // 0x130(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x131(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ProximityBasedGEDeliveryInfoHard
	// Inherited from FProximityBasedGEDeliveryInfoBase
	// Size: 0x10 (0x148 - 0x138)
	struct FProximityBasedGEDeliveryInfoHard : public FProximityBasedGEDeliveryInfoBase	
	{
	public:
		TArray EffectsToApply; // 0x138(0x10)
	};


	// Struct FortniteGame.GameplayEffectApplicationInfoHard
	// Size: 0x10 (0x10 - 0x0)
	struct FGameplayEffectApplicationInfoHard	
	{
	public:
		UClass GameplayEffect; // 0x0(0x8)
		float Level; // 0x8(0x4)
		unsigned char UnknownData01_7[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BuildingGameplayActorClassData
	// Inherited from FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x8 (0x100 - 0xF8)
	struct FBuildingGameplayActorClassData : public FBuildingActorClassData	
	{
	public:
		bool bEnablePhysicsUserData : 1; // 0xF8:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0xF9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.TeamRoles
	// Size: 0x2 (0x2 - 0x0)
	struct FTeamRoles	
	{
	public:
		char PusherTeam; // 0x0(0x1)
		char DefenderTeam; // 0x1(0x1)
	};


	// Struct FortniteGame.PawnDamageData
	// Size: 0x60 (0x60 - 0x0)
	struct FPawnDamageData	
	{
	public:
		AActor DamagedActor; // 0x0(0x8)
		float Damage; // 0x8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		AController InstigatedBy; // 0x10(0x8)
		AActor DamageCauser; // 0x18(0x8)
		FVector HitLocation; // 0x20(0x18)
		UPrimitiveComponent HitComponent; // 0x38(0x8)
		FName BoneName; // 0x40(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x44(0x4) UNKNOWN PROPERTY
		FVector Momentum; // 0x48(0x18)
	};


	// Struct FortniteGame.FortPlayerAttributeSets
	// Size: 0x58 (0x58 - 0x0)
	struct FFortPlayerAttributeSets	
	{
	public:
		UFortRegenHealthSet HealthSet; // 0x0(0x8)
		UFortControlResistanceSet ControlResistanceSet; // 0x8(0x8)
		UFortDamageSet DamageSet; // 0x10(0x8)
		UFortMovementSet MovementSet; // 0x18(0x8)
		UFortAdvancedMovementSet AdvancedMovementSet; // 0x20(0x8)
		UFortConstructionSet ConstructionSet; // 0x28(0x8)
		UFortPlayerAttrSet PlayerAttrSet; // 0x30(0x8)
		UFortCharacterAttrSet CharacterAttrSet; // 0x38(0x8)
		UFortWeaponAttrSet WeaponAttrSet; // 0x40(0x8)
		UFortHomebaseSet HomebaseSet; // 0x48(0x8)
		UFortAIPerceptionAttributeSet AIPerceptionSet; // 0x50(0x8)
	};


	// Struct FortniteGame.FortAppliedSwapItemAndVariantData
	// Size: 0x28 (0x28 - 0x0)
	struct FFortAppliedSwapItemAndVariantData	
	{
	public:
		FGuid SwapId; // 0x0(0x10)
		EFortAppliedSwapItemAndVariantState SwapState; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		TArray SwapData; // 0x18(0x10)
	};


	// Struct FortniteGame.FortSwapItemAndVariantData
	// Size: 0x18 (0x18 - 0x0)
	struct FFortSwapItemAndVariantData	
	{
	public:
		UFortItemDefinition Item; // 0x0(0x8)
		TArray ChannelInfoList; // 0x8(0x10)
	};


	// Struct FortniteGame.CustomCharacterData
	// Size: 0x58 (0x58 - 0x0)
	struct FCustomCharacterData	
	{
	public:
		char WasPartReplicatedFlags; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		int32_t RequiredVariantPartFlags; // 0x4(0x4)
		UCustomCharacterPart Parts; // 0x8(0x38)
		TArray VariantRequiredCharacterParts; // 0x40(0x10)
		bool bReplicationFailed; // 0x50(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x51(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlayerBannerInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FPlayerBannerInfo	
	{
	public:
		FString IconId; // 0x0(0x10)
		FString ColorId; // 0x10(0x10)
		int32_t Level; // 0x20(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SimulatedAttributeArray
	// Inherited from FFastArraySerializer
	// Size: 0x18 (0x120 - 0x108)
	struct FSimulatedAttributeArray : public FFastArraySerializer	
	{
	public:
		TArray TrackedAttributes; // 0x108(0x10)
		AFortPlayerStateZone OwningPlayerState; // 0x118(0x8)
	};


	// Struct FortniteGame.SimulatedAttributeEntry
	// Inherited from FFastArraySerializerItem
	// Size: 0x44 (0x50 - 0xC)
	struct FSimulatedAttributeEntry : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData02_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FGameplayAttribute Attribute; // 0x10(0x38)
		float CurrentValue; // 0x48(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AccumulatedItemEntry
	// Size: 0x10 (0x10 - 0x0)
	struct FAccumulatedItemEntry	
	{
	public:
		UFortWorldItemDefinition ItemDefinition; // 0x0(0x8)
		int32_t Quantity; // 0x8(0x4)
		unsigned char UnknownData01_7[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortSpectatorZoneArray
	// Inherited from FFastArraySerializer
	// Size: 0x18 (0x120 - 0x108)
	struct FFortSpectatorZoneArray : public FFastArraySerializer	
	{
	public:
		TArray SpectatorArray; // 0x108(0x10)
		AFortPlayerStateZone OwningState; // 0x118(0x8)
	};


	// Struct FortniteGame.FortSpectatorZoneItem
	// Inherited from FFastArraySerializerItem
	// Size: 0xC (0x18 - 0xC)
	struct FFortSpectatorZoneItem : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData01_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		AFortPlayerStateZone PlayerState; // 0x10(0x8)
	};


	// Struct FortniteGame.FortCreativeMessageDispatcherErrorMessage
	// Size: 0x20 (0x20 - 0x0)
	struct FFortCreativeMessageDispatcherErrorMessage	
	{
	public:
		EMessageDispatcherErrorMessageType ErrorMessageType; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FText MessageName; // 0x8(0x10)
		FGameplayTag ChannelId; // 0x18(0x4)
		int32_t LimitValue; // 0x1C(0x4)
	};


	// Struct FortniteGame.EventTournamentIds
	// Size: 0x40 (0x40 - 0x0)
	struct FEventTournamentIds	
	{
	public:
		FString EventId; // 0x0(0x10)
		FString WindowId; // 0x10(0x10)
		FString GroupId; // 0x20(0x10)
		FString SubGroupID; // 0x30(0x10)
	};


	// Struct FortniteGame.FortTournamentStatInfo
	// Size: 0x20 (0x20 - 0x0)
	struct FFortTournamentStatInfo	
	{
	public:
		FString StatName; // 0x0(0x10)
		FName StatDisplayName; // 0x10(0x4)
		bool bIsDeltaCount; // 0x14(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
		int32_t StatValue; // 0x18(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.DeathInfo
	// Size: 0xA8 (0xA8 - 0x0)
	struct FDeathInfo	
	{
	public:
		TWeakObjectPtr FinisherOrDowner; // 0x0(0x8)
		TWeakObjectPtr Downer; // 0x8(0x8)
		bool bDBNO; // 0x10(0x1)
		EDeathCause DeathCause; // 0x11(0x1)
		char DeathClassSlot; // 0x12(0x1)
		unsigned char UnknownData04_6[0x1]; // 0x13(0x1) UNKNOWN PROPERTY
		float Distance; // 0x14(0x4)
		float DeathServerTime; // 0x18(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		FVector DeathLocation; // 0x20(0x18)
		bool bInitialized; // 0x38(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer DeathTags; // 0x40(0x20)
		FGameplayTagContainer FinisherOrDownerTags; // 0x60(0x20)
		FGameplayTagContainer VictimTags; // 0x80(0x20)
		unsigned char UnknownData07_7[0x8]; // 0xA0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CustomFeedMessageContext
	// Size: 0x20 (0x20 - 0x0)
	struct FCustomFeedMessageContext	
	{
	public:
		TWeakObjectPtr OwningPlayerState; // 0x0(0x8)
		FVector OriginLocation; // 0x8(0x18)
	};


	// Struct FortniteGame.DetailedMetricInformation
	// Size: 0x10 (0x10 - 0x0)
	struct FDetailedMetricInformation	
	{
	public:
		TArray MetricStates; // 0x0(0x10)
	};


	// Struct FortniteGame.MetricStateInformation
	// Size: 0x30 (0x30 - 0x0)
	struct FMetricStateInformation	
	{
	public:
		FString Name; // 0x0(0x10)
		FString Description; // 0x10(0x10)
		EFortBudgetCategory category; // 0x20(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		int32_t Cost; // 0x24(0x4)
		int32_t Budget; // 0x28(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortResurrectionData
	// Size: 0x28 (0x28 - 0x0)
	struct FFortResurrectionData	
	{
	public:
		bool bResurrectionChipAvailable; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float ResurrectionExpirationTime; // 0x4(0x4)
		float ResurrectionExpirationLength; // 0x8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FVector WorldLocation; // 0x10(0x18)
	};


	// Struct FortniteGame.SimpleMetricInformation
	// Size: 0x78 (0x78 - 0x0)
	struct FSimpleMetricInformation	
	{
	public:
		TArray CategoryNames; // 0x0(0x10)
		TArray CategoryValues; // 0x10(0x10)
		TArray CategoryBudgets; // 0x20(0x10)
		FVector Location; // 0x30(0x18)
		float NormalizedGroupBudgetValue; // 0x48(0x4)
		int32_t GroupTotalBudget; // 0x4C(0x4)
		FVector NeighbourGroupCenter; // 0x50(0x18)
		TArray NeighbourGroupBudgetValue; // 0x68(0x10)
	};


	// Struct FortniteGame.ChangeTeamInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FChangeTeamInfo	
	{
	public:
		TWeakObjectPtr Instigator; // 0x0(0x8)
		FGameplayTagContainer ChangeTeamTags; // 0x8(0x20)
	};


	// Struct FortniteGame.FortRespawnData
	// Size: 0x40 (0x40 - 0x0)
	struct FFortRespawnData	
	{
	public:
		bool bRespawnDataAvailable; // 0x0(0x1)
		bool bClientIsReady; // 0x1(0x1)
		bool bServerIsReady; // 0x2(0x1)
		unsigned char UnknownData02_6[0x5]; // 0x3(0x5) UNKNOWN PROPERTY
		FVector RespawnLocation; // 0x8(0x18)
		FRotator RespawnRotation; // 0x20(0x18)
		float RespawnCameraDistance; // 0x38(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.WeaponHudData
	// Size: 0x58 (0x58 - 0x0)
	struct FWeaponHudData	
	{
	public:
		FName KeyActionName; // 0x0(0x4)
		FName GamepadActionName; // 0x4(0x4)
		FText ActionDescription; // 0x8(0x10)
		bool bVisible; // 0x18(0x1)
		bool bIsDimmed; // 0x19(0x1)
		bool bIsAxisMapping; // 0x1A(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x1B(0x1) UNKNOWN PROPERTY
		float AxisScale; // 0x1C(0x4)
		FGameplayTagContainer DisabledTags; // 0x20(0x20)
		FString KeyActionId; // 0x40(0x10)
		FGameplayTag WatchTag; // 0x50(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PickupInstigatorData
	// Size: 0x18 (0x18 - 0x0)
	struct FPickupInstigatorData	
	{
	public:
		char TeamIndex; // 0x0(0x1)
		TEnumAsByte TargetAttitude; // 0x1(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float AccentColorParam; // 0x4(0x4)
		int32_t ScoreValue; // 0x8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UClass OverridePickupClass; // 0x10(0x8)
	};


	// Struct FortniteGame.FortPlayerAnimAssets
	// Size: 0x18 (0x18 - 0x0)
	struct FFortPlayerAnimAssets	
	{
	public:
		UFortLocomotionAnimAsset LocomotionAnimAsset; // 0x0(0x8)
		UFortTacticalStateAnimAsset TacticalStateAnimAsset; // 0x8(0x8)
		UFortFirstPersonAnimAsset FirstPersonWeaponAnimAsset; // 0x10(0x8)
	};


	// Struct FortniteGame.FortProceduralLayeringWeaponData
	// Size: 0x28 (0x28 - 0x0)
	struct FFortProceduralLayeringWeaponData	
	{
	public:
		bool bUseMotionMatchingWithoutProxyTable; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UClass ItemChooserDataClass; // 0x8(0x8)
		UFortItemChooserData ItemChooserData; // 0x10(0x8)
		UProxyTable ProxyTable; // 0x18(0x8)
		UProxyTable ProxyTableOverride; // 0x20(0x8)
	};


	// Struct FortniteGame.FortCosmeticModification
	// Size: 0x600 (0x600 - 0x0)
	struct FFortCosmeticModification	
	{
	public:
		TWeakObjectPtr CosmeticMaterial; // 0x0(0x20)
		TWeakObjectPtr AmbientParticleSystem; // 0x20(0x20)
		TWeakObjectPtr AmbientNiagaraSystem; // 0x40(0x20)
		TWeakObjectPtr MuzzleParticleSystem; // 0x60(0x20)
		TWeakObjectPtr MuzzleNiagaraSystem; // 0x80(0x20)
		TWeakObjectPtr ReloadParticleSystem; // 0xA0(0x20)
		TWeakObjectPtr ReloadNiagaraSystem; // 0xC0(0x20)
		TWeakObjectPtr BeamParticleSystem; // 0xE0(0x20)
		TWeakObjectPtr BeamNiagaraSystem; // 0x100(0x20)
		TWeakObjectPtr ImpactPhysicalSurfaceEffects; // 0x120(0x460)
		TArray ImpactNiagaraPhysicalSurfaceEffects; // 0x580(0x10)
		TWeakObjectPtr TracerTemplate; // 0x590(0x20)
		bool bModifyColor; // 0x5B0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x5B1(0x3) UNKNOWN PROPERTY
		FLinearColor ColorAlteration; // 0x5B4(0x10)
		FName ColorParameterName; // 0x5C4(0x4)
		bool bModifyDecalColour; // 0x5C8(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x5C9(0x3) UNKNOWN PROPERTY
		FLinearColor DecalColourAlterationStart; // 0x5CC(0x10)
		FLinearColor DecalColourAlterationEnd; // 0x5DC(0x10)
		bool bModifyShellColour; // 0x5EC(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x5ED(0x3) UNKNOWN PROPERTY
		FLinearColor ShellColourAlteration; // 0x5F0(0x10)
	};


	// Struct FortniteGame.WeaponHudKeyActionVisibility
	// Size: 0x8 (0x8 - 0x0)
	struct FWeaponHudKeyActionVisibility	
	{
	public:
		int32_t Index; // 0x0(0x4)
		bool bVisibility; // 0x4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.WeaponHudKeyActionIdAndVisibility
	// Size: 0x18 (0x18 - 0x0)
	struct FWeaponHudKeyActionIdAndVisibility	
	{
	public:
		FString ID; // 0x0(0x10)
		bool bVisibility; // 0x10(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.WeaponModReloadAnimData
	// Size: 0x10 (0x10 - 0x0)
	struct FWeaponModReloadAnimData	
	{
	public:
		UAnimMontage PlayerReloadAnim; // 0x0(0x8)
		UAnimMontage WeaponReloadAnim; // 0x8(0x8)
	};


	// Struct FortniteGame.CosmeticVariantCache
	// Size: 0x18 (0x18 - 0x0)
	struct FCosmeticVariantCache	
	{
	public:
		UItemDefinitionBase ItemDefFor; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortEquippedWeaponModSlot
	// Size: 0x40 (0x40 - 0x0)
	struct FFortEquippedWeaponModSlot	
	{
	public:
		FFortAbilitySetHandle EquippedAbilitySetHandle; // 0x0(0x38)
		UFortWeaponModItemDefinition EquippedWeaponMod; // 0x38(0x8)
	};


	// Struct FortniteGame.FortEffectDistanceQuality
	// Size: 0x18 (0x18 - 0x0)
	struct FFortEffectDistanceQuality	
	{
	public:
		float MinDistanceCinematic; // 0x0(0x4)
		float MinDistanceEpic; // 0x4(0x4)
		float MinDistanceHigh; // 0x8(0x4)
		float MinDistanceMedium; // 0xC(0x4)
		float MinDistanceLow; // 0x10(0x4)
		bool bAllowCinematic : 1; // 0x14:0(0x1)
		bool bAllowEpic : 1; // 0x14:1(0x1)
		bool bAllowHigh : 1; // 0x14:2(0x1)
		bool bAllowMedium : 1; // 0x14:3(0x1)
		bool bAllowLow : 1; // 0x14:4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MaterialInterfaceArray
	// Size: 0x10 (0x10 - 0x0)
	struct FMaterialInterfaceArray	
	{
	public:
		TArray Materials; // 0x0(0x10)
	};


	// Struct FortniteGame.WeaponImpactArraySupportData
	// Size: 0x18 (0x18 - 0x0)
	struct FWeaponImpactArraySupportData	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		UWeaponImpactData ImpactData; // 0x10(0x8)
	};


	// Struct FortniteGame.FortNDCImpactInfo
	// Size: 0xD8 (0xD8 - 0x0)
	struct FFortNDCImpactInfo	
	{
	public:
		TWeakObjectPtr ImpactFXDataChannel; // 0x0(0x20)
		TMap PerSurfaceImpactFXDataChannel; // 0x20(0x50)
		float ScaleMultiplier; // 0x70(0x4)
		bool bSimple : 1; // 0x74:0(0x1)
		bool bUseNDCImpacts : 1; // 0x74:1(0x1)
		unsigned char UnknownData01_5[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		FFortNDCImpactInfo_CachedData CachedNDCInfo; // 0x78(0x10)
		TMap PerSurfaceCachedNDCInfo; // 0x88(0x50)
	};


	// Struct FortniteGame.FortNDCImpactInfo_CachedData
	// Size: 0x10 (0x10 - 0x0)
	struct FFortNDCImpactInfo_CachedData	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		UNiagaraDataChannel_Fort CachedNDC; // 0x8(0x8)
	};


	// Struct FortniteGame.FortWeaponInputDevicePropertyPair
	// Size: 0x18 (0x18 - 0x0)
	struct FFortWeaponInputDevicePropertyPair	
	{
	public:
		UClass DevicePropertyClass; // 0x0(0x8)
		UInputDeviceProperty DevicePropertyInstance; // 0x8(0x8)
		bool bIsLooping; // 0x10(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortWeaponImpactFXDetails
	// Size: 0x30 (0x30 - 0x0)
	struct FFortWeaponImpactFXDetails	
	{
	public:
		unsigned char UnknownData02_7[0x18]; // 0x0(0x18) UNKNOWN PROPERTY
		UFXSystemAsset ImpactNS; // 0x18(0x8)
		UFXSystemAsset TargetAsset; // 0x20(0x8)
		unsigned char UnknownData03_7[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGameplayAbilityBehaviorDistanceData
	// Size: 0x28 (0x28 - 0x0)
	struct FFortGameplayAbilityBehaviorDistanceData	
	{
	public:
		FGameplayTagContainer DistanceDataTag; // 0x0(0x20)
		float Distance; // 0x20(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AdHocSquad_InviteData
	// Inherited from FFastArraySerializerItem
	// Size: 0x14 (0x20 - 0xC)
	struct FAdHocSquad_InviteData : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData02_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		AFortPlayerStateAthena InvitingPlayerState; // 0x10(0x8)
		EAdHocSquads_InviteStatus InviteStatus; // 0x18(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CobaltWidgetRoundData
	// Size: 0x28 (0x28 - 0x0)
	struct FCobaltWidgetRoundData	
	{
	public:
		int8_t RoundNumber; // 0x0(0x1)
		int8_t FirstRound; // 0x1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		TArray CurrentRoundMatches; // 0x8(0x10)
		TArray PreviousRoundWinners; // 0x18(0x10)
	};


	// Struct FortniteGame.CobaltWidgetMatchData
	// Size: 0x18 (0x18 - 0x0)
	struct FCobaltWidgetMatchData	
	{
	public:
		TArray Teams; // 0x0(0x10)
		FGameplayTag POITag; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortPublicAccountInfo
	// Size: 0x34 (0x34 - 0x0)
	struct FFortPublicAccountInfo	
	{
	public:
		int32_t Level; // 0x0(0x4)
		int32_t MaxLevel; // 0x4(0x4)
		int32_t LevelXp; // 0x8(0x4)
		int32_t LevelXpForLevel; // 0xC(0x4)
		FAthenaLevelInfo BattleRoyaleLevel; // 0x10(0x24)
	};


	// Struct FortniteGame.AthenaLevelInfo
	// Size: 0x24 (0x24 - 0x0)
	struct FAthenaLevelInfo	
	{
	public:
		int32_t AccountLevel; // 0x0(0x4)
		int32_t Level; // 0x4(0x4)
		int32_t MaxLevel; // 0x8(0x4)
		int32_t LevelXp; // 0xC(0x4)
		int32_t LevelXpForLevel; // 0x10(0x4)
		int32_t BookLevel; // 0x14(0x4)
		int32_t BookMaxLevel; // 0x18(0x4)
		int32_t BookLevelXp; // 0x1C(0x4)
		int32_t BookLevelXpForLevel; // 0x20(0x4)
	};


	// Struct FortniteGame.FortItemInstanceQuantityPair
	// Size: 0x10 (0x10 - 0x0)
	struct FFortItemInstanceQuantityPair	
	{
	public:
		UFortItem Item; // 0x0(0x8)
		TEnumAsByte InventoryType; // 0x8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		int32_t Quantity; // 0xC(0x4)
	};


	// Struct FortniteGame.FortCollectionBookRewards
	// Size: 0x58 (0x58 - 0x0)
	struct FFortCollectionBookRewards	
	{
	public:
		ECollectionBookRewardType RewardType; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName PageId; // 0x4(0x4)
		FName SectionId; // 0x8(0x4)
		int32_t XpRequired; // 0xC(0x4)
		FText Description; // 0x10(0x10)
		bool bIsMajorReward; // 0x20(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
		FFortRewardInfo Rewards; // 0x28(0x30)
	};


	// Struct FortniteGame.FortRewardInfo
	// Size: 0x30 (0x30 - 0x0)
	struct FFortRewardInfo	
	{
	public:
		TArray SelectableRewards; // 0x0(0x10)
		TArray StandardRewards; // 0x10(0x10)
		TArray HiddenRewards; // 0x20(0x10)
	};


	// Struct FortniteGame.FortHiddenRewardQuantityPair
	// Size: 0x8 (0x8 - 0x0)
	struct FFortHiddenRewardQuantityPair	
	{
	public:
		FName TemplateId; // 0x0(0x4)
		int32_t Quantity; // 0x4(0x4)
	};


	// Struct FortniteGame.FortSelectableRewardOption
	// Size: 0x10 (0x10 - 0x0)
	struct FFortSelectableRewardOption	
	{
	public:
		TArray Rewards; // 0x0(0x10)
	};


	// Struct FortniteGame.FortMediaEventsStreamAssets
	// Size: 0x68 (0x68 - 0x0)
	struct FFortMediaEventsStreamAssets	
	{
	public:
		FString Name; // 0x0(0x10)
		bool bAutoActivate; // 0x10(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		UMediaTexture VideoTexture; // 0x18(0x8)
		UMaterialInterface VideoMaterial; // 0x20(0x8)
		USoundSourceBus SoundSourceBus; // 0x28(0x8)
		USoundClass SoundClass; // 0x30(0x8)
		USoundMix ActiveSoundMix; // 0x38(0x8)
		USoundSubmixBase DefaultSubmix; // 0x40(0x8)
		USoundSubmixBase LicensedSubmix; // 0x48(0x8)
		float VolumeOverride; // 0x50(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		UFortStreamMediaSource MediaSource; // 0x58(0x8)
		UMediaPlayer ExternalVideoPlayer; // 0x60(0x8)
	};


	// Struct FortniteGame.FortMediaInBandMetadata
	// Size: 0x90 (0x90 - 0x0)
	struct FFortMediaInBandMetadata	
	{
	public:
		FString LanguageCode; // 0x0(0x10)
		FString Title; // 0x10(0x10)
		FString Artist; // 0x20(0x10)
		FString Genre; // 0x30(0x10)
		FString Date; // 0x40(0x10)
		FString Description; // 0x50(0x10)
		FString LongDescription; // 0x60(0x10)
		FString Album; // 0x70(0x10)
		FString Encoder; // 0x80(0x10)
	};


	// Struct FortniteGame.CreativeVersionId
	// Size: 0x4 (0x4 - 0x0)
	struct FCreativeVersionId	
	{
	public:
		int32_t CachedVersion; // 0x0(0x4)
	};


	// Struct FortniteGame.FortPrivateAccountInfo
	// Inherited from FFortPublicAccountInfo
	// Size: 0x4 (0x38 - 0x34)
	struct FFortPrivateAccountInfo : public FFortPublicAccountInfo	
	{
	public:
		int32_t MtxBalance; // 0x34(0x4)
	};


	// Struct FortniteGame.FortPawnMaterialOverride
	// Size: 0x68 (0x68 - 0x0)
	struct FFortPawnMaterialOverride	
	{
	public:
		FGuid OverrideId; // 0x0(0x10)
		TWeakObjectPtr Material; // 0x10(0x20)
		FFortPawnMaterialOverrideCopiedParameters MaterialParamsToCopy; // 0x30(0x30)
		float Priority; // 0x60(0x4)
		EFortPawnMaterialOverrideFlags Flags; // 0x64(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x65(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortPawnMaterialOverrideCopiedParameters
	// Size: 0x30 (0x30 - 0x0)
	struct FFortPawnMaterialOverrideCopiedParameters	
	{
	public:
		TArray ScalarParamNames; // 0x0(0x10)
		TArray VectorParamNames; // 0x10(0x10)
		TArray TextureParamNames; // 0x20(0x10)
	};


	// Struct FortniteGame.MinigameScoreEntry
	// Inherited from FFastArraySerializerItem
	// Size: 0x5C (0x68 - 0xC)
	struct FMinigameScoreEntry : public FFastArraySerializerItem	
	{
	public:
		unsigned char UnknownData03_3[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FUniqueNetIdRepl UniqueID; // 0x10(0x30)
		FString PlayerName; // 0x40(0x10)
		float Score; // 0x50(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		FDateTime TimeRecorded; // 0x58(0x8)
		bool bHasScore : 1; // 0x60:0(0x1)
		unsigned char UnknownData05_7[0x7]; // 0x61(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AsyncLoadedSecondaryAssets
	// Size: 0x20 (0x20 - 0x0)
	struct FAsyncLoadedSecondaryAssets	
	{
	public:
		TArray Meshes; // 0x0(0x10)
		TArray Materials; // 0x10(0x10)
	};


	// Struct FortniteGame.CreativeDeviceInstanceInfo
	// Size: 0x90 (0x90 - 0x0)
	struct FCreativeDeviceInstanceInfo	
	{
	public:
		TWeakObjectPtr ActorPtr; // 0x0(0x20)
		FSoftObjectPath ActorPath; // 0x20(0x18)
		int32_t DeviceTrackingGUID; // 0x38(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
		UClass Class; // 0x40(0x8)
		FString Label; // 0x48(0x10)
		bool bIsActorCut; // 0x58(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x59(0x7) UNKNOWN PROPERTY
		FVector_NetQuantize10 ActorLocation; // 0x60(0x18)
		TArray DeviceFunctionSubscriptions; // 0x78(0x10)
		unsigned char UnknownData05_7[0x8]; // 0x88(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CreativeDeviceEventSubscriptionInfo
	// Size: 0x18 (0x18 - 0x0)
	struct FCreativeDeviceEventSubscriptionInfo	
	{
	public:
		FName FunctionPropertyName; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray FunctionSubscriptions; // 0x8(0x10)
	};


	// Struct FortniteGame.TrackedDevicesByEvent
	// Size: 0x18 (0x18 - 0x0)
	struct FTrackedDevicesByEvent	
	{
	public:
		FName EventPropertyName; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray DevicesOnEvent; // 0x8(0x10)
	};


	// Struct FortniteGame.BasicDeviceTrackingInfo
	// Size: 0x58 (0x58 - 0x0)
	struct FBasicDeviceTrackingInfo	
	{
	public:
		int32_t DeviceTrackingGUID; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FSoftObjectPath ActorPath; // 0x8(0x18)
		UClass Class; // 0x20(0x8)
		FString Label; // 0x28(0x10)
		FVector_NetQuantize10 ActorLocation; // 0x38(0x18)
		uint16_t NumBoundFunctions; // 0x50(0x2)
		uint16_t NumBoundEvents; // 0x52(0x2)
		int32_t CabinModeNameNum; // 0x54(0x4)
	};


	// Struct FortniteGame.DynamicXpSessionAccoladeStats
	// Size: 0x40 (0x40 - 0x0)
	struct FDynamicXpSessionAccoladeStats	
	{
	public:
		FString AccoladeId; // 0x0(0x10)
		FString AccoladeName; // 0x10(0x10)
		FString Grouping; // 0x20(0x10)
		int32_t Triggers; // 0x30(0x4)
		int32_t GrantedXp; // 0x34(0x4)
		int32_t PotentialXp; // 0x38(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MashBossHealthShieldData
	// Size: 0x10 (0x10 - 0x0)
	struct FMashBossHealthShieldData	
	{
	public:
		float TotalHealth; // 0x0(0x4)
		float CurrentHealth; // 0x4(0x4)
		float TotalShield; // 0x8(0x4)
		float CurrentShield; // 0xC(0x4)
	};


	// Struct FortniteGame.MeshSet
	// Size: 0xE0 (0xE0 - 0x0)
	struct FMeshSet	
	{
	public:
		float Weight; // 0x0(0x4)
		TEnumAsByte ResourceType; // 0x4(0x1)
		bool bDoNotBlockBuildings : 1; // 0x5:0(0x1)
		bool bDestroyOnPlayerBuildingPlacement : 1; // 0x5:1(0x1)
		unsigned char UnknownData02_5[0x2]; // 0x6(0x2) UNKNOWN PROPERTY
		UStaticMesh BaseMesh; // 0x8(0x8)
		UParticleSystem BreakEffect; // 0x10(0x8)
		UParticleSystem DeathParticles; // 0x18(0x8)
		FName DeathParticleSocketName; // 0x20(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		USoundBase DeathSound; // 0x28(0x8)
		UParticleSystem ConstructedEffect; // 0x30(0x8)
		TArray SwapInParticles; // 0x38(0x10)
		TArray SwapInSounds; // 0x48(0x10)
		TArray SwapInMeshes; // 0x58(0x10)
		TArray SwapInLightProperties; // 0x68(0x10)
		FAddOrRemoveGameplayTags BuildingOwnedTagDelta; // 0x78(0x40)
		UStaticMesh SearchedMesh; // 0xB8(0x8)
		FCurveTableRowHandle SearchSpeed; // 0xC0(0x10)
		float LootNoiseRange; // 0xD0(0x4)
		FVector3f LootSpawnLocation; // 0xD4(0xC)
	};


	// Struct FortniteGame.AddOrRemoveGameplayTags
	// Size: 0x40 (0x40 - 0x0)
	struct FAddOrRemoveGameplayTags	
	{
	public:
		FGameplayTagContainer Added; // 0x0(0x20)
		FGameplayTagContainer Removed; // 0x20(0x20)
	};


	// Struct FortniteGame.TaggedInLightProperties
	// Size: 0x1C (0x1C - 0x0)
	struct FTaggedInLightProperties	
	{
	public:
		FName tag; // 0x0(0x4)
		FLightProperty_Color ColorSubstitute; // 0x4(0x18)
	};


	// Struct FortniteGame.LightProperty_Color
	// Size: 0x18 (0x18 - 0x0)
	struct FLightProperty_Color	
	{
	public:
		bool bEnabled; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FLinearColor Color; // 0x4(0x10)
		bool bUsingSRGB; // 0x14(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.TaggedStaticMeshSubstitution
	// Size: 0x10 (0x10 - 0x0)
	struct FTaggedStaticMeshSubstitution	
	{
	public:
		FName tag; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UStaticMesh Substitute; // 0x8(0x8)
	};


	// Struct FortniteGame.TaggedSoundSubstitution
	// Size: 0x10 (0x10 - 0x0)
	struct FTaggedSoundSubstitution	
	{
	public:
		FName tag; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		USoundBase Substitute; // 0x8(0x8)
	};


	// Struct FortniteGame.TaggedParticleSubstitution
	// Size: 0x10 (0x10 - 0x0)
	struct FTaggedParticleSubstitution	
	{
	public:
		FName tag; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UParticleSystem Substitute; // 0x8(0x8)
	};


	// Struct FortniteGame.PropertyOverrideData
	// Size: 0x50 (0x50 - 0x0)
	struct FPropertyOverrideData	
	{
	public:
		TArray PropertyOverrides; // 0x0(0x10)
		TArray SharedPropertyIds; // 0x10(0x10)
		TArray PendingPropertyIds; // 0x20(0x10)
		unsigned char UnknownData02_6[0x8]; // 0x30(0x8) UNKNOWN PROPERTY
		EPropertyOverrideTargetType OverrideMode; // 0x38(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
		UObject BaseObject; // 0x40(0x8)
		UObject MutableObject; // 0x48(0x8)
	};


	// Struct FortniteGame.PropertyOverrideId
	// Size: 0x8 (0x8 - 0x0)
	struct FPropertyOverrideId	
	{
	public:
		uint64_t PropertyHashes; // 0x0(0x8)
	};


	// Struct FortniteGame.PropertyOverrideMk2
	// Size: 0x48 (0x48 - 0x0)
	struct FPropertyOverrideMk2	
	{
	public:
		FString PropertyScope; // 0x0(0x10)
		FString PropertyName; // 0x10(0x10)
		FString PropertyData; // 0x20(0x10)
		FString DefaultPropertyData; // 0x30(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x40(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ActiveStyleInfo
	// Size: 0x40 (0x40 - 0x0)
	struct FActiveStyleInfo	
	{
	public:
		UFortMaterialStyle PreviousStyle; // 0x0(0x8)
		UFortMaterialStyle CurrentStyle; // 0x8(0x8)
		FRequestStyleParams CurrentStyleRequest; // 0x10(0x30)
	};


	// Struct FortniteGame.RequestStyleParams
	// Size: 0x30 (0x30 - 0x0)
	struct FRequestStyleParams	
	{
	public:
		float DurationOverride; // 0x0(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UMaterialInstanceDynamic MaterialInstanceDynamic; // 0x8(0x8)
		EStyleSpecificationMethod StyleSpecificationMethod; // 0x10(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		UFortMaterialStyleSet StyleSet; // 0x18(0x8)
		FName StyleName; // 0x20(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		UFortMaterialStyle DirectStyleReference; // 0x28(0x8)
	};


	// Struct FortniteGame.PurchasedItemInfo
	// Size: 0x10 (0x10 - 0x0)
	struct FPurchasedItemInfo	
	{
	public:
		UFortItem Item; // 0x0(0x8)
		int32_t Quantity; // 0x8(0x4)
		unsigned char UnknownData01_7[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.McpPrivacySettings
	// Size: 0x2 (0x2 - 0x0)
	struct FMcpPrivacySettings	
	{
	public:
		bool OptOutOfPublicLeaderboards; // 0x0(0x1)
		bool OptOutOfFriendsLeaderboards; // 0x1(0x1)
	};


	// Struct FortniteGame.SafeZoneRoute
	// Size: 0x110 (0x110 - 0x0)
	struct FSafeZoneRoute	
	{
	public:
		FScalableFloat bIsEnabled; // 0x0(0x28)
		FScalableFloat bUsePOIStartLocation; // 0x28(0x28)
		FScalableFloat bUsePOINameOverride; // 0x50(0x28)
		FText POINameOverride; // 0x78(0x10)
		FScalableFloat StartRadius; // 0x88(0x28)
		FScalableFloat EndRadius; // 0xB0(0x28)
		FGameplayTag StartPOITag; // 0xD8(0x4)
		FGameplayTag EndPOITag; // 0xDC(0x4)
		FVector StartLocation; // 0xE0(0x18)
		FVector EndLocation; // 0xF8(0x18)
	};


	// Struct FortniteGame.TDMPlayerStandingInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FTDMPlayerStandingInfo	
	{
	public:
		AFortPlayerStateAthena PlayerState; // 0x0(0x8)
		bool bIsLocalPlayer; // 0x8(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		int32_t PlayerScore; // 0xC(0x4)
		FString PlayerName; // 0x10(0x10)
		char PlayerTeamId; // 0x20(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		int32_t PlayerRanking; // 0x24(0x4)
	};


	// Struct FortniteGame.FortTimestampEvent
	// Size: 0x10 (0x10 - 0x0)
	struct FFortTimestampEvent	
	{
	public:
		ETimestampEventType Type; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName Name; // 0x4(0x4)
		float PositionSecond; // 0x8(0x4)
		float BPM; // 0xC(0x4)
	};


	// Struct FortniteGame.AthenaTravelLogEntry
	// Size: 0xF0 (0xF0 - 0x0)
	struct FAthenaTravelLogEntry	
	{
	public:
		float Time; // 0x0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector Position; // 0x8(0x18)
		FRotator Rotation; // 0x20(0x18)
		EAthenaTravelEventType Type; // 0x38(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		FName InstigatorName; // 0x3C(0x4)
		FUniqueNetIdRepl InstigatorId; // 0x40(0x30)
		EAthenaTravelLogPlayerType InstigatorPlayerType; // 0x70(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x71(0x3) UNKNOWN PROPERTY
		FName ReceiverName; // 0x74(0x4)
		FUniqueNetIdRepl ReceiverId; // 0x78(0x30)
		EAthenaTravelLogPlayerType ReceiverPlayerType; // 0xA8(0x1)
		unsigned char UnknownData07_6[0x3]; // 0xA9(0x3) UNKNOWN PROPERTY
		float Value; // 0xAC(0x4)
		FJsonObjectWrapper Meta; // 0xB0(0x20)
		FGameplayTagContainer LocationPOITags; // 0xD0(0x20)
	};


	// Struct FortniteGame.VolumePerformanceMetrics
	// Size: 0x38 (0x38 - 0x0)
	struct FVolumePerformanceMetrics	
	{
	public:
		int32_t PerformanceValue; // 0x0(0x4)
		int32_t PerformanceMaxValue; // 0x4(0x4)
		int32_t PerformanceValueMargin; // 0x8(0x4)
		FIntPoint PerformanceValueCellIndex; // 0xC(0x8)
		int32_t PerformanceLowendThreshold; // 0x14(0x4)
		int32_t PreviewDeltaValue; // 0x18(0x4)
		EFortBudgetCategory category; // 0x1C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
		int32_t PlayerId; // 0x20(0x4)
		int32_t MostExpensivePerformanceValue; // 0x24(0x4)
		int32_t MostExpensivePreviewDeltaValue; // 0x28(0x4)
		int32_t GlobalMemoryValue; // 0x2C(0x4)
		FIntPoint MostExpensivePerformanceValueCellIndex; // 0x30(0x8)
	};


	// Struct FortniteGame.FortReplicatedWeatherEventData
	// Size: 0x14 (0x14 - 0x0)
	struct FFortReplicatedWeatherEventData	
	{
	public:
		int32_t Index; // 0x0(0x4)
		float StartTime; // 0x4(0x4)
		float EndTime; // 0x8(0x4)
		float BlendInDuration; // 0xC(0x4)
		float BlendOutDuration; // 0x10(0x4)
	};


	// Struct FortniteGame.FortReplayFXState
	// Size: 0x10 (0x10 - 0x0)
	struct FFortReplayFXState	
	{
	public:
		int32_t DefaultParticleLODBias; // 0x0(0x4)
		int32_t DefaultDepthOfFieldQuality; // 0x4(0x4)
		int32_t OverrideParticleLODBias; // 0x8(0x4)
		int32_t OverrideDepthOfFieldQuality; // 0xC(0x4)
	};


	// Struct FortniteGame.ProjectileEventData
	// Size: 0x28 (0x28 - 0x0)
	struct FProjectileEventData	
	{
	public:
		AFortProjectileBase SpawnedProjectile; // 0x0(0x8)
		TArray Hits; // 0x8(0x10)
		TArray ExplodedActors; // 0x18(0x10)
	};


	// Struct FortniteGame.StateTransitionControllerHandle
	// Size: 0x10 (0x10 - 0x0)
	struct FStateTransitionControllerHandle	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortEventName
	// Size: 0x8 (0x8 - 0x0)
	struct FFortEventName	
	{
	public:
		FName CategoryName; // 0x0(0x4)
		FName EventName; // 0x4(0x4)
	};


	// Struct FortniteGame.FortClientEventName
	// Inherited from FFortEventName
	// Size: 0x0 (0x8 - 0x8)
	struct FFortClientEventName : public FFortEventName	
	{
	public:
	};


	// Struct FortniteGame.AthenaMatchLootReward
	// Size: 0x18 (0x18 - 0x0)
	struct FAthenaMatchLootReward	
	{
	public:
		FString TemplateId; // 0x0(0x10)
		int32_t Amount; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaMatchXpReward
	// Size: 0x18 (0x18 - 0x0)
	struct FAthenaMatchXpReward	
	{
	public:
		FText Text; // 0x0(0x10)
		int32_t Amount; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaTravelRecord
	// Size: 0x10 (0x10 - 0x0)
	struct FAthenaTravelRecord	
	{
	public:
		TArray Log; // 0x0(0x10)
	};


	// Struct FortniteGame.FortMiniMapData
	// Size: 0xC8 (0xC8 - 0x0)
	struct FFortMiniMapData	
	{
	public:
		UObject MiniMapIcon; // 0x0(0x8)
		FVector2D IconScale; // 0x8(0x10)
		bool bUseIconSize : 1; // 0x18:0(0x1)
		unsigned char UnknownData05_5[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		FVector2D IconMaterialSize; // 0x20(0x10)
		bool bIsVisible : 1; // 0x30:0(0x1)
		bool bIsVisibleOnMiniMap : 1; // 0x30:1(0x1)
		bool bIsVisibleOnMap : 1; // 0x30:2(0x1)
		bool bIsVisibilityBasedOnTeam : 1; // 0x30:3(0x1)
		bool bShowVerticalOffset : 1; // 0x30:4(0x1)
		bool bShowFarOffIndicator : 1; // 0x30:5(0x1)
		bool bDisplayIconEvenOnFogOfWar : 1; // 0x30:6(0x1)
		bool bAllowLocalOverrides : 1; // 0x30:7(0x1)
		bool bUseTeamAffiliationColors : 1; // 0x31:0(0x1)
		unsigned char UnknownData06_5[0x2]; // 0x32(0x2) UNKNOWN PROPERTY
		TEnumAsByte DrawLayer; // 0x34(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
		FLinearColor Color; // 0x38(0x10)
		FLinearColor FriendColor; // 0x48(0x10)
		FLinearColor EnemyColor; // 0x58(0x10)
		FLinearColor NeutralColor; // 0x68(0x10)
		FLinearColor PulseColor; // 0x78(0x10)
		float ColorPulsesPerSecond; // 0x88(0x4)
		float SizePulsesPerSecond; // 0x8C(0x4)
		float ViewableDistance; // 0x90(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x94(0x4) UNKNOWN PROPERTY
		FVector LocationOffset; // 0x98(0x18)
		int32_t Priority; // 0xB0(0x4)
		char Team; // 0xB4(0x1)
		unsigned char UnknownData09_6[0x3]; // 0xB5(0x3) UNKNOWN PROPERTY
		TArray MiniMapIconMaterialParameterDataList; // 0xB8(0x10)
	};


	// Struct FortniteGame.FortMiniMapIconMaterialParameterData
	// Size: 0x28 (0x28 - 0x0)
	struct FFortMiniMapIconMaterialParameterData	
	{
	public:
		EMiniMapIconParameterDataType DataType; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName Name; // 0x4(0x4)
		float Scalar; // 0x8(0x4)
		FLinearColor Vector; // 0xC(0x10)
		unsigned char UnknownData03_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		UTexture Texture; // 0x20(0x8)
	};


	// Struct FortniteGame.CreativeMiniMapComponentIconData
	// Size: 0x50 (0x50 - 0x0)
	struct FCreativeMiniMapComponentIconData	
	{
	public:
		int32_t IconIndex; // 0x0(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UTexture2D IconTexture; // 0x8(0x8)
		TWeakObjectPtr IconMaterial; // 0x10(0x20)
		FName IconTextureMaterialParam; // 0x30(0x4)
		ECreativeMinimapComponentIconColorType IconColor; // 0x34(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
		FLinearColor IconLinearColor; // 0x38(0x10)
		float IconScale; // 0x48(0x4)
		unsigned char UnknownData05_7[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortMiniMapIndicatorTextProperties
	// Size: 0x78 (0x78 - 0x0)
	struct FFortMiniMapIndicatorTextProperties	
	{
	public:
		FSlateFontInfo DisplayTextFont; // 0x0(0x58)
		FLinearColor DisplayTextColor; // 0x58(0x10)
		FVector2D DisplayTextOffset; // 0x68(0x10)
	};


	// Struct FortniteGame.FortStatManagerTag
	// Inherited from FGameplayTag
	// Size: 0x0 (0x4 - 0x4)
	struct FFortStatManagerTag : public FGameplayTag	
	{
	public:
	};


	// Struct FortniteGame.FinalizedAttachmentParams
	// Size: 0x38 (0x38 - 0x0)
	struct FFinalizedAttachmentParams	
	{
	public:
		FVector WorldLocation; // 0x0(0x18)
		FRotator WorldRotation; // 0x18(0x18)
		FName SocketName; // 0x30(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ReplicatedAttachParams
	// Size: 0x140 (0x140 - 0x0)
	struct FReplicatedAttachParams	
	{
	public:
		FHitResult Hit; // 0x0(0xF8)
		AActor AttachedToActor; // 0xF8(0x8)
		FVector_NetQuantize10 AttachOffset; // 0x100(0x18)
		FVector_NetQuantizeNormal VelocityNormalized; // 0x118(0x18)
		float NarrowPlacementAgainstVelocityThreshold; // 0x130(0x4)
		float StickyOffsetFromPhysicsMesh; // 0x134(0x4)
		float StickyOffsetFromBoneCenter; // 0x138(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x13C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PartStackEntry
	// Size: 0x10 (0x10 - 0x0)
	struct FPartStackEntry	
	{
	public:
		TArray PartList; // 0x0(0x10)
	};


	// Struct FortniteGame.SettingsSaveContextBehaviorDefinition
	// Size: 0x18 (0x18 - 0x0)
	struct FSettingsSaveContextBehaviorDefinition	
	{
	public:
		FString Name; // 0x0(0x10)
		bool bAllowRequestSave; // 0x10(0x1)
		bool bSendAnalytics; // 0x11(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x12(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlayerLastSelectedPreferredProvider
	// Size: 0x38 (0x38 - 0x0)
	struct FPlayerLastSelectedPreferredProvider	
	{
	public:
		FUniqueNetIdRepl LocalUserId; // 0x0(0x30)
		EAppStore PreferredProvider; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortMobileHUDProfileContainer
	// Size: 0x30 (0x30 - 0x0)
	struct FFortMobileHUDProfileContainer	
	{
	public:
		FFortMobileHUDProfileIdentifier ActiveHUDProfileIdentifier; // 0x0(0x14)
		unsigned char UnknownData02_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TArray CustomHUDProfiles; // 0x18(0x10)
		EHUDLayoutToolTheme HUDLayoutTheme; // 0x28(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortMobileHUDProfileBase
	// Size: 0x38 (0x38 - 0x0)
	struct FFortMobileHUDProfileBase	
	{
	public:
		unsigned char UnknownData03_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		FFortMobileHUDProfileIdentifier HUDProfileIdentifier; // 0x8(0x14)
		unsigned char UnknownData04_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		FText HUDProfileName; // 0x20(0x10)
		FGameplayTag HUDProfileBaseType; // 0x30(0x4)
		unsigned char UnknownData05_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortMobileHUDProfileIdentifier
	// Size: 0x14 (0x14 - 0x0)
	struct FFortMobileHUDProfileIdentifier	
	{
	public:
		FGameplayTag HUDProfileType; // 0x0(0x4)
		FGuid Guid; // 0x4(0x10)
	};


	// Struct FortniteGame.FortMobileCustomHUDProfile
	// Inherited from FFortMobileHUDProfileBase
	// Size: 0x10 (0x48 - 0x38)
	struct FFortMobileCustomHUDProfile : public FFortMobileHUDProfileBase	
	{
	public:
		FFortMobileSchemaModificationContainer Modifications; // 0x38(0x10)
	};


	// Struct FortniteGame.FortMobileSchemaModificationContainer
	// Size: 0x10 (0x10 - 0x0)
	struct FFortMobileSchemaModificationContainer	
	{
	public:
		TArray Modifications; // 0x0(0x10)
	};


	// Struct FortniteGame.FortMobileSchemaModification
	// Size: 0x80 (0x80 - 0x0)
	struct FFortMobileSchemaModification	
	{
	public:
		FGuid Guid; // 0x0(0x10)
		ESchemaModificationType ModificationType; // 0x10(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		FGameplayTag OwningContextTag; // 0x14(0x4)
		FFortMobileHUDWidgetSchemaSave ModifiedSchema; // 0x18(0x68)
	};


	// Struct FortniteGame.FortMobileHUDWidgetSchemaSave
	// Size: 0x68 (0x68 - 0x0)
	struct FFortMobileHUDWidgetSchemaSave	
	{
	public:
		FGameplayTag HUDWidgetClassTag; // 0x0(0x4)
		FGameplayTag BehaviorClassTag; // 0x4(0x4)
		FGuid Guid; // 0x8(0x10)
		FFortMobileHUDWidgetLayoutSave HUDWidgetLayout; // 0x18(0x50)
	};


	// Struct FortniteGame.FortMobileHUDWidgetLayoutSave
	// Size: 0x50 (0x50 - 0x0)
	struct FFortMobileHUDWidgetLayoutSave	
	{
	public:
		FAnchorData LayoutData; // 0x0(0x40)
		TArray CustomProperties; // 0x40(0x10)
	};


	// Struct FortniteGame.FortMobileHUDWidgetCustomPropertySave
	// Size: 0x18 (0x18 - 0x0)
	struct FFortMobileHUDWidgetCustomPropertySave	
	{
	public:
		FGameplayTag PropertyTag; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FString PropertyValue; // 0x8(0x10)
	};


	// Struct FortniteGame.FireModeData
	// Size: 0x5 (0x5 - 0x0)
	struct FFireModeData	
	{
	public:
		bool bAutoFireIsEnabled; // 0x0(0x1)
		bool b3DTouchEnabled; // 0x1(0x1)
		bool bTapToShootEnabled; // 0x2(0x1)
		bool bAlwaysShowDedicatedButton; // 0x3(0x1)
		EFireModeType FireModeType; // 0x4(0x1)
	};


	// Struct FortniteGame.HUDLayoutData
	// Size: 0x10 (0x10 - 0x0)
	struct FHUDLayoutData	
	{
	public:
		TArray LayoutEntries; // 0x0(0x10)
	};


	// Struct FortniteGame.HUDLayoutDataEntry
	// Size: 0x1A0 (0x1A0 - 0x0)
	struct FHUDLayoutDataEntry	
	{
	public:
		FGameplayTag VisualType; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FAnchorData AnchroData; // 0x8(0x40)
		int32_t ZOrder; // 0x48(0x4)
		EBacchusHUDStateType BuildVisibility; // 0x4C(0x1)
		EBacchusHUDStateType CombatVisibility; // 0x4D(0x1)
		EBacchusHUDStateType EditVisibility; // 0x4E(0x1)
		EBacchusHUDStateType CreativeVisibility; // 0x4F(0x1)
		float Property; // 0x50(0x4)
		float Property; // 0x54(0x4)
		float Property; // 0x58(0x4)
		float Property; // 0x5C(0x4)
		TMap FloatProperties; // 0x60(0x50)
		unsigned char UnknownData03_7[0xF0]; // 0xB0(0xF0) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortUserInputSettingsPerMode
	// Size: 0x60 (0x60 - 0x0)
	struct FFortUserInputSettingsPerMode	
	{
	public:
		FFortUserInputSettingsPerInputType KeyboardMouseSettings; // 0x0(0x30)
		FFortUserInputSettingsPerInputType ControllerSettings; // 0x30(0x30)
	};


	// Struct FortniteGame.FortUserInputSettingsPerInputType
	// Size: 0x30 (0x30 - 0x0)
	struct FFortUserInputSettingsPerInputType	
	{
	public:
		FString LayoutPresetName; // 0x0(0x10)
		FString TemplateLayoutPresetNameForCustom; // 0x10(0x10)
		TArray ActionMappings; // 0x20(0x10)
	};


	// Struct FortniteGame.UserActionBindings
	// Size: 0x10 (0x10 - 0x0)
	struct FUserActionBindings	
	{
	public:
		TArray UserActionBindings; // 0x0(0x10)
	};


	// Struct FortniteGame.FortGamepadUserOptions
	// Size: 0x4C (0x4C - 0x0)
	struct FFortGamepadUserOptions	
	{
	public:
		FFortGamepadBasicOptions Basic; // 0x0(0x10)
		FFortGamepadAdvancedOptions Advanced; // 0x10(0x3C)
	};


	// Struct FortniteGame.FortGamepadAdvancedOptions
	// Size: 0x3C (0x3C - 0x0)
	struct FFortGamepadAdvancedOptions	
	{
	public:
		uint32_t LookHorizontalSpeed; // 0x0(0x4)
		uint32_t LookVerticalSpeed; // 0x4(0x4)
		uint32_t LookHorizontalSpeedAds; // 0x8(0x4)
		uint32_t LookVerticalSpeedAds; // 0xC(0x4)
		uint32_t LookHorizontalBoostSpeed; // 0x10(0x4)
		uint32_t LookVerticalBoostSpeed; // 0x14(0x4)
		float LookBoostAccelerationTime; // 0x18(0x4)
		uint32_t LookHorizontalBoostSpeedAds; // 0x1C(0x4)
		uint32_t LookVerticalBoostSpeedAds; // 0x20(0x4)
		float LookBoostAccelerationTimeAds; // 0x24(0x4)
		bool bInstantBoostWhenBuilding; // 0x28(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x29(0x3) UNKNOWN PROPERTY
		float LookEaseTime; // 0x2C(0x4)
		EFortGamepadLookInputCurve LookInputCurve; // 0x30(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		uint32_t AimAssistStrength; // 0x34(0x4)
		bool bUseLegacyControls; // 0x38(0x1)
		unsigned char UnknownData05_7[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGamepadBasicOptions
	// Size: 0x10 (0x10 - 0x0)
	struct FFortGamepadBasicOptions	
	{
	public:
		EFortGamepadSensitivity LookSensitivityPreset; // 0x0(0x1)
		EFortGamepadSensitivity LookSensitivityPresetAds; // 0x1(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float LookBuildModeMultiplier; // 0x4(0x4)
		float LookEditModeMultiplier; // 0x8(0x4)
		bool bUseAdvancedOptions; // 0xC(0x1)
		unsigned char UnknownData03_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortClientSettingRecordPartitionSchema
	// Size: 0x20 (0x20 - 0x0)
	struct FFortClientSettingRecordPartitionSchema	
	{
	public:
		int32_t PartitionVersion; // 0x0(0x4)
		FName ResolvingPartitionName; // 0x4(0x4)
		TArray PartitionContents; // 0x8(0x10)
		UFortClientSettingRecordPartition ResolvedPartition; // 0x18(0x8)
	};


	// Struct FortniteGame.FortPendingSlottedItemOperation
	// Size: 0x18 (0x18 - 0x0)
	struct FFortPendingSlottedItemOperation	
	{
	public:
		FString SlottedItemId; // 0x0(0x10)
		FName SlotRowName; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaPinnedQuestData
	// Size: 0x8 (0x8 - 0x0)
	struct FAthenaPinnedQuestData	
	{
	public:
		UFortControllerComponent_PinQuest PinnedQuestComponent; // 0x0(0x8)
	};


	// Struct FortniteGame.UrgentQuestData
	// Size: 0x168 (0x168 - 0x0)
	struct FUrgentQuestData	
	{
	public:
		FGameplayTag EventTag; // 0x0(0x4)
		float TotalEventTime; // 0x4(0x4)
		bool bQuestCompleteOnTimeExpiration; // 0x8(0x1)
		bool bDisplayHUDData; // 0x9(0x1)
		unsigned char UnknownData05_6[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
		FText EventTitle; // 0x10(0x10)
		FText EventSubtitle; // 0x20(0x10)
		FText EventSubtitleSecondary; // 0x30(0x10)
		FText EventDescription; // 0x40(0x10)
		FText EventDescriptionGamepad; // 0x50(0x10)
		FText EventDescriptionTouch; // 0x60(0x10)
		TArray EventDescriptionOverrides; // 0x70(0x10)
		FGameplayTag EventDescriptionOverrideTag; // 0x80(0x4)
		int32_t SortPriority; // 0x84(0x4)
		bool bHideQuestProgressBar; // 0x88(0x1)
		bool bDisplayAllObjectivesIndividually; // 0x89(0x1)
		unsigned char UnknownData06_6[0x6]; // 0x8A(0x6) UNKNOWN PROPERTY
		FText QuestProgressTextFormat; // 0x90(0x10)
		bool bReverseProgressBar; // 0xA0(0x1)
		bool bShowBountyThreatInformation; // 0xA1(0x1)
		bool bShowBountyPriceAndDistance; // 0xA2(0x1)
		bool bDisplayStartedEventUI; // 0xA3(0x1)
		bool bIsSharedUrgentQuest; // 0xA4(0x1)
		unsigned char UnknownData07_6[0x3]; // 0xA5(0x3) UNKNOWN PROPERTY
		AFortPlayerStateAthena DisplayPlayer; // 0xA8(0x8)
		AFortPlayerStateAthena AcceptingPlayer; // 0xB0(0x8)
		TWeakObjectPtr SocialAvatarBrushPtr; // 0xB8(0x20)
		UObject BountyPriceImage; // 0xD8(0x8)
		TWeakObjectPtr AlertIcon; // 0xE0(0x20)
		TWeakObjectPtr SpecialEventStartedSound; // 0x100(0x20)
		FDateTime EventStartTime; // 0x120(0x8)
		FTimerHandle EventTimerHandle; // 0x128(0x8)
		FLinearColor AlertIconBorderColor; // 0x130(0x10)
		FVector2D AlertIconBrushSize; // 0x140(0x10)
		bool bOverrideWidgetPrimaryColor; // 0x150(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x151(0x3) UNKNOWN PROPERTY
		FLinearColor OverriddenWidgetPrimaryColor; // 0x154(0x10)
		EObjectiveCategories ObjectiveCategory; // 0x164(0x1)
		unsigned char UnknownData09_7[0x3]; // 0x165(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.UrgentQuestDataDescOverrides
	// Size: 0x38 (0x38 - 0x0)
	struct FUrgentQuestDataDescOverrides	
	{
	public:
		FGameplayTag OverrideTag; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FText EventDescription; // 0x8(0x10)
		FText EventDescriptionGamepad; // 0x18(0x10)
		FText EventDescriptionTouch; // 0x28(0x10)
	};


	// Struct FortniteGame.SplinePoint_Serializable
	// Size: 0x88 (0x88 - 0x0)
	struct FSplinePoint_Serializable	
	{
	public:
		float InputKey; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector Position; // 0x8(0x18)
		FVector ArriveTangent; // 0x20(0x18)
		FVector LeaveTangent; // 0x38(0x18)
		FRotator Rotation; // 0x50(0x18)
		FVector Scale; // 0x68(0x18)
		TEnumAsByte Type; // 0x80(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x81(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCurieCableSocketIdentifier
	// Size: 0x8 (0x8 - 0x0)
	struct FFortCurieCableSocketIdentifier	
	{
	public:
		FGameplayTag tag; // 0x0(0x4)
		int32_t Index; // 0x4(0x4)
	};


	// Struct FortniteGame.FortCurieCableSocket
	// Size: 0xE0 (0xE0 - 0x0)
	struct FFortCurieCableSocket	
	{
	public:
		FFortCurieCableSocketIdentifier SocketIdentifier; // 0x0(0x8)
		FVector Location; // 0x8(0x18)
		FFortCurieCableSocketConnection SocketConnection; // 0x20(0x18)
		bool bAutoSendSignalOnElementAttachment : 1; // 0x38:0(0x1)
		bool bAutoSendSignalOnElementDetachment : 1; // 0x38:1(0x1)
		bool bAutoRouteToCurieComponentOnReceive : 1; // 0x38:2(0x1)
		unsigned char UnknownData02_5[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
		TMap ReceivedElementToMagnitudeMap; // 0x40(0x50)
		unsigned char UnknownData03_7[0x50]; // 0x90(0x50) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCurieCableSocketConnection
	// Size: 0x18 (0x18 - 0x0)
	struct FFortCurieCableSocketConnection	
	{
	public:
		AActor ConnectedActor; // 0x0(0x8)
		FFortCurieCableSocketIdentifier ConnectedSocketIdentifier; // 0x8(0x8)
		UFortCurieCableSocketComponent ConnectedSocketComponent; // 0x10(0x8)
	};


	// Struct FortniteGame.FortDialogDescription
	// Size: 0x130 (0x130 - 0x0)
	struct FFortDialogDescription	
	{
	public:
		FSlateBrush Icon; // 0x0(0xB0)
		FText MessageHeader; // 0xB0(0x10)
		FText MessageBody; // 0xC0(0x10)
		FText AcceptButtonText; // 0xD0(0x10)
		FText IgnoreButtonText; // 0xE0(0x10)
		FText DismissButtonText; // 0xF0(0x10)
		float DisplayTime; // 0x100(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x104(0x4) UNKNOWN PROPERTY
		UUserWidget AdditionalContent; // 0x108(0x8)
		EFortDialogFeedbackType FeedBackType; // 0x110(0x1)
		bool Dismissable; // 0x111(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x112(0x6) UNKNOWN PROPERTY
		UFortNotificationHandler NotificationHandler; // 0x118(0x8)
		unsigned char UnknownData05_7[0x10]; // 0x120(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGameplayEffectContainer
	// Size: 0xB8 (0xB8 - 0x0)
	struct FFortGameplayEffectContainer	
	{
	public:
		FGameplayTag ApplicationTag; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FFortAbilityTargetSelectionList TargetSelection; // 0x8(0x48)
		TArray TargetGameplayEffectClasses; // 0x50(0x10)
		TArray OwnerGameplayEffectClasses; // 0x60(0x10)
		FGameplayTagContainer ActivationCues; // 0x70(0x20)
		FGameplayTagContainer ImpactCues; // 0x90(0x20)
		bool bUseCalculationInTooltips; // 0xB0(0x1)
		bool bOverrideChargeMagnitude; // 0xB1(0x1)
		unsigned char UnknownData03_6[0x2]; // 0xB2(0x2) UNKNOWN PROPERTY
		float ChargeMagnitudeOverrideValue; // 0xB4(0x4)
	};


	// Struct FortniteGame.FortAbilityTargetSelectionList
	// Size: 0x48 (0x48 - 0x0)
	struct FFortAbilityTargetSelectionList	
	{
	public:
		TArray List; // 0x0(0x10)
		bool bStopAtFirstSuccess : 1; // 0x10:0(0x1)
		bool bKeepCheckingListOnIndestructibleHit : 1; // 0x10:1(0x1)
		unsigned char UnknownData03_5[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer AbilityTargetBlockedGameplayTags; // 0x18(0x20)
		bool bUseWeaponRanges : 1; // 0x38:0(0x1)
		bool bUseMaxYawAngleToTarget : 1; // 0x38:1(0x1)
		unsigned char UnknownData04_5[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float MaxYawAngleToTarget; // 0x3C(0x4)
		unsigned char UnknownData05_7[0x8]; // 0x40(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAbilityTargetSelection
	// Size: 0x168 (0x168 - 0x0)
	struct FFortAbilityTargetSelection	
	{
	public:
		TEnumAsByte Shape; // 0x0(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FString CustomShapeComponentName; // 0x8(0x10)
		EFortTargetSelectionTestType TestType; // 0x18(0x1)
		EFortAbilityTargetingSource PrimarySource; // 0x19(0x1)
		EFortAbilityTargetingSource SecondarySource; // 0x1A(0x1)
		unsigned char UnknownData07_6[0x5]; // 0x1B(0x5) UNKNOWN PROPERTY
		FScalableFloat Range; // 0x20(0x28)
		FVector HalfExtents; // 0x48(0x18)
		bool bAlignShapeEdgeToSourceLocation; // 0x60(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x61(0x7) UNKNOWN PROPERTY
		FScalableFloat ConeYawAngle; // 0x68(0x28)
		FScalableFloat ConePitchAngle; // 0x90(0x28)
		FScalableFloat ConeMinRadius; // 0xB8(0x28)
		FFortTargetFilter TargetFilter; // 0xE0(0x40)
		bool bExcludeObstructedByWorld; // 0x120(0x1)
		unsigned char UnknownData09_6[0x7]; // 0x121(0x7) UNKNOWN PROPERTY
		TArray ExcludeObstructedByWorldOnlyForTargetActorClasses; // 0x128(0x10)
		bool bShouldAttachedActorsObstructTarget; // 0x138(0x1)
		unsigned char UnknownData10_6[0x7]; // 0x139(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer ObstructionExclusionGameplayTags; // 0x140(0x20)
		bool bCreateHitResultWhenNoTargetsFound; // 0x160(0x1)
		bool bUseProjectileRotationForDamageZones; // 0x161(0x1)
		EFortAbilityTargetSelectionUsage TargetSelectionUsage; // 0x162(0x1)
		unsigned char UnknownData11_6[0x1]; // 0x163(0x1) UNKNOWN PROPERTY
		int32_t MaxTargets; // 0x164(0x4)
	};


	// Struct FortniteGame.FortTargetFilter
	// Size: 0x40 (0x40 - 0x0)
	struct FFortTargetFilter	
	{
	public:
		TEnumAsByte ActorTypeFilter; // 0x0(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UClass ActorClassFilter; // 0x8(0x8)
		bool bExcludeInstigator : 1; // 0x10:0(0x1)
		bool bUseTrapsOwningPawnAsInstigator : 1; // 0x10:1(0x1)
		bool bExcludeRequester : 1; // 0x10:2(0x1)
		bool bExcludeAllAttachedToInstigator : 1; // 0x10:3(0x1)
		bool bExcludeAthenaVehicleOfInstigator : 1; // 0x10:4(0x1)
		bool bExcludeAllAttachedToRequester : 1; // 0x10:5(0x1)
		bool bExcludeTargetsInEditMode : 1; // 0x10:6(0x1)
		bool bExcludePawnFriends : 1; // 0x10:7(0x1)
		bool bExcludeFriendlyAI : 1; // 0x11:0(0x1)
		bool bIncludeRiddenAI : 1; // 0x11:1(0x1)
		bool bExcludeAllAI : 1; // 0x11:2(0x1)
		bool bExcludePawnNeutrals : 1; // 0x11:3(0x1)
		bool bExcludePawnEnemies : 1; // 0x11:4(0x1)
		bool bExcludeNonPawnFriends : 1; // 0x11:5(0x1)
		bool bExcludeNonPawnEnemies : 1; // 0x11:6(0x1)
		bool bConsiderFriendlyFireWhenExcludingFriends : 1; // 0x11:7(0x1)
		bool bExcludeDBNOPawns : 1; // 0x12:0(0x1)
		bool bExcludeFallingPawns : 1; // 0x12:1(0x1)
		bool bExcludeWaterVolumes : 1; // 0x12:2(0x1)
		bool bExcludeWaterBodies : 1; // 0x12:3(0x1)
		bool bExcludeAthenaVehicleOccupiedBySource : 1; // 0x12:4(0x1)
		bool bExcludeAthenaVehicleUnoccupied : 1; // 0x12:5(0x1)
		bool bExcludeAthenaVehicleOccupied : 1; // 0x12:6(0x1)
		unsigned char UnknownData05_3[0x1]; // 0x13(0x1) UNKNOWN PROPERTY
		bool bExcludePassengersInSameVehicleAsSource : 1; // 0x14:0(0x1)
		unsigned char UnknownData06_3[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
		bool bExcludeAthenaVehicleFromObstructionChecks : 1; // 0x18:0(0x1)
		bool bExcludeWithoutNavigationCorridor : 1; // 0x18:1(0x1)
		bool bExcludeNonPlayerBuiltPieces : 1; // 0x18:2(0x1)
		bool bExcludePlayerBuiltPieces : 1; // 0x18:3(0x1)
		bool bExcludeNonBGABuildings : 1; // 0x18:4(0x1)
		bool bExcludeNonBlockingHits : 1; // 0x18:5(0x1)
		bool bExcludeProjectiles : 1; // 0x18:6(0x1)
		bool bTraceComplexCollision : 1; // 0x18:7(0x1)
		bool bExcludeLandscape : 1; // 0x19:0(0x1)
		bool bConsiderPhysicsPawnsAsNonPlayerPawns : 1; // 0x19:1(0x1)
		unsigned char UnknownData07_5[0x6]; // 0x1A(0x6) UNKNOWN PROPERTY
		FGameplayTagContainer ExclusionGameplayTags; // 0x20(0x20)
	};


	// Struct FortniteGame.FortGameplayEffectContainerSpec
	// Size: 0xB8 (0xB8 - 0x0)
	struct FFortGameplayEffectContainerSpec	
	{
	public:
		FFortAbilityTargetSelectionList TargetSelection; // 0x0(0x48)
		TArray TargetGameplayEffectSpecs; // 0x48(0x10)
		TArray OwnerGameplayEffectSpecs; // 0x58(0x10)
		FGameplayTagContainer ActivationCues; // 0x68(0x20)
		FGameplayTagContainer ImpactCues; // 0x88(0x20)
		float ImpactNoiseRange; // 0xA8(0x4)
		float FlyByNoiseRange; // 0xAC(0x4)
		bool bOverrideChargeMagnitude; // 0xB0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xB1(0x3) UNKNOWN PROPERTY
		float ChargeMagnitudeOverrideValue; // 0xB4(0x4)
	};


	// Struct FortniteGame.FortGameplayAbilityTagChangedAction
	// Size: 0x18 (0x18 - 0x0)
	struct FFortGameplayAbilityTagChangedAction	
	{
	public:
		EFortGameplayAbilityTagChangedEvent Trigger; // 0x0(0x1)
		EFortGameplayAbilityTagChangedActionType Action; // 0x1(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		FGameplayTag tag; // 0x4(0x4)
		unsigned char UnknownData03_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AbilityTrackedActorSettings
	// Size: 0x28 (0x28 - 0x0)
	struct FAbilityTrackedActorSettings	
	{
	public:
		FScalableFloat MaximumTrackedActors; // 0x0(0x28)
	};


	// Struct FortniteGame.FortGameplayAbilityMontageInfo
	// Size: 0x58 (0x58 - 0x0)
	struct FFortGameplayAbilityMontageInfo	
	{
	public:
		UAnimMontage MontageToPlay; // 0x0(0x8)
		float AnimPlayRate; // 0x8(0x4)
		float AnimRootMotionTranslationScale; // 0xC(0x4)
		EFortGameplayAbilityMontageSectionToPlay MontageSectionToPlay; // 0x10(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		FName OverrideSection; // 0x14(0x4)
		bool bPlayRandomSection; // 0x18(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		TArray CharacterPartMontages; // 0x20(0x10)
		unsigned char UnknownData05_7[0x28]; // 0x30(0x28) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCharacterPartMontageInfo
	// Size: 0x10 (0x10 - 0x0)
	struct FFortCharacterPartMontageInfo	
	{
	public:
		TEnumAsByte CharacterPart; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UAnimMontage AnimMontage; // 0x8(0x8)
	};


	// Struct FortniteGame.FortAbilityCost
	// Size: 0x40 (0x40 - 0x0)
	struct FFortAbilityCost	
	{
	public:
		EFortAbilityCostSource CostSource; // 0x0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FScalableFloat CostValue; // 0x8(0x28)
		UFortItemDefinition ItemDefinition; // 0x30(0x8)
		bool bOnlyApplyCostOnHit; // 0x38(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortProjectileTrajectoryData
	// Size: 0x20 (0x20 - 0x0)
	struct FFortProjectileTrajectoryData	
	{
	public:
		float Speed; // 0x0(0x4)
		float GravityZ; // 0x4(0x4)
		float CapsuleRadius; // 0x8(0x4)
		float CapsuleHalfHeight; // 0xC(0x4)
		bool bShouldBounce; // 0x10(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		float Bounciness; // 0x14(0x4)
		float Friction; // 0x18(0x4)
		TEnumAsByte CollisionObjectType; // 0x1C(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.HeldObjectMovementReplicatedData
	// Size: 0x50 (0x50 - 0x0)
	struct FHeldObjectMovementReplicatedData	
	{
	public:
		char RepIncrement; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FVector DetachLocation; // 0x8(0x18)
		FRotator DetachRotation; // 0x20(0x18)
		FVector MovementVelocity; // 0x38(0x18)
	};


	// Struct FortniteGame.HeldObjectThrownData
	// Size: 0x50 (0x50 - 0x0)
	struct FHeldObjectThrownData	
	{
	public:
		FScalableFloat MaxSpeed; // 0x0(0x28)
		FScalableFloat GravityScale; // 0x28(0x28)
	};


	// Struct FortniteGame.McpBanInfo
	// Size: 0x40 (0x40 - 0x0)
	struct FMcpBanInfo	
	{
	public:
		TArray BanReasons; // 0x0(0x10)
		FString ExploitProgramName; // 0x10(0x10)
		FString AdditionalInfo; // 0x20(0x10)
		FDateTime BanStartTimeUtc; // 0x30(0x8)
		float BanDurationDays; // 0x38(0x4)
		EPlayerCompetitiveBanReasons CompetitiveBanReason; // 0x3C(0x1)
		bool bRequiresUserAck; // 0x3D(0x1)
		bool bBanHasStarted; // 0x3E(0x1)
		unsigned char UnknownData01_7[0x1]; // 0x3F(0x1) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCampaignLoadout
	// Size: 0x8 (0x8 - 0x0)
	struct FFortCampaignLoadout	
	{
	public:
		UFortPersonalVehicleItem PersonalVehicle; // 0x0(0x8)
	};


	// Struct FortniteGame.FriendCode
	// Size: 0x20 (0x20 - 0x0)
	struct FFriendCode	
	{
	public:
		FString Code; // 0x0(0x10)
		FString CodeType; // 0x10(0x10)
	};


	// Struct FortniteGame.FortHomeBaseInfo
	// Size: 0x38 (0x38 - 0x0)
	struct FFortHomeBaseInfo	
	{
	public:
		FString BannerIconId; // 0x0(0x10)
		FString BannerColorId; // 0x10(0x10)
		FText Name; // 0x20(0x10)
		bool ValidData; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortQuestObjectiveCompletion
	// Size: 0x30 (0x30 - 0x0)
	struct FFortQuestObjectiveCompletion	
	{
	public:
		FString StatName; // 0x0(0x10)
		int32_t Count; // 0x10(0x4)
		int32_t TimestampOffset; // 0x14(0x4)
		unsigned char UnknownData01_7[0x18]; // 0x18(0x18) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortSubgameClientSettings
	// Size: 0x10 (0x10 - 0x0)
	struct FFortSubgameClientSettings	
	{
	public:
		TArray PinnedQuestInstances; // 0x0(0x10)
	};


	// Struct FortniteGame.AccountIdAndScore
	// Size: 0x20 (0x20 - 0x0)
	struct FAccountIdAndScore	
	{
	public:
		FString AccountId; // 0x0(0x10)
		int32_t TotalScore; // 0x10(0x4)
		int32_t IndividualContribution; // 0x14(0x4)
		bool bCriticalMatchBonus; // 0x18(0x1)
		bool bIsLeecherExempt; // 0x19(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x1A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AccountIdAndMatchEndData
	// Size: 0x1B8 (0x1B8 - 0x0)
	struct FAccountIdAndMatchEndData	
	{
	public:
		FString AccountId; // 0x0(0x10)
		TArray Advance; // 0x10(0x10)
		TArray EarnedBadgeData; // 0x20(0x10)
		TArray EarnedItemCaches; // 0x30(0x10)
		int32_t TotalScore; // 0x40(0x4)
		bool bCriticalMatchBonus; // 0x44(0x1)
		bool bDidLeech; // 0x45(0x1)
		unsigned char UnknownData07_6[0x2]; // 0x46(0x2) UNKNOWN PROPERTY
		int32_t NumMissionPoints; // 0x48(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
		TArray ShuffledLoadoutUsed; // 0x50(0x10)
		int32_t ShuffledLockerUsedIndex; // 0x60(0x4)
		unsigned char UnknownData09_6[0x4]; // 0x64(0x4) UNKNOWN PROPERTY
		TArray UsedCosmetics; // 0x68(0x10)
		int32_t TheaterNum; // 0x78(0x4)
		unsigned char UnknownData10_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		FMcpProfileChangeRequest TheaterItemUpdate; // 0x80(0x58)
		int32_t OutpostNum; // 0xD8(0x4)
		unsigned char UnknownData11_6[0x4]; // 0xDC(0x4) UNKNOWN PROPERTY
		FMcpProfileChangeRequest OutpostItemUpdate; // 0xE0(0x58)
		FString OutpostId; // 0x138(0x10)
		FFortOutpostCoreInfo OutpostInfo; // 0x148(0x28)
		FString DeployableBaseItemId; // 0x170(0x10)
		FFortCloudSaveInfo CloudSaveInfo; // 0x180(0x18)
		FString LockCode; // 0x198(0x10)
		bool bAbandoning; // 0x1A8(0x1)
		EAthenaRebootEligiblityStatus EligibilityStatus; // 0x1A9(0x1)
		unsigned char UnknownData12_6[0x2]; // 0x1AA(0x2) UNKNOWN PROPERTY
		float MissionLeechScaling; // 0x1AC(0x4)
		int32_t TotalSecondsInMatch; // 0x1B0(0x4)
		unsigned char UnknownData13_7[0x4]; // 0x1B4(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCloudSaveInfo
	// Size: 0x18 (0x18 - 0x0)
	struct FFortCloudSaveInfo	
	{
	public:
		int32_t SaveCount; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray SavedRecords; // 0x8(0x10)
	};


	// Struct FortniteGame.FortCloudSaveRecordInfo
	// Size: 0x18 (0x18 - 0x0)
	struct FFortCloudSaveRecordInfo	
	{
	public:
		int32_t RecordIndex; // 0x0(0x4)
		int32_t ArchiveNumber; // 0x4(0x4)
		FString RecordFilename; // 0x8(0x10)
	};


	// Struct FortniteGame.FortOutpostCoreInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FFortOutpostCoreInfo	
	{
	public:
		TArray PlacedBuildings; // 0x0(0x10)
		TArray AccountsWithEditPermission; // 0x10(0x10)
		uint32_t HighestEnduranceWaveReached; // 0x20(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortPlacedBuilding
	// Size: 0x20 (0x20 - 0x0)
	struct FFortPlacedBuilding	
	{
	public:
		FString BuildingTag; // 0x0(0x10)
		FString PlacedTag; // 0x10(0x10)
	};


	// Struct FortniteGame.FortQuestEarnedBadgeData
	// Size: 0x18 (0x18 - 0x0)
	struct FFortQuestEarnedBadgeData	
	{
	public:
		FString TemplateId; // 0x0(0x10)
		int32_t Count; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.EndZoneScoreAndAwards
	// Size: 0x70 (0x70 - 0x0)
	struct FEndZoneScoreAndAwards	
	{
	public:
		bool bResultsPendingSave; // 0x0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		int32_t TotalScore; // 0x4(0x4)
		bool bCriticalMatchBonus; // 0x8(0x1)
		bool bDidLeech; // 0x9(0x1)
		EAthenaRebootEligiblityStatus EligibilityStatus; // 0xA(0x1)
		unsigned char UnknownData04_6[0x5]; // 0xB(0x5) UNKNOWN PROPERTY
		TArray EarnedBadgeData; // 0x10(0x10)
		TArray EarnedItemCaches; // 0x20(0x10)
		int32_t NumMissionPoints; // 0x30(0x4)
		float MissionLeechScaling; // 0x34(0x4)
		unsigned char UnknownData05_6[0x34]; // 0x38(0x34) UNKNOWN PROPERTY
		int32_t TotalSecondsInMatch; // 0x6C(0x4)
	};


	// Struct FortniteGame.McpVariantReader
	// Size: 0x30 (0x30 - 0x0)
	struct FMcpVariantReader	
	{
	public:
		FString Channel; // 0x0(0x10)
		FString Active; // 0x10(0x10)
		TArray Owned; // 0x20(0x10)
	};


	// Struct FortniteGame.SlidingControlParams
	// Size: 0x6C0 (0x6C0 - 0x0)
	struct FSlidingControlParams	
	{
	public:
		FScalableFloat MinAnalogSpeed; // 0x0(0x28)
		FScalableFloat BrakingDeceleration; // 0x28(0x28)
		FScalableFloat WalkableFloorAngle; // 0x50(0x28)
		FScalableFloat SlidingIsEnabled; // 0x78(0x28)
		FScalableFloat MinSpeedToStartSliding; // 0xA0(0x28)
		FScalableFloat UphillSlideStartBoost; // 0xC8(0x28)
		FScalableFloat LevelSlideStartBoost; // 0xF0(0x28)
		FScalableFloat DownhillSlideStartBoost; // 0x118(0x28)
		FScalableFloat MaxSlidingSlopeAngle; // 0x140(0x28)
		FScalableFloat BoostUphillGroundFrictionMultiplier; // 0x168(0x28)
		FScalableFloat BoostLevelGroundFrictionMultiplier; // 0x190(0x28)
		FScalableFloat UphillGroundFrictionMultiplier; // 0x1B8(0x28)
		FScalableFloat LevelGroundFrictionMultiplier; // 0x1E0(0x28)
		FScalableFloat DownhillGroundFrictionMultiplier; // 0x208(0x28)
		FScalableFloat MaxForwardSlidingSpeed; // 0x230(0x28)
		FScalableFloat MaxLateralSlidingSpeed; // 0x258(0x28)
		FScalableFloat MinForwardSlidingSpeed; // 0x280(0x28)
		FScalableFloat MaxForwardSlidingAcceleration; // 0x2A8(0x28)
		FScalableFloat MaxLateralSlidingAcceleration; // 0x2D0(0x28)
		FScalableFloat MaxBackwardSlidingAcceleration; // 0x2F8(0x28)
		FScalableFloat SlidingFatigueDuration; // 0x320(0x28)
		FScalableFloat SlidingFatigueMultiplier; // 0x348(0x28)
		FScalableFloat EnterSlideFromFallInputBuffer; // 0x370(0x28)
		FScalableFloat CrouchCooldownAfterSlideDuration; // 0x398(0x28)
		bool bUncrouchAfterSlidingIfMoving; // 0x3C0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x3C1(0x3) UNKNOWN PROPERTY
		float MinAccelerationSlidingAngle; // 0x3C4(0x4)
		FScalableFloat MinAngleForAdditionalMomentum; // 0x3C8(0x28)
		FScalableFloat MinAdditionalMomentum; // 0x3F0(0x28)
		FScalableFloat MaxAdditionalMomentum; // 0x418(0x28)
		bool bClampMaximumSpeedToEntryDirection; // 0x440(0x1)
		bool bUsePhysicsSlidingDownSlopeImpulsion; // 0x441(0x1)
		unsigned char UnknownData05_6[0x6]; // 0x442(0x6) UNKNOWN PROPERTY
		FScalableFloat FallingGracePeriod; // 0x448(0x28)
		FScalableFloat LandingVelocityReductionRatio; // 0x470(0x28)
		bool UseAccelerationRotateVelocity; // 0x498(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x499(0x7) UNKNOWN PROPERTY
		FScalableFloat MaxRotationAngleOnAcceleration; // 0x4A0(0x28)
		FScalableFloat RotationAngleSpeedOnAcceleration; // 0x4C8(0x28)
		FScalableFloat SlopeUpAddedFrictionAngle; // 0x4F0(0x28)
		FScalableFloat SlopeUpAddedFrictionValue; // 0x518(0x28)
		FScalableFloat SlidingVerticalVelocityConvertedOnLanding; // 0x540(0x28)
		UCurveFloat SlidingLandingSpeedTransferRatioCurve; // 0x568(0x8)
		FScalableFloat SlidingUseSlopeAngleForVerticalVelocityTransferRatio; // 0x570(0x28)
		UCurveFloat SlidingSpeedAddedFrictionCurve; // 0x598(0x8)
		FScalableFloat SlidingRentryFromJumpPenalty; // 0x5A0(0x28)
		FScalableFloat SlidingMaxAngleForBaseTransferOnLanding; // 0x5C8(0x28)
		FScalableFloat JumpSlideCapsuleRadiusDetectionRange; // 0x5F0(0x28)
		FScalableFloat JumpSlideCapsuleHeightClearanceCoefficient; // 0x618(0x28)
		FScalableFloat JumpSlideAllowedSurfaceAngleDeviation; // 0x640(0x28)
		FScalableFloat MinSpeedToStartJumpSliding; // 0x668(0x28)
		FScalableFloat JumpSlideSweepHeightShrinkCoefficient; // 0x690(0x28)
		char SlidingFatigueMaxCount; // 0x6B8(0x1)
		unsigned char UnknownData07_7[0x7]; // 0x6B9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SwingingControlParams
	// Size: 0x738 (0x738 - 0x0)
	struct FSwingingControlParams	
	{
	public:
		UCurveFloat ReelForceByRopeLength; // 0x0(0x8)
		FScalableFloat ReelingSpeed; // 0x8(0x28)
		FScalableFloat ReelingSpeedGrounded; // 0x30(0x28)
		FScalableFloat ReelingSpeedGroundedAttachedVehicle; // 0x58(0x28)
		FScalableFloat MaxReelingSpeed; // 0x80(0x28)
		FScalableFloat InputAccelMultiplier; // 0xA8(0x28)
		FScalableFloat InputAccelMultiplierAirbornUnattached; // 0xD0(0x28)
		FScalableFloat AirbornUnattachedInputFriction; // 0xF8(0x28)
		FScalableFloat LengthForMaxReelForce; // 0x120(0x28)
		FScalableFloat MaxHorizontalSpeed; // 0x148(0x28)
		FScalableFloat MaxHorizontalSpeedGrounded; // 0x170(0x28)
		FScalableFloat MaxHorizontalSpeedGroundedAttachedVehicle; // 0x198(0x28)
		FScalableFloat SwingGravity; // 0x1C0(0x28)
		FScalableFloat GravityMultiplierWhileAttached; // 0x1E8(0x28)
		FScalableFloat UnattachedGroundedFriction; // 0x210(0x28)
		FScalableFloat UnattachedGroundedBraking; // 0x238(0x28)
		FScalableFloat UnattachedGroundedCounterInput_MaxDrag; // 0x260(0x28)
		FScalableFloat UnattachedGroundedCounterInput_MinDrag; // 0x288(0x28)
		FScalableFloat UnattachedGroundedCounterInput_MaxDot; // 0x2B0(0x28)
		FScalableFloat UnattachedGroundedCounterInput_MinDot; // 0x2D8(0x28)
		FScalableFloat AttachedNoAccelFriction; // 0x300(0x28)
		FScalableFloat AttachedNoAccelBraking; // 0x328(0x28)
		FScalableFloat AttachedGroundedSwingingFriction; // 0x350(0x28)
		FScalableFloat AttachedGroundedSwingingBraking; // 0x378(0x28)
		FScalableFloat UnattachedCancelSpeed; // 0x3A0(0x28)
		FScalableFloat MinTimeDetachedForExit; // 0x3C8(0x28)
		FScalableFloat AdditionalDownAccelWhileSwinging; // 0x3F0(0x28)
		FScalableFloat VerticalDistanceToAttachPointToLeaveGround; // 0x418(0x28)
		FScalableFloat JumpZVelocity; // 0x440(0x28)
		FScalableFloat WaterMaxImmersionPercent; // 0x468(0x28)
		FScalableFloat WaterUpSpeed; // 0x490(0x28)
		FScalableFloat DefaultForwardInputAccel; // 0x4B8(0x28)
		FScalableFloat InitialAttachedSpeed; // 0x4E0(0x28)
		FScalableFloat GroundTraceDistance; // 0x508(0x28)
		FScalableFloat DistanceThresholdForGrounded; // 0x530(0x28)
		FScalableFloat SpeedForMaxInputAccel; // 0x558(0x28)
		FScalableFloat MinInputAccelMultiplier; // 0x580(0x28)
		FScalableFloat MinRopeLengthForAccel; // 0x5A8(0x28)
		FScalableFloat ClampPosVerticalSpeedWhileAttached; // 0x5D0(0x28)
		FScalableFloat MaxAttachedPosVerticalSpeed; // 0x5F8(0x28)
		FScalableFloat ClampNegVerticalSpeedWhileAttached; // 0x620(0x28)
		FScalableFloat MaxAttachedNegVerticalSpeed; // 0x648(0x28)
		FScalableFloat ClampPosVerticalSpeedWhileUnattached; // 0x670(0x28)
		FScalableFloat MaxUnattachedPosVerticalSpeed; // 0x698(0x28)
		FScalableFloat ClampNegVerticalSpeedWhileUnattached; // 0x6C0(0x28)
		FScalableFloat MaxUnattachedNegVerticalSpeed; // 0x6E8(0x28)
		FScalableFloat bDisableGroundedSwingingCalculations; // 0x710(0x28)
	};


	// Struct FortniteGame.SynchedActionInfo
	// Size: 0x30 (0x30 - 0x0)
	struct FSynchedActionInfo	
	{
	public:
		FName WarpSyncPoint1Name; // 0x0(0x4)
		FName WarpSyncPointLandingOrientationName; // 0x4(0x4)
		float DistanceToTarget; // 0x8(0x4)
		float DistanceToTargetX; // 0xC(0x4)
		float DistanceToTargetY; // 0x10(0x4)
		float DistanceToTargetZ; // 0x14(0x4)
		float AngleToTargetHorizontal; // 0x18(0x4)
		float DistanceWarpPoint1ToWarpPoint2; // 0x1C(0x4)
		float DistanceWarpPoint1ToWarpPoint2X; // 0x20(0x4)
		float DistanceWarpPoint1ToWarpPoint2Y; // 0x24(0x4)
		float DistanceWarpPoint1ToWarpPoint2Z; // 0x28(0x4)
		float StartingGroundAngle; // 0x2C(0x4)
	};


	// Struct FortniteGame.WaterSprintBoostParams
	// Size: 0xF0 (0xF0 - 0x0)
	struct FWaterSprintBoostParams	
	{
	public:
		FScalableFloat RequiredDepth; // 0x0(0x28)
		FScalableFloat TriggerAboveDepth; // 0x28(0x28)
		FScalableFloat TriggerAtVelocity; // 0x50(0x28)
		FScalableFloat PreventAtVelocity; // 0x78(0x28)
		FScalableFloat duration; // 0xA0(0x28)
		FScalableFloat MaxSpeed; // 0xC8(0x28)
	};


	// Struct FortniteGame.WaterJumpParams
	// Size: 0xA0 (0xA0 - 0x0)
	struct FWaterJumpParams	
	{
	public:
		FScalableFloat WaterJumpMinVelocityZ; // 0x0(0x28)
		FScalableFloat WaterJumpMaxVelocityZ; // 0x28(0x28)
		FScalableFloat WaterJumpForceZ; // 0x50(0x28)
		FScalableFloat JumpForceDuration; // 0x78(0x28)
	};


	// Struct FortniteGame.WaterControlParams
	// Size: 0x690 (0x690 - 0x0)
	struct FWaterControlParams	
	{
	public:
		FScalableFloat MinImmersionDepth; // 0x0(0x28)
		FScalableFloat TargetImmersionDepth; // 0x28(0x28)
		FScalableFloat MaxImmersionDepth; // 0x50(0x28)
		FScalableFloat CancelCrouchImmersionDepth; // 0x78(0x28)
		FScalableFloat DBNOSwimImmersionDepth; // 0xA0(0x28)
		FScalableFloat MaxAcceleration; // 0xC8(0x28)
		FScalableFloat MaxAccelerationSprinting; // 0xF0(0x28)
		FScalableFloat BrakingDeceleration; // 0x118(0x28)
		FScalableFloat MaxNormalSpeed; // 0x140(0x28)
		FScalableFloat MaxSprintSpeed; // 0x168(0x28)
		FScalableFloat MinSprintJumpSpeed; // 0x190(0x28)
		FScalableFloat SprintJumpAirAccelAngleLimit; // 0x1B8(0x28)
		FScalableFloat SprintRetriggerDelay; // 0x1E0(0x28)
		FScalableFloat SprintDelayAfterFiring; // 0x208(0x28)
		FScalableFloat MaxTargetingSpeed; // 0x230(0x28)
		FScalableFloat BackwardsSpeedMultiplier; // 0x258(0x28)
		FScalableFloat BackwardsSpeedCosAngle; // 0x280(0x28)
		FScalableFloat AngledSpeedMultiplier; // 0x2A8(0x28)
		FScalableFloat AngledSpeedCosAngle; // 0x2D0(0x28)
		FScalableFloat Friction; // 0x2F8(0x28)
		FScalableFloat FrictionSprinting; // 0x320(0x28)
		FScalableFloat FrictionDirectionChangeDot; // 0x348(0x28)
		FScalableFloat FrictionDirectionChangeMultiplier; // 0x370(0x28)
		FScalableFloat MaxSpeedUp; // 0x398(0x28)
		FScalableFloat MaxSpeedDown; // 0x3C0(0x28)
		FScalableFloat MaxHorizontalEntrySpeed; // 0x3E8(0x28)
		FScalableFloat WaterForceMultiplier; // 0x410(0x28)
		FScalableFloat WaterForceSecondMultiplier; // 0x438(0x28)
		FScalableFloat MaxWaterForce; // 0x460(0x28)
		FScalableFloat WaterVelocityDepthForMax; // 0x488(0x28)
		FScalableFloat WaterVelocityMinMultiplier; // 0x4B0(0x28)
		FScalableFloat WaterSimMaxTimeStep; // 0x4D8(0x28)
		FScalableFloat WaterSimSubStepTime; // 0x500(0x28)
		FScalableFloat BobbingMaxForce; // 0x528(0x28)
		FScalableFloat BobbingIdealDepthTolerance; // 0x550(0x28)
		FScalableFloat BobbingFrictionDown; // 0x578(0x28)
		FScalableFloat BobbingExpDragDown; // 0x5A0(0x28)
		FScalableFloat BobbingFrictionDownSubmerged; // 0x5C8(0x28)
		FScalableFloat BobbingExpDragDownSubmerged; // 0x5F0(0x28)
		FScalableFloat BobbingFrictionUp; // 0x618(0x28)
		FScalableFloat BobbingExpDragUp; // 0x640(0x28)
		FScalableFloat BoostDragMultiplier; // 0x668(0x28)
	};


	// Struct FortniteGame.AirControlParams
	// Size: 0x140 (0x140 - 0x0)
	struct FAirControlParams	
	{
	public:
		FScalableFloat MaxAcceleration; // 0x0(0x28)
		FScalableFloat LateralFriction; // 0x28(0x28)
		FScalableFloat MaxLateralSpeed; // 0x50(0x28)
		FScalableFloat TerminalVelocity; // 0x78(0x28)
		FScalableFloat UpwardTerminalVelocity; // 0xA0(0x28)
		FScalableFloat GravityScalar; // 0xC8(0x28)
		FScalableFloat CustomGravityCeiling; // 0xF0(0x28)
		FScalableFloat CustomGravityCeilingWidth; // 0x118(0x28)
	};


	// Struct FortniteGame.GoopControlParams
	// Size: 0xA0 (0xA0 - 0x0)
	struct FGoopControlParams	
	{
	public:
		FScalableFloat DragHorizontalPercent; // 0x0(0x28)
		FScalableFloat DragVerticalPercent; // 0x28(0x28)
		FScalableFloat DragHorizontalFlat; // 0x50(0x28)
		FScalableFloat DragVerticalFlat; // 0x78(0x28)
	};


	// Struct FortniteGame.FlyingRidableControlParams
	// Size: 0x1C0 (0x1C0 - 0x0)
	struct FFlyingRidableControlParams	
	{
	public:
		FScalableFloat AirFriction; // 0x0(0x28)
		FScalableFloat FluidFriction; // 0x28(0x28)
		FScalableFloat MaxSpeed; // 0x50(0x28)
		FScalableFloat MaxAccelerationBoost; // 0x78(0x28)
		FScalableFloat BaseAcceleration; // 0xA0(0x28)
		FScalableFloat BaseAccelerationBoost; // 0xC8(0x28)
		FScalableFloat PitchForMaxBoost; // 0xF0(0x28)
		FScalableFloat PitchForMinBoost; // 0x118(0x28)
		FVector AscendingAcceleration; // 0x140(0x18)
		FVector IdleAcceleration; // 0x158(0x18)
		FScalableFloat MovingTurnRate; // 0x170(0x28)
		FScalableFloat IdleTurnRate; // 0x198(0x28)
	};


	// Struct FortniteGame.RidableControlRuntimeData
	// Size: 0x40 (0x40 - 0x0)
	struct FRidableControlRuntimeData	
	{
	public:
		FRotator RidingControllerRotation; // 0x0(0x18)
		float DesiredTurnInPlaceAngle; // 0x18(0x4)
		bool bDesiredTurnInPlaceAngleSet; // 0x1C(0x1)
		unsigned char UnknownData04_6[0xB]; // 0x1D(0xB) UNKNOWN PROPERTY
		bool bIsRidingSprinting; // 0x28(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x29(0x3) UNKNOWN PROPERTY
		float PreviousControlYaw; // 0x2C(0x4)
		bool bMovingBackwards; // 0x30(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		float RiderReferentialYaw; // 0x34(0x4)
		bool bAscending; // 0x38(0x1)
		bool bIsRidingPetting; // 0x39(0x1)
		unsigned char UnknownData07_7[0x6]; // 0x3A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.RidableControlParams
	// Size: 0x208 (0x208 - 0x0)
	struct FRidableControlParams	
	{
	public:
		FScalableFloat GroundRotationSpeed; // 0x0(0x28)
		FScalableFloat SprintGroundRotationSpeed; // 0x28(0x28)
		FScalableFloat AirRotationSpeed; // 0x50(0x28)
		FScalableFloat SwimmingRotationSpeed; // 0x78(0x28)
		FScalableFloat TurnInPlaceRotationSpeed; // 0xA0(0x28)
		FScalableFloat HalfDeadzone; // 0xC8(0x28)
		FScalableFloat TurnInPlaceStartAngle; // 0xF0(0x28)
		FScalableFloat TimeBeforeTurnInPlaceAllowed; // 0x118(0x28)
		FScalableFloat TimeBeforeInputsReleasedConsidered; // 0x140(0x28)
		FScalableFloat BackwardsHalfDeadzone; // 0x168(0x28)
		FScalableFloat MinimumInputAnalogModifier; // 0x190(0x28)
		FScalableFloat SprintStopSpeedThreshold; // 0x1B8(0x28)
		FScalableFloat MinimumJumpHoldTime; // 0x1E0(0x28)
	};


	// Struct FortniteGame.OverrideMovementCurveData
	// Size: 0x3F0 (0x3F0 - 0x0)
	struct FOverrideMovementCurveData	
	{
	public:
		bool bUseBrakingDecelerationWalking; // 0x0(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve BrakingDecelerationWalkingCurve; // 0x8(0x88)
		bool bUseBrakingDecelerationRunning; // 0x90(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x91(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve BrakingDecelerationRunningCurve; // 0x98(0x88)
		bool bUseBrakingDecelerationSprinting; // 0x120(0x1)
		unsigned char UnknownData09_6[0x7]; // 0x121(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve BrakingDecelerationSprintingCurve; // 0x128(0x88)
		bool bUseBrakingDecelerationTacticalSprinting; // 0x1B0(0x1)
		unsigned char UnknownData10_6[0x7]; // 0x1B1(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve BrakingDecelerationTacticalSprintingCurve; // 0x1B8(0x88)
		bool bUseSpeedCurve; // 0x240(0x1)
		unsigned char UnknownData11_6[0x7]; // 0x241(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve SpeedCurve; // 0x248(0x88)
		bool bUseWalkAccelerationCurve; // 0x2D0(0x1)
		unsigned char UnknownData12_6[0x7]; // 0x2D1(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve WalkAccelerationCurve; // 0x2D8(0x88)
		bool bUseRunAccelerationCurve; // 0x360(0x1)
		unsigned char UnknownData13_6[0x7]; // 0x361(0x7) UNKNOWN PROPERTY
		FRuntimeFloatCurve RunAccelerationCurve; // 0x368(0x88)
	};


	// Struct FortniteGame.FortMoveCollisionProbeSetup
	// Size: 0xA8 (0xA8 - 0x0)
	struct FFortMoveCollisionProbeSetup	
	{
	public:
		FName ProbeTag; // 0x0(0x4)
		float DelayBetweenProbes; // 0x4(0x4)
		float AvoidanceStrength; // 0x8(0x4)
		float SweepVelocityScale; // 0xC(0x4)
		float IgnoreImpact_WalkableFloorMinZ; // 0x10(0x4)
		float IgnoreImpact_BelowProbeZ; // 0x14(0x4)
		bool IgnoreImpact_PhysicsIsActive; // 0x18(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x19(0x3) UNKNOWN PROPERTY
		float FilterOtherMoveInputDotProduct; // 0x1C(0x4)
		bool bShouldFireInputFilteredDelegate; // 0x20(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
		TArray IgnoreImpact_ActorClasses; // 0x28(0x10)
		TArray ProbeSweepTypes; // 0x38(0x10)
		TWeakObjectPtr ProbeComponent; // 0x48(0x8)
		unsigned char UnknownData05_7[0x58]; // 0x50(0x58) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortTeamMemberInfo
	// Size: 0x230 (0x230 - 0x0)
	struct FFortTeamMemberInfo	
	{
	public:
		FUniqueNetIdRepl MemberUniqueId; // 0x0(0x30)
		FUniqueNetIdRepl PartyLeaderUniqueId; // 0x30(0x30)
		FUniqueNetIdRepl ConsoleUniqueId; // 0x60(0x30)
		FString Platform; // 0x90(0x10)
		FText PlayerName; // 0xA0(0x10)
		bool bPartyLeader; // 0xB0(0x1)
		bool bIsInZone; // 0xB1(0x1)
		bool bHasBoostXp; // 0xB2(0x1)
		bool bHasRestXp; // 0xB3(0x1)
		unsigned char UnknownData06_6[0x4]; // 0xB4(0x4) UNKNOWN PROPERTY
		FString BannerIconId; // 0xB8(0x10)
		FString BannerColorId; // 0xC8(0x10)
		bool bBattlePassPurchased; // 0xD8(0x1)
		unsigned char UnknownData07_6[0x3]; // 0xD9(0x3) UNKNOWN PROPERTY
		int32_t BattlePassLevel; // 0xDC(0x4)
		int32_t BattlePassSelfXpBoost; // 0xE0(0x4)
		int32_t BattlePassFriendXpBoost; // 0xE4(0x4)
		int32_t NumPlayersInParty; // 0xE8(0x4)
		int32_t PlayerIndex; // 0xEC(0x4)
		char TeamAffiliation; // 0xF0(0x1)
		unsigned char UnknownData08_6[0x7]; // 0xF1(0x7) UNKNOWN PROPERTY
		FText HeroClass; // 0xF8(0x10)
		FText HeroLevel; // 0x108(0x10)
		int32_t HeroXP; // 0x118(0x4)
		unsigned char UnknownData09_6[0x4]; // 0x11C(0x4) UNKNOWN PROPERTY
		UFortItem HeroItem; // 0x120(0x8)
		TArray SelectedGadgetItems; // 0x128(0x10)
		unsigned char UnknownData10_6[0x8]; // 0x138(0x8) UNKNOWN PROPERTY
		FSlateBrush HeroIcon; // 0x140(0xB0)
		FFortHomeBaseInfo HomeBaseInfo; // 0x1F0(0x38)
		unsigned char UnknownData11_7[0x8]; // 0x228(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ObjectiveGateClientInfo
	// Size: 0x10 (0x10 - 0x0)
	struct FObjectiveGateClientInfo	
	{
	public:
		FName ObjectiveName; // 0x0(0x4)
		float GateTransitionStartWorldTime; // 0x4(0x4)
		float GateAutoTransitionTime; // 0x8(0x4)
		bool bGateOpen; // 0xC(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ProjectileHomingData
	// Size: 0x60 (0x60 - 0x0)
	struct FProjectileHomingData	
	{
	public:
		EFortHomingStyle HomingStyle; // 0x0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float MinTurnSpeed; // 0x4(0x4)
		float MaxTurnSpeed; // 0x8(0x4)
		float RampTimeFromMinToMaxTurnSpeed; // 0xC(0x4)
		float LockTargetDistanceThreshold; // 0x10(0x4)
		int32_t RandomSeed; // 0x14(0x4)
		TWeakObjectPtr LockedOnTarget; // 0x18(0x8)
		TWeakObjectPtr LockedOnTargetComponent; // 0x20(0x8)
		FVector LockedOnTargetPosition; // 0x28(0x18)
		FVector TargetOffset; // 0x40(0x18)
		EFortHomingOffsetStyle TargetOffsetStyle; // 0x58(0x1)
		bool bScaleTargetOffsetWithCapsuleHeight; // 0x59(0x1)
		bool ResetTurnSpeedTimer; // 0x5A(0x1)
		unsigned char UnknownData03_7[0x5]; // 0x5B(0x5) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortStopSimulatingRepData
	// Size: 0x20 (0x20 - 0x0)
	struct FFortStopSimulatingRepData	
	{
	public:
		char RepIncrement; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FVector StopLocation; // 0x8(0x18)
	};


	// Struct FortniteGame.FortReplicatedVelocityData
	// Size: 0x20 (0x20 - 0x0)
	struct FFortReplicatedVelocityData	
	{
	public:
		char RepIncrement; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FVector ReplicatedVelocity; // 0x8(0x18)
	};


	// Struct FortniteGame.ChaseExternalForce
	// Size: 0x38 (0x38 - 0x0)
	struct FChaseExternalForce	
	{
	public:
		float duration; // 0x0(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector Direction; // 0x8(0x18)
		float Magnitude; // 0x20(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		UCurveFloat MagnitudeScaleCurve; // 0x28(0x8)
		unsigned char UnknownData05_7[0x8]; // 0x30(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.XPEventInfo
	// Size: 0x88 (0x88 - 0x0)
	struct FXPEventInfo	
	{
	public:
		FName EventName; // 0x0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FText SimulatedText; // 0x8(0x10)
		FText SimulatedName; // 0x18(0x10)
		UFortQuestItemDefinition QuestDef; // 0x28(0x8)
		EXPEventPriorityType Priority; // 0x30(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		int32_t EventXpValue; // 0x34(0x4)
		int32_t TotalXpEarnedInMatch; // 0x38(0x4)
		FPrimaryAssetId Accolade; // 0x3C(0x8)
		int32_t RestedValuePortion; // 0x44(0x4)
		int32_t SeasonBoostValuePortion; // 0x48(0x4)
		int32_t RestedXPRemaining; // 0x4C(0x4)
		bool bWasNonQuestReactionGrant; // 0x50(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x51(0x7) UNKNOWN PROPERTY
		AFortPlayerController PlayerController; // 0x58(0x8)
		TWeakObjectPtr AccoladeLargePreviewImageOverride; // 0x60(0x20)
		EFortSimulatedXPSize SimulatedXpSize; // 0x80(0x1)
		unsigned char UnknownData07_7[0x7]; // 0x81(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SharedQuestData
	// Size: 0x18 (0x18 - 0x0)
	struct FSharedQuestData	
	{
	public:
		TArray SharedQuests; // 0x0(0x10)
		UFortQuestItem PinnedQuest; // 0x10(0x8)
	};


	// Struct FortniteGame.FortQuestAnalyticEvent
	// Size: 0x18 (0x18 - 0x0)
	struct FFortQuestAnalyticEvent	
	{
	public:
		FString TemplateId; // 0x0(0x10)
		EFortQuestAnalyticState State; // 0x10(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ObjectiveUpdateCallback
	// Size: 0x20 (0x20 - 0x0)
	struct FObjectiveUpdateCallback	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		UFortQuestItem QuestItem; // 0x8(0x8)
		unsigned char UnknownData03_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PrimaryMissionQuestData
	// Size: 0x18 (0x18 - 0x0)
	struct FPrimaryMissionQuestData	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		TArray PrimaryMissionObjectives; // 0x8(0x10)
	};


	// Struct FortniteGame.UpdatingQuestsByObjectiveInfo
	// Size: 0x10 (0x10 - 0x0)
	struct FUpdatingQuestsByObjectiveInfo	
	{
	public:
		TArray QuestList; // 0x0(0x10)
	};


	// Struct FortniteGame.FortGlobalMission
	// Size: 0x170 (0x170 - 0x0)
	struct FFortGlobalMission	
	{
	public:
		TWeakObjectPtr MissionInfo; // 0x0(0x20)
		TArray AllowedTheaterTypes; // 0x20(0x10)
		FGameplayTagQuery TheaterTagQuery; // 0x30(0x48)
		FGameplayTagQuery RegionTagQuery; // 0x78(0x48)
		TArray AllowedZoneTypes; // 0xC0(0x10)
		FGameplayTagQuery ZoneTagQuery; // 0xD0(0x48)
		FGameplayTagQuery PrimaryMissionTagQuery; // 0x118(0x48)
		float MaxDifficultyLevel; // 0x160(0x4)
		float MinDifficultyLevel; // 0x164(0x4)
		bool bIsPrototype; // 0x168(0x1)
		bool bAllowInTestMaps; // 0x169(0x1)
		bool bEnabled; // 0x16A(0x1)
		unsigned char UnknownData01_7[0x5]; // 0x16B(0x5) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortQuestDrivenMission
	// Inherited from FFortGlobalMission
	// Size: 0x8 (0x178 - 0x170)
	struct FFortQuestDrivenMission : public FFortGlobalMission	
	{
	public:
		UFortQuestItemDefinition RequiredQuest; // 0x170(0x8)
	};


	// Struct FortniteGame.QuestDrivenMissionSubList
	// Size: 0x18 (0x18 - 0x0)
	struct FQuestDrivenMissionSubList	
	{
	public:
		FName MissionSubListName; // 0x0(0x4)
		bool bEnabled; // 0x4(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
		TArray QuestDrivenMissionList; // 0x8(0x10)
	};


	// Struct FortniteGame.FortMissionDistributionCategory
	// Size: 0x48 (0x48 - 0x0)
	struct FFortMissionDistributionCategory	
	{
	public:
		FGameplayTagQuery CategoryTagQuery; // 0x0(0x48)
	};


	// Struct FortniteGame.FortNonPrimaryMission
	// Size: 0xB0 (0xB0 - 0x0)
	struct FFortNonPrimaryMission	
	{
	public:
		TWeakObjectPtr MissionInfo; // 0x0(0x20)
		FGameplayTagQuery ContextTagQuery; // 0x20(0x48)
		FDataTableRowHandle MinDifficulty; // 0x68(0x10)
		FDataTableRowHandle MaxDifficulty; // 0x78(0x10)
		bool bSatisfiesCurrentRequirement; // 0x88(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x89(0x7) UNKNOWN PROPERTY
		TArray RequirementIndicesSatisfied; // 0x90(0x10)
		TArray DistributionCategoryIndicesSatisfied; // 0xA0(0x10)
	};


	// Struct FortniteGame.WeaponSeatDefinition
	// Size: 0x48 (0x48 - 0x0)
	struct FWeaponSeatDefinition	
	{
	public:
		int32_t SeatIndex; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UFortWeaponItemDefinition VehicleWeapon; // 0x8(0x8)
		TArray WeaponActionDefForUI; // 0x10(0x10)
		UFortWeaponItemDefinition VehicleWeaponOverride; // 0x20(0x8)
		UFortWeaponItemDefinition LastEquippedVehicleWeapon; // 0x28(0x8)
		bool bSendReplicatedTargetingEvent; // 0x30(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x31(0x17) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleWeapon_RetainedData
	// Size: 0xC (0xC - 0x0)
	struct FVehicleWeapon_RetainedData	
	{
	public:
		int32_t AmmoInClip; // 0x0(0x4)
		float LastFireTime; // 0x4(0x4)
		bool bHasPrevious; // 0x8(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCachedWeaponOverheatData
	// Size: 0x18 (0x18 - 0x0)
	struct FFortCachedWeaponOverheatData	
	{
	public:
		float TimeWeaponWasUnequipped; // 0x0(0x4)
		float OverheatValueAtUneqip; // 0x4(0x4)
		float OverheatValue; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		float TimeOverheatedBegan; // 0x10(0x4)
		float TimeHeatWasLastAdded; // 0x14(0x4)
	};


	// Struct FortniteGame.FilteredEventReceiverHandle
	// Size: 0x28 (0x28 - 0x0)
	struct FFilteredEventReceiverHandle	
	{
	public:
		unsigned char UnknownData01_2[0x28]; // 0x0(0x28) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VerbFilterBlueprint
	// Size: 0x10 (0x10 - 0x0)
	struct FVerbFilterBlueprint	
	{
	public:
		FInstancedStruct Filter; // 0x0(0x10)
	};


	// Struct FortniteGame.ServerExpirationAlertData
	// Size: 0x28 (0x28 - 0x0)
	struct FServerExpirationAlertData	
	{
	public:
		int32_t SecondsRemainingStart; // 0x0(0x4)
		int32_t SecondsVisible; // 0x4(0x4)
		bool ShowCountdown; // 0x8(0x1)
		unsigned char UnknownData01_6[0x17]; // 0x9(0x17) UNKNOWN PROPERTY
		UFortUINotification Notification; // 0x20(0x8)
	};


	// Struct FortniteGame.FortCreativeLinearMoverRotationMovementData
	// Size: 0x40 (0x40 - 0x0)
	struct FFortCreativeLinearMoverRotationMovementData	
	{
	public:
		FRotator TargetRotation; // 0x0(0x18)
		FRotator InitialRotation; // 0x18(0x18)
		float StartTime; // 0x30(0x4)
		float EndTime; // 0x34(0x4)
		EFortCreativeLinearMoverRotationDirection RotationDirection; // 0x38(0x1)
		bool bFinished; // 0x39(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x3A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCreativeLinearMoverTranslationMovementData
	// Size: 0x40 (0x40 - 0x0)
	struct FFortCreativeLinearMoverTranslationMovementData	
	{
	public:
		FVector TargetLocation; // 0x0(0x18)
		FVector InitialLocation; // 0x18(0x18)
		float StartTime; // 0x30(0x4)
		float EndTime; // 0x34(0x4)
		bool bFinished; // 0x38(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x39(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BuildingSupportCellIndex
	// Size: 0xC (0xC - 0x0)
	struct FBuildingSupportCellIndex	
	{
	public:
		int32_t X; // 0x0(0x4)
		int32_t Y; // 0x4(0x4)
		int32_t Z; // 0x8(0x4)
	};


	// Struct FortniteGame.FortKeyframedMovementKeyframeData
	// Size: 0x90 (0x90 - 0x0)
	struct FFortKeyframedMovementKeyframeData	
	{
	public:
		FTransform Transform; // 0x0(0x60)
		FVector4 CubicBezierEasingParameters; // 0x60(0x20)
		float Time; // 0x80(0x4)
		unsigned char UnknownData01_7[0xC]; // 0x84(0xC) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortKeyframedMovementCommandData
	// Size: 0x90 (0x90 - 0x0)
	struct FFortKeyframedMovementCommandData	
	{
	public:
		EFortKeyframedMovementNetCommand Command; // 0x0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float CommandServerTime; // 0x4(0x4)
		float StartTimeForPlay; // 0x8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FTransform HaltTransform; // 0x10(0x60)
		TArray Keyframes; // 0x70(0x10)
		EFortKeyframedMovementMovementMode MovementMode; // 0x80(0x1)
		unsigned char UnknownData05_7[0xF]; // 0x81(0xF) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.LevelInstanceListElement
	// Size: 0x38 (0x38 - 0x0)
	struct FLevelInstanceListElement	
	{
	public:
		FGuid Guid; // 0x0(0x10)
		FString Name; // 0x10(0x10)
		ELevelManagementTerrainType TerrainType; // 0x20(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		int32_t MaxMemory; // 0x24(0x4)
		int32_t CurrentMemory; // 0x28(0x4)
		int32_t NumPortals; // 0x2C(0x4)
		int32_t NumRefs; // 0x30(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortHUDTagPromptData
	// Size: 0x38 (0x38 - 0x0)
	struct FFortHUDTagPromptData	
	{
	public:
		FGameplayTag VolumeTag; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FText Text_PromptTitle; // 0x8(0x10)
		FText Text_PromptDescription; // 0x18(0x10)
		bool bIsEnterData; // 0x28(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		UClass WidgetClass; // 0x30(0x8)
	};


	// Struct FortniteGame.FortClientAnnouncementData
	// Size: 0x1 (0x1 - 0x0)
	struct FFortClientAnnouncementData	
	{
	public:
	};


	// Struct FortniteGame.FortClientAnnouncementData_Basic
	// Inherited from FFortClientAnnouncementData
	// Size: 0x100 (0x100 - 0x0)
	struct FFortClientAnnouncementData_Basic : public FFortClientAnnouncementData	
	{
	public:
		FSlateBrush Icon; // 0x0(0xB0)
		FText TitleText; // 0xB0(0x10)
		FText DetailText; // 0xC0(0x10)
		FText GamepadDetailText; // 0xD0(0x10)
		int32_t Priority; // 0xE0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xE4(0x4) UNKNOWN PROPERTY
		float DisplayTime; // 0xE8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xEC(0x4) UNKNOWN PROPERTY
		USoundBase OnStartSound; // 0xF0(0x8)
	};


	// Struct FortniteGame.FortClientAnnouncementData_Tutorial
	// Inherited from FFortClientAnnouncementData_Basic -> FFortClientAnnouncementData
	// Size: 0x48 (0x140 - 0xF8)
	struct FFortClientAnnouncementData_Tutorial : public FFortClientAnnouncementData_Basic	
	{
	public:
		float AutoContinueDelay; // 0xF8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xFC(0x4) UNKNOWN PROPERTY
		FText NameText; // 0x100(0x10)
		FText SystemText; // 0x110(0x10)
		bool bButtonEnabled; // 0x120(0x1)
		bool bLightboxEnabled; // 0x121(0x1)
		bool bLightboxDisableInputOnly; // 0x122(0x1)
		unsigned char UnknownData04_6[0x1]; // 0x123(0x1) UNKNOWN PROPERTY
		FMargin Padding; // 0x124(0x10)
		TEnumAsByte VAlign; // 0x134(0x1)
		TEnumAsByte HAlign; // 0x135(0x1)
		unsigned char UnknownData05_7[0xA]; // 0x136(0xA) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SpecialActorRepData
	// Inherited from FFastArraySerializerItem
	// Size: 0x224 (0x230 - 0xC)
	struct FSpecialActorRepData : public FFastArraySerializerItem	
	{
	public:
		FName SpecialActorID; // 0xC(0x4)
		FGameplayTag CategoryTag; // 0x10(0x4)
		TWeakObjectPtr SpecialActor; // 0x14(0x8)
		unsigned char UnknownData08_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		APlayerState PlayerState; // 0x20(0x8)
		float ReplicationInterval; // 0x28(0x4)
		float ReplicationIntervalDeviation; // 0x2C(0x4)
		float NextReplicationTime; // 0x30(0x4)
		float LastActorNotRelevantTime; // 0x34(0x4)
		bool bActorIsRelevant; // 0x38(0x1)
		bool bWasActorRelevantLastUpdate; // 0x39(0x1)
		int16_t ReplicatedTransformIndex; // 0x3A(0x2)
		unsigned char UnknownData09_6[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
		FVector CurrentLocation; // 0x40(0x18)
		float CurrentYaw; // 0x58(0x4)
		int8_t MinimapIconBrushIndex; // 0x5C(0x1)
		int8_t MinimapScaleIndex; // 0x5D(0x1)
		int8_t FullScreenMapIconBrushIndex; // 0x5E(0x1)
		int8_t FullScreenMapScaleIndex; // 0x5F(0x1)
		int8_t CompassIconBrushIndex; // 0x60(0x1)
		int8_t CompassScaleIndex; // 0x61(0x1)
		bool bDrawCompassIcon; // 0x62(0x1)
		bool bDrawCompassDistanceText; // 0x63(0x1)
		bool bDrawRotated; // 0x64(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x65(0x3) UNKNOWN PROPERTY
		float YawOffset; // 0x68(0x4)
		FElevationArrowData ElevationArrowData; // 0x6C(0x1C)
		bool bReplicateHealth; // 0x88(0x1)
		bool bReplicateShield; // 0x89(0x1)
		char RenderOnMapDuringPhases; // 0x8A(0x1)
		unsigned char UnknownData11_6[0x1]; // 0x8B(0x1) UNKNOWN PROPERTY
		float CurrentHealth; // 0x8C(0x4)
		float MaxHealth; // 0x90(0x4)
		float CurrentShield; // 0x94(0x4)
		float MaxShield; // 0x98(0x4)
		unsigned char UnknownData12_6[0x4]; // 0x9C(0x4) UNKNOWN PROPERTY
		FText DisplayName; // 0xA0(0x10)
		float RenderDistance; // 0xB0(0x4)
		unsigned char UnknownData13_6[0x4]; // 0xB4(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer RenderTags; // 0xB8(0x20)
		TEnumAsByte DrawLayer; // 0xD8(0x1)
		unsigned char UnknownData14_6[0x3]; // 0xD9(0x3) UNKNOWN PROPERTY
		FGameplayTag SeasonItemTag; // 0xDC(0x4)
		FSlateBrush SeasonItemInteractedBrush; // 0xE0(0xB0)
		int32_t Priority; // 0x190(0x4)
		float AddedToClientTime; // 0x194(0x4)
		TArray TrackedStats; // 0x198(0x10)
		float LastLocationReplicationTime; // 0x1A8(0x4)
		float PrevLocationReplicatedTime; // 0x1AC(0x4)
		FVector_NetQuantize InitialRepLocation; // 0x1B0(0x18)
		FVector LastRepLocation; // 0x1C8(0x18)
		FVector PrevRepLocation; // 0x1E0(0x18)
		FVector LerpStartLocation; // 0x1F8(0x18)
		float LastYawReplicationTime; // 0x210(0x4)
		float PrevYawReplicatedTime; // 0x214(0x4)
		float InitialRepYaw; // 0x218(0x4)
		float LastRepYaw; // 0x21C(0x4)
		float PrevRepYaw; // 0x220(0x4)
		float LerpStartYaw; // 0x224(0x4)
		unsigned char UnknownData15_7[0x8]; // 0x228(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SpecialActorSingleStatData
	// Size: 0xC (0xC - 0x0)
	struct FSpecialActorSingleStatData	
	{
	public:
		ESpecialActorStatType StatType; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float Value; // 0x4(0x4)
		float StatLogicValue; // 0x8(0x4)
	};


	// Struct FortniteGame.ElevationArrowData
	// Size: 0x1C (0x1C - 0x0)
	struct FElevationArrowData	
	{
	public:
		bool bShowElevationArrow; // 0x0(0x1)
		bool bOverrideDefaultBehavior; // 0x1(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float ElevationDifferenceZ; // 0x4(0x4)
		float MaxDistanceToDisplay; // 0x8(0x4)
		FLinearColor IndicatorColor; // 0xC(0x10)
	};


	// Struct FortniteGame.CreativeIslandDescriptionTag
	// Size: 0x20 (0x20 - 0x0)
	struct FCreativeIslandDescriptionTag	
	{
	public:
		FString Name; // 0x0(0x10)
		FText DisplayText; // 0x10(0x10)
	};


	// Struct FortniteGame.GameSummaryInfo
	// Size: 0x18 (0x18 - 0x0)
	struct FGameSummaryInfo	
	{
	public:
		FString GameSessionId; // 0x0(0x10)
		bool Completed; // 0x10(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortMultiSizeBrush
	// Size: 0x420 (0x420 - 0x0)
	struct FFortMultiSizeBrush	
	{
	public:
		FSlateBrush Brush_XXS; // 0x0(0xB0)
		FSlateBrush Brush_XS; // 0xB0(0xB0)
		FSlateBrush Brush_S; // 0x160(0xB0)
		FSlateBrush Brush_M; // 0x210(0xB0)
		FSlateBrush Brush_L; // 0x2C0(0xB0)
		FSlateBrush Brush_XL; // 0x370(0xB0)
	};


	// Struct FortniteGame.FortItemHeaderInformation
	// Size: 0x108 (0x108 - 0x0)
	struct FFortItemHeaderInformation	
	{
	public:
		unsigned char UnknownData01_2[0x108]; // 0x0(0x108) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortItemViewSettings
	// Size: 0x50 (0x50 - 0x0)
	struct FFortItemViewSettings	
	{
	public:
		bool UsesPlacementActor; // 0x0(0x1)
		bool UsesFixedCamera; // 0x1(0x1)
		bool SupportsZooming; // 0x2(0x1)
		bool RestrictZoomToWidget; // 0x3(0x1)
		float DefaultZoomLevel; // 0x4(0x4)
		FFloatRange ZoomRange; // 0x8(0x10)
		EFortItemViewRotationMode RotationMode; // 0x18(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		FRotator CameraRotationOffset; // 0x20(0x18)
		FVector MeshBoundsCenterOffset; // 0x38(0x18)
	};


	// Struct FortniteGame.FortGlobalActionDetailsFunctionContext
	// Size: 0x1 (0x1 - 0x0)
	struct FFortGlobalActionDetailsFunctionContext	
	{
	public:
		ECommonInputType OverrideInputType; // 0x0(0x1)
	};


	// Struct FortniteGame.FortDialogExternalLatentActionHandle
	// Size: 0x4 (0x4 - 0x0)
	struct FFortDialogExternalLatentActionHandle	
	{
	public:
		int32_t Handle; // 0x0(0x4)
	};


	// Struct FortniteGame.FortVehicleInPersistent
	// Size: 0x1A0 (0x1A0 - 0x0)
	struct FFortVehicleInPersistent	
	{
	public:
		unsigned char UnknownData07_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		UFortPhysicsVehicleConfigs FortPhysicsVehicleConfigs; // 0x8(0x8)
		bool bUseForceHeading : 1; // 0x10:0(0x1)
		unsigned char UnknownData08_3[0x1F]; // 0x11(0x1F) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x30:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x30:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x30:2(0x1) UNKNOWN PROPERTY
		bool bHasDriver : 1; // 0x30:3(0x1)
		bool bHasPassengers : 1; // 0x30:4(0x1)
		bool bIsTouchingAnything : 1; // 0x30:5(0x1)
		bool bAttemptAsyncOrientationCorrection : 1; // 0x30:6(0x1)
		bool bUseGravity : 1; // 0x30:7(0x1)
		unsigned char UnknownData12_5[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		float WaterLevel; // 0x34(0x4)
		FVector LocalFrontFrictionPt; // 0x38(0x18)
		FVector LocalRearFrictionPt; // 0x50(0x18)
		float FrontMassRatio; // 0x68(0x4)
		float RearMassRatio; // 0x6C(0x4)
		float TopSpeedCurrentMultiplier; // 0x70(0x4)
		FReplicatedAthenaVehicleAttributes VehicleAttributes; // 0x74(0x20)
		unsigned char UnknownData13_6[0xFC]; // 0x94(0xFC) UNKNOWN PROPERTY
		TArray TireStates; // 0x190(0x10)
	};


	// Struct FortniteGame.FortVehicleOutContinuous
	// Size: 0x50 (0x50 - 0x0)
	struct FFortVehicleOutContinuous	
	{
	public:
		unsigned char UnknownData03_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		float SteeringAngle; // 0x8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FVector AverageSpringNormal; // 0x10(0x18)
		FVector PlatformVelocityDirection; // 0x28(0x18)
		unsigned char UnknownData05_7[0x10]; // 0x40(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortVehicleOutPersistent
	// Size: 0x28 (0x28 - 0x0)
	struct FFortVehicleOutPersistent	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		bool bCanDriveOnIncline : 1; // 0x8:0(0x1)
		bool bWheelsOnGround : 1; // 0x8:1(0x1)
		bool bAnyWheelsOnGround : 1; // 0x8:2(0x1)
		bool bIsTouchingDrivableGround : 1; // 0x8:3(0x1)
		bool bIsAsyncCorrectingOrientation : 1; // 0x8:4(0x1)
		bool bIsTouchingGroundWithoutWheels : 1; // 0x8:5(0x1)
		bool bPossiblyTouchingTop : 1; // 0x8:6(0x1)
		bool bOnRoad : 1; // 0x8:7(0x1)
		bool bOnLandscape : 1; // 0x9:0(0x1)
		bool bOnDirt : 1; // 0x9:1(0x1)
		bool bOnVehicle : 1; // 0x9:2(0x1)
		bool bBoosting : 1; // 0x9:3(0x1)
		bool bOnGrass : 1; // 0x9:4(0x1)
		bool bOnSnow : 1; // 0x9:5(0x1)
		bool bOnIce : 1; // 0x9:6(0x1)
		bool bOnMud : 1; // 0x9:7(0x1)
		unsigned char UnknownData03_5[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
		TArray TireSurfaces; // 0x10(0x10)
		float TotalBrakingDelta; // 0x20(0x4)
		int32_t CurrentGearIdx; // 0x24(0x4)
	};


	// Struct FortniteGame.FortVehicleInternalPersistent
	// Size: 0xE0 (0xE0 - 0x0)
	struct FFortVehicleInternalPersistent	
	{
	public:
		unsigned char UnknownData01_2[0xE0]; // 0x0(0xE0) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AttachedWheel
	// Size: 0x38 (0x38 - 0x0)
	struct FAttachedWheel	
	{
	public:
		USkeletalMeshComponent SkeletalMeshComponent; // 0x0(0x8)
		FName DamageablePartShapeName; // 0x8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UMaterialInstanceDynamic MatInstance; // 0x10(0x8)
		unsigned char UnknownData04_6[0x18]; // 0x18(0x18) UNKNOWN PROPERTY
		float CurrentHealth; // 0x30(0x4)
		unsigned char UnknownData05_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.JunoBuildingMultiOverlapResult
	// Size: 0x10 (0x10 - 0x0)
	struct FJunoBuildingMultiOverlapResult	
	{
	public:
		TArray Overlaps; // 0x0(0x10)
	};


	// Struct FortniteGame.JunoBuildingOverlapResult
	// Size: 0x38 (0x38 - 0x0)
	struct FJunoBuildingOverlapResult	
	{
	public:
		TWeakObjectPtr OverlappedActor; // 0x0(0x8)
		TWeakObjectPtr OverlappedComponent; // 0x8(0x8)
		TArray Intersections; // 0x10(0x10)
		FVector MTD; // 0x20(0x18)
	};


	// Struct FortniteGame.VehicleWheelFXSocketInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FVehicleWheelFXSocketInfo	
	{
	public:
		FName SocketName; // 0x0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FVector Offset; // 0x8(0x18)
		float Scale; // 0x20(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortLightweightProjectileRequest_Net
	// Size: 0x38 (0x38 - 0x0)
	struct FFortLightweightProjectileRequest_Net	
	{
	public:
		FVector_NetQuantize10 StartPosition; // 0x0(0x18)
		FVector_NetQuantizeNormal StartDirection; // 0x18(0x18)
		float Timestamp; // 0x30(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortBulletPatternEntry
	// Size: 0x88 (0x88 - 0x0)
	struct FFortBulletPatternEntry	
	{
	public:
		FFortBulletPatternEntryData EntryData; // 0x0(0x50)
		unsigned char UnknownData01_7[0x38]; // 0x50(0x38) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortBulletPatternEntryData
	// Size: 0x50 (0x50 - 0x0)
	struct FFortBulletPatternEntryData	
	{
	public:
		FName SocketName; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FRotator RelativeRotation; // 0x8(0x18)
		FRotator MinRotationVariance; // 0x20(0x18)
		FRotator MaxRotationVariance; // 0x38(0x18)
	};


	// Struct FortniteGame.FortNDCTracerInfo
	// Size: 0x18 (0x18 - 0x0)
	struct FFortNDCTracerInfo	
	{
	public:
		UNiagaraDataChannelAsset TracerFxDataChannel; // 0x0(0x8)
		float ScaleMultiplier; // 0x8(0x4)
		int32_t CustomDataInt; // 0xC(0x4)
		bool bUseNDCTracers : 1; // 0x10:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.WeaponCueReplicationStruct
	// Size: 0xD8 (0xD8 - 0x0)
	struct FWeaponCueReplicationStruct	
	{
	public:
		uint32_t RepCounter; // 0x0(0x4)
		TEnumAsByte CueEventType; // 0x4(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
		FGameplayCueParameters Parameters; // 0x8(0xD0)
	};


	// Struct FortniteGame.VideoPlayerDeviceMediaMetadata
	// Size: 0x48 (0x48 - 0x0)
	struct FVideoPlayerDeviceMediaMetadata	
	{
	public:
		FString UID; // 0x0(0x10)
		FDateTime ServerTime; // 0x10(0x8)
		FDateTime StartTime; // 0x18(0x8)
		TArray Instigators; // 0x20(0x10)
		int32_t InstanceID; // 0x30(0x4)
		bool bLooping; // 0x34(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
		ULevelSequence Sequence; // 0x38(0x8)
		bool bOverride; // 0x40(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x41(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCollectionBookSlotData
	// Inherited from FTableRowBase
	// Size: 0x40 (0x48 - 0x8)
	struct FFortCollectionBookSlotData : public FTableRowBase	
	{
	public:
		FName SlotXpWeightName; // 0x8(0x4)
		FName SlotSourceId; // 0xC(0x4)
		FName SlotSourceId2; // 0x10(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TArray AllowedItems; // 0x18(0x10)
		TArray AllowedWorkerPersonalities; // 0x28(0x10)
		FDataTableRowHandle PurchaseCosts; // 0x38(0x10)
	};


	// Struct FortniteGame.HomebaseSquadSlot
	// Size: 0x60 (0x60 - 0x0)
	struct FHomebaseSquadSlot	
	{
	public:
		FText DisplayName; // 0x0(0x10)
		TArray ValidSlottableItemTypes; // 0x10(0x10)
		FGameplayTagContainer TagFilter; // 0x20(0x20)
		TArray SlottingBonuses; // 0x40(0x10)
		UCurveTable PersonalityMatchBonusTable; // 0x50(0x8)
		ESquadSlotType SlotType; // 0x58(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x59(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.HomebaseSquadAttributeBonus
	// Size: 0x48 (0x48 - 0x0)
	struct FHomebaseSquadAttributeBonus	
	{
	public:
		FGameplayAttribute AttributeGranted; // 0x0(0x38)
		FCurveTableRowHandle BonusCurve; // 0x38(0x10)
	};


	// Struct FortniteGame.HomebaseSquad
	// Inherited from FTableRowBase
	// Size: 0x68 (0x70 - 0x8)
	struct FHomebaseSquad : public FTableRowBase	
	{
	public:
		FText DisplayName; // 0x8(0x10)
		FText ShortDisplayName; // 0x18(0x10)
		EFortHomebaseSquadType SquadType; // 0x28(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x29(0x3) UNKNOWN PROPERTY
		FGameplayTag ManagerSynergyTag; // 0x2C(0x4)
		TArray CrewSlots; // 0x30(0x10)
		FGameplayTagContainer RequiredTheaterTags; // 0x40(0x20)
		int32_t MaxNumDefendersAllowedInLevel; // 0x60(0x4)
		int32_t MaxNumDefendersAllowedInGroupLevel; // 0x64(0x4)
		bool bConsiderNumPlayersForMaxNumDefenders; // 0x68(0x1)
		bool bAlwaysRemoveOldestDefenderWhenReplacing; // 0x69(0x1)
		unsigned char UnknownData03_7[0x6]; // 0x6A(0x6) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortPlayerPawnObjectReference
	// Size: 0x10 (0x10 - 0x0)
	struct FFortPlayerPawnObjectReference	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		UObject TrackedObject; // 0x8(0x8)
	};


	// Struct FortniteGame.FortInterpCurveOffsetData
	// Size: 0x10 (0x10 - 0x0)
	struct FFortInterpCurveOffsetData	
	{
	public:
		float PitchAngle; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UCurveVector OffsetCurve; // 0x8(0x8)
	};


	// Struct FortniteGame.FortADSTransitionInterpCurveOffset
	// Size: 0x10 (0x10 - 0x0)
	struct FFortADSTransitionInterpCurveOffset	
	{
	public:
		TArray SampleCurves; // 0x0(0x10)
	};


	// Struct FortniteGame.AthenaBroadcastKillFeedEntryInfo
	// Size: 0x28 (0x28 - 0x0)
	struct FAthenaBroadcastKillFeedEntryInfo	
	{
	public:
		FString InstigatorPlayerName; // 0x0(0x10)
		FString VictimPlayerName; // 0x10(0x10)
		EAthenaBroadcastKillFeedEntryType EntryType; // 0x20(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ContextualPresentation
	// Size: 0x68 (0x68 - 0x0)
	struct FContextualPresentation	
	{
	public:
		ECosmeticCompatibleModeLegacy PrimaryMode; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FGameplayTag ProductTag; // 0x4(0x4)
		TWeakObjectPtr Material; // 0x8(0x20)
		TWeakObjectPtr RenderImage; // 0x28(0x20)
		TWeakObjectPtr OverrideImageMaterial; // 0x48(0x20)
	};


	// Struct FortniteGame.CustomizationInfoData
	// Size: 0x30 (0x30 - 0x0)
	struct FCustomizationInfoData	
	{
	public:
		FString VariantTagString; // 0x0(0x10)
		FString VariantChannelTagString; // 0x10(0x10)
		FLinearColor ColorValue; // 0x20(0x10)
	};


	// Struct FortniteGame.LoadoutSlotOverrideData
	// Size: 0x30 (0x30 - 0x0)
	struct FLoadoutSlotOverrideData	
	{
	public:
		FString TemplateId; // 0x0(0x10)
		bool bMainSlot; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		TArray VariantOverrides; // 0x18(0x10)
		UFortItemDefinition ItemDefinition; // 0x28(0x8)
	};


	// Struct FortniteGame.3DPreviewOverrideData
	// Size: 0x18 (0x18 - 0x0)
	struct F3DPreviewOverrideData	
	{
	public:
		bool bPreviewBoost; // 0x0(0x1)
		bool bPreviewDriftTrail; // 0x1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		TArray LoadoutSlots; // 0x8(0x10)
	};


	// Struct FortniteGame.SurvivorPresigeData
	// Size: 0x80 (0x80 - 0x0)
	struct FSurvivorPresigeData	
	{
	public:
		FText DisplayName; // 0x0(0x10)
		TWeakObjectPtr SmallIconMaterial; // 0x10(0x20)
		TWeakObjectPtr LargeIconMaterial; // 0x30(0x20)
		FLinearColor Color1; // 0x50(0x10)
		FLinearColor Color2; // 0x60(0x10)
		FLinearColor TextColor; // 0x70(0x10)
	};


	// Struct FortniteGame.AthenaSeasonItemCustomSkinCategoryData
	// Size: 0x30 (0x30 - 0x0)
	struct FAthenaSeasonItemCustomSkinCategoryData	
	{
	public:
		FText Name; // 0x0(0x10)
		TArray Entries; // 0x10(0x10)
		int32_t RequiredRewardsToUnlock; // 0x20(0x4)
		float ZoomLevel; // 0x24(0x4)
		float Rotation; // 0x28(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BattlePassRewardInfo
	// Size: 0x20 (0x20 - 0x0)
	struct FBattlePassRewardInfo	
	{
	public:
		UItemDefinitionBase ItemDef; // 0x0(0x8)
		int32_t Level; // 0x8(0x4)
		bool bIsFree; // 0xC(0x1)
		unsigned char UnknownData02_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		int32_t QuantityRewarded; // 0x10(0x4)
		EBattlePassRewardSource UnlockableSource; // 0x14(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
		UItemDefinitionBase UnlockableSourceItemDef; // 0x18(0x8)
	};


	// Struct FortniteGame.AthenaMidSeasonUpdateItemReq
	// Size: 0x28 (0x28 - 0x0)
	struct FAthenaMidSeasonUpdateItemReq	
	{
	public:
		TWeakObjectPtr Item; // 0x0(0x20)
		int32_t Count; // 0x20(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaMidSeasonUpdateQuestReq
	// Size: 0x28 (0x28 - 0x0)
	struct FAthenaMidSeasonUpdateQuestReq	
	{
	public:
		TWeakObjectPtr Quest; // 0x0(0x20)
		bool bCompletionRequired; // 0x20(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaMidSeasonUpdate
	// Size: 0x50 (0x50 - 0x0)
	struct FAthenaMidSeasonUpdate	
	{
	public:
		int32_t SeasonLevelRequirement; // 0x0(0x4)
		int32_t BookLevelRequirement; // 0x4(0x4)
		bool SeasonPurchasedRequirement; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		TArray ItemRequirements; // 0x10(0x10)
		TArray QuestRequirements; // 0x20(0x10)
		FAthenaRewardScheduleLevel Grants; // 0x30(0x10)
		TArray Removals; // 0x40(0x10)
	};


	// Struct FortniteGame.AthenaRewardScheduleLevel
	// Size: 0x10 (0x10 - 0x0)
	struct FAthenaRewardScheduleLevel	
	{
	public:
		TArray Rewards; // 0x0(0x10)
	};


	// Struct FortniteGame.AthenaRewardItemReference
	// Size: 0x58 (0x58 - 0x0)
	struct FAthenaRewardItemReference	
	{
	public:
		TWeakObjectPtr ItemDefinition; // 0x0(0x20)
		FString TemplateId; // 0x20(0x10)
		int32_t Quantity; // 0x30(0x4)
		bool IsChaseReward; // 0x34(0x1)
		EAthenaRewardItemType RewardType; // 0x35(0x1)
		EAthenaRewardVisualImportanceType RewardVisualImportanceType; // 0x36(0x1)
		unsigned char UnknownData01_6[0x1]; // 0x37(0x1) UNKNOWN PROPERTY
		TArray PreviewVariantSets; // 0x38(0x10)
		TArray AdditionalPreviewVariants; // 0x48(0x10)
	};


	// Struct FortniteGame.AdditionalVariantSet
	// Size: 0x10 (0x10 - 0x0)
	struct FAdditionalVariantSet	
	{
	public:
		TArray VariantsToApply; // 0x0(0x10)
	};


	// Struct FortniteGame.AthenaSuperChargedBonusQuestLevel
	// Size: 0x28 (0x28 - 0x0)
	struct FAthenaSuperChargedBonusQuestLevel	
	{
	public:
		float PercentOfGoldenPath; // 0x0(0x4)
		int32_t MinimumDaysSinceSeasonStart; // 0x4(0x4)
		TWeakObjectPtr BonusQuest; // 0x8(0x20)
	};


	// Struct FortniteGame.XpDisplayConversion
	// Size: 0x28 (0x28 - 0x0)
	struct FXpDisplayConversion	
	{
	public:
		TWeakObjectPtr XpItemDef; // 0x0(0x20)
		int32_t ValueToReplaceAt; // 0x20(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.TrackCategory
	// Size: 0x38 (0x38 - 0x0)
	struct FTrackCategory	
	{
	public:
		TWeakObjectPtr CategoryIcon; // 0x0(0x20)
		FText CategoryName; // 0x20(0x10)
		int32_t CategoryStartingLevel; // 0x30(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaSeasonTitleEntry
	// Inherited from FTableRowBase
	// Size: 0x28 (0x30 - 0x8)
	struct FAthenaSeasonTitleEntry : public FTableRowBase	
	{
	public:
		FText DisplayChapterText; // 0x8(0x10)
		FText DisplaySeasonText; // 0x18(0x10)
		ESeasonTitleDisplayType DisplayType; // 0x28(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.XPDisplayData
	// Size: 0x30 (0x30 - 0x0)
	struct FXPDisplayData	
	{
	public:
		FName XPType; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FText TitleText; // 0x8(0x10)
		FText DisplayText; // 0x18(0x10)
		UMaterialInterface IconMaterial; // 0x28(0x8)
	};


	// Struct FortniteGame.AthenaSeasonalXPCurveEntry
	// Inherited from FTableRowBase
	// Size: 0x38 (0x40 - 0x8)
	struct FAthenaSeasonalXPCurveEntry : public FTableRowBase	
	{
	public:
		int32_t Level; // 0x8(0x4)
		int32_t XpToNextLevel; // 0xC(0x4)
		int32_t XpTotal; // 0x10(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr RewardItemAsset; // 0x18(0x20)
		int32_t RewardItemCount; // 0x38(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaExtendedXPCurveEntry
	// Inherited from FTableRowBase
	// Size: 0x30 (0x38 - 0x8)
	struct FAthenaExtendedXPCurveEntry : public FTableRowBase	
	{
	public:
		int32_t XpPerLevel; // 0x8(0x4)
		int32_t UntilLevel; // 0xC(0x4)
		TWeakObjectPtr RewardItemAssetPerLevel; // 0x10(0x20)
		int32_t RewardItemCountPerLevel; // 0x30(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaDynamicRestedXpGoldenPath
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FAthenaDynamicRestedXpGoldenPath : public FTableRowBase	
	{
	public:
		int32_t Day; // 0x8(0x4)
		int32_t GoldenPathXP; // 0xC(0x4)
		int32_t GoldenPathXPAvailable; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AthenaDynamicRestedXpProgression
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FAthenaDynamicRestedXpProgression : public FTableRowBase	
	{
	public:
		int32_t Accumulated; // 0x8(0x4)
		float DynamicRestMult; // 0xC(0x4)
		float NonBRDynamicRestMult; // 0x10(0x4)
		float StWDynamicRestMult; // 0x14(0x4)
	};


	// Struct FortniteGame.DynamicRestedXPProgression
	// Inherited from FTableRowBase
	// Size: 0x8 (0x10 - 0x8)
	struct FDynamicRestedXPProgression : public FTableRowBase	
	{
	public:
		int32_t AccumulatedRestXP; // 0x8(0x4)
		float DynamicRestXPMultiplier; // 0xC(0x4)
	};


	// Struct FortniteGame.AthenaReengagementRestedXp
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FAthenaReengagementRestedXp : public FTableRowBase	
	{
	public:
		int32_t Interval; // 0x8(0x4)
		int32_t TimeSinceLastSession; // 0xC(0x4)
		int32_t RestXPGained; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AttributeInfo
	// Size: 0x10 (0x10 - 0x0)
	struct FAttributeInfo	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AttributeRangePair
	// Size: 0x14 (0x14 - 0x0)
	struct FAttributeRangePair	
	{
	public:
		EAttributeHandling AttributeType; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FFloatRange AttributeRange; // 0x4(0x10)
	};


	// Struct FortniteGame.AttributeGateData
	// Size: 0x10 (0x10 - 0x0)
	struct FAttributeGateData	
	{
	public:
		TArray AttributeRules; // 0x0(0x10)
	};


	// Struct FortniteGame.GateType_Base
	// Size: 0x10 (0x10 - 0x0)
	struct FGateType_Base	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		FName GateName; // 0x8(0x4)
		unsigned char UnknownData03_7[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.GateType_ObjectiveUpdate_Base
	// Inherited from FGateType_Base
	// Size: 0x0 (0x10 - 0x10)
	struct FGateType_ObjectiveUpdate_Base : public FGateType_Base	
	{
	public:
	};


	// Struct FortniteGame.ObjectiveUpdateGate_Attribute
	// Inherited from FGateType_ObjectiveUpdate_Base -> FGateType_Base
	// Size: 0x50 (0x60 - 0x10)
	struct FObjectiveUpdateGate_Attribute : public FGateType_ObjectiveUpdate_Base	
	{
	public:
		TMap AttributeRequirements; // 0x10(0x50)
	};


	// Struct FortniteGame.BacchusActionIconMapping
	// Size: 0x10 (0x10 - 0x0)
	struct FBacchusActionIconMapping	
	{
	public:
		FName Action; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		UPaperSprite Sprite; // 0x8(0x8)
	};


	// Struct FortniteGame.EscapeMenuEvent
	// Size: 0x1 (0x1 - 0x0)
	struct FEscapeMenuEvent	
	{
	public:
		unsigned char UnknownData01_2[0x1]; // 0x0(0x1) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CrashpadStaticParams
	// Size: 0x128 (0x128 - 0x0)
	struct FCrashpadStaticParams	
	{
	public:
		FGameplayTag HoverTag; // 0x0(0x4)
		float PawnLaunchMultiplierXY; // 0x4(0x4)
		float PawnLaunchHorzClamp; // 0x8(0x4)
		float PawnLaunchVertOffset; // 0xC(0x4)
		float VerticalVelocityMultiplier; // 0x10(0x4)
		float MinLaunch; // 0x14(0x4)
		float MaxLaunch; // 0x18(0x4)
		float MinLaunchCrashpadPlus; // 0x1C(0x4)
		float MaxLaunchCrashpadPlus; // 0x20(0x4)
		float GrowthStart; // 0x24(0x4)
		float GrowthEnd; // 0x28(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		UCurveFloat LaunchCurve; // 0x30(0x8)
		UCurveFloat LaunchAngleWeight; // 0x38(0x8)
		float PlacedLaunchMod; // 0x40(0x4)
		float VehicleLaunchMultiplierXY; // 0x44(0x4)
		float VehicleLaunchMultiplierZ; // 0x48(0x4)
		float VehicleImpactRadius; // 0x4C(0x4)
		float PawnOrVehicleBounceIntensity; // 0x50(0x4)
		float CrashpadLaunchVertOffset; // 0x54(0x4)
		float CrashpadBounceIntensity; // 0x58(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		TArray CrashpadBounceScales; // 0x60(0x10)
		float MovingWithHeldObjectThreshold; // 0x70(0x4)
		float ProjectileLaunchMultiplierXY; // 0x74(0x4)
		float ProjectileLaunchMultiplierZ; // 0x78(0x4)
		float ProjectileBounceIntensity; // 0x7C(0x4)
		UClass FallImmunityGameplayEffect; // 0x80(0x8)
		UClass WebLaunchGameplayEffect; // 0x88(0x8)
		FGameplayTag SharkTag; // 0x90(0x4)
		bool bDestroyByShark; // 0x94(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x95(0x3) UNKNOWN PROPERTY
		FGameplayTag KnockbackImmunityTag; // 0x98(0x4)
		FGameplayTag TagBuildingPhysics; // 0x9C(0x4)
		float PhysicsObjectMassMultiplier; // 0xA0(0x4)
		float PhysicsObjectImpulseMultiplier; // 0xA4(0x4)
		float MinPhysicsObjectMass; // 0xA8(0x4)
		float MaxPhysicsObjectMass; // 0xAC(0x4)
		float MaxPhysicsObjectLaunch; // 0xB0(0x4)
		float MinPhysicsObjectStartVelZ; // 0xB4(0x4)
		float MaxPhysicsObjectStartVelZ; // 0xB8(0x4)
		float PhysicsObjectBounceIntensity; // 0xBC(0x4)
		float NonPawnLaunchScaleXY; // 0xC0(0x4)
		float NonPawnLaunchScaleZ; // 0xC4(0x4)
		float NonPawnLaunchOffsetZ; // 0xC8(0x4)
		float MinNonPawnVelocity; // 0xCC(0x4)
		float MaxNonPawnVelocity; // 0xD0(0x4)
		FGameplayTag TagEventUsedLaunchPad; // 0xD4(0x4)
		float BuildingActorBounceIntensity; // 0xD8(0x4)
		unsigned char UnknownData07_6[0x4]; // 0xDC(0x4) UNKNOWN PROPERTY
		UStaticMeshComponent CrashpadMesh; // 0xE0(0x8)
		FGameplayTagContainer TagCrashpadPlus; // 0xE8(0x20)
		FGameplayTagContainer QuestCrashpadUseTag; // 0x108(0x20)
	};


	// Struct FortniteGame.CrashpadDynamicParams
	// Size: 0x60 (0x60 - 0x0)
	struct FCrashpadDynamicParams	
	{
	public:
		AActor CollidingActor; // 0x0(0x8)
		TMap TrackedPlayers; // 0x8(0x50)
		bool bHitAnotherCrashpad; // 0x58(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x59(0x3) UNKNOWN PROPERTY
		int32_t CrashpadsBouncedOffOf; // 0x5C(0x4)
	};


	// Struct FortniteGame.FortMapData
	// Size: 0x48 (0x48 - 0x0)
	struct FFortMapData	
	{
	public:
		TWeakObjectPtr BuildingWorld; // 0x0(0x20)
		FGameplayTagContainer BuildingLevelTags; // 0x20(0x20)
		float SelectionWeight; // 0x40(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x44(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BuildingSMActorClassData
	// Inherited from FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x130 (0x228 - 0xF8)
	struct FBuildingSMActorClassData : public FBuildingActorClassData	
	{
	public:
		TWeakObjectPtr DeathParticles; // 0xF8(0x20)
		TArray AlternateMeshes; // 0x118(0x10)
		FName DestructionLootTierGroup; // 0x128(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x12C(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr WindSpeedCurve; // 0x130(0x20)
		TWeakObjectPtr WindPannerSpeedCurve; // 0x150(0x20)
		TWeakObjectPtr WindAudio; // 0x170(0x20)
		FVector2D RandomScaleRange; // 0x190(0x10)
		char NumFrameSubObjects; // 0x1A0(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x1A1(0x3) UNKNOWN PROPERTY
		float ShieldBuffMaterialParamValue1; // 0x1A4(0x4)
		float ShieldBuffMaterialParamValue2; // 0x1A8(0x4)
		float AnimatingDistanceFieldSelfShadowBias; // 0x1AC(0x4)
		float AnimatingSubObjects; // 0x1B0(0x4)
		float PlayerGridSnapSize; // 0x1B4(0x4)
		FVector3f BuildingPlacementDistance; // 0x1B8(0xC)
		unsigned char UnknownData08_6[0x4]; // 0x1C4(0x4) UNKNOWN PROPERTY
		FCurveTableRowHandle BuildingResourceAmountOverride; // 0x1C8(0x10)
		TArray IntenseWindMaterials; // 0x1D8(0x10)
		UBuildingEditModeMetadata EditModePatternData; // 0x1E8(0x8)
		bool bCanSpawnAtLowerQuotaLevels : 1; // 0x1F0:0(0x1)
		TEnumAsByte MaximumQuotaLevelBound; // 0x1F1(0x1)
		bool bDeriveCurieIdentifierFromResourceType : 1; // 0x1F2:0(0x1)
		unsigned char UnknownData09_5[0x1]; // 0x1F3(0x1) UNKNOWN PROPERTY
		float InfluenceMapWeight; // 0x1F4(0x4)
		bool bNoAIPawnCollision : 1; // 0x1F8:0(0x1)
		bool bBlocksCeilingPlacement : 1; // 0x1F8:1(0x1)
		bool bBlocksAttachmentPlacement : 1; // 0x1F8:2(0x1)
		bool bUsePhysicalSurfaceForFootstep : 1; // 0x1F8:3(0x1)
		bool bRandomYawOnPlacement : 1; // 0x1F8:4(0x1)
		bool bRandomScaleOnPlacement : 1; // 0x1F8:5(0x1)
		bool bClearMIDWhenReturningToUndamagedState : 1; // 0x1F8:6(0x1)
		unsigned char UnknownData10_5[0x7]; // 0x1F9(0x7) UNKNOWN PROPERTY
		TArray BlueprintMICs; // 0x200(0x10)
		TArray RandomDayphaseFXList; // 0x210(0x10)
		bool bUseDynamicDestructionMaterial : 1; // 0x220:0(0x1)
		bool bUseDynamicDestructionNiagaraSystem : 1; // 0x220:1(0x1)
		bool bAllowResourceDrop : 1; // 0x220:2(0x1)
		bool bHideOnDeath : 1; // 0x220:3(0x1)
		bool bPlayDestructionEffects : 1; // 0x220:4(0x1)
		bool bSkipConstructionSounds : 1; // 0x220:5(0x1)
		unsigned char UnknownData11_7[0x7]; // 0x221(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.RandomDayphaseFX
	// Size: 0x38 (0x38 - 0x0)
	struct FRandomDayphaseFX	
	{
	public:
		UParticleSystem ParticleSystem; // 0x0(0x8)
		TArray AltParticleSystems; // 0x8(0x10)
		TArray RequiredDayphases; // 0x18(0x10)
		float ChanceToSpawnFX; // 0x28(0x4)
		TEnumAsByte DetailMode; // 0x2C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
		float MaxDrawDistance; // 0x30(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.TierMeshSets
	// Size: 0x18 (0x18 - 0x0)
	struct FTierMeshSets	
	{
	public:
		int32_t Tier; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray MeshSets; // 0x8(0x10)
	};


	// Struct FortniteGame.BuildingPillarActorClassData
	// Inherited from FBuildingSMActorClassData -> FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x0 (0x228 - 0x228)
	struct FBuildingPillarActorClassData : public FBuildingSMActorClassData	
	{
	public:
	};


	// Struct FortniteGame.BuildingPropCornerActorClassData
	// Inherited from FBuildingSMActorClassData -> FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x0 (0x228 - 0x228)
	struct FBuildingPropCornerActorClassData : public FBuildingSMActorClassData	
	{
	public:
	};


	// Struct FortniteGame.BuildingTimeOfDayLightsActorClassData
	// Inherited from FBuildingSMActorClassData -> FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x8 (0x230 - 0x228)
	struct FBuildingTimeOfDayLightsActorClassData : public FBuildingSMActorClassData	
	{
	public:
		UMaterial FourLayerMaterial; // 0x228(0x8)
	};


	// Struct FortniteGame.BuildingPropActorClassData
	// Inherited from FBuildingTimeOfDayLightsActorClassData -> FBuildingSMActorClassData -> FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x20 (0x250 - 0x230)
	struct FBuildingPropActorClassData : public FBuildingTimeOfDayLightsActorClassData	
	{
	public:
		FGameplayTagContainer AnalyticsTags; // 0x230(0x20)
	};


	// Struct FortniteGame.BuildingPropWallActorClassData
	// Inherited from FBuildingPropActorClassData -> FBuildingTimeOfDayLightsActorClassData -> FBuildingSMActorClassData -> FBuildingActorClassData -> FUserOptionDefinitionContainer
	// Size: 0x0 (0x250 - 0x250)
	struct FBuildingPropWallActorClassData : public FBuildingPropActorClassData	
	{
	public:
	};


	// Struct FortniteGame.BulletWhipTrackerSystemData
	// Size: 0xA8 (0xA8 - 0x0)
	struct FBulletWhipTrackerSystemData	
	{
	public:
		UBulletWhipTrackerAudioData WhipTrackerData; // 0x0(0x8)
		unsigned char UnknownData03_6[0x54]; // 0x8(0x54) UNKNOWN PROPERTY
		TWeakObjectPtr CachedPassByPawn; // 0x5C(0x8)
		TWeakObjectPtr Instigator; // 0x64(0x8)
		TWeakObjectPtr PassByTargetPawn; // 0x6C(0x8)
		unsigned char UnknownData04_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		UAudioComponent WhipAudioComponent; // 0x78(0x8)
		unsigned char UnknownData05_7[0x28]; // 0x80(0x28) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortGiftBoxFortmatData
	// Size: 0x20 (0x20 - 0x0)
	struct FFortGiftBoxFortmatData	
	{
	public:
		FString StringAssetType; // 0x0(0x10)
		FString StringData; // 0x10(0x10)
	};


	// Struct FortniteGame.ChallengeGiftBoxData
	// Size: 0x30 (0x30 - 0x0)
	struct FChallengeGiftBoxData	
	{
	public:
		TWeakObjectPtr GiftBoxToUse; // 0x0(0x20)
		TArray GiftBoxFormatData; // 0x20(0x10)
	};


	// Struct FortniteGame.ConformantSubsystemCouplingCache
	// Size: 0x50 (0x50 - 0x0)
	struct FConformantSubsystemCouplingCache	
	{
	public:
		unsigned char UnknownData01_2[0x50]; // 0x0(0x50) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.GatingParams
	// Size: 0x28 (0x28 - 0x0)
	struct FGatingParams	
	{
	public:
		bool bIsInFrontEnd; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer TagsToMatch; // 0x8(0x20)
	};


	// Struct FortniteGame.AlternativeMontage
	// Size: 0x70 (0x70 - 0x0)
	struct FAlternativeMontage	
	{
	public:
		bool bisFrontEnd; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FGameplayTagQuery RequiredQuery; // 0x8(0x48)
		TWeakObjectPtr SoftMontage; // 0x50(0x20)
	};


	// Struct FortniteGame.CosmeticsPassLookupKey
	// Size: 0x40 (0x40 - 0x0)
	struct FCosmeticsPassLookupKey	
	{
	public:
		unsigned char UnknownData01_2[0x40]; // 0x0(0x40) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CosmeticFlowgraphState
	// Size: 0x18 (0x18 - 0x0)
	struct FCosmeticFlowgraphState	
	{
	public:
		UCosmeticStepDependencyBuilder Builder; // 0x0(0x8)
		TArray Steps; // 0x8(0x10)
	};


	// Struct FortniteGame.ExtensibilityPassContextEntry
	// Size: 0x10 (0x10 - 0x0)
	struct FExtensibilityPassContextEntry	
	{
	public:
		UFortCosmeticPassContext Context; // 0x0(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AgeRatingInfo
	// Size: 0x18 (0x18 - 0x0)
	struct FAgeRatingInfo	
	{
	public:
		FText AgeRatingText; // 0x0(0x10)
		UTexture2DDynamic RatingImageTexture; // 0x10(0x8)
	};


	// Struct FortniteGame.GatedCosmeticFallback
	// Size: 0x68 (0x68 - 0x0)
	struct FGatedCosmeticFallback	
	{
	public:
		FGameplayTagQuery CosmeticSlotQuery; // 0x0(0x48)
		TWeakObjectPtr DefaultCosmeticItemDefinition; // 0x48(0x20)
	};


	// Struct FortniteGame.CosmeticSlotIdentifier
	// Size: 0x4 (0x4 - 0x0)
	struct FCosmeticSlotIdentifier	
	{
	public:
		FGameplayTag SlotIdentifierTag; // 0x0(0x4)
	};


	// Struct FortniteGame.CosmeticSlotQuery
	// Size: 0x48 (0x48 - 0x0)
	struct FCosmeticSlotQuery	
	{
	public:
		FGameplayTagQuery SlotQuery; // 0x0(0x48)
	};


	// Struct FortniteGame.CosmeticsPassCoreBehaviorFlagsState
	// Size: 0x20 (0x20 - 0x0)
	struct FCosmeticsPassCoreBehaviorFlagsState	
	{
	public:
		TArray OptInFlags; // 0x0(0x10)
		TArray OptOutFlags; // 0x10(0x10)
	};


	// Struct FortniteGame.CreativeAttenuationVizData
	// Size: 0x20 (0x20 - 0x0)
	struct FCreativeAttenuationVizData	
	{
	public:
		UPrimitiveComponent MinSphere; // 0x0(0x8)
		UPrimitiveComponent MaxSphere; // 0x8(0x8)
		float MinDistance; // 0x10(0x4)
		float FalloffDistance; // 0x14(0x4)
		bool bIsVisible; // 0x18(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CreativeLayoutAlignmentConstraint
	// Size: 0x18 (0x18 - 0x0)
	struct FCreativeLayoutAlignmentConstraint	
	{
	public:
		ECreativeLayoutAlignmentOption Alignment; // 0x0(0x1)
		ECreativeLayoutAnchorOption Anchor; // 0x1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FVector2D Offset; // 0x8(0x10)
	};


	// Struct FortniteGame.CustomAccessoryMorphs
	// Size: 0x8 (0x8 - 0x0)
	struct FCustomAccessoryMorphs	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CustomAccessoryHatReactiveMorphs
	// Inherited from FCustomAccessoryMorphs
	// Size: 0x40 (0x48 - 0x8)
	struct FCustomAccessoryHatReactiveMorphs : public FCustomAccessoryMorphs	
	{
	public:
		TArray CapMorphTargets; // 0x8(0x10)
		TArray HelmetMorphTargets; // 0x18(0x10)
		TArray MaskMorphTargets; // 0x28(0x10)
		TArray HatMorphTargets; // 0x38(0x10)
	};


	// Struct FortniteGame.DailyTime
	// Size: 0x8 (0x8 - 0x0)
	struct FDailyTime	
	{
	public:
		int32_t Hour; // 0x0(0x4)
		int32_t Minute; // 0x4(0x4)
	};


	// Struct FortniteGame.DailyTimeWindow
	// Size: 0x10 (0x10 - 0x0)
	struct FDailyTimeWindow	
	{
	public:
		FDailyTime StartTime; // 0x0(0x8)
		FDailyTime EndTime; // 0x8(0x8)
	};


	// Struct FortniteGame.DataDrivenServiceBriefConfig
	// Size: 0xD0 (0xD0 - 0x0)
	struct FDataDrivenServiceBriefConfig	
	{
	public:
		FText TitleText; // 0x0(0x10)
		FText DescriptionText; // 0x10(0x10)
		FText TransactionText; // 0x20(0x10)
		FText StockText; // 0x30(0x10)
		FText WarningMessageText; // 0x40(0x10)
		TMap CannotUseReasonParameterToDisplayText; // 0x50(0x50)
		FString CannotUseReasonParameterKey; // 0xA0(0x10)
		FString CostParameterKey; // 0xB0(0x10)
		FString StockCountParameterKey; // 0xC0(0x10)
	};


	// Struct FortniteGame.ItemFundingUpdatedFundingData
	// Size: 0x10 (0x10 - 0x0)
	struct FItemFundingUpdatedFundingData	
	{
	public:
		int32_t StationIndex; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		int64_t NewCurrentFunds; // 0x8(0x8)
	};


	// Struct FortniteGame.RuntimeUserOption
	// Size: 0x18 (0x18 - 0x0)
	struct FRuntimeUserOption	
	{
	public:
		FName RowName; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FInstancedStruct RowData; // 0x8(0x10)
	};


	// Struct FortniteGame.DevicesPlayStateContext
	// Size: 0x10 (0x10 - 0x0)
	struct FDevicesPlayStateContext	
	{
	public:
		bool bPlaying; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		APlayspace EventOwner; // 0x8(0x8)
	};


	// Struct FortniteGame.EditConnectionChangedContext
	// Size: 0x4 (0x4 - 0x0)
	struct FEditConnectionChangedContext	
	{
	public:
		int32_t NumConnections; // 0x0(0x4)
	};


	// Struct FortniteGame.VkEditStatusEventContext
	// Size: 0x1 (0x1 - 0x0)
	struct FVkEditStatusEventContext	
	{
	public:
		EVkEditStatus Status; // 0x0(0x1)
	};


	// Struct FortniteGame.MutableResetData
	// Size: 0x1 (0x1 - 0x0)
	struct FMutableResetData	
	{
	public:
		unsigned char UnknownData01_2[0x1]; // 0x0(0x1) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MutableRetriggerData
	// Size: 0x1 (0x1 - 0x0)
	struct FMutableRetriggerData	
	{
	public:
		unsigned char UnknownData01_2[0x1]; // 0x0(0x1) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MutableFailData
	// Size: 0x1 (0x1 - 0x0)
	struct FMutableFailData	
	{
	public:
		unsigned char UnknownData01_2[0x1]; // 0x0(0x1) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.MutableTimerToggleData
	// Size: 0x18 (0x18 - 0x0)
	struct FMutableTimerToggleData	
	{
	public:
		unsigned char UnknownData01_2[0x18]; // 0x0(0x18) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ActiveGateData
	// Size: 0x58 (0x58 - 0x0)
	struct FActiveGateData	
	{
	public:
		bool bGateOpenState; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TMap AdditionalMutableGateInfo; // 0x8(0x50)
	};


	// Struct FortniteGame.GateExpression_Base
	// Size: 0x8 (0x8 - 0x0)
	struct FGateExpression_Base	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.GateExpression_AllExpressionsMatch
	// Inherited from FGateExpression_Base
	// Size: 0x10 (0x18 - 0x8)
	struct FGateExpression_AllExpressionsMatch : public FGateExpression_Base	
	{
	public:
		TArray Expressions; // 0x8(0x10)
	};


	// Struct FortniteGame.GateExpression_AnyExpressionMatches
	// Inherited from FGateExpression_Base
	// Size: 0x10 (0x18 - 0x8)
	struct FGateExpression_AnyExpressionMatches : public FGateExpression_Base	
	{
	public:
		TArray Expressions; // 0x8(0x10)
	};


	// Struct FortniteGame.GateExpression_NoExpressionsMatch
	// Inherited from FGateExpression_Base
	// Size: 0x10 (0x18 - 0x8)
	struct FGateExpression_NoExpressionsMatch : public FGateExpression_Base	
	{
	public:
		TArray Expressions; // 0x8(0x10)
	};


	// Struct FortniteGame.GateExpression_AllSpecifiedGatesOpen
	// Inherited from FGateExpression_Base
	// Size: 0x10 (0x18 - 0x8)
	struct FGateExpression_AllSpecifiedGatesOpen : public FGateExpression_Base	
	{
	public:
		TArray Gates; // 0x8(0x10)
	};


	// Struct FortniteGame.GateExpression_AnySpecifiedGatesOpen
	// Inherited from FGateExpression_Base
	// Size: 0x10 (0x18 - 0x8)
	struct FGateExpression_AnySpecifiedGatesOpen : public FGateExpression_Base	
	{
	public:
		TArray Gates; // 0x8(0x10)
	};


	// Struct FortniteGame.GateExpression_AllSpecifiedGatesClosed
	// Inherited from FGateExpression_Base
	// Size: 0x10 (0x18 - 0x8)
	struct FGateExpression_AllSpecifiedGatesClosed : public FGateExpression_Base	
	{
	public:
		TArray Gates; // 0x8(0x10)
	};


	// Struct FortniteGame.GateExpression_AllGatesOpen
	// Inherited from FGateExpression_Base
	// Size: 0x0 (0x8 - 0x8)
	struct FGateExpression_AllGatesOpen : public FGateExpression_Base	
	{
	public:
	};


	// Struct FortniteGame.GateExpression_AnyGatesOpen
	// Inherited from FGateExpression_Base
	// Size: 0x0 (0x8 - 0x8)
	struct FGateExpression_AnyGatesOpen : public FGateExpression_Base	
	{
	public:
	};


	// Struct FortniteGame.GateExpression_AllGatesClosed
	// Inherited from FGateExpression_Base
	// Size: 0x0 (0x8 - 0x8)
	struct FGateExpression_AllGatesClosed : public FGateExpression_Base	
	{
	public:
	};


	// Struct FortniteGame.EventManagerKey
	// Size: 0x50 (0x50 - 0x0)
	struct FEventManagerKey	
	{
	public:
		unsigned char UnknownData02_7[0x30]; // 0x0(0x30) UNKNOWN PROPERTY
		uint32_t InternalId; // 0x30(0x4)
		unsigned char UnknownData03_7[0x1C]; // 0x34(0x1C) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.UpdateCharacterCustomizationData
	// Size: 0x60 (0x60 - 0x0)
	struct FUpdateCharacterCustomizationData	
	{
	public:
		unsigned char UnknownData01_2[0x60]; // 0x0(0x60) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.RootMotionSource_DashForce
	// Inherited from FRootMotionSource_MoveToForce -> FRootMotionSource
	// Size: 0x10 (0x110 - 0x100)
	struct FRootMotionSource_DashForce : public FRootMotionSource_MoveToForce	
	{
	public:
		float HeightAboveGround; // 0x100(0x4)
		unsigned char UnknownData01_7[0xC]; // 0x104(0xC) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.XPEventEntryHotfix
	// Size: 0xC (0xC - 0x0)
	struct FXPEventEntryHotfix	
	{
	public:
		FName Entry; // 0x0(0x4)
		int32_t CountThreshhold; // 0x4(0x4)
		int32_t MaxCount; // 0x8(0x4)
	};


	// Struct FortniteGame.AccoladeSecondaryXpType
	// Size: 0x30 (0x30 - 0x0)
	struct FAccoladeSecondaryXpType	
	{
	public:
		FGameplayTag Type; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FScalableFloat XpAmount; // 0x8(0x28)
	};


	// Struct FortniteGame.XpEventInfoOverrides
	// Size: 0x50 (0x50 - 0x0)
	struct FXpEventInfoOverrides	
	{
	public:
		unsigned char UnknownData01_2[0x50]; // 0x0(0x50) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortXPEventEntry
	// Size: 0x18 (0x18 - 0x0)
	struct FFortXPEventEntry	
	{
	public:
		int32_t OldXPValue; // 0x0(0x4)
		int32_t OldLevel; // 0x4(0x4)
		int32_t NewXPValue; // 0x8(0x4)
		int32_t NewLevel; // 0xC(0x4)
		int32_t EventXpValue; // 0x10(0x4)
		int32_t RemainingRestXP; // 0x14(0x4)
	};


	// Struct FortniteGame.FortAimedObjectConfig
	// Size: 0x50 (0x50 - 0x0)
	struct FFortAimedObjectConfig	
	{
	public:
		FVector CameraOffset; // 0x0(0x18)
		FRotator CameraSpaceRotationOffset; // 0x18(0x18)
		EAimedObjectType ObjectType; // 0x30(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		float BlendRate; // 0x34(0x4)
		float HidePawnBlendInWeight; // 0x38(0x4)
		float HidePawnBlendOutWeight; // 0x3C(0x4)
		FName AimedObjectBoneName; // 0x40(0x4)
		FName CameraBoneName; // 0x44(0x4)
		FName HeadBoneName; // 0x48(0x4)
		FName AimedObjectHandleBoneName; // 0x4C(0x4)
	};


	// Struct FortniteGame.FortAnimationLayeringWeightsDataSet
	// Size: 0x78 (0x78 - 0x0)
	struct FFortAnimationLayeringWeightsDataSet	
	{
	public:
		float LocalSpaceLegs; // 0x0(0x4)
		float LocalSpacePelvis; // 0x4(0x4)
		float LocalSpaceTorso; // 0x8(0x4)
		float LocalSpaceHead; // 0xC(0x4)
		float LocalSpaceShoulderL; // 0x10(0x4)
		float LocalSpaceShoulderR; // 0x14(0x4)
		float LocalSpaceArmL; // 0x18(0x4)
		float LocalSpaceArmR; // 0x1C(0x4)
		float LocalSpaceWeaponL; // 0x20(0x4)
		float LocalSpaceWeaponR; // 0x24(0x4)
		float LocalSpaceHandAttachL; // 0x28(0x4)
		float LocalSpaceHandAttachR; // 0x2C(0x4)
		float LocalSpaceHandL; // 0x30(0x4)
		float LocalSpaceHandR; // 0x34(0x4)
		float LocalSpaceFingersL; // 0x38(0x4)
		float LocalSpaceFingersR; // 0x3C(0x4)
		float MeshSpaceLegs; // 0x40(0x4)
		float MeshSpacePelvis; // 0x44(0x4)
		float MeshSpaceTorso; // 0x48(0x4)
		float MeshSpaceHead; // 0x4C(0x4)
		float MeshSpaceShoulderL; // 0x50(0x4)
		float MeshSpaceShoulderR; // 0x54(0x4)
		float MeshSpaceArmL; // 0x58(0x4)
		float MeshSpaceArmR; // 0x5C(0x4)
		float MeshSpaceWeaponL; // 0x60(0x4)
		float MeshSpaceWeaponR; // 0x64(0x4)
		float MeshSpaceHandAttachL; // 0x68(0x4)
		float MeshSpaceHandAttachR; // 0x6C(0x4)
		float MeshSpaceHandL; // 0x70(0x4)
		float MeshSpaceHandR; // 0x74(0x4)
	};


	// Struct FortniteGame.FortAnimInput_JackalVehicle
	// Size: 0x240 (0x240 - 0x0)
	struct FFortAnimInput_JackalVehicle	
	{
	public:
		bool bIsUsingJackalVehicle : 1; // 0x0:0(0x1)
		bool bIsSteeringLeft : 1; // 0x0:1(0x1)
		bool bIsSteeringRight : 1; // 0x0:2(0x1)
		unsigned char UnknownData05_5[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float SteerAngleDeadZoneDegrees; // 0x4(0x4)
		float SteerAngle; // 0x8(0x4)
		float LeanYaw; // 0xC(0x4)
		float QuantizedSteerAngle; // 0x10(0x4)
		float SteerAlpha; // 0x14(0x4)
		float RunForwardAlpha; // 0x18(0x4)
		float SlopePitchDegreeAngle; // 0x1C(0x4)
		float SlopeRollDegreeAngle; // 0x20(0x4)
		float DistanceFromGround; // 0x24(0x4)
		float PivotPlayRate; // 0x28(0x4)
		bool bIsReversing : 1; // 0x2C:0(0x1)
		bool bIsBraking : 1; // 0x2C:1(0x1)
		bool bIsMoving : 1; // 0x2C:2(0x1)
		bool bIsMovingForward : 1; // 0x2C:3(0x1)
		bool bIsSprinting : 1; // 0x2C:4(0x1)
		bool bInAir : 1; // 0x2C:5(0x1)
		bool bIsFalling : 1; // 0x2C:6(0x1)
		bool bIsJumping : 1; // 0x2C:7(0x1)
		bool bIsRelaxed : 1; // 0x2D:0(0x1)
		bool bIsBoosting : 1; // 0x2D:1(0x1)
		bool bHasReachedJumpChargeStartThreshold : 1; // 0x2D:2(0x1)
		bool bHasReachedJumpChargeMidThreshold : 1; // 0x2D:3(0x1)
		bool bHasReachedJumpChargeFullThreshold : 1; // 0x2D:4(0x1)
		bool bAdjustRootForFemaleRider : 1; // 0x2D:5(0x1)
		bool bIsPlayingEmoteOnHoverboard : 1; // 0x2D:6(0x1)
		bool bShouldApplyAdditive : 1; // 0x2D:7(0x1)
		bool bPlayPivotOnGroundAndNotBoosting : 1; // 0x2E:0(0x1)
		bool bIsOnLowerHill : 1; // 0x2E:1(0x1)
		bool bLowerBodyIdleToLoopTransition : 1; // 0x2E:2(0x1)
		bool bInterruptHoverboardFullybody : 1; // 0x2E:3(0x1)
		bool bEnterFullBodyHoverboardState : 1; // 0x2E:4(0x1)
		bool bDefaultToJumpStartTransition : 1; // 0x2E:5(0x1)
		bool bLocomotionPoseToJumpTransition : 1; // 0x2E:6(0x1)
		bool bBoostingToBoostingJumpTransition : 1; // 0x2E:7(0x1)
		bool bJumpToLocomotionPoseTransition : 1; // 0x2F:0(0x1)
		bool bJumpApexToJumpFallTransition : 1; // 0x2F:1(0x1)
		bool bIdleToMovementStartTransition : 1; // 0x2F:2(0x1)
		bool bIdleToMovementLoopTransition : 1; // 0x2F:3(0x1)
		bool bMovementLoopToMovementStopTransition : 1; // 0x2F:4(0x1)
		bool bMovementLoopToPivotTransition : 1; // 0x2F:5(0x1)
		bool bMovementLoopToIdleTransition : 1; // 0x2F:6(0x1)
		bool bIdleAdditiveToCollisionNTransition : 1; // 0x2F:7(0x1)
		bool bSplitBodyToHoverboardBRTransition : 1; // 0x30:0(0x1)
		bool bHoverboardBRToSplitBodyTransition : 1; // 0x30:1(0x1)
		bool bHoverboardBRMovementToJumpChargeTransition : 1; // 0x30:2(0x1)
		bool bIdlesToJackalVehicleTransition : 1; // 0x30:3(0x1)
		bool bPlayAdditiveLeans : 1; // 0x30:4(0x1)
		bool bPlayBalloonLeans : 1; // 0x30:5(0x1)
		bool bPlayJumpTrickVertical : 1; // 0x30:6(0x1)
		bool bPlayJumpTrick : 1; // 0x30:7(0x1)
		bool bPlayMovingFast : 1; // 0x31:0(0x1)
		bool bPlayHipAdjustmentAdditive : 1; // 0x31:1(0x1)
		bool bPlayDriveSouth : 1; // 0x31:2(0x1)
		bool bPlayHeadAimOffset : 1; // 0x31:3(0x1)
		bool bPlaySlopeAimOffset : 1; // 0x31:4(0x1)
		unsigned char UnknownData06_5[0x2]; // 0x32(0x2) UNKNOWN PROPERTY
		float JumpCombatAdditiveWeight; // 0x34(0x4)
		float MeleeTwistIdle; // 0x38(0x4)
		float MeleeTwistLocomotionLoop; // 0x3C(0x4)
		FFortAnimInput_VelocityImpact VelocityImpact; // 0x40(0xF0)
		FVector ImpactDisplacement; // 0x130(0x18)
		unsigned char UnknownData07_6[0x8]; // 0x148(0x8) UNKNOWN PROPERTY
		float SteerYaw; // 0x150(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x154(0x4) UNKNOWN PROPERTY
		FVector EmoteHoverboardPosition; // 0x158(0x18)
		FRotator EmoteHoverboardRotation; // 0x170(0x18)
		bool bShouldAttachFeetToHoverboard : 1; // 0x188:0(0x1)
		unsigned char UnknownData09_5[0x7]; // 0x189(0x7) UNKNOWN PROPERTY
		FVector FootLeftLocationOffset; // 0x190(0x18)
		FRotator FootLeftRotationOffset; // 0x1A8(0x18)
		FVector FootRightLocationOffset; // 0x1C0(0x18)
		FRotator FootRightRotationOffset; // 0x1D8(0x18)
		float StoppedThreshold; // 0x1F0(0x4)
		float MovingForwardThreshold; // 0x1F4(0x4)
		float MovingFowardFastThreshold; // 0x1F8(0x4)
		float DefaultToJumpStartTransitionThreshold; // 0x1FC(0x4)
		float JumpTrickAngularVelocityThreshold; // 0x200(0x4)
		float JumpDistanceFromGroundThreshold; // 0x204(0x4)
		float VelocityStartThreshold; // 0x208(0x4)
		float MovingFastThreshold; // 0x20C(0x4)
		float RelaxedSpeedThreshold; // 0x210(0x4)
		float JumpChargeStartThreshold; // 0x214(0x4)
		float JumpChargeMidThreshold; // 0x218(0x4)
		float JumpChargeFullThreshold; // 0x21C(0x4)
		float RotatingAngularVelocityThreshold; // 0x220(0x4)
		float IdleToLoopTransitionSpeedThreshold; // 0x224(0x4)
		float IdleToMovementLoopTransitionThreshold; // 0x228(0x4)
		float MeleeTwistIdleMultiplier; // 0x22C(0x4)
		float MeleeTwistLocomotionLoopMultiplier; // 0x230(0x4)
		float LeanYawForMaxPivotPlayRate; // 0x234(0x4)
		float SteerAlphaForMaxPivotPlayRate; // 0x238(0x4)
		EFortCardinalDirection PrePivotCardinalDirection; // 0x23C(0x1)
		EFortCardinalDirection PreviousFrameLocomotionCardinalDirection; // 0x23D(0x1)
		bool bPivotTransitionDoOnceTriggered; // 0x23E(0x1)
		bool bShouldPlayJogPivotTransition; // 0x23F(0x1)
	};


	// Struct FortniteGame.FortAnimInput_VelocityImpact
	// Size: 0xF0 (0xF0 - 0x0)
	struct FFortAnimInput_VelocityImpact	
	{
	public:
		FVector LastVelocity; // 0x0(0x18)
		FVector DeltaVelocityThreshold; // 0x18(0x18)
		FVector ImpactScale; // 0x30(0x18)
		FInputRange ImpactLimitX; // 0x48(0x8)
		FInputRange ImpactLimitY; // 0x50(0x8)
		FInputRange ImpactLimitZ; // 0x58(0x8)
		FFloatRK4SpringInterpolator SpringInterpolatorX; // 0x60(0x8)
		unsigned char UnknownData05_6[0x1C]; // 0x68(0x1C) UNKNOWN PROPERTY
		FFloatRK4SpringInterpolator SpringInterpolatorY; // 0x84(0x8)
		unsigned char UnknownData06_6[0x1C]; // 0x8C(0x1C) UNKNOWN PROPERTY
		FFloatRK4SpringInterpolator SpringInterpolatorZ; // 0xA8(0x8)
		unsigned char UnknownData07_6[0x1C]; // 0xB0(0x1C) UNKNOWN PROPERTY
		bool bTestVelocity : 1; // 0xCC:0(0x1)
		unsigned char UnknownData08_5[0x3]; // 0xCD(0x3) UNKNOWN PROPERTY
		FVector TestVelocity; // 0xD0(0x18)
		bool bIsForwardImpact : 1; // 0xE8:0(0x1)
		bool bIsBackwardImpact : 1; // 0xE8:1(0x1)
		bool bIsLeftImpact : 1; // 0xE8:2(0x1)
		bool bIsRightImpact : 1; // 0xE8:3(0x1)
		bool bIsUpImpact : 1; // 0xE8:4(0x1)
		bool bIsDownImpact : 1; // 0xE8:5(0x1)
		unsigned char UnknownData09_7[0x7]; // 0xE9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAnimInput_RandomizeMontageSection
	// Size: 0x18 (0x18 - 0x0)
	struct FFortAnimInput_RandomizeMontageSection	
	{
	public:
		UAnimSequenceBase CurrentAnimation; // 0x0(0x8)
		FName MontageSectionName; // 0x8(0x4)
		float TimeUntilNextSectionChange; // 0xC(0x4)
		int32_t CurrentSectionParamIndex; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAnimInput_StandardLocomotion
	// Size: 0xD0 (0xD0 - 0x0)
	struct FFortAnimInput_StandardLocomotion	
	{
	public:
		FVector ActorSpaceVelocityDirPreTurn; // 0x0(0x18)
		float OneHandedTransitionHackAlpha; // 0x18(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		FFortAnimInput_SpeedWarping SpeedWarping; // 0x20(0x30)
		float StopStateRotationMultiplier; // 0x50(0x4)
		float JogStartSpeedWarpingAlpha; // 0x54(0x4)
		FFortAnimInput_SpeedWarping JogStartSpeedWarping; // 0x58(0x30)
		float DisableRightArmAdditiveCurveAlpha; // 0x88(0x4)
		bool bShouldWalkRightFootFwd : 1; // 0x8C:0(0x1)
		bool bShouldPlayJogStartTransition : 1; // 0x8C:1(0x1)
		bool bShouldPlayJogStopTransition : 1; // 0x8C:2(0x1)
		bool bShouldPlayJogPivotTransition : 1; // 0x8C:3(0x1)
		bool bStartTransitionActive : 1; // 0x8C:4(0x1)
		bool bStopTransitionActive : 1; // 0x8C:5(0x1)
		bool bPivotTransitionActive : 1; // 0x8C:6(0x1)
		bool bShouldPlayPostPivotTransition : 1; // 0x8C:7(0x1)
		bool bShouldEarlyOutStartState : 1; // 0x8D:0(0x1)
		bool bShouldEarlyOutStopState : 1; // 0x8D:1(0x1)
		bool bShouldEarlyOutPivotState : 1; // 0x8D:2(0x1)
		unsigned char UnknownData06_5[0x2]; // 0x8E(0x2) UNKNOWN PROPERTY
		float StartAnimDeltaAngleNorth; // 0x90(0x4)
		float StartAnimDeltaAngleEast; // 0x94(0x4)
		float StartAnimDeltaAngleSouth; // 0x98(0x4)
		float StartAnimDeltaAngleWest; // 0x9C(0x4)
		float StopAnimDeltaAngle; // 0xA0(0x4)
		float PrePivotAnimDeltaAngle; // 0xA4(0x4)
		float PostPivotAnimDeltaAngle; // 0xA8(0x4)
		float JogPrePivotTimer; // 0xAC(0x4)
		float TransitionPlayRate; // 0xB0(0x4)
		EFortCardinalDirection StopCardinalDirection; // 0xB4(0x1)
		EFortCardinalDirection PrePivotCardinalDirection; // 0xB5(0x1)
		EFortCardinalDirection PostPivotCardinalDirection; // 0xB6(0x1)
		bool bEarlyOut_Lowerbody_Turns : 1; // 0xB7:0(0x1)
		EFortCardinalDirection StartTransitionInitialDirection; // 0xB8(0x1)
		bool bStartJogDoOnceTriggered : 1; // 0xB9:0(0x1)
		unsigned char UnknownData07_5[0x2]; // 0xBA(0x2) UNKNOWN PROPERTY
		float StartStateRotationMultiplier; // 0xBC(0x4)
		bool bStopJogDoOnceTriggered : 1; // 0xC0:0(0x1)
		bool bPivotTransitionDoOnceTriggered : 1; // 0xC0:1(0x1)
		bool bPostPivotTransitionDoOnceTriggered : 1; // 0xC0:2(0x1)
		bool bIsInTetheredMovement : 1; // 0xC0:3(0x1)
		bool bIsInsideVehicle : 1; // 0xC0:4(0x1)
		unsigned char UnknownData08_5[0x3]; // 0xC1(0x3) UNKNOWN PROPERTY
		uint32_t LastUpdateFrame; // 0xC4(0x4)
		uint32_t LastThreadSafeUpdateFrame; // 0xC8(0x4)
		unsigned char UnknownData09_7[0x4]; // 0xCC(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAnimInput_SpeedWarping
	// Size: 0x30 (0x30 - 0x0)
	struct FFortAnimInput_SpeedWarping	
	{
	public:
		UCurveFloat PlayRateAdjustmentCurve; // 0x0(0x8)
		FVector2D SpeedWarpingLimits; // 0x8(0x10)
		FVector2D SpeedWarpingLimitsAddlRateScale; // 0x18(0x10)
		float SpeedWarpingAmount; // 0x28(0x4)
		float PlayRate; // 0x2C(0x4)
	};


	// Struct FortniteGame.FortAnimNode_CurveFilterSlot
	// Inherited from FAnimNode_Slot -> FAnimNode_Base
	// Size: 0x50 (0x98 - 0x48)
	struct FFortAnimNode_CurveFilterSlot : public FAnimNode_Slot	
	{
	public:
		FName MontageSlotName; // 0x48(0x4)
		ECurveFilterSlotMode FilterMode; // 0x4C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x4D(0x3) UNKNOWN PROPERTY
		TArray CurveNames; // 0x50(0x10)
		unsigned char UnknownData03_7[0x38]; // 0x60(0x38) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAnimNode_LinkedGraphGate
	// Inherited from FAnimNode_Base
	// Size: 0x28 (0x38 - 0x10)
	struct FFortAnimNode_LinkedGraphGate : public FAnimNode_Base	
	{
	public:
		FPoseLink Source; // 0x10(0x10)
		FName LinkedGraphTag; // 0x20(0x4)
		bool bFallbackToAdditiveIdentity; // 0x24(0x1)
		unsigned char UnknownData01_7[0x13]; // 0x25(0x13) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAnimNode_PoseDebug
	// Inherited from FAnimNode_Base
	// Size: 0x10 (0x20 - 0x10)
	struct FFortAnimNode_PoseDebug : public FAnimNode_Base	
	{
	public:
		FPoseLink Source; // 0x10(0x10)
	};


	// Struct FortniteGame.FortAnimNode_SetIKTarget
	// Inherited from FAnimNode_SkeletalControlBase -> FAnimNode_Base
	// Size: 0x148 (0x210 - 0xC8)
	struct FFortAnimNode_SetIKTarget : public FAnimNode_SkeletalControlBase	
	{
	public:
		FBoneReference FootL; // 0xC8(0xC)
		FBoneReference FootR; // 0xD4(0xC)
		FBoneReference IKFootL; // 0xE0(0xC)
		FBoneReference IKFootR; // 0xEC(0xC)
		float IKTraceLength; // 0xF8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xFC(0x4) UNKNOWN PROPERTY
		FVector GravityDir; // 0x100(0x18)
		TEnumAsByte FootTraceChannel; // 0x118(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x119(0x3) UNKNOWN PROPERTY
		float MaxFootHeightComponentSpace; // 0x11C(0x4)
		unsigned char UnknownData05_7[0xF0]; // 0x120(0xF0) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AnimTagProperty
	// Size: 0x30 (0x30 - 0x0)
	struct FAnimTagProperty	
	{
	public:
		FGameplayTag BackingGameplayTag; // 0x0(0x4)
		unsigned char UnknownData02_6[0x24]; // 0x4(0x24) UNKNOWN PROPERTY
		FName PropertyName; // 0x28(0x4)
		bool bUseExactTag; // 0x2C(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortAthenaCompassIcon
	// Size: 0xD0 (0xD0 - 0x0)
	struct FFortAthenaCompassIcon	
	{
	public:
		FSlateBrush Brush; // 0x0(0xB0)
		float Scale; // 0xB0(0x4)
		float MaxPawnDistanceForScaling; // 0xB4(0x4)
		float DistanceForScalingMultiplier_Min; // 0xB8(0x4)
		float DistanceForScalingMultiplier_Max; // 0xBC(0x4)
		float YOffset; // 0xC0(0x4)
		unsigned char UnknownData01_7[0xC]; // 0xC4(0xC) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleBounceState
	// Size: 0xC (0xC - 0x0)
	struct FVehicleBounceState	
	{
	public:
		EBounceCompressionState CompressionState; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float CompressionValue; // 0x4(0x4)
		float StateCooldown; // 0x8(0x4)
	};


	// Struct FortniteGame.FortUserMixSettings
	// Size: 0x40 (0x40 - 0x0)
	struct FFortUserMixSettings	
	{
	public:
		USoundControlBusMix Mix; // 0x0(0x8)
		USoundControlBus MainBus; // 0x8(0x8)
		USoundControlBus MusicBus; // 0x10(0x8)
		USoundControlBus SFXBus; // 0x18(0x8)
		USoundControlBus DialogueBus; // 0x20(0x8)
		USoundControlBus ChatBus; // 0x28(0x8)
		USoundControlBus CinematicsBus; // 0x30(0x8)
		USoundControlBus PIPBus; // 0x38(0x8)
	};


	// Struct FortniteGame.FortAudioTODEventData
	// Size: 0x38 (0x38 - 0x0)
	struct FFortAudioTODEventData	
	{
	public:
		FGameplayTag EventName; // 0x0(0x4)
		EFortAudioTODScheduleMode EventScheduleMode; // 0x4(0x1)
		EFortDayPhase DayPhase; // 0x5(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x6(0x2) UNKNOWN PROPERTY
		FVector2D DayPhaseOffsetRangeSeconds; // 0x8(0x10)
		FVector2D RangeInGameHours; // 0x18(0x10)
		FVector2D EventDurationInGameHours; // 0x28(0x10)
	};


	// Struct FortniteGame.AileronRoll
	// Size: 0xE0 (0xE0 - 0x0)
	struct FAileronRoll	
	{
	public:
		FFortRechargingActionTimer Action; // 0x0(0xD8)
		EAileronRollDirection Direction; // 0xD8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VehicleSimAux
	// Size: 0xD0 (0xD0 - 0x0)
	struct FVehicleSimAux	
	{
	public:
		unsigned char UnknownData01_2[0xD0]; // 0x0(0xD0) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.BiplaneSimAux
	// Inherited from FVehicleSimAux
	// Size: 0x590 (0x660 - 0xD0)
	struct FBiplaneSimAux : public FVehicleSimAux	
	{
	public:
		bool bIsEngineOn; // 0xD0(0x1)
		bool bIsFlying; // 0xD1(0x1)
		bool bAutoStartEngineInAir; // 0xD2(0x1)
		bool bEngineStartIsBeingHeld; // 0xD3(0x1)
		float PitchAlphaNoPilot; // 0xD4(0x4)
		float TurnAlphaNoPilot; // 0xD8(0x4)
		float RollAlphaNoPilot; // 0xDC(0x4)
		float AileronRollAlphaStart; // 0xE0(0x4)
		bool bHadPassengers; // 0xE4(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xE5(0x3) UNKNOWN PROPERTY
		float NoPassengerStallTimerStart; // 0xE8(0x4)
		float StuckTimerStart; // 0xEC(0x4)
		bool bRollRight; // 0xF0(0x1)
		bool bRollLeft; // 0xF1(0x1)
		unsigned char UnknownData05_6[0x2]; // 0xF2(0x2) UNKNOWN PROPERTY
		float AileronRollDoubleClickTimerStart; // 0xF4(0x4)
		FAileronRoll AileronRoll; // 0xF8(0xE0)
		FFortRechargingActionTimer BoostAction; // 0x1D8(0xD8)
		unsigned char UnknownData06_6[0x3A0]; // 0x2B0(0x3A0) UNKNOWN PROPERTY
		float VehicleFuelPercent; // 0x650(0x4)
		bool bIsStallingFromAltitude; // 0x654(0x1)
		unsigned char UnknownData07_7[0xB]; // 0x655(0xB) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortVehicleDerived
	// Size: 0x70 (0x70 - 0x0)
	struct FFortVehicleDerived	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		TArray Springs; // 0x8(0x10)
		TArray InternalGears; // 0x18(0x10)
		TArray InternalSprintGears; // 0x28(0x10)
		FVector LocalFrontFrictionPt; // 0x38(0x18)
		FVector LocalRearFrictionPt; // 0x50(0x18)
		float FrontMassRatio; // 0x68(0x4)
		float RearMassRatio; // 0x6C(0x4)
	};


	// Struct FortniteGame.GearConfig
	// Size: 0x18 (0x18 - 0x0)
	struct FGearConfig	
	{
	public:
		float TopSpeed; // 0x0(0x4)
		float MinSpeed; // 0x4(0x4)
		float PushForce; // 0x8(0x4)
		float RampTime; // 0xC(0x4)
		float SteeringAngleMultiplier; // 0x10(0x4)
		bool bAutoBrake : 1; // 0x14:0(0x1)
		bool bIgnoreGravity : 1; // 0x14:1(0x1)
		bool bForwardGear : 1; // 0x14:2(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.SpringConfig
	// Size: 0xD0 (0xD0 - 0x0)
	struct FSpringConfig	
	{
	public:
		FTransform LocalStartTM; // 0x0(0x60)
		FTransform LocalApplyTM; // 0x60(0x60)
		float SpringLength; // 0xC0(0x4)
		float SpringStiff; // 0xC4(0x4)
		float SpringDamp; // 0xC8(0x4)
		float MaxAccelChange; // 0xCC(0x4)
	};


	// Struct FortniteGame.BiplaneDerived
	// Inherited from FFortVehicleDerived
	// Size: 0x0 (0x70 - 0x70)
	struct FBiplaneDerived : public FFortVehicleDerived	
	{
	public:
	};


	// Struct FortniteGame.FortBitArray
	// Size: 0x10 (0x10 - 0x0)
	struct FFortBitArray	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortBotBuildingContainerBlacklistDataTableRow
	// Inherited from FTableRowBase
	// Size: 0x28 (0x30 - 0x8)
	struct FFortBotBuildingContainerBlacklistDataTableRow : public FTableRowBase	
	{
	public:
		TWeakObjectPtr BlacklistedActorClass; // 0x8(0x20)
		bool bIsBlacklisted; // 0x28(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortBotCosmeticLibraryWeightRegionOverrideDataTableRow
	// Inherited from FTableRowBase
	// Size: 0x38 (0x40 - 0x8)
	struct FFortBotCosmeticLibraryWeightRegionOverrideDataTableRow : public FTableRowBase	
	{
	public:
		FString RegionId; // 0x8(0x10)
		FScalableFloat RegionWeights; // 0x18(0x28)
	};


	// Struct FortniteGame.FortBotCosmeticItemDataTableRow
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortBotCosmeticItemDataTableRow : public FTableRowBase	
	{
	public:
		FPrimaryAssetId PrimaryAssetId; // 0x8(0x8)
		float Weight; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortLimitedAvailabilityBotCosmeticItemDataTableRow
	// Inherited from FFortBotCosmeticItemDataTableRow -> FTableRowBase
	// Size: 0x10 (0x28 - 0x18)
	struct FFortLimitedAvailabilityBotCosmeticItemDataTableRow : public FFortBotCosmeticItemDataTableRow	
	{
	public:
		FDateTime StartDate; // 0x18(0x8)
		FDateTime EndDate; // 0x20(0x8)
	};


	// Struct FortniteGame.FortBotCosmeticItemSetDataTableRow
	// Inherited from FTableRowBase
	// Size: 0x30 (0x38 - 0x8)
	struct FFortBotCosmeticItemSetDataTableRow : public FTableRowBase	
	{
	public:
		FPrimaryAssetId CharacterAssetId; // 0x8(0x8)
		FPrimaryAssetId GliderAssetId; // 0x10(0x8)
		FPrimaryAssetId SkyDiveContrailAssetId; // 0x18(0x8)
		FPrimaryAssetId BackpackAssetId; // 0x20(0x8)
		FPrimaryAssetId PickaxeAssetId; // 0x28(0x8)
		float Weight; // 0x30(0x4)
		FGameplayTag SetTag; // 0x34(0x4)
	};


	// Struct FortniteGame.FortLimitedAvailabilityBotCosmeticItemSetDataTableRow
	// Inherited from FFortBotCosmeticItemSetDataTableRow -> FTableRowBase
	// Size: 0x10 (0x48 - 0x38)
	struct FFortLimitedAvailabilityBotCosmeticItemSetDataTableRow : public FFortBotCosmeticItemSetDataTableRow	
	{
	public:
		FDateTime StartDate; // 0x38(0x8)
		FDateTime EndDate; // 0x40(0x8)
	};


	// Struct FortniteGame.FortBotItemDataTableRow
	// Inherited from FTableRowBase
	// Size: 0x8 (0x10 - 0x8)
	struct FFortBotItemDataTableRow : public FTableRowBase	
	{
	public:
		FGameplayTag tag; // 0x8(0x4)
		bool bIsSupported; // 0xC(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortBotAugmentsDataTableRow
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortBotAugmentsDataTableRow : public FTableRowBase	
	{
	public:
		UFortPlayerAugmentItemDefinition AugmentItemDefinition; // 0x8(0x8)
		float Weight; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortBudgetGridCellMemoryStats
	// Size: 0x10 (0x10 - 0x0)
	struct FFortBudgetGridCellMemoryStats	
	{
	public:
		int32_t MemoryValue; // 0x0(0x4)
		int32_t PreviewValue; // 0x4(0x4)
		FIntPoint CellIndex; // 0x8(0x8)
	};


	// Struct FortniteGame.FortBudgetGridMemoryStats
	// Size: 0x20 (0x20 - 0x0)
	struct FFortBudgetGridMemoryStats	
	{
	public:
		int32_t MinValue; // 0x0(0x4)
		FIntPoint MinValueCellIndex; // 0x4(0x8)
		int32_t MaxValue; // 0xC(0x4)
		FIntPoint MaxValueCellIndex; // 0x10(0x8)
		int32_t AverageValue; // 0x18(0x4)
		int32_t MedianValue; // 0x1C(0x4)
	};


	// Struct FortniteGame.FortCameraClampOverride
	// Size: 0x14 (0x14 - 0x0)
	struct FFortCameraClampOverride	
	{
	public:
		bool bOverride : 1; // 0x0:0(0x1)
		unsigned char UnknownData01_5[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FFloatRange ClampRange; // 0x4(0x10)
	};


	// Struct FortniteGame.ChallengeBundleGiftCardDisplayData
	// Size: 0x98 (0x98 - 0x0)
	struct FChallengeBundleGiftCardDisplayData	
	{
	public:
		TWeakObjectPtr GiftCardWidget; // 0x0(0x20)
		FText HasNoAvailableQuestsText; // 0x20(0x10)
		FText AllQuestsAreClaimedText; // 0x30(0x10)
		FText ThereIsSingleAvailableQuestText; // 0x40(0x10)
		FText ThereAreMultipleAvailableQuestsText; // 0x50(0x10)
		FText ReturnToTheLobbyText; // 0x60(0x10)
		FText FlushToTheBattleText; // 0x70(0x10)
		FText JustCompletedAllQuestsInBattleText; // 0x80(0x10)
		FGameplayTag CompleteStatTag; // 0x90(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x94(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortClientEvent
	// Size: 0x18 (0x18 - 0x0)
	struct FFortClientEvent	
	{
	public:
		FName CategoryName; // 0x0(0x4)
		FName EventName; // 0x4(0x4)
		UObject EventSource; // 0x8(0x8)
		UObject EventFocus; // 0x10(0x8)
	};


	// Struct FortniteGame.FortCollectionBookDirectPurchaseData
	// Inherited from FTableRowBase
	// Size: 0x30 (0x38 - 0x8)
	struct FFortCollectionBookDirectPurchaseData : public FTableRowBase	
	{
	public:
		TArray PurchaseCosts; // 0x8(0x10)
		FGameplayTagContainer PurchaseCatalysts; // 0x18(0x20)
	};


	// Struct FortniteGame.FortCollectionBookSlotXPWeightData
	// Inherited from FTableRowBase
	// Size: 0x18 (0x20 - 0x8)
	struct FFortCollectionBookSlotXPWeightData : public FTableRowBase	
	{
	public:
		float ConstantWeight; // 0x8(0x4)
		float RarityWeight; // 0xC(0x4)
		float PremiumTierWeight; // 0x10(0x4)
		float ItemLevelWeight; // 0x14(0x4)
		float ItemRatingWeight; // 0x18(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCollectionBookSectionState
	// Size: 0x18 (0x18 - 0x0)
	struct FFortCollectionBookSectionState	
	{
	public:
		FString Section; // 0x0(0x10)
		EFortCollectionBookState State; // 0x10(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortComponentPropertyProxy
	// Size: 0x1 (0x1 - 0x0)
	struct FFortComponentPropertyProxy	
	{
	public:
		unsigned char UnknownData01_2[0x1]; // 0x0(0x1) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortContainerTableRow
	// Inherited from FTableRowBase
	// Size: 0x8 (0x10 - 0x8)
	struct FFortContainerTableRow : public FTableRowBase	
	{
	public:
		UClass ContainerClass; // 0x8(0x8)
	};


	// Struct FortniteGame.FortTableRow_AFKSettings
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortTableRow_AFKSettings : public FTableRowBase	
	{
	public:
		float TimeToAFKWarn; // 0x8(0x4)
		float TimeToAFKKick; // 0xC(0x4)
		int32_t NumberOfEventsRequiredToResetAFKTimer; // 0x10(0x4)
		bool bIsAFKTimerDisabled; // 0x14(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ObjectiveArray
	// Size: 0x10 (0x10 - 0x0)
	struct FObjectiveArray	
	{
	public:
		TArray Objectives; // 0x0(0x10)
	};


	// Struct FortniteGame.EventCacheID
	// Size: 0x10 (0x10 - 0x0)
	struct FEventCacheID	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.GateRegistry
	// Size: 0x50 (0x50 - 0x0)
	struct FGateRegistry	
	{
	public:
		unsigned char UnknownData01_2[0x50]; // 0x0(0x50) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCosmeticFrontendPawnPreviewSettings
	// Size: 0x58 (0x58 - 0x0)
	struct FFortCosmeticFrontendPawnPreviewSettings	
	{
	public:
		TWeakObjectPtr FrontendAnimClass; // 0x0(0x20)
		FVector PivotOffset; // 0x20(0x18)
		FRotator InitialRotation; // 0x38(0x18)
		float Scale; // 0x50(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CosmeticLoadoutPartyReplState
	// Size: 0x58 (0x58 - 0x0)
	struct FCosmeticLoadoutPartyReplState	
	{
	public:
		FString BackpackPersistentName; // 0x0(0x10)
		FString BannerIconId; // 0x10(0x10)
		FString BannerColorId; // 0x20(0x10)
		int32_t BattlePassLevel; // 0x30(0x4)
		int32_t BattlePassSelfBoostXp; // 0x34(0x4)
		int32_t BattlePassFriendBoostXp; // 0x38(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
		FDisplayManagerVariantData AthenaCharacterVariantInfo; // 0x40(0x18)
	};


	// Struct FortniteGame.DisplayManagerVariantData
	// Size: 0x18 (0x18 - 0x0)
	struct FDisplayManagerVariantData	
	{
	public:
		UAthenaCosmeticItemDefinition CosmeticItemDef; // 0x0(0x8)
		TArray CosmeticVariantChannels; // 0x8(0x10)
	};


	// Struct FortniteGame.BaseVariantDef
	// Size: 0x90 (0x90 - 0x0)
	struct FBaseVariantDef	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		bool bStartUnlocked; // 0x8(0x1)
		bool bIsDefault; // 0x9(0x1)
		bool bHideIfNotOwned; // 0xA(0x1)
		unsigned char UnknownData03_6[0x1]; // 0xB(0x1) UNKNOWN PROPERTY
		FGameplayTag CustomizationVariantTag; // 0xC(0x4)
		FText VariantName; // 0x10(0x10)
		TWeakObjectPtr PreviewImage; // 0x20(0x20)
		FText UnlockRequirements; // 0x40(0x10)
		TWeakObjectPtr UnlockingItemDef; // 0x50(0x20)
		FGameplayTagContainer VariantGameplayTags; // 0x70(0x20)
	};


	// Struct FortniteGame.CosmeticPropertyVariantDef
	// Inherited from FBaseVariantDef
	// Size: 0x50 (0xE0 - 0x90)
	struct FCosmeticPropertyVariantDef : public FBaseVariantDef	
	{
	public:
		TArray CosmeticProperties; // 0x90(0x10)
		FCosmeticMetaTagContainer MetaTags; // 0xA0(0x40)
	};


	// Struct FortniteGame.CosmeticMetaTagContainer
	// Size: 0x40 (0x40 - 0x0)
	struct FCosmeticMetaTagContainer	
	{
	public:
		FGameplayTagContainer MetaTagsToApply; // 0x0(0x20)
		FGameplayTagContainer MetaTagsToRemove; // 0x20(0x20)
	};


	// Struct FortniteGame.FortCosmeticProperty_SwapData
	// Inherited from FCosmeticPropertyBase
	// Size: 0x24 (0x28 - 0x4)
	struct FFortCosmeticProperty_SwapData : public FCosmeticPropertyBase	
	{
	public:
		unsigned char UnknownData01_3[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray Swaps; // 0x8(0x10)
		FGuid SwapId; // 0x18(0x10)
	};


	// Struct FortniteGame.ConcurrentFlowsCosmeticSlotId
	// Size: 0x4 (0x4 - 0x0)
	struct FConcurrentFlowsCosmeticSlotId	
	{
	public:
		unsigned char UnknownData01_2[0x4]; // 0x0(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCharacterCustomizationBudgetProxyStorage
	// Size: 0x10 (0x10 - 0x0)
	struct FFortCharacterCustomizationBudgetProxyStorage	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCharacterCustomizationHandlerStorage
	// Size: 0x10 (0x10 - 0x0)
	struct FFortCharacterCustomizationHandlerStorage	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCharacterCustomizationPassPayload
	// Size: 0x60 (0x60 - 0x0)
	struct FFortCharacterCustomizationPassPayload	
	{
	public:
		unsigned char UnknownData01_2[0x60]; // 0x0(0x60) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCosmeticStatEntry
	// Size: 0x18 (0x18 - 0x0)
	struct FFortCosmeticStatEntry	
	{
	public:
		FString StatName; // 0x0(0x10)
		int32_t StatValue; // 0x10(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCustomizationAssetsToLoadSourceInterface
	// Size: 0x8 (0x8 - 0x0)
	struct FFortCustomizationAssetsToLoadSourceInterface	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCosmeticStep_AwaitLoadRequestPayload
	// Inherited from FFortCustomizationAssetsToLoadSourceInterface
	// Size: 0x38 (0x40 - 0x8)
	struct FFortCosmeticStep_AwaitLoadRequestPayload : public FFortCustomizationAssetsToLoadSourceInterface	
	{
	public:
		unsigned char UnknownData01_1[0x38]; // 0x8(0x38) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CosmeticSlotsSyncPointReflectedContainer
	// Size: 0x10 (0x10 - 0x0)
	struct FCosmeticSlotsSyncPointReflectedContainer	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.VariantUID
	// Size: 0x10 (0x10 - 0x0)
	struct FVariantUID	
	{
	public:
		FGameplayTag ChannelTag; // 0x0(0x4)
		FGameplayTag VariantTag; // 0x4(0x4)
		FPrimaryAssetId TemplateId; // 0x8(0x8)
	};


	// Struct FortniteGame.CreativeBetaPermission
	// Size: 0x30 (0x30 - 0x0)
	struct FCreativeBetaPermission	
	{
	public:
		unsigned char UnknownData01_2[0x30]; // 0x0(0x30) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.CreativeDeviceMeshSettings
	// Size: 0x60 (0x60 - 0x0)
	struct FCreativeDeviceMeshSettings	
	{
	public:
		TWeakObjectPtr Mesh; // 0x0(0x20)
		FVector Scale; // 0x20(0x18)
		FGameplayTag StatTag; // 0x38(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr Material; // 0x40(0x20)
	};


	// Struct FortniteGame.UserOptionDefinitionIconValueEntry
	// Inherited from FTableRowBase
	// Size: 0x70 (0x78 - 0x8)
	struct FUserOptionDefinitionIconValueEntry : public FTableRowBase	
	{
	public:
		FCreativeIconOption Value; // 0x8(0x40)
		FText DisplayName; // 0x48(0x10)
		FGameplayTagContainer GrantedContextTags; // 0x58(0x20)
	};


	// Struct FortniteGame.UserOptionDefinitionMetaData
	// Size: 0x8 (0x8 - 0x0)
	struct FUserOptionDefinitionMetaData	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.UserOptionDefinitionIconMetaData
	// Inherited from FUserOptionDefinitionMetaData
	// Size: 0x58 (0x60 - 0x8)
	struct FUserOptionDefinitionIconMetaData : public FUserOptionDefinitionMetaData	
	{
	public:
		FCreativeIconOption DefaultValue; // 0x8(0x40)
		UDataTable IconsDataTable; // 0x48(0x8)
		TArray ValueEntries; // 0x50(0x10)
	};


	// Struct FortniteGame.FortCreativeIslandUIMetadataTableRow
	// Inherited from FTableRowBase
	// Size: 0xF8 (0x100 - 0x8)
	struct FFortCreativeIslandUIMetadataTableRow : public FTableRowBase	
	{
	public:
		FName CreativeTagID; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FString PortalUrl; // 0x10(0x10)
		FString PortalQrImageUrl; // 0x20(0x10)
		FString PublishUrl; // 0x30(0x10)
		TWeakObjectPtr CollabIcon; // 0x40(0x20)
		TMap CreativeTagLabelOverrides; // 0x60(0x50)
		FText InfoButtonText; // 0xB0(0x10)
		TWeakObjectPtr InfoButtonIcon; // 0xC0(0x20)
		TWeakObjectPtr InfoButtonWidgetClass; // 0xE0(0x20)
	};


	// Struct FortniteGame.CreativeItemMetaData
	// Size: 0x8 (0x8 - 0x0)
	struct FCreativeItemMetaData	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCreativeItemListData
	// Inherited from FTableRowBase
	// Size: 0x30 (0x38 - 0x8)
	struct FFortCreativeItemListData : public FTableRowBase	
	{
	public:
		FName category; // 0x8(0x4)
		FPrimaryAssetId ItemPrimaryAssetId; // 0xC(0x8)
		int32_t Count; // 0x14(0x4)
		float SortPriority; // 0x18(0x4)
		bool bIncluded; // 0x1C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
		FText Label; // 0x20(0x10)
		ECreativeItemListType Type; // 0x30(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCreativeOptionBundleTableRow
	// Inherited from FTableRowBase
	// Size: 0x20 (0x28 - 0x8)
	struct FFortCreativeOptionBundleTableRow : public FTableRowBase	
	{
	public:
		TWeakObjectPtr CreativeOptionBundle; // 0x8(0x20)
	};


	// Struct FortniteGame.PhotoModeData
	// Size: 0x38 (0x38 - 0x0)
	struct FPhotoModeData	
	{
	public:
		FVector Location; // 0x0(0x18)
		FRotator Rotation; // 0x18(0x18)
		bool bIsValid; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.PlaysetBaseContext
	// Size: 0x18 (0x18 - 0x0)
	struct FPlaysetBaseContext	
	{
	public:
		AActor EventOwner; // 0x0(0x8)
		UFortPlaysetItemDefinition Playset; // 0x8(0x8)
		ULevelRecordSpawner LevelRecordSpawner; // 0x10(0x8)
	};


	// Struct FortniteGame.PlaysetPlacedContext
	// Inherited from FPlaysetBaseContext
	// Size: 0x30 (0x48 - 0x18)
	struct FPlaysetPlacedContext : public FPlaysetBaseContext	
	{
	public:
		FVector Location; // 0x18(0x18)
		FRotator Rotation; // 0x30(0x18)
	};


	// Struct FortniteGame.FortSourDropperColorData
	// Size: 0x50 (0x50 - 0x0)
	struct FFortSourDropperColorData	
	{
	public:
		TMap TypeColors; // 0x0(0x50)
	};


	// Struct FortniteGame.CreativeStatOption
	// Size: 0x98 (0x98 - 0x0)
	struct FCreativeStatOption	
	{
	public:
		FStatEventFilter StatEventFilter; // 0x0(0x88)
		FText DisplayName; // 0x88(0x10)
	};


	// Struct FortniteGame.StatEventFilter
	// Size: 0x88 (0x88 - 0x0)
	struct FStatEventFilter	
	{
	public:
		EFortQuestObjectiveStatEvent StatEvent; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TWeakObjectPtr ItemDefinition; // 0x8(0x20)
		FGameplayTagContainer TargetTagsQuery; // 0x28(0x20)
		FGameplayTagContainer SourceTagsQuery; // 0x48(0x20)
		FGameplayTagContainer ContextTagsQuery; // 0x68(0x20)
	};


	// Struct FortniteGame.CreativeVersionMapping
	// Size: 0x8 (0x8 - 0x0)
	struct FCreativeVersionMapping	
	{
	public:
		FGameplayTag tag; // 0x0(0x4)
		int32_t Version; // 0x4(0x4)
	};


	// Struct FortniteGame.SavedCustomMatchOptions
	// Size: 0x50 (0x50 - 0x0)
	struct FSavedCustomMatchOptions	
	{
	public:
		TMap CustomMatchOptions; // 0x0(0x50)
	};


	// Struct FortniteGame.FortDailyRewardsNotification
	// Size: 0x18 (0x18 - 0x0)
	struct FFortDailyRewardsNotification	
	{
	public:
		int32_t DaysLoggedIn; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TArray Items; // 0x8(0x10)
	};


	// Struct FortniteGame.FortDailyLoginRewardStat_ScheduleClaimed
	// Size: 0x8 (0x8 - 0x0)
	struct FFortDailyLoginRewardStat_ScheduleClaimed	
	{
	public:
		int32_t RewardsClaimed; // 0x0(0x4)
		bool ClaimedToday; // 0x4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortDailyLoginRewardStat
	// Size: 0x60 (0x60 - 0x0)
	struct FFortDailyLoginRewardStat	
	{
	public:
		int32_t NextDefaultReward; // 0x0(0x4)
		int32_t TotalDaysLoggedIn; // 0x4(0x4)
		FDateTime LastClaimDate; // 0x8(0x8)
		TMap AdditionalSchedules; // 0x10(0x50)
	};


	// Struct FortniteGame.FortDailyRewardScheduleDisplayData
	// Size: 0x40 (0x40 - 0x0)
	struct FFortDailyRewardScheduleDisplayData	
	{
	public:
		FText Title; // 0x0(0x10)
		FText Description; // 0x10(0x10)
		FText ItemDescription; // 0x20(0x10)
		FText EpicItemDescription; // 0x30(0x10)
	};


	// Struct FortniteGame.FortDailyRewardScheduleDefinition
	// Size: 0x80 (0x80 - 0x0)
	struct FFortDailyRewardScheduleDefinition	
	{
	public:
		FName ScheduleName; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr EnablingToken; // 0x8(0x20)
		UDataTable Rewards; // 0x28(0x8)
		FFortDailyRewardScheduleDisplayData DisplayData; // 0x30(0x40)
		FDateTime BeginDate; // 0x70(0x8)
		FDateTime EndDate; // 0x78(0x8)
	};


	// Struct FortniteGame.FortDayPhaseCallbackHandle
	// Size: 0x10 (0x10 - 0x0)
	struct FFortDayPhaseCallbackHandle	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.ConfirmationDialogAction
	// Size: 0xE0 (0xE0 - 0x0)
	struct FConfirmationDialogAction	
	{
	public:
		FText DisplayName; // 0x0(0x10)
		FName ResultName; // 0x10(0x4)
		unsigned char UnknownData02_6[0xC]; // 0x14(0xC) UNKNOWN PROPERTY
		FSlateBrush Icon; // 0x20(0xB0)
		FName ActionName; // 0xD0(0x4)
		unsigned char UnknownData03_7[0xC]; // 0xD4(0xC) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortDialogDescription_NUI
	// Size: 0x140 (0x140 - 0x0)
	struct FFortDialogDescription_NUI	
	{
	public:
		FSlateBrush Icon; // 0x0(0xB0)
		FText MessageHeader; // 0xB0(0x10)
		FText MessageBody; // 0xC0(0x10)
		TArray ConfirmButtonInputActions; // 0xD0(0x10)
		FName DeclineButtonInputAction; // 0xE0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xE4(0x4) UNKNOWN PROPERTY
		UWidget AdditionalContent; // 0xE8(0x8)
		UWidget LeftAdditionalContent; // 0xF0(0x8)
		float DisplayTime; // 0xF8(0x4)
		bool Dismissable; // 0xFC(0x1)
		bool Cancelable; // 0xFD(0x1)
		bool bCloseOnEsc; // 0xFE(0x1)
		bool bShouldWaitForLatentActionOnConfirmAction; // 0xFF(0x1)
		UFortNotificationHandler NotificationHandler; // 0x100(0x8)
		USoundBase ShowSound; // 0x108(0x8)
		unsigned char UnknownData03_7[0x30]; // 0x110(0x30) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortCreativeOptionDestructiveAction
	// Inherited from FTableRowBase
	// Size: 0x40 (0x48 - 0x8)
	struct FFortCreativeOptionDestructiveAction : public FTableRowBase	
	{
	public:
		ECreativeOptionDestructiveActionOperator CheckedActionOperator; // 0x8(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		FText DialogTitle; // 0x10(0x10)
		FText DialogInfoText; // 0x20(0x10)
		FName ConfirmActionName; // 0x30(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		TArray ButtonInputActions; // 0x38(0x10)
	};


	// Struct FortniteGame.DynamicXpCalibrationResult
	// Size: 0x28 (0x28 - 0x0)
	struct FDynamicXpCalibrationResult	
	{
	public:
		EDynamicXpCalibrationPhase Result; // 0x0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FString Ids; // 0x8(0x10)
		FDateTime ResultExpiresAt; // 0x18(0x8)
		float XpVarianceMult; // 0x20(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.DynamicXpAggregatedAccoladeStats
	// Size: 0x18 (0x18 - 0x0)
	struct FDynamicXpAggregatedAccoladeStats	
	{
	public:
		FString AccoladeId; // 0x0(0x10)
		double TriggersPerMinute; // 0x10(0x8)
	};


	// Struct FortniteGame.AccoladeTriggerPerMinute
	// Size: 0x60 (0x60 - 0x0)
	struct FAccoladeTriggerPerMinute	
	{
	public:
		FString ID; // 0x0(0x10)
		TMap Tpm; // 0x10(0x50)
	};


	// Struct FortniteGame.PublicDynamicXpStats
	// Size: 0x8 (0x8 - 0x0)
	struct FPublicDynamicXpStats	
	{
	public:
		int32_t UniqueGameVersion; // 0x0(0x4)
		EDynamicXpCalibrationPhase CalibrationPhase; // 0x4(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x5(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.AccoladePublishData
	// Size: 0x38 (0x38 - 0x0)
	struct FAccoladePublishData	
	{
	public:
		FString ID; // 0x0(0x10)
		FString Name; // 0x10(0x10)
		FString Description; // 0x20(0x10)
		FGameplayTag Weight; // 0x30(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.DynamicXpAggregatedStats
	// Size: 0x78 (0x78 - 0x0)
	struct FDynamicXpAggregatedStats	
	{
	public:
		FString UniqueGameId; // 0x0(0x10)
		int32_t UniqueGameVersion; // 0x10(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x14(0x4) UNKNOWN PROPERTY
		FDynamicXpCalibrationResult CalibrationResult; // 0x18(0x28)
		TArray LilAccoladeTPM; // 0x40(0x10)
		TArray Accolades; // 0x50(0x10)
		double MeanSessionLengthMinutes; // 0x60(0x8)
		TArray PublishData; // 0x68(0x10)
	};


	// Struct FortniteGame.DynamicXpCreatorAccoladeTuning
	// Size: 0x8 (0x8 - 0x0)
	struct FDynamicXpCreatorAccoladeTuning	
	{
	public:
		float Weight; // 0x0(0x4)
		float MaxWeightPercentage; // 0x4(0x4)
	};


	// Struct FortniteGame.DynamicXpAfkPenalty
	// Size: 0x8 (0x8 - 0x0)
	struct FDynamicXpAfkPenalty	
	{
	public:
		float AfkThresholdSecs; // 0x0(0x4)
		float AfkMinRewardMult; // 0x4(0x4)
	};


	// Struct FortniteGame.DynamicXpCircuitBreaker
	// Size: 0x28 (0x28 - 0x0)
	struct FDynamicXpCircuitBreaker	
	{
	public:
		float TimespanOutlierMult; // 0x0(0x4)
		int32_t TimespanOutlierDuration; // 0x4(0x4)
		float BankXpRemovalMult; // 0x8(0x4)
		float BankXpRemovalTimeIntervalSecs; // 0xC(0x4)
		float ExcessXpThresholdMult; // 0x10(0x4)
		float XpCutoffThresholdMult; // 0x14(0x4)
		float XpCutoffRewardMult; // 0x18(0x4)
		float FrequencyThresholdMult; // 0x1C(0x4)
		float MinXpThresholdMult; // 0x20(0x4)
		float MaxXpBoosterMult; // 0x24(0x4)
	};


	// Struct FortniteGame.DynamicXpQueuedAccolade
	// Size: 0x20 (0x20 - 0x0)
	struct FDynamicXpQueuedAccolade	
	{
	public:
		FGuid DeviceGuid; // 0x0(0x10)
		FString TeamClassGrouping; // 0x10(0x10)
	};


	// Struct FortniteGame.DynamicXpReportPlayerLeaving
	// Size: 0x70 (0x70 - 0x0)
	struct FDynamicXpReportPlayerLeaving	
	{
	public:
		unsigned char UnknownData01_2[0x70]; // 0x0(0x70) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.DynamicXpPlayerSessionTransient
	// Size: 0x138 (0x138 - 0x0)
	struct FDynamicXpPlayerSessionTransient	
	{
	public:
		TArray QueuedAccolade; // 0x0(0x10)
		unsigned char UnknownData04_6[0x50]; // 0x10(0x50) UNKNOWN PROPERTY
		FGuid LastVoteGuid; // 0x60(0x10)
		int32_t TotalXpGained; // 0x70(0x4)
		int32_t TotalXpPotential; // 0x74(0x4)
		float SessionStartTime; // 0x78(0x4)
		float LastTimeUpdate; // 0x7C(0x4)
		float BankXpReductionTimer; // 0x80(0x4)
		bool bInMiddleOfRound; // 0x84(0x1)
		bool bHitXpThreshold; // 0x85(0x1)
		bool bPrevHitXpThreshold; // 0x86(0x1)
		bool bHitExcessXpCutoff; // 0x87(0x1)
		bool bPrevHitExcessXpCutoff; // 0x88(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		int32_t TimeSpanOutliers; // 0x8C(0x4)
		int32_t LastPotentialXp; // 0x90(0x4)
		float LastBoostedXp; // 0x94(0x4)
		bool bReportedTimeSpanOutlier; // 0x98(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x99(0x3) UNKNOWN PROPERTY
		float AfkTime; // 0x9C(0x4)
		float PrevAfkTime; // 0xA0(0x4)
		float TotalAfkTime; // 0xA4(0x4)
		float AfkRewardMult; // 0xA8(0x4)
		int32_t NumTimesAfk; // 0xAC(0x4)
		int32_t NumTimesAfkMax; // 0xB0(0x4)
		int32_t NumTimesBoosted; // 0xB4(0x4)
		bool bWasAfk; // 0xB8(0x1)
		unsigned char UnknownData07_7[0x7F]; // 0xB9(0x7F) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.DynamicXpPlayerSession
	// Inherited from FDynamicXpPlayerSessionTransient
	// Size: 0x60 (0x198 - 0x138)
	struct FDynamicXpPlayerSession : public FDynamicXpPlayerSessionTransient	
	{
	public:
		unsigned char UnknownData02_3[0x30]; // 0x138(0x30) UNKNOWN PROPERTY
		UFortControllerComponent_EndMatchPersistence EndMatchPersistence; // 0x168(0x8)
		unsigned char UnknownData03_7[0x28]; // 0x170(0x28) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortEncounterProfile
	// Size: 0x58 (0x58 - 0x0)
	struct FFortEncounterProfile	
	{
	public:
		TWeakObjectPtr EncounterOptions; // 0x0(0x20)
		TArray OverrideCategories; // 0x20(0x10)
		bool bShouldReselectOptionsPerInstance; // 0x30(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer EncounterTypeTags; // 0x38(0x20)
	};


	// Struct FortniteGame.FortEncounterSequenceSettings
	// Size: 0x38 (0x38 - 0x0)
	struct FFortEncounterSequenceSettings	
	{
	public:
		FFortEncounterTransitionSettings TransitionSettings; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray EncounterSequence; // 0x8(0x10)
		FGameplayTagContainer SequenceTags; // 0x18(0x20)
	};


	// Struct FortniteGame.FortEncounterTransitionSettings
	// Size: 0x1 (0x1 - 0x0)
	struct FFortEncounterTransitionSettings	
	{
	public:
		bool bShouldMaintainEncounterState; // 0x0(0x1)
	};


	// Struct FortniteGame.FortEncounterSettingsFixedPace
	// Size: 0x14 (0x14 - 0x0)
	struct FFortEncounterSettingsFixedPace	
	{
	public:
		float RiftSpawnInterval; // 0x0(0x4)
		int32_t RiftSpawnCount; // 0x4(0x4)
		int32_t AIMaxCount; // 0x8(0x4)
		float SpawnAIIntervalTime; // 0xC(0x4)
		int32_t SpawnAIIntervalCount; // 0x10(0x4)
	};


	// Struct FortniteGame.NavWidgetSettings
	// Size: 0x28 (0x28 - 0x0)
	struct FNavWidgetSettings	
	{
	public:
		bool bDrawNavWidget; // 0x0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float Distance; // 0x4(0x4)
		float Angle; // 0x8(0x4)
		float MinRandomNavAngle; // 0xC(0x4)
		float MaxRandomNavAngle; // 0x10(0x4)
		FGameplayTag WordSetToUse; // 0x14(0x4)
		FText IndicatorTextToUse; // 0x18(0x10)
	};


	// Struct FortniteGame.FortMissionEventName
	// Inherited from FFortEventName
	// Size: 0x0 (0x8 - 0x8)
	struct FFortMissionEventName : public FFortEventName	
	{
	public:
	};


	// Struct FortniteGame.FortEventReactionsTableRow
	// Inherited from FTableRowBase
	// Size: 0x20 (0x28 - 0x8)
	struct FFortEventReactionsTableRow : public FTableRowBase	
	{
	public:
		FInstancedStruct EventConditional; // 0x8(0x10)
		TArray EventReactions; // 0x18(0x10)
	};


	// Struct FortniteGame.RewardEntry
	// Size: 0x8 (0x8 - 0x0)
	struct FRewardEntry	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortRewardEntry
	// Inherited from FRewardEntry
	// Size: 0x0 (0x8 - 0x8)
	struct FFortRewardEntry : public FRewardEntry	
	{
	public:
	};


	// Struct FortniteGame.FortRewardEntry_Augment
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x20 (0x28 - 0x8)
	struct FFortRewardEntry_Augment : public FFortRewardEntry	
	{
	public:
		TWeakObjectPtr AugmentDefinition; // 0x8(0x20)
	};


	// Struct FortniteGame.EventReactionBase
	// Size: 0x8 (0x8 - 0x0)
	struct FEventReactionBase	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.EventReaction_Reward
	// Inherited from FEventReactionBase
	// Size: 0x0 (0x8 - 0x8)
	struct FEventReaction_Reward : public FEventReactionBase	
	{
	public:
	};


	// Struct FortniteGame.FortEventReaction_Reward
	// Inherited from FEventReaction_Reward -> FEventReactionBase
	// Size: 0x0 (0x8 - 0x8)
	struct FFortEventReaction_Reward : public FEventReaction_Reward	
	{
	public:
	};


	// Struct FortniteGame.FortEventReaction_AugmentReward
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_AugmentReward : public FFortEventReaction_Reward	
	{
	public:
		TArray AugmentRewards; // 0x8(0x10)
	};


	// Struct FortniteGame.FortRewardEntry_ChallengeBundle
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x20 (0x28 - 0x8)
	struct FFortRewardEntry_ChallengeBundle : public FFortRewardEntry	
	{
	public:
		TWeakObjectPtr ChallengeBundleDefinition; // 0x8(0x20)
	};


	// Struct FortniteGame.FortEventReaction_ChallengeBundleReward
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_ChallengeBundleReward : public FFortEventReaction_Reward	
	{
	public:
		TArray ChallengeBundleRewards; // 0x8(0x10)
	};


	// Struct FortniteGame.FortRewardEntry_Cosmetic
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x20 (0x28 - 0x8)
	struct FFortRewardEntry_Cosmetic : public FFortRewardEntry	
	{
	public:
		TWeakObjectPtr CosmeticDefinition; // 0x8(0x20)
	};


	// Struct FortniteGame.FortRewardEntry_HiddenCosmetic
	// Inherited from FFortRewardEntry_Cosmetic -> FFortRewardEntry -> FRewardEntry
	// Size: 0x0 (0x28 - 0x28)
	struct FFortRewardEntry_HiddenCosmetic : public FFortRewardEntry_Cosmetic	
	{
	public:
	};


	// Struct FortniteGame.FortEventReaction_CosmeticReward
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_CosmeticReward : public FFortEventReaction_Reward	
	{
	public:
		TArray CosmeticRewards; // 0x8(0x10)
	};


	// Struct FortniteGame.CustomVerbSubjectEntry
	// Size: 0x28 (0x28 - 0x0)
	struct FCustomVerbSubjectEntry	
	{
	public:
		FName Name; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer SubjectTags; // 0x8(0x20)
	};


	// Struct FortniteGame.CustomVerbValueEntry
	// Size: 0x10 (0x10 - 0x0)
	struct FCustomVerbValueEntry	
	{
	public:
		FName Name; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		double Value; // 0x8(0x8)
	};


	// Struct FortniteGame.CustomVerbEntry
	// Size: 0x28 (0x28 - 0x0)
	struct FCustomVerbEntry	
	{
	public:
		FGameplayTag tag; // 0x0(0x4)
		int32_t Amount; // 0x4(0x4)
		TArray Subjects; // 0x8(0x10)
		TArray Values; // 0x18(0x10)
	};


	// Struct FortniteGame.EventReaction_SideEffect
	// Inherited from FEventReactionBase
	// Size: 0x0 (0x8 - 0x8)
	struct FEventReaction_SideEffect : public FEventReactionBase	
	{
	public:
	};


	// Struct FortniteGame.FortEventReaction_SideEffect
	// Inherited from FEventReaction_SideEffect -> FEventReactionBase
	// Size: 0x0 (0x8 - 0x8)
	struct FFortEventReaction_SideEffect : public FEventReaction_SideEffect	
	{
	public:
	};


	// Struct FortniteGame.FortEventReaction_CustomVerbMessage
	// Inherited from FFortEventReaction_SideEffect -> FEventReaction_SideEffect -> FEventReactionBase
	// Size: 0x28 (0x30 - 0x8)
	struct FFortEventReaction_CustomVerbMessage : public FFortEventReaction_SideEffect	
	{
	public:
		FCustomVerbEntry CustomVerb; // 0x8(0x28)
	};


	// Struct FortniteGame.FortEventReaction_CustomWidgetData
	// Size: 0x8 (0x8 - 0x0)
	struct FFortEventReaction_CustomWidgetData	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortEventReaction_SurvivorTierBadgeWidgetData
	// Inherited from FFortEventReaction_CustomWidgetData
	// Size: 0x8 (0x10 - 0x8)
	struct FFortEventReaction_SurvivorTierBadgeWidgetData : public FFortEventReaction_CustomWidgetData	
	{
	public:
		int32_t SurvivorTier; // 0x8(0x4)
		int32_t PrestigeLevel; // 0xC(0x4)
	};


	// Struct FortniteGame.FortEventReaction_CustomWidget
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_CustomWidget : public FFortEventReaction_Reward	
	{
	public:
		TArray WidgetDataArray; // 0x8(0x10)
	};


	// Struct FortniteGame.FortTableRow_Rewards
	// Inherited from FTableRowBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortTableRow_Rewards : public FTableRowBase	
	{
	public:
		TArray RewardsArray; // 0x8(0x10)
	};


	// Struct FortniteGame.FortRewardEntry_DataTableEntry
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x10 (0x18 - 0x8)
	struct FFortRewardEntry_DataTableEntry : public FFortRewardEntry	
	{
	public:
		FDataTableRowHandle TableRowEntry; // 0x8(0x10)
	};


	// Struct FortniteGame.FortEventReaction_DataTableRewards
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_DataTableRewards : public FFortEventReaction_Reward	
	{
	public:
		TArray DataTableEntryRewards; // 0x8(0x10)
	};


	// Struct FortniteGame.FortEventReaction_EngagementEventLevel
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x8 (0x10 - 0x8)
	struct FFortEventReaction_EngagementEventLevel : public FFortEventReaction_Reward	
	{
	public:
		int32_t NumberOfLevelsToGrant; // 0x8(0x4)
		bool bShouldRewardBeHiddenFromPlayers : 1; // 0xC:0(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortRewardEntry_GameplayAbility
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x20 (0x28 - 0x8)
	struct FFortRewardEntry_GameplayAbility : public FFortRewardEntry	
	{
	public:
		TWeakObjectPtr GameplayAbilityToGrant; // 0x8(0x20)
	};


	// Struct FortniteGame.FortEventReaction_GameplayAbilityReward
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_GameplayAbilityReward : public FFortEventReaction_Reward	
	{
	public:
		TArray GA_Rewards; // 0x8(0x10)
	};


	// Struct FortniteGame.RewardEntry_GameplayEffect
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x28 (0x30 - 0x8)
	struct FRewardEntry_GameplayEffect : public FFortRewardEntry	
	{
	public:
		TWeakObjectPtr GameplayEffectToGrant; // 0x8(0x20)
		int32_t EffectLevel; // 0x28(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortEventReaction_GameplayEffectReward
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_GameplayEffectReward : public FFortEventReaction_Reward	
	{
	public:
		TArray GE_Rewards; // 0x8(0x10)
	};


	// Struct FortniteGame.FortRewardEntry_GenericReward
	// Inherited from FFortRewardEntry -> FRewardEntry
	// Size: 0x28 (0x30 - 0x8)
	struct FFortRewardEntry_GenericReward : public FFortRewardEntry	
	{
	public:
		TWeakObjectPtr ItemDefinition; // 0x8(0x20)
		int32_t Count; // 0x28(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
	};


	// Struct FortniteGame.FortEventReaction_GenericReward
	// Inherited from FEventReactionBase
	// Size: 0x10 (0x18 - 0x8)
	struct FFortEventReaction_GenericReward : public FEventReactionBase	
	{
	public:
		TArray Rewards; // 0x8(0x10)
	};


	// Struct FortniteGame.FortEventReaction_GrantWorldQuest
	// Inherited from FFortEventReaction_Reward -> FEventReaction_Reward -> FEventReactionBase
	// Size: 0x20 (0x28 - 0x8)
	struct FFortEventReaction_GrantWorldQuest : public FFortEventReaction_Reward	
	{
	public:
		TWeakObjectPtr QuestDefinition; // 0x8(0x20)
	};


	// Struct FortniteGame.FortEventReaction_PlayAudio
	// Inherited from FFortEventReaction_SideEffect -> FEventReaction_SideEffect -> FEventReactionBase
	// Size: 0x48 (0x50 - 0x8)
	struct FFortEventReaction_PlayAudio : public FFortEventReaction_SideEffect	
	{
	public:
