#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: FortniteUI
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class FortniteUI.AccoladeProductData
	// Inherited from UDataAsset -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UAccoladeProductData : public UDataAsset	
	{
	public:
		TArray TabInfos; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AccoladeProductData");
			return ret;
		}
	};


	// Class FortniteUI.AllSelectSubsystem
	// Inherited from ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class UAllSelectSubsystem : public ULocalPlayerSubsystem	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AllSelectSubsystem");
			return ret;
		}
	};


	// Class FortniteUI.AthenaChallengeComponentWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B8 - 0x2B8)
	class UAthenaChallengeComponentWidget : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaChallengeComponentWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaChallengeListEntryContextInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaChallengeListEntryContextInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaChallengeListEntryContextInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortHUDElementWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x320 - 0x2E0)
	class UFortHUDElementWidget : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData03_3[0x8]; // 0x2E0(0x8) UNKNOWN PROPERTY
		FGameplayTag ElementTag; // 0x2E8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x2EC(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer HUDElementTag; // 0x2F0(0x20)
		ESlateVisibility HiddenVisibility; // 0x310(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x311(0x7) UNKNOWN PROPERTY
		UTutorialHighlight TutorialHighlight; // 0x318(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHUDElementWidget");
			return ret;
		}

		void OnVisibilitySetEvent(ESlateVisibility InVisibility); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF4149C62D8
		void OnPlayerControllerSet_BP(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4149C61F8
		bool HasAnyTags(FGameplayTagContainer& InTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4149C6118
		void HandleOnHUDElementVisibilityChanged(FGameplayTagContainer& HiddenHUDElementTags); // Flags: RequiredAPI|Native|Protected|HasOutParms 0x7FF4149C6038
		void HandleGetHUDElementWidgetsForTags(FGameplayTagContainer& HUDElementTags, TArray& OutWidgets); // Flags: Final|Native|Public|HasOutParms 0x7FF4149C5F58
		void AppendHUDElementTags(FGameplayTagContainer& AdditionalTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149C5E78
	};


	// Class FortniteUI.FortMobileHUDElement
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x350 - 0x320)
	class UFortMobileHUDElement : public UFortHUDElementWidget	
	{
	public:
		FGameplayTag SizePropertyTag; // 0x320(0x4)
		unsigned char UnknownData02_6[0x14]; // 0x324(0x14) UNKNOWN PROPERTY
		UImage Image_Background; // 0x338(0x8)
		int32_t ForcedZOrder; // 0x340(0x4)
		bool bShouldFillParent; // 0x344(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x345(0x3) UNKNOWN PROPERTY
		UScaleBox ScaleBox_HUDWidgetScale; // 0x348(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDElement");
			return ret;
		}

		void OnHUDThemeChanged(EHUDLayoutToolTheme EHUDLayoutToolTheme); // Flags: RequiredAPI|Native|Public 0x7FF4149C63B8
	};


	// Class FortniteUI.BacchusHUDElement
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x370 - 0x350)
	class UBacchusHUDElement : public UFortMobileHUDElement	
	{
	public:
		bool bHideWhenNotUsingTouch; // 0x350(0x1)
		bool bUpdatesWithHUDState; // 0x351(0x1)
		bool bAlwaysShow; // 0x352(0x1)
		EBacchusHUDStateType OnInBuildMode; // 0x353(0x1)
		EBacchusHUDStateType OnInCombatMode; // 0x354(0x1)
		EBacchusHUDStateType OnInEditMode; // 0x355(0x1)
		EBacchusHUDStateType OnInCreativeMode; // 0x356(0x1)
		EBacchusHUDStateType OnInBattleLabMode; // 0x357(0x1)
		EBacchusHUDStateType IsFreeFalling; // 0x358(0x1)
		EBacchusHUDStateType IsGliding; // 0x359(0x1)
		EBacchusHUDStateType CanOpenChute; // 0x35A(0x1)
		EBacchusHUDStateType InLockedBus; // 0x35B(0x1)
		EBacchusHUDStateType InUnlockedBus; // 0x35C(0x1)
		EBacchusHUDStateType OnTargeting; // 0x35D(0x1)
		EBacchusHUDStateType OnUsingScopeTargeting; // 0x35E(0x1)
		EBacchusHUDStateType OnCanTarget; // 0x35F(0x1)
		EBacchusHUDStateType OnCanUseScopeTargeting; // 0x360(0x1)
		EBacchusHUDStateType OnCrouching; // 0x361(0x1)
		EBacchusHUDStateType OnCanUseSecondaryAbility; // 0x362(0x1)
		EBacchusHUDStateType OnDBNO; // 0x363(0x1)
		EBacchusHUDStateType OnCarryingDBNO; // 0x364(0x1)
		EBacchusHUDStateType OnCarryingHeldObject; // 0x365(0x1)
		EBacchusHUDStateType OnImprovedDBNO; // 0x366(0x1)
		EBacchusHUDStateType OnControllingRCPawn; // 0x367(0x1)
		EBacchusHUDStateType OnInVehicle; // 0x368(0x1)
		EBacchusHUDStateType OnDrivingVehicle; // 0x369(0x1)
		EBacchusHUDStateType OnZiplining; // 0x36A(0x1)
		unsigned char UnknownData01_7[0x5]; // 0x36B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusHUDElement");
			return ret;
		}

		void ShowHighlight(bool Show); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6658
		void OnHUDStateUpdate(FFortHUDState& NewState); // Flags: Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 0x7FF4149C6578
		void HandleInputMethodChanged(ECommonInputType CurrentInputType); // Flags: Final|Native|Protected 0x7FF4149C6498
	};


	// Class FortniteUI.AthenaEquippedItemBase
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xC0 (0x430 - 0x370)
	class UAthenaEquippedItemBase : public UBacchusHUDElement	
	{
	public:
		EEquippedWeaponDisplay CurrentMode; // 0x370(0x1)
		unsigned char UnknownData02_6[0xB]; // 0x371(0xB) UNKNOWN PROPERTY
		int32_t AmountConsideredInfinite; // 0x37C(0x4)
		FText DefaultOutOfAmmoText; // 0x380(0x10)
		UCommonVisibilitySwitcher Switcher_Content; // 0x390(0x8)
		UPanelWidget Panel_ResourceContent; // 0x398(0x8)
		UPanelWidget Panel_AmmoContent; // 0x3A0(0x8)
		UPanelWidget Panel_UtilityContent; // 0x3A8(0x8)
		UImage Image_AmmoIcon; // 0x3B0(0x8)
		UImage Image_ResourceIcon; // 0x3B8(0x8)
		UImage Image_UtilitySplit; // 0x3C0(0x8)
		UImage Image_RechargeableIcon; // 0x3C8(0x8)
		UImage Image_UtilityIcon; // 0x3D0(0x8)
		UCommonTextBlock Text_MagazineAmmoCount; // 0x3D8(0x8)
		UCommonTextBlock Text_SurplusAmmoCount; // 0x3E0(0x8)
		UCommonTextBlock Text_ResourceCount; // 0x3E8(0x8)
		UCommonTextBlock Text_SurplusUtilityAmmoCount; // 0x3F0(0x8)
		UCommonTextBlock Text_UtilityAmmoCount; // 0x3F8(0x8)
		UCommonTextBlock Text_OutOfAmmo; // 0x400(0x8)
		UOverlay Overlay_UtilityAmmoIcon; // 0x408(0x8)
		UScaleBox RootScaleBox; // 0x410(0x8)
		ESlateVisibility WeaponEquipVisibility; // 0x418(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x419(0x7) UNKNOWN PROPERTY
		TArray TrackedAttributes; // 0x420(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemBase");
			return ret;
		}

		void HandleWorldItemsChanged(); // Flags: Final|Native|Protected 0x7FF4149C7D18
		void HandleWeaponTargetingChanged(bool bIsTargeting); // Flags: Final|Native|Protected 0x7FF4149C7C38
		void HandleWeaponReloadStarted(float ReloadTime, EFortWeaponReloadType ReloadType); // Flags: Final|Native|Protected 0x7FF4149C7B58
		void HandleWeaponReloadCancelled(); // Flags: Final|Native|Protected 0x7FF4149C7A78
		void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown); // Flags: Final|Native|Protected 0x7FF4149C7998
		void HandleWeaponEquipped(AFortWeapon NewWeapon, AFortWeapon PrevWeapon); // Flags: Final|Native|Protected 0x7FF4149C78B8
		void HandleViewTargetChanged(); // Flags: Final|Native|Protected 0x7FF4149C77D8
		void HandleSecondaryFireReleased(AFortWeapon Weapon); // Flags: Final|Native|Protected 0x7FF4149C76F8
		void HandleSecondaryFirePressed(AFortWeapon Weapon); // Flags: Final|Native|Protected 0x7FF4149C7618
		void HandleLocalAmmoChanged(int32_t LocalCount, int32_t LocalRemaining); // Flags: Final|Native|Protected 0x7FF4149C7538
		void HandleBuildingMaterialChanged(); // Flags: Final|Native|Protected 0x7FF4149C7458
		void BP_HandleWeaponTargetingChanged(bool bIsTargeting); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C7378
		void BP_HandleWeaponReloadStarted(float ReloadTime, EFortWeaponReloadType ReloadType); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C7298
		void BP_HandleWeaponReloadCancelled(AFortWeapon Weapon); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C71B8
		void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C70D8
		void BP_HandleWeaponModeChanged(EEquippedWeaponDisplay Mode); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6FF8
		void BP_HandleWeaponEquipped(AFortWeapon NewWeapon, AFortWeapon PrevWeapon); // Flags: Native|Event|Protected|BlueprintEvent 0x7FF4149C6F18
		void BP_HandleSecondaryFireReleased(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6E38
		void BP_HandleSecondaryFirePressed(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6D58
		void BP_HandleResourceTypeChanged(UFortResourceItemDefinition Item, int32_t ResourceCount); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6C78
		void BP_HandleResourceCountChanged(int32_t ResourceCount); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6B98
		void BP_HandleHideAmmo(bool bHideReserveAmmo, bool bHideMagazineAmmo); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6AB8
		void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C69D8
		void BP_HandleHasAmmoChanged(bool bHasAmmo); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C68F8
		void BP_HandleAmmoCountChanged(int32_t MagazineAmmoCount, int32_t SurplusAmmoCount, int32_t TotalRemaining); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6818
		void BP_HandleAmmoClipAttributeChanged(float Value); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C6738
	};


	// Class FortniteUI.AthenaEquippedItemReticleWidgetBase
	// Inherited from UAthenaEquippedItemBase -> UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x478 - 0x430)
	class UAthenaEquippedItemReticleWidgetBase : public UAthenaEquippedItemBase	
	{
	public:
		int32_t MaximumAmmo; // 0x430(0x4)
		float CurrentAmmoPercentage; // 0x434(0x4)
		float LowAmmoPercentage; // 0x438(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x43C(0x4) UNKNOWN PROPERTY
		UMaterialInstanceDynamic AmmoCounterMaterialInstanceDynamic; // 0x440(0x8)
		UCommonBorder AmmoCounter; // 0x448(0x8)
		AFortWeapon CurrentEquippedWeapon; // 0x450(0x8)
		bool bShouldHideReticleAmmoCounterWhileTargeting; // 0x458(0x1)
		bool bIsHoldingSecondaryFire; // 0x459(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x45A(0x2) UNKNOWN PROPERTY
		float TimeToOutroAnim; // 0x45C(0x4)
		FTimerHandle FadeOutTimerHandle; // 0x460(0x8)
		bool bIsAmmoVisible; // 0x468(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x469(0x7) UNKNOWN PROPERTY
		UWidgetAnimation FadeoutAnimation; // 0x470(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemReticleWidgetBase");
			return ret;
		}

		void OnAmmoCountChanged(int32_t MagazineAmmoCount, int32_t MaximumMagazineAmmoCount, EFortWeaponReloadType ReloadType); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8178
		void FadeAmmoOut(float PlaybackSpeed); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C8098
		void FadeAmmoInOut(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C7FB8
		void FadeAmmoIn(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C7ED8
		void DefaultFadeAmmoOut(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C7DF8
	};


	// Class FortniteUI.AthenaEquippedItemInfoWidget
	// Inherited from UAthenaEquippedItemBase -> UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x178 (0x5A8 - 0x430)
	class UAthenaEquippedItemInfoWidget : public UAthenaEquippedItemBase	
	{
	public:
		unsigned char UnknownData01_1[0x178]; // 0x430(0x178) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemInfoWidget");
			return ret;
		}

		void OnExtensionWidgetAdded(EUIExtensionSlot ExtensionSlot, UUserWidget ExtensionWidget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8258
	};


	// Class FortniteUI.AthenaEquippedItemWidgetBase
	// Inherited from UAthenaEquippedItemInfoWidget -> UAthenaEquippedItemBase -> UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x5E0 - 0x5A8)
	class UAthenaEquippedItemWidgetBase : public UAthenaEquippedItemInfoWidget	
	{
	public:
		unsigned char UnknownData03_3[0x8]; // 0x5A8(0x8) UNKNOWN PROPERTY
		float OutroDelayTime; // 0x5B0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x5B4(0x4) UNKNOWN PROPERTY
		UVerticalBox SwitchPopup; // 0x5B8(0x8)
		UCommonTextBlock SwitchPopupText; // 0x5C0(0x8)
		UFortSimpleWidgetAnimationsPanel SimpleAnimations; // 0x5C8(0x8)
		FName IntroAnimName; // 0x5D0(0x4)
		FName OutroAnimName; // 0x5D4(0x4)
		unsigned char UnknownData05_7[0x8]; // 0x5D8(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemWidgetBase");
			return ret;
		}

		void OnPopUpOnSwitchDone(); // Flags: Final|Native|Private|BlueprintCallable 0x7FF4149C8338
	};


	// Class FortniteUI.AthenaFrontendFlowInterruptInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaFrontendFlowInterruptInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaFrontendFlowInterruptInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaFullScreenMapBrowsingControlsWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x450 - 0x3F8)
	class UAthenaFullScreenMapBrowsingControlsWidget : public UCommonActivatableWidget	
	{
	public:
		UPanelWidget Panel_PanGroup; // 0x3F8(0x8)
		UPanelWidget Panel_ZoomGroup; // 0x400(0x8)
		USizeBox SizeBox_PlaceMarker; // 0x408(0x8)
		UCommonTextBlock Text_PlaceMarker; // 0x410(0x8)
		UCommonActionWidget Action_PlaceMarker; // 0x418(0x8)
		UCommonActionWidget Action_RemoveMarker; // 0x420(0x8)
		USizeBox SizeBox_TeleportToMarker; // 0x428(0x8)
		FText TextPlaceMarker; // 0x430(0x10)
		FText TextRemoveMarker; // 0x440(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaFullScreenMapBrowsingControlsWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaGoalsPageBaseCard
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x300 - 0x2B8)
	class UAthenaGoalsPageBaseCard : public UUserWidget	
	{
	public:
		UAthenaChallengeDateTimeTextBlock DateTimeText_TimeRemaining; // 0x2B8(0x8)
		UPanelWidget Panel_TimeRemaining; // 0x2C0(0x8)
		FText TextExpired; // 0x2C8(0x10)
		unsigned char UnknownData01_7[0x28]; // 0x2D8(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaGoalsPageBaseCard");
			return ret;
		}

		void ShowNewBang(bool bEnabled); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8B18
		void PopulateIsSelectable(bool bCardIsSelectable); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8A38
		void PopulateHeader(FBundleGoalCardDisplayData& GoalCardDisplayData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149C8958
		void PopulateBattlePassRequirement(bool bBattlePassRequired); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8878
		void OnTimerSet(EAthenaChallengeTimerState TimerState); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8798
		bool GetIsSelectable(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149C86B8
		void BP_SetDisabled(bool bDisabled); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C85D8
		void BP_PostSetData(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C84F8
		void BP_OnSelectionChanged(bool bSelected); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8418
	};


	// Class FortniteUI.AthenaGoalsPageGiftCard
	// Inherited from UAthenaGoalsPageBaseCard -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA8 (0x3A8 - 0x300)
	class UAthenaGoalsPageGiftCard : public UAthenaGoalsPageBaseCard	
	{
	public:
		FChallengeBundleGiftCardDisplayData DisplayData; // 0x300(0x98)
		TWeakObjectPtr ChallengeBundle; // 0x398(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x3A0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaGoalsPageGiftCard");
			return ret;
		}

		void Update(); // Flags: Final|Native|Protected 0x7FF4149C9058
		void PopulateRelogin(bool bInFrontend); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x7FF4149C8F78
		void PopulateHasAvailableQuestsForCompletion(int32_t AvailableQuestsAmount); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8E98
		void PopulateAllQuestsAreCompletedButSomeNotClaimed(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C8DB8
		void PopulateAllQuestsAreClaimedBundleIsNotCompleted(FTimespan& TimeRemainingForNextQuest); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x7FF4149C8CD8
		void PopulateAllQuestsAreClaimedBundleIsCompleted(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x7FF4149C8BF8
	};


	// Class FortniteUI.AthenaHUDFeedbackLine
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x3B8 - 0x320)
	class UAthenaHUDFeedbackLine : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x320(0x8) UNKNOWN PROPERTY
		UFortDynamicEntryBox DynamicEntryBox_Keybinds; // 0x328(0x8)
		UCommonRichTextBlock RichText_Feedback; // 0x330(0x8)
		unsigned char UnknownData03_7[0x80]; // 0x338(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDFeedbackLine");
			return ret;
		}

		void OnShowEnabledUpdated(bool bShowEnabled); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C9138
	};


	// Class FortniteUI.AthenaHUDFeedbackLineCooldown
	// Inherited from UAthenaHUDFeedbackLine -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x3C8 - 0x3B8)
	class UAthenaHUDFeedbackLineCooldown : public UAthenaHUDFeedbackLine	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x3B8(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDFeedbackLineCooldown");
			return ret;
		}

		void RegisterAbilityNotify(); // Flags: Final|Native|Private 0x7FF4149C9598
		void OnCooldownUpdated(float CooldownDuration, float CooldownRemaining, float CooldownPercentage); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C94B8
		void OnCooldownTagChanged(FGameplayTag CooldownTag, int32_t Count); // Flags: Final|Native|Private 0x7FF4149C93D8
		void OnCooldownStarted(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C92F8
		void OnCooldownFinished(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149C9218
	};


	// Class FortniteUI.AthenaHUDPickupItemWidgetBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2F8 - 0x2E0)
	class UAthenaHUDPickupItemWidgetBase : public UCommonUserWidget	
	{
	public:
		UAthenaItemDetailsHeaderBase ItemDetailsHeader; // 0x2E0(0x8)
		TWeakObjectPtr Pickup; // 0x2E8(0x8)
		TWeakObjectPtr PickupItem; // 0x2F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDPickupItemWidgetBase");
			return ret;
		}

		void SetPickup(AFortPickup NewPickup); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C9678
	};


	// Class FortniteUI.FortPrimaryContentInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortPrimaryContentInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPrimaryContentInterface");
			return ret;
		}

		FPrimaryContentSetup GetPrimaryContentSetup(); // Flags: Native|Event|Public|BlueprintEvent|Const 0x7FF4149C9758
	};


	// Class FortniteUI.AthenaHUDPrimaryContentInterface
	// Inherited from UFortPrimaryContentInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaHUDPrimaryContentInterface : public UFortPrimaryContentInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDPrimaryContentInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaInventoryGroupBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x350 - 0x2E0)
	class UAthenaInventoryGroupBase : public UCommonUserWidget	
	{
	public:
		TWeakObjectPtr ParentInventoryPanel; // 0x2E0(0x8)
		UFortItemTileView ItemTileView; // 0x2E8(0x8)
		TArray FilteredItemTypes; // 0x2F0(0x10)
		int32_t DefaultNumEntries; // 0x300(0x4)
		EInventoryContentSortType InventoryContentSortType; // 0x304(0x1)
		unsigned char UnknownData01_7[0x4B]; // 0x305(0x4B) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaInventoryGroupBase");
			return ret;
		}
	};


	// Class FortniteUI.AthenaInventoryGroupResources
	// Inherited from UAthenaInventoryGroupBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x390 - 0x350)
	class UAthenaInventoryGroupResources : public UAthenaInventoryGroupBase	
	{
	public:
		FGameplayTagContainer CurrencyItemTags; // 0x350(0x20)
		FGameplayTagContainer IngredientItemTags; // 0x370(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaInventoryGroupResources");
			return ret;
		}
	};


	// Class FortniteUI.FortTabInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortTabInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTabInterface");
			return ret;
		}

		bool OnShouldCreateTab(bool& bOutShouldCreateTab, UObject WorldContextObject); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const 0x7FF4149C9838
	};


	// Class FortniteUI.AthenaInventoryTabInterface
	// Inherited from UFortTabInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaInventoryTabInterface : public UFortTabInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaInventoryTabInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortItemDetailsHostPanel
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x3C0 - 0x2E0)
	class UFortItemDetailsHostPanel : public UCommonUserWidget	
	{
	public:
		FMulticastInlineDelegate OnItemChanged; // 0x2E0(0x10)
		TWeakObjectPtr ItemToDetail; // 0x2F0(0x8)
		unsigned char UnknownData06_6[0x10]; // 0x2F8(0x10) UNKNOWN PROPERTY
		TWeakObjectPtr ItemToCompareWith; // 0x308(0x8)
		unsigned char UnknownData07_6[0x10]; // 0x310(0x10) UNKNOWN PROPERTY
		bool bShouldPreviewUpgradingItem; // 0x320(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x321(0x3) UNKNOWN PROPERTY
		int32_t UpgradeLevelDelta; // 0x324(0x4)
		UScrollBox ScrollBox; // 0x328(0x8)
		UNamedSlot DetailsContainerSlotWidget; // 0x330(0x8)
		UCommonBorder HighRarityBorder; // 0x338(0x8)
		TScriptInterface ItemViewContext; // 0x340(0x10)
		EFortItemInspectionMode CurrentInspectMode; // 0x350(0x1)
		unsigned char UnknownData09_6[0x27]; // 0x351(0x27) UNKNOWN PROPERTY
		int32_t QuantityOverride; // 0x378(0x4)
		unsigned char UnknownData10_6[0x4]; // 0x37C(0x4) UNKNOWN PROPERTY
		UFortTooltipLoadingWrapper ItemToDetailLoadingWrapper; // 0x380(0x8)
		UFortTooltipLoadingWrapper ItemToCompareLoadingWrapper; // 0x388(0x8)
		UCommonLoadGuard ItemToDetailLoadGuard; // 0x390(0x8)
		UCommonLoadGuard ItemToCompareLoadGuard; // 0x398(0x8)
		UCommonBorder Border_Details; // 0x3A0(0x8)
		UImage Image_RechargeableIcon; // 0x3A8(0x8)
		bool bAsyncLoadTooltipData; // 0x3B0(0x1)
		bool bIsUpdatingSuspended; // 0x3B1(0x1)
		unsigned char UnknownData11_7[0xE]; // 0x3B2(0xE) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemDetailsHostPanel");
			return ret;
		}

		void UpdateRechargeIcon(UFortItem ItemToRepresent); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF413FDD2D0
		void ShouldPreviewUpgradingItem(bool Value); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FDD1F0
		void SetUpgradeLevelDelta(int32_t InDelta); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FDD110
		void SetScrollWidget(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413FDD030
		void SetQuantityOverride(int32_t QuantityOverride); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FDCF50
		void SetItemViewContext(TScriptInterface& ItemViewContext); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF413FDCE70
		void SetItemToDetail(UFortItem ItemToDetail); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413FDCD90
		void SetItemToCompareWith(UFortItem ItemToCompareWith); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413FDCCB0
		void SetIsUpdatingSuspended(bool bValue); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FDCBD0
		void SetInspectMode(EFortItemInspectionMode InspectMode); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FDCAF0
		void OnItemChangedDelegate__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FDCA10
		void HandleUpgradeLevelDeltaChangedBP(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDC930
		void HandleShouldPreviewUpgradingItemChangedBP(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDC850
		void HandleQuantityOverrideChanged(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDC770
		void HandleItemToDetailTooltipAssetsLoading(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDC690
		void HandleItemToDetailTooltipAssetsLoaded(); // Flags: Final|Native|Private 0x7FF413FDC5B0
		void HandleItemToDetailChangedBP(); // Flags: Event|Public|BlueprintEvent 0x7FF413FDC4D0
		void HandleItemToCompareTooltipAssetsLoading(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDC3F0
		void HandleItemToCompareTooltipAssetsLoaded(); // Flags: Final|Native|Private 0x7FF413FDC310
		void HandleItemRefundComplete(bool bWasSuccessful, FString ConvertedItemInstanceId, TArray& ItemsQuantities); // Flags: Final|Native|Private|HasOutParms 0x7FF413FDC230
		void HandleItemRarityUpgradeComplete(bool bWasSuccessful, FString ConvertedItemInstanceId, TArray& ItemsQuantities); // Flags: Final|Native|Private|HasOutParms 0x7FF413FDC150
		void HandleItemEvolutionComplete(bool bWasSuccessful, FString ConvertedItemInstanceId, TArray& ItemsQuantities); // Flags: Final|Native|Private|HasOutParms 0x7FF413FDC070
		void HandleInspectModeChanged(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDBF90
		void HandleDifferentItemToDetailSet(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDBEB0
		void HandleDifferentItemToCompareSet(); // Flags: Event|Protected|BlueprintEvent 0x7FF413FDBDD0
	};


	// Class FortniteUI.AthenaItemDetailsHeaderBase
	// Inherited from UFortItemDetailsHostPanel -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x148 (0x508 - 0x3C0)
	class UAthenaItemDetailsHeaderBase : public UFortItemDetailsHostPanel	
	{
	public:
		FFortRarityItemData RarityData; // 0x3C0(0x78)
		int32_t NoAmmoSwitcherIndex; // 0x438(0x4)
		bool bMinimalAmmoTooltip; // 0x43C(0x1)
		bool bShowAmmoHeader; // 0x43D(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x43E(0x2) UNKNOWN PROPERTY
		UMaterialInstanceDynamic RarityBorderMID; // 0x440(0x8)
		UMaterialInstanceDynamic LevelBarMID; // 0x448(0x8)
		UWidgetSwitcher CommonWidgetSwitcher_Stack; // 0x450(0x8)
		UCommonBorder RarityBorder; // 0x458(0x8)
		UHorizontalBox TagListBox; // 0x460(0x8)
		USpacer IconSpacer; // 0x468(0x8)
		UCommonBorder LevelBar; // 0x470(0x8)
		UWidgetSwitcher RatingSwitcher; // 0x478(0x8)
		UFortTierIndicator TierIndicator; // 0x480(0x8)
		UTextBlock SlotsCount; // 0x488(0x8)
		UHorizontalBox TertiaryRow; // 0x490(0x8)
		UFortItemCategoryIndicator CategoryIndicatorTertiary; // 0x498(0x8)
		UTextBlock AmmoLoadedText; // 0x4A0(0x8)
		UItemCostWidgetBase ItemCostWidget; // 0x4A8(0x8)
		UFortLazyImage Image_MinimalIconPreview; // 0x4B0(0x8)
		UTextBlock Text_ItemNameShort; // 0x4B8(0x8)
		UTextBlock Text_ItemNameShort_Amount; // 0x4C0(0x8)
		UHorizontalBox CraftingIngredientBox; // 0x4C8(0x8)
		UItemCostWidgetBase ItemCostWidgetShort; // 0x4D0(0x8)
		UTextBlock Text_WeaponName; // 0x4D8(0x8)
		UImage Image_RarityGlow; // 0x4E0(0x8)
		UTextBlock Text_WeaponRarityValue; // 0x4E8(0x8)
		UHorizontalBox HorizontalBox_Tertiary2; // 0x4F0(0x8)
		UFortItemCategoryIndicator CategoryIndicatorTertiary; // 0x4F8(0x8)
		UTextBlock AmmoLoadedText; // 0x500(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaItemDetailsHeaderBase");
			return ret;
		}

		void UpdateQuantityText(int32_t Count, bool bIsZeroDisplayed); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C9BB8
		void UpdateItemForWidgets(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C9AD8
		UFortWeaponItemDefinition TryGetWeaponItemDefForItem(UFortItem Item); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149C99F8
		void SetItemCost(AActor Actor); // Flags: Event|Public|BlueprintEvent 0x7FF4149C9918
	};


	// Class FortniteUI.AthenaMapLegendEntryIcon
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E8 - 0x2E0)
	class UAthenaMapLegendEntryIcon : public UCommonUserWidget	
	{
	public:
		UFortLazyImage FortLazyImage_LegendIcon; // 0x2E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapLegendEntryIcon");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMapLegendEntryWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2F0 - 0x2E0)
	class UAthenaMapLegendEntryWidget : public UCommonUserWidget	
	{
	public:
		UDynamicEntryBox DynamicEntryBox_LegendIcons; // 0x2E0(0x8)
		UCommonTextBlock Text_EntryName; // 0x2E8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapLegendEntryWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMapLegendWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x418 - 0x3F8)
	class UAthenaMapLegendWidget : public UCommonActivatableWidget	
	{
	public:
		TArray MapLegendEntries; // 0x3F8(0x10)
		UPanelWidget SizeBox_LegendPanel; // 0x408(0x8)
		UDynamicEntryBox EntryBox_LegendEntries; // 0x410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapLegendWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMapScreenContainerTabInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaMapScreenContainerTabInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapScreenContainerTabInterface");
			return ret;
		}

		void OnTabAddedToMapScreenContainer(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CA1D8
		bool OnShouldShowTabOnMapScreenForMinigame(bool& bOutShouldShowTabOnMapScreenForMinigame, AFortMinigame Minigame); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const 0x7FF4149CA0F8
		bool OnShouldDisplayBackActionInActionBar(bool& bOutShouldDisplayBackActionInActionBar); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const 0x7FF4149CA018
		bool OnShouldCreateMapScreenTab(bool& bOutShouldCreateMapScreenTab, UObject WorldContextObject); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const 0x7FF4149C9F38
		bool OnHandleMapBackAction(bool& bOutBackActionHandled); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149C9E58
		bool OnHandleMapActionKey(FKey& InKey, bool bKeyDown, bool& bOutMapActionHandled); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149C9D78
		bool OnBlockMapActionByKey(FKey& InKey, bool& bOutMapActionBlocked); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149C9C98
	};


	// Class FortniteUI.FortUIStateWidgetBase
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x410 - 0x3F8)
	class UFortUIStateWidgetBase : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_3[0x10]; // 0x3F8(0x10) UNKNOWN PROPERTY
		UCommonActivatableWidgetStack WidgetStack_PrimaryContent; // 0x408(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIStateWidgetBase");
			return ret;
		}
	};


	// Class FortniteUI.AthenaHUDBase
	// Inherited from UFortUIStateWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x230 (0x640 - 0x410)
	class UAthenaHUDBase : public UFortUIStateWidgetBase	
	{
	public:
		unsigned char UnknownData02_3[0x30]; // 0x410(0x30) UNKNOWN PROPERTY
		TArray MinigameWidgets; // 0x440(0x10)
		UClass KairosHUDLayerClass; // 0x450(0x8)
		TArray MutatorAddedWidgets; // 0x458(0x10)
		unsigned char UnknownData03_6[0xF0]; // 0x468(0xF0) UNKNOWN PROPERTY
		UAthenaMapScreenContainer MapScreenContainer; // 0x558(0x8)
		UAthenaHUDMenu AthenaHUDMenu; // 0x560(0x8)
		UCommonActivatableWidget TitleBar; // 0x568(0x8)
		TSet RelevantExtensionSlots; // 0x570(0x50)
		TWeakObjectPtr NewEmotePicker; // 0x5C0(0x20)
		TWeakObjectPtr SquadComsPickerClass; // 0x5E0(0x20)
		TWeakObjectPtr WeaponWheelClass; // 0x600(0x20)
		TWeakObjectPtr QuickWeaponClass; // 0x620(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDBase");
			return ret;
		}

		void SetZoneCompleted(bool bValue); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149CB0B8
		void OnHUDScaleChanged(float HUDScale); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CAFD8
		void OnExtensionWidgetRemoved(EUIExtensionSlot ExtensionSlot, UUserWidget Widget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CAEF8
		void OnExtensionWidgetCreated(EUIExtensionSlot ExtensionSlot, UUserWidget Widget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CAE18
		void OnClearUIExtensions(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CAD38
		void HandleUpdateMinigameUIExtensions(AFortMinigame Minigame); // Flags: Final|Native|Protected 0x7FF4149CAC58
		void HandleRecoverFromPostGame(); // Flags: Final|Native|Protected 0x7FF4149CAB78
		void HandlePickerOpenRequest(EFortPickerMode Mode, int32_t InitialOption, bool bIgnoreFirstAccept); // Flags: Final|Native|Protected 0x7FF4149CAA98
		void HandleOnMutatorRemoved(AFortGameplayMutator NewMutator); // Flags: Final|Native|Protected 0x7FF4149CA9B8
		void HandleOnMutatorAdded(AFortGameplayMutator NewMutator); // Flags: Final|Native|Protected 0x7FF4149CA8D8
		void HandleNewPanelFromMutator(UClass PanelClass); // Flags: Final|Native|Protected 0x7FF4149CA7F8
		void HandleMinigamePlayModeChanged(AFortMinigame Minigame, bool bIsInPlayMode); // Flags: Final|Native|Protected 0x7FF4149CA718
		void HandleMinigameHideHUD(bool bLoading); // Flags: Final|Native|Protected 0x7FF4149CA638
		void HandleCursorModeChanging(bool bCursorModeEnabled, FName ActionName); // Flags: Final|Native|Protected 0x7FF4149CA558
		void HandleCursorModeChanged(bool bCursorModeEnabled, FName ActionName, UUserWidget CustomWidget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CA478
		bool GetZoneCompleted(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149CA398
		void BindVolumeEvents(); // Flags: Native|Protected 0x7FF4149CA2B8
	};


	// Class FortniteUI.AthenaMobileHUD
	// Inherited from UAthenaHUDBase -> UFortUIStateWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x660 - 0x640)
	class UAthenaMobileHUD : public UAthenaHUDBase	
	{
	public:
		TArray TournamentUIExtensions; // 0x640(0x10)
		TArray ArenaTournamentUIExtensions; // 0x650(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMobileHUD");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMosaicWidget
	// Inherited from UWidget -> UVisual -> UObject
	// Size: 0xB0 (0x210 - 0x160)
	class UAthenaMosaicWidget : public UWidget	
	{
	public:
		unsigned char UnknownData03_3[0x10]; // 0x160(0x10) UNKNOWN PROPERTY
		UDataTable TilesDataTable; // 0x170(0x8)
		float MosaicScale; // 0x178(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x17C(0x4) UNKNOWN PROPERTY
		UMaterialInterface TilesMaterial; // 0x180(0x8)
		FName MatTileTextureParameterName; // 0x188(0x4)
		FName MatTileDiscoveredParameterName; // 0x18C(0x4)
		unsigned char UnknownData05_6[0x10]; // 0x190(0x10) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnPostUpdateTilesDelegate; // 0x1A0(0x10)
		TArray TilesMaterials; // 0x1B0(0x10)
		TMap CachedQuests; // 0x1C0(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMosaicWidget");
			return ret;
		}

		void OnPostUpdateTiles__DelegateSignature(bool bIsEntirelyCollected); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FBF4C8
	};


	// Class FortniteUI.AthenaMosaicWidgetContainer
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2C0 - 0x2B8)
	class UAthenaMosaicWidgetContainer : public UUserWidget	
	{
	public:
		UAthenaMosaicWidget MosaicWidget; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMosaicWidgetContainer");
			return ret;
		}
	};


	// Class FortniteUI.AthenaNPCCustomMapWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2E0 - 0x2B8)
	class UAthenaNPCCustomMapWidget : public UUserWidget	
	{
	public:
		FGameplayTag NPCTag; // 0x2B8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x2BC(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr NPCIconOverride; // 0x2C0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaNPCCustomMapWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaNPCQuestRewardsPanel
	// Inherited from UAthenaNPCCustomMapWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2E0 - 0x2E0)
	class UAthenaNPCQuestRewardsPanel : public UAthenaNPCCustomMapWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaNPCQuestRewardsPanel");
			return ret;
		}

		void BP_Show(FText& NPCTitle, TWeakObjectPtr& NPCPicture, bool bIsLocked); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CB198
	};


	// Class FortniteUI.AthenaNPCQuestServicesPanel
	// Inherited from UAthenaNPCCustomMapWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E8 - 0x2E0)
	class UAthenaNPCQuestServicesPanel : public UAthenaNPCCustomMapWidget	
	{
	public:
		UCollectionNPCServiceContainer Services; // 0x2E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaNPCQuestServicesPanel");
			return ret;
		}

		void BP_Show(FText& NPCTitle, TWeakObjectPtr& NPCPicture); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CB278
	};


	// Class FortniteUI.AthenaObjectiveTaskEntryBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x2D8 - 0x2B8)
	class UAthenaObjectiveTaskEntryBase : public UUserWidget	
	{
	public:
		UFortRichTextBlockKeybind Text_ObjectiveDescriptionText; // 0x2B8(0x8)
		bool bCompleted; // 0x2C0(0x1)
		unsigned char UnknownData01_6[0xF]; // 0x2C1(0xF) UNKNOWN PROPERTY
		UUserWidget ProgressWidget; // 0x2D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaObjectiveTaskEntryBase");
			return ret;
		}

		void OverridePrimaryColor(bool bShouldOverride, FLinearColor& DesiredColor); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintEvent 0x7FF4149CB7B8
		void OnUpdateOptionalObjectiveProgress(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CB6D8
		void OnObjectiveRewardSetWithNonstandardReward(int32_t RewardQuantity, UTexture2D PreviewTexture); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CB5F8
		void OnObjectiveRewardSet(int32_t RewardQuantity, EFortEarnedSubRewardType RewardType); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CB518
		void OnNewlyCompleted(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CB438
		void OnIsActiveSet(bool bNewIsActive); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CB358
	};


	// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaPlayerInfoBaseWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPlayerInfoBaseWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaPlayerNameInfoBase
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x208 (0x528 - 0x320)
	class UAthenaPlayerNameInfoBase : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData03_3[0x178]; // 0x320(0x178) UNKNOWN PROPERTY
		TWeakObjectPtr WeakPlayerStateAthena; // 0x498(0x8)
		bool bIsLocalPlayer; // 0x4A0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x4A1(0x3) UNKNOWN PROPERTY
		FSlateColor Color_PlayerNameAlive; // 0x4A4(0x14)
		FSlateColor Color_PlayerNameDead; // 0x4B8(0x14)
		FSlateColor Color_PlayerNameDisconnected; // 0x4CC(0x14)
		UImage Image_Marker; // 0x4E0(0x8)
		UImage Image_MarkerMobile; // 0x4E8(0x8)
		UCommonTextBlock CommonTextBlock_PlayerName; // 0x4F0(0x8)
		UCommonTextBlock CommonTextBlock_PlayerNameMobile; // 0x4F8(0x8)
		UAthenaLevelEffects LevelEffects; // 0x500(0x8)
		UAthenaLevelEffects LevelEffectsMobile; // 0x508(0x8)
		UImage Image_PlatformIcon; // 0x510(0x8)
		UFortVoiceChatStatusIconProxyAnim SpeakerWidgetAnim; // 0x518(0x8)
		unsigned char UnknownData05_7[0x8]; // 0x520(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPlayerNameInfoBase");
			return ret;
		}

		void UpdateRankedProgress(FRankedProgressReplicatedData& RankedProgress); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CBDD8
		void SetPlayerState(AFortPlayerStateAthena InPlayerState); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149CBCF8
		void ResetRankedProgress(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CBC18
		void BP_HandleTalkingVisualDisplayChanged(bool bTalkingVisualsActive); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CBB38
		void BP_HandleSeasonLevelUIDisplayChanged(int32_t Level); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CBA58
		void BP_HandlePlaylistExtensionWidgetCreated(UUserWidget Widget, EUIExtensionSlot SlotType); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CB978
		void BP_HandlePlayerNameReplicated(FString PlayerName); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CB898
	};


	// Class FortniteUI.AthenaPOIProgressExtensionWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x178 (0x498 - 0x320)
	class UAthenaPOIProgressExtensionWidget : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData01_1[0x178]; // 0x320(0x178) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPOIProgressExtensionWidget");
			return ret;
		}

		void OnExtensionWidgetRemoved(UUserWidget ExtensionWidget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CBF98
		void OnExtensionWidgetAdded(UUserWidget ExtensionWidget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CBEB8
	};


	// Class FortniteUI.AthenaPostMatchScreenContainerTabInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaPostMatchScreenContainerTabInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPostMatchScreenContainerTabInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaQuestCategoryCompletedTracker
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2E0 - 0x2B8)
	class UAthenaQuestCategoryCompletedTracker : public UUserWidget	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		FText MoreInTimerCompletionText; // 0x2C0(0x10)
		bool bShowCompletionTextUpperCase; // 0x2D0(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x2D1(0x7) UNKNOWN PROPERTY
		UAthenaChallengeDateTimeTextBlock DateTimeText_MoreQuestsLater; // 0x2D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaQuestCategoryCompletedTracker");
			return ret;
		}

		bool GetIsProgressBarEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149CC078
	};


	// Class FortniteUI.AthenaReplayActionFeedRowProxyInstance
	// Inherited from UObject
	// Size: 0x158 (0x180 - 0x28)
	class UAthenaReplayActionFeedRowProxyInstance : public UObject	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FReplayEliminationEventInfo RowData; // 0x30(0x150)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaReplayActionFeedRowProxyInstance");
			return ret;
		}
	};


	// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UAthenaReplayBrowserRowProxyInstance : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaReplayBrowserRowProxyInstance");
			return ret;
		}
	};


	// Class FortniteUI.AthenaSpecialEventEntryIcon
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2D0 - 0x2B8)
	class UAthenaSpecialEventEntryIcon : public UUserWidget	
	{
	public:
		UCommonTextBlock Text_UrgentIcon; // 0x2B8(0x8)
		UImage Image_UrgentIcon; // 0x2C0(0x8)
		UImage Image_AlertBackground; // 0x2C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaSpecialEventEntryIcon");
			return ret;
		}

		bool LoadAndSetIcon(FUrgentQuestData& UrgentQuestData); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable 0x7FF4149CC158
	};


	// Class FortniteUI.BacchusLocalPlayerInfoBase
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x388 - 0x370)
	class UBacchusLocalPlayerInfoBase : public UBacchusHUDElement	
	{
	public:
		UAthenaPlayerNameInfoBase AthenaPlayerNameInfo; // 0x370(0x8)
		UAthenaPlayerViewModel CachedPlayerViewModel; // 0x378(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x380(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusLocalPlayerInfoBase");
			return ret;
		}

		void HandleSquadMemberDisconnected(AFortPlayerStateAthena Player); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CC238
	};


	// Class FortniteUI.BacchusRadialDisplayBase
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x328 - 0x320)
	class UBacchusRadialDisplayBase : public UFortHUDElementWidget	
	{
	public:
		FGameplayTag TrackedCueTag; // 0x320(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x324(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusRadialDisplayBase");
			return ret;
		}

		void OnUpdateRadialCounterEvent_Blueprint(float NewCounterFillPercent); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CC3F8
		void HandleUIGameplayCue(FName CueName, TEnumAsByte EventType, FGameplayCueParameters& Parameters); // Flags: Final|Native|Private|HasOutParms 0x7FF4149CC318
	};


	// Class FortniteUI.BasicInteractionWidgetBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x320 - 0x2E0)
	class UBasicInteractionWidgetBase : public UCommonUserWidget	
	{
	public:
		UCommonRichTextBlock RichText_Description; // 0x2E0(0x8)
		UMultiInteractDisplayWidgetBase MultiInteractDisplayWidget; // 0x2E8(0x8)
		UBorder OuterBorder; // 0x2F0(0x8)
		UHorizontalBox SubTextBox; // 0x2F8(0x8)
		UImage SubDescriptionAlertImage; // 0x300(0x8)
		UCommonRichTextBlock TextSubDescription; // 0x308(0x8)
		FText InitialDescription; // 0x310(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BasicInteractionWidgetBase");
			return ret;
		}

		void UpdateMultiInteractionCount(int32_t NewInteractionCount); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149CC5B8
		void UpdateDescription(FText Description, FLinearColor DescriptionColor, FText SubDescription, FLinearColor SubDescriptionColor, int32_t InteractionCount); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF4149CC4D8
	};


	// Class FortniteUI.BattlePassInputData
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBattlePassInputData : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassInputData");
			return ret;
		}
	};


	// Class FortniteUI.BattlePassEnabledInputData
	// Inherited from UBattlePassInputData -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UBattlePassEnabledInputData : public UBattlePassInputData	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassEnabledInputData");
			return ret;
		}

		void GetData(bool& InIsEnabled); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 0x7FF4149CC698
	};


	// Class FortniteUI.BattlePassBulkBuyInputData
	// Inherited from UBattlePassInputData -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UBattlePassBulkBuyInputData : public UBattlePassInputData	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassBulkBuyInputData");
			return ret;
		}

		void GetData(bool& IsPageCompleted, int32_t& StartingPage, int32_t& EndingPage, int32_t& PurchaseCost); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 0x7FF4149CC778
	};


	// Class FortniteUI.BattlePassSubPageInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBattlePassSubPageInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassSubPageInterface");
			return ret;
		}

		void OnEnterSubPage(); // Flags: Event|Public|BlueprintEvent 0x7FF4149CC858
	};


	// Class FortniteUI.CheckDismissableActivatableWidget
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UCheckDismissableActivatableWidget : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.CheckDismissableActivatableWidget");
			return ret;
		}
	};


	// Class FortniteUI.CreativeContentBrowserTab_CreationCondition
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UCreativeContentBrowserTab_CreationCondition : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.CreativeContentBrowserTab_CreationCondition");
			return ret;
		}
	};


	// Class FortniteUI.DonutChallengeIdleGame
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8C0 (0xBA0 - 0x2E0)
	class UDonutChallengeIdleGame : public UCommonUserWidget	
	{
	public:
		FMulticastInlineDelegate OnNewHighScore; // 0x2E0(0x10)
		FMulticastInlineDelegate OnDistanceScoreChanged; // 0x2F0(0x10)
		FMulticastInlineDelegate OnSpeedScoreChanged; // 0x300(0x10)
		FMulticastInlineDelegate OnStyleScoreChanged; // 0x310(0x10)
		FMulticastInlineDelegate OnEndMatchScore; // 0x320(0x10)
		FMulticastInlineDelegate OnDayNightCycleChanged; // 0x330(0x10)
		unsigned char UnknownData05_6[0x140]; // 0x340(0x140) UNKNOWN PROPERTY
		FLinearColor BoundsColor; // 0x480(0x10)
		float DayNightCycleTime; // 0x490(0x4)
		float PlayerTopSpeed; // 0x494(0x4)
		float BumpyRideSpeedReduction; // 0x498(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x49C(0x4) UNKNOWN PROPERTY
		FVector2D MapSize; // 0x4A0(0x10)
		FVector2D PlayerCollisionOffset; // 0x4B0(0x10)
		FVector2D PlayerCollisionSize; // 0x4C0(0x10)
		float MapScale; // 0x4D0(0x4)
		float MaxNumLevels; // 0x4D4(0x4)
		float ObjectSpawnPlacementRadius; // 0x4D8(0x4)
		int32_t NumOfTreeSpawnAttempts; // 0x4DC(0x4)
		int32_t NumOfRockSpawnAttempts; // 0x4E0(0x4)
		int32_t NumOfBigRockSpawnAttempts; // 0x4E4(0x4)
		int32_t NumOfJumpPadSpawnAttempts; // 0x4E8(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x4EC(0x4) UNKNOWN PROPERTY
		UCurveFloat Curve_BonusSpawn_Trees; // 0x4F0(0x8)
		UCurveFloat Curve_BonusSpawn_SmallBumps; // 0x4F8(0x8)
		UCurveFloat Curve_BonusSpawn_Bumps; // 0x500(0x8)
		UCurveFloat Curve_BonusSpawn_JumpPads; // 0x508(0x8)
		FName Param_Player_Direction; // 0x510(0x4)
		FName Param_Player_FacingLeft; // 0x514(0x4)
		unsigned char UnknownData08_6[0x8]; // 0x518(0x8) UNKNOWN PROPERTY
		FSlateBrush PlayerBrush; // 0x520(0xB0)
		FSlateBrush TreeBrush; // 0x5D0(0xB0)
		FSlateBrush RockBrush; // 0x680(0xB0)
		FSlateBrush BigRockBrush; // 0x730(0xB0)
		FSlateBrush JumpPadBrush; // 0x7E0(0xB0)
		FSlateBrush TorchBrush; // 0x890(0xB0)
		FSlateBrush MonsterBrush; // 0x940(0xB0)
		FSlateBrush ChimiBrush; // 0x9F0(0xB0)
		FSlateBrush ArmBrush; // 0xAA0(0xB0)
		UWidgetAnimation Anim_Jump; // 0xB50(0x8)
		UWidgetAnimation Anim_MediumJump; // 0xB58(0x8)
		UWidgetAnimation Anim_SuperJump; // 0xB60(0x8)
		UWidgetAnimation Anim_BumpyRide; // 0xB68(0x8)
		UImage Image_Player; // 0xB70(0x8)
		UImage Image_MobileInput; // 0xB78(0x8)
		UImage Image_MobileInput_Background; // 0xB80(0x8)
		UCommonButtonLegacy Button_Jump; // 0xB88(0x8)
		UCommonButtonLegacy Button_MobileJump; // 0xB90(0x8)
		unsigned char UnknownData09_7[0x8]; // 0xB98(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.DonutChallengeIdleGame");
			return ret;
		}

		void TryJump(); // Flags: Final|Native|Private 0x7FF4149CD9D8
		void StartGame(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149CD8F8
		void EndSuperJump(); // Flags: Final|Native|Private 0x7FF4149CD818
		void EndJump(); // Flags: Final|Native|Private 0x7FF4149CD738
		void EndBumpyRide(); // Flags: Final|Native|Private 0x7FF4149CD658
		void DebugBPFloat(float InFloat); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD578
		void BPUpdateStyle(int32_t NewStyle); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD498
		void BPUpdateSpeed(int32_t NewSpeed); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD3B8
		void BPUpdateDistance(int32_t NewDistance); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD2D8
		void BPShowHighScore(int32_t inNewHighScore); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD1F8
		void BPOnSpeedUpdated(int32_t NewCurSpeed); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD118
		void BPOnNextLevelReached(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CD038
		void BPOnMonsterNearChanged(bool bIsNearLevelMonster); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCF58
		void BPOnJump(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCE78
		void BPOnGameInitialized(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCD98
		void BPOnFailedJumpPress(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCCB8
		void BPOnFacingDirectionChanged(bool bIsLeftFacing); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCBD8
		void BPOnCrash(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCAF8
		void BPOnCollision(TEnumAsByte ObjectType); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CCA18
		void BPGameOver(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CC938
	};


	// Class FortniteUI.FortActivatablePanel
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x568 - 0x530)
	class UFortActivatablePanel : public UCommonActivatablePanelLegacy	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x530(0x8) UNKNOWN PROPERTY
		bool bIsPushedOnToContentPanelStack; // 0x538(0x1)
		bool bIsAlreadyOnContentPanelStack; // 0x539(0x1)
		EInputPriority InputPriority; // 0x53A(0x1)
		bool bIsClosableByPlayerInput; // 0x53B(0x1)
		FPrimaryContentSetup PrimaryContentSetup; // 0x53C(0x3)
		unsigned char UnknownData03_7[0x29]; // 0x53F(0x29) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivatablePanel");
			return ret;
		}

		void RestoreScrollWidget(UWidget FallbackWidget); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FC6F08
		void RestoreCenterWidget(UWidget FallbackWidget); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FC6E28
		void AsyncPlaySound2D(UObject WorldContextObject, TWeakObjectPtr SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Flags: Final|BlueprintCosmetic|Native|Public|BlueprintCallable 0x7FF413FC6D48
	};


	// Class FortniteUI.DonutIdleGameScreen
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x578 - 0x568)
	class UDonutIdleGameScreen : public UFortActivatablePanel	
	{
	public:
		UWidgetAnimation Anim_Intro; // 0x568(0x8)
		UDonutChallengeIdleGame Widget_GameLayer; // 0x570(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.DonutIdleGameScreen");
			return ret;
		}
	};


	// Class FortniteUI.EndOfMatchQuestEntryWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x320 - 0x2E0)
	class UEndOfMatchQuestEntryWidget : public UCommonUserWidget	
	{
	public:
		FMulticastInlineDelegate OnEndOfMatchQuestIntroFinishedDelegate; // 0x2E0(0x10)
		FMulticastInlineDelegate OnEndOfMatchQuestMoveDownFinishedDelegate; // 0x2F0(0x10)
		float MoveDownDuration; // 0x300(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x304(0x4) UNKNOWN PROPERTY
		UFortNotificationEntry_Quest QuestNotification; // 0x308(0x8)
		unsigned char UnknownData03_7[0x10]; // 0x310(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.EndOfMatchQuestEntryWidget");
			return ret;
		}

		void OnEndOfMatchQuestMoveDownFinished__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FC5168
		void OnEndOfMatchQuestCreateFinished__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FC5088
		void HandleNotificationDisplayed(); // Flags: Final|Native|Private 0x7FF413FC4FA8
		void HandleMoveDownFinished(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF413FC4EC8
	};


	// Class FortniteUI.EndOfMatchQuestEntryWidget_Auto
	// Inherited from UEndOfMatchQuestEntryWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x368 - 0x320)
	class UEndOfMatchQuestEntryWidget_Auto : public UEndOfMatchQuestEntryWidget	
	{
	public:
		FGameplayTagContainer InclusiveFilterTags; // 0x320(0x20)
		FGameplayTagContainer ExclusiveFilterTags; // 0x340(0x20)
		bool bShowFirstQuestFound; // 0x360(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x361(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.EndOfMatchQuestEntryWidget_Auto");
			return ret;
		}

		bool InitializeQuestNotification(UFortQuestItem InQuestData); // Flags: Final|Native|Private|Const 0x7FF4149CDB98
		bool FilterQuest(UFortQuestItem InQuestData); // Flags: Final|Native|Private|Const 0x7FF4149CDAB8
	};


	// Class FortniteUI.EnhancedInputInjectable
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEnhancedInputInjectable : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.EnhancedInputInjectable");
			return ret;
		}
	};


	// Class FortniteUI.FortFireModeStreamingVideo
	// Inherited from UFortBaseStreamingVideo -> UEpicBaseStreamingVideo -> UObject
	// Size: 0x0 (0x1C0 - 0x1C0)
	class UFortFireModeStreamingVideo : public UFortBaseStreamingVideo	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFireModeStreamingVideo");
			return ret;
		}
	};


	// Class FortniteUI.FortActivityBrowserAttributionsModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x468 - 0x3F8)
	class UFortActivityBrowserAttributionsModal : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData02_3[0x10]; // 0x3F8(0x10) UNKNOWN PROPERTY
		UCommonButtonBase Button_Back; // 0x408(0x8)
		UCommonButtonBase Button_CloseTouch; // 0x410(0x8)
		UCommonButtonBase Button_OpenLink; // 0x418(0x8)
		UCommonRichTextBlock RichText_Description; // 0x420(0x8)
		UScrollBox ScrollBox_Details; // 0x428(0x8)
		UCommonTextBlock Text_ActivityName; // 0x430(0x8)
		UCommonRichTextBlock Text_ActivityOrigin; // 0x438(0x8)
		UCommonRichTextBlock Text_LinkCode; // 0x440(0x8)
		float ScrollAmount; // 0x448(0x4)
		unsigned char UnknownData03_7[0x1C]; // 0x44C(0x1C) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityBrowserAttributionsModal");
			return ret;
		}

		void OnCreditsModalInitialized(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CDFF8
		void OnAttributionsModalInitialized(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CDF18
		FText GetLinkCodeTextFormat(FText& LinkCode); // Flags: Native|Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CDE38
		FText GetCreatorTextFormat(FText& CreatorName); // Flags: Native|Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CDD58
		FText GetAttributionsTextFormat(FText& Title, FText& Author, FText& License); // Flags: Native|Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149CDC78
	};


	// Class FortniteUI.FortActivityView
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x448 - 0x3F8)
	class UFortActivityView : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_1[0x50]; // 0x3F8(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityView");
			return ret;
		}

		void BP_OnPartySizeChanged(int32_t PartySize); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE298
		void BP_OnLocalPlayerPromotedToLeader(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE1B8
		void BP_OnLocalPlayerDemoted(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE0D8
	};


	// Class FortniteUI.FortActivityDetailsModalBase
	// Inherited from UFortActivityView -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x130 (0x578 - 0x448)
	class UFortActivityDetailsModalBase : public UFortActivityView	
	{
	public:
		unsigned char UnknownData01_1[0x130]; // 0x448(0x130) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityDetailsModalBase");
			return ret;
		}
	};


	// Class FortniteUI.FortActivityModeSetSelectionModalBase
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x410 - 0x3F8)
	class UFortActivityModeSetSelectionModalBase : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x3F8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityModeSetSelectionModalBase");
			return ret;
		}
	};


	// Class FortniteUI.FortAthenaSurvivorTierBadge
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UFortAthenaSurvivorTierBadge : public UUserWidget	
	{
	public:
		EFortAthenaSurvivorTierBadgeSize BadgeSize; // 0x2B8(0x1)
		unsigned char UnknownData01_7[0xF]; // 0x2B9(0xF) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAthenaSurvivorTierBadge");
			return ret;
		}

		void SetBadgeSize(EFortAthenaSurvivorTierBadgeSize InBadgeSize); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149CE7D8
		void OverrideTierAndPrestigeLevel(int32_t CustomTier, int32_t CustomPrestigeLvl); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149CE6F8
		void HandlePostMatchVisibility(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149CE618
		void BP_OnSurvivorTierStateChanged(int32_t Tier, int32_t PrestigeLevel); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE538
		void BP_OnPresentAnimation(int32_t BeforeTier, int32_t BeforePrestigeLevel, int32_t AfterTier, int32_t AfterPrestigeLevel); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE458
		void BP_OnBadgeSizeChanged(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE378
	};


	// Class FortniteUI.FortAthenaSurvivorTiersQuestRewardsPanel
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B8 - 0x2B8)
	class UFortAthenaSurvivorTiersQuestRewardsPanel : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAthenaSurvivorTiersQuestRewardsPanel");
			return ret;
		}

		void OnSurvivorTierStateChanged(int32_t Prestige, int32_t TierRaw, int32_t TierDisplay); // Flags: Final|Native|Protected 0x7FF4149CE998
		void BP_OnSurvivorTierStateChanged(int32_t PrestigeLevel, int32_t TierRaw, int32_t TierDisplay); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CE8B8
	};


	// Class FortniteUI.FortMobileHUDElementProxy
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x3C8 - 0x350)
	class UFortMobileHUDElementProxy : public UFortMobileHUDElement	
	{
	public:
		FText WidgetName; // 0x350(0x10)
		bool AppendWidgetAndBehaviorNames; // 0x360(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x361(0x3) UNKNOWN PROPERTY
		FLinearColor InBoundsHighlightColor; // 0x364(0x10)
		FLinearColor OutOfBoundsProxyHighlightColor; // 0x374(0x10)
		unsigned char UnknownData03_6[0x34]; // 0x384(0x34) UNKNOWN PROPERTY
		UImage Image_SelectionHighlight; // 0x3B8(0x8)
		UImage Image_OutOfBoundsIndicator; // 0x3C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDElementProxy");
			return ret;
		}
	};


	// Class FortniteUI.FortAutorunLockHUDElementProxy
	// Inherited from UFortMobileHUDElementProxy -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3D0 - 0x3C8)
	class UFortAutorunLockHUDElementProxy : public UFortMobileHUDElementProxy	
	{
	public:
		UOverlay Overlay_AutorunLockZone; // 0x3C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAutorunLockHUDElementProxy");
			return ret;
		}
	};


	// Class FortniteUI.FortAutorunLockZoneButton
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x378 - 0x370)
	class UFortAutorunLockZoneButton : public UBacchusHUDElement	
	{
	public:
		UFortAutorunLockZone AutorunLockZone; // 0x370(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAutorunLockZoneButton");
			return ret;
		}
	};


	// Class FortniteUI.FortBangWrapperContentInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortBangWrapperContentInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortBangWrapperContentInterface");
			return ret;
		}

		void OnStopCallout(); // Flags: Event|Public|BlueprintEvent 0x7FF4149CEC38
		void OnStartCallout(FName TutorialObjectiveName, ETutorialType TutorialType); // Flags: Event|Public|BlueprintEvent 0x7FF4149CEB58
		void OnBangStateChanged(bool bEnabled, int32_t Count); // Flags: Event|Public|BlueprintEvent 0x7FF4149CEA78
	};


	// Class FortniteUI.FortPerUserViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x70 - 0x68)
	class UFortPerUserViewModel : public UMVVMViewModelBase	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x68(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPerUserViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortBatchViewModel
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x88 - 0x70)
	class UFortBatchViewModel : public UFortPerUserViewModel	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x70(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortBatchViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortBladeWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x318 - 0x2E0)
	class UFortBladeWidget : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData01_1[0x38]; // 0x2E0(0x38) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortBladeWidget");
			return ret;
		}

		void OnViewportResized(); // Flags: Event|Protected|BlueprintEvent|Const 0x7FF4149CED18
	};


	// Class FortniteUI.FortCabinEmailManagementWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x350 - 0x2B8)
	class UFortCabinEmailManagementWidget : public UUserWidget	
	{
	public:
		UOverlay Overlay_EmailEntry; // 0x2B8(0x8)
		UCommonTextBlock Text_Warning; // 0x2C0(0x8)
		UCommonTextBlock Text_MainDescription; // 0x2C8(0x8)
		UCommonButtonBase Button_Done; // 0x2D0(0x8)
		UCommonButtonBase Button_Cancel; // 0x2D8(0x8)
		UFortCTAButton Button_ResendEmail; // 0x2E0(0x8)
		UFortCTAButton Button_EditEmail; // 0x2E8(0x8)
		UFortInputField InputField_Email; // 0x2F0(0x8)
		UCommonTextBlock Text_Email; // 0x2F8(0x8)
		unsigned char UnknownData01_7[0x50]; // 0x300(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCabinEmailManagementWidget");
			return ret;
		}

		void OnShowFailureReason(FText& ErrorText); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x7FF4149CF098
		void OnScreenStateChange(ECabinEmailViewState NewState); // Flags: Event|Public|BlueprintEvent 0x7FF4149CEFB8
		void OnChangeEmailEditMode(bool bIsInEditMode); // Flags: Event|Public|BlueprintEvent 0x7FF4149CEED8
		void HandleConfirmEmail(FText& NewText, TEnumAsByte CommitInfo); // Flags: Final|Native|Protected|HasOutParms 0x7FF4149CEDF8
	};


	// Class FortniteUI.FortColorPickerConfiguration
	// Inherited from UDataAsset -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class UFortColorPickerConfiguration : public UDataAsset	
	{
	public:
		bool bNoColorOptionAvailable; // 0x30(0x1)
		EColorPickerType ColorPickerType; // 0x31(0x1)
		bool bInitializeCustomColorFromSelectedSwatch; // 0x32(0x1)
		EColorPickerColorRepresentation CustomColorRepresentation; // 0x33(0x1)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortColorPickerConfiguration");
			return ret;
		}
	};


	// Class FortniteUI.FortCompassWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x150 (0x470 - 0x320)
	class UFortCompassWidget : public UFortHUDElementWidget	
	{
	public:
		UMaterialInstanceDynamic CompassMaterial; // 0x320(0x8)
		UImage Image_Compass; // 0x328(0x8)
		FName CompassMaterialParam; // 0x330(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x334(0x4) UNKNOWN PROPERTY
		FSlateFontInfo HeadingFont; // 0x338(0x58)
		FSlateBrush HeadingIndicatorBrush; // 0x390(0xB0)
		float MarkerVerticalOffset; // 0x440(0x4)
		float CompassPanOffset; // 0x444(0x4)
		unsigned char UnknownData03_7[0x28]; // 0x448(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCompassWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortContentGatingIntroModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x400 - 0x3F8)
	class UFortContentGatingIntroModal : public UCommonActivatableWidget	
	{
	public:
		UCommonButtonBase Button_CloseTouch; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortContentGatingIntroModal");
			return ret;
		}

		void ExitModal(); // Flags: Final|Native|Private|BlueprintCallable 0x7FF4149CF178
	};


	// Class FortniteUI.FortControllerHighlightDiagram
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x458 - 0x3F8)
	class UFortControllerHighlightDiagram : public UCommonActivatableWidget	
	{
	public:
		UWidget CurrentHighlightedElement; // 0x3F8(0x8)
		TMap ControllerHighlights; // 0x400(0x50)
		UCanvasPanel CanvasPanel_Highlights; // 0x450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortControllerHighlightDiagram");
			return ret;
		}
	};


	// Class FortniteUI.FortCountdownTimerVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xA0 - 0x68)
	class UFortCountdownTimerVM : public UMVVMViewModelBase	
	{
	public:
		ECountdownTimerState TimerState; // 0x68(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x69(0x7) UNKNOWN PROPERTY
		FText TimeLeftText; // 0x70(0x10)
		unsigned char UnknownData03_7[0x20]; // 0x80(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCountdownTimerVM");
			return ret;
		}

		void StartTimer(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4149CF4F8
		void SetupViewModel(FDateTime& InFutureTime, FText& InLiveText); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4149CF418
		void ResetTimer(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4149CF338
		void ClearCountdownData(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4149CF258
	};


	// Class FortniteUI.FortCreativeCreateBuildModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x4D8 - 0x3F8)
	class UFortCreativeCreateBuildModal : public UCommonActivatableWidget	
	{
	public:
		UCommonAnimatedSwitcher Switcher_Content; // 0x3F8(0x8)
		UPanelWidget Panel_CreateBuild; // 0x400(0x8)
		UPanelWidget Panel_CreateBuildInProgress; // 0x408(0x8)
		UPanelWidget Panel_CreateBuildSucceeded; // 0x410(0x8)
		UPanelWidget Panel_CreateBuildFailed; // 0x418(0x8)
		UCommonButtonBase Button_PrimaryFunction; // 0x420(0x8)
		UCommonButtonBase Button_CloseTouch; // 0x428(0x8)
		UCommonButtonBase Button_CopyMnemonic; // 0x430(0x8)
		UButton Button_CreatorPortalUrl; // 0x438(0x8)
		UCommonTextBlock Text_CreatorPortalUrl; // 0x440(0x8)
		UCommonTextBlock Text_Mnemonic; // 0x448(0x8)
		UCommonTextBlock Text_CreateBuildError; // 0x450(0x8)
		UFortLazyImage LazyImage_CreatorPortalQrCode; // 0x458(0x8)
		bool bCreateBuildInProgress; // 0x460(0x1)
		bool bClearPersistentData; // 0x461(0x1)
		unsigned char UnknownData02_6[0x6]; // 0x462(0x6) UNKNOWN PROPERTY
		FString CreatedMnemonic; // 0x468(0x10)
		FDataTableRowHandle ClearPersistentDataInputRowHandle; // 0x478(0x10)
		unsigned char UnknownData03_7[0x50]; // 0x488(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreateBuildModal");
			return ret;
		}

		void SetClearPersistentDataInputEnabled(bool bEnabled); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D0058
		void SetClearPersistentData(bool bInClearPersistentData); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149CFF78
		void OnReceivedDoesIslandContainFabricDevices(bool bIslandContainsFabricDevices); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CFE98
		void OnQrCodeImageUpdated(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CFDB8
		void OnMnemonicCopied(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CFCD8
		void OnCreateBuildSucceeded(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CFBF8
		void OnCreateBuildStarted(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CFB18
		void OnCreateBuildFailed(FString ErrorCode); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CFA38
		void OnContentSwitcherTransitioningChanged(bool bIsTransitioning); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CF958
		void OnContentSwitcherActiveWidgetChanged(UWidget ActiveWidget); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CF878
		void OnClearPersistentDataSet(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CF798
		void HandleCreatorPortalUrlButtonClicked(); // Flags: Final|Native|Private 0x7FF4149CF6B8
		void BP_Reset(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149CF5D8
	};


	// Class FortniteUI.FortCreativeCreatorAttributions
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x140 (0x538 - 0x3F8)
	class UFortCreativeCreatorAttributions : public UCommonActivatableWidget	
	{
	public:
		UFortDynamicEntryBox DynamicEntryBox_CreditsContainer; // 0x3F8(0x8)
		FText CreatorTitle; // 0x400(0x10)
		FText AttributionsTitle; // 0x410(0x10)
		UUserWidget AttributionsTitleWidget; // 0x420(0x8)
		FText CreditsTitle; // 0x428(0x10)
		UUserWidget CreditsTitleWidget; // 0x438(0x8)
		FText AttributionsTextFormat; // 0x440(0x10)
		UClass CreditsTeamTitleCardClass; // 0x450(0x8)
		UClass CreditsCreatorAttributionsClass; // 0x458(0x8)
		TWeakObjectPtr CreditsAttributionsModalClass; // 0x460(0x20)
		UFortCreativeCreditsTeamTitleCard Button_CreditsTeamTitleCard; // 0x480(0x8)
		UFortCreativeCreditsAttributions Button_CreditsAttributions; // 0x488(0x8)
		UFortCreativeCreditsAttributions Button_Credits; // 0x490(0x8)
		FMargin SectionTitlePadding; // 0x498(0x10)
		FMargin TitleCardButtonPadding; // 0x4A8(0x10)
		FMargin TeamMemberButtonPadding; // 0x4B8(0x10)
		FMargin AttributionsButtonPadding; // 0x4C8(0x10)
		FMargin CreditsButtonPadding; // 0x4D8(0x10)
		unsigned char UnknownData01_7[0x50]; // 0x4E8(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreatorAttributions");
			return ret;
		}

		void OnTitleCardButtonCreated(); // Flags: Event|Protected|BlueprintEvent|Const 0x7FF4149D04B8
		void OnTeamMemberTitleCardButtonCreated(UFortCreativeCreditsTeamTitleCard TeamMemberButton); // Flags: Event|Protected|BlueprintEvent|Const 0x7FF4149D03D8
		void OnSectionTitleCreated(UFortCreativeCreditsSectionTitle SectionTitle); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D02F8
		void OnCreditsButtonCreated(); // Flags: Event|Protected|BlueprintEvent|Const 0x7FF4149D0218
		void OnAttributionsButtonCreated(); // Flags: Event|Protected|BlueprintEvent|Const 0x7FF4149D0138
	};


	// Class FortniteUI.FortCreativeCreditsAttributions
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x13B0 - 0x1390)
	class UFortCreativeCreditsAttributions : public UCommonButtonBase	
	{
	public:
		UTimelineComponent HoverAnimationTimeline; // 0x1390(0x8)
		UCommonRichTextBlock RichText_CreditsAttributionsShortDescription; // 0x1398(0x8)
		int32_t AttributionsPreviewTextWordLimit; // 0x13A0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x13A4(0x4) UNKNOWN PROPERTY
		UCurveLinearColor HoverAnimationCurve; // 0x13A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreditsAttributions");
			return ret;
		}

		void OnAnimationUpdate(FLinearColor Color); // Flags: Final|Native|Private|HasDefaults|Const 0x7FF4149D0678
		float GetHoverAnimationLength(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D0598
	};


	// Class FortniteUI.FortCreativeCreditsSectionTitle
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E8 - 0x2E0)
	class UFortCreativeCreditsSectionTitle : public UCommonUserWidget	
	{
	public:
		UCommonTextBlock Text_Title; // 0x2E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreditsSectionTitle");
			return ret;
		}

		void SetTitleText(FText& TitleText); // Flags: Final|Native|Public|HasOutParms|Const 0x7FF4149D0758
	};


	// Class FortniteUI.FortCreativeCreditsTeamTitleCard
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x13B0 - 0x1390)
	class UFortCreativeCreditsTeamTitleCard : public UCommonButtonBase	
	{
	public:
		UCommonTextBlock Text_CreatorTitle; // 0x1390(0x8)
		UCommonTextBlock Text_CreatorName; // 0x1398(0x8)
		UCommonTextBlock Text_CreatorDescription; // 0x13A0(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x13A8(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreditsTeamTitleCard");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeIslandInfoViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x88 (0xF0 - 0x68)
	class UFortCreativeIslandInfoViewModel : public UMVVMViewModelBase	
	{
	public:
		FMulticastInlineDelegate OnIslandMetaDataUpdateComplete; // 0x68(0x10)
		FMulticastInlineDelegate OnFailedToUpdateCreativePlotData; // 0x78(0x10)
		TArray IslandIntroduction; // 0x88(0x10)
		EDynamicXpCalibrationPhase XpCalibrationPhase; // 0x98(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x99(0x7) UNKNOWN PROPERTY
		UTexture2DDynamic ThumbnailTexture; // 0xA0(0x8)
		UTexture2D LobbyBackgroundTexture; // 0xA8(0x8)
		FString PublishedCreatorName; // 0xB0(0x10)
		bool bIsUpdatingIslandMetaData; // 0xC0(0x1)
		unsigned char UnknownData03_7[0x2F]; // 0xC1(0x2F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeIslandInfoViewModel");
			return ret;
		}

		void UpdateCreativePlotData(FString NewIslandTitle, TArray& NewIslandIntroductions); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF413FCB598
		void UnbindViewModel(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FCB4B8
		void SetIslandDescriptionTags(TArray& IslandDescriptionTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF413FCB3D8
		void OnIslandMetaDataUpdateComplete__DelegateSignature(FString Error); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FCB2F8
		void OnFailedToUpdateCreativePlotData__DelegateSignature(FCreativeIslandInfo& IslandInfo); // Flags: MulticastDelegate|Public|Delegate|HasOutParms 0x7FF413FCB218
		bool IsPlayerInAnExperienceTheyOwn(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FCB138
		void InitializeViewModel(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FCB058
		void HandleLinkDataQueryComplete(bool bSuccess, FString ErrorMessage, UFortGameActivity LinkData); // Flags: Final|Native|Private 0x7FF413FCAF78
		void HandleIslandMetaDataUpdateComplete(FString Error); // Flags: Final|Native|Private 0x7FF413FCAE98
		void HandleDownloadThumbnailComplete(bool bSuccess, UTexture2DDynamic InThumbnailTexture); // Flags: Final|Native|Private 0x7FF413FCADB8
		FText GetIslandTitle(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FCACD8
		TArray GetIslandDescriptionTags(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FCAB38
		FText GetIslandCode(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FCAA58
	};


	// Class FortniteUI.FortMatchmakingKnobsModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2C8 (0x6C0 - 0x3F8)
	class UFortMatchmakingKnobsModal : public UCommonActivatableWidget	
	{
	public:
		float MobileOptionListEntrySpacing; // 0x3F8(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x3FC(0x4) UNKNOWN PROPERTY
		TArray ScrolledOffWhitelistedPlayers; // 0x400(0x10)
		bool bInitializeDataInNativeConstruct; // 0x410(0x1)
		unsigned char UnknownData07_6[0x27]; // 0x411(0x27) UNKNOWN PROPERTY
		UPlaylistUserOptions OptionsAsset; // 0x438(0x8)
		TArray OptionDataProviders; // 0x440(0x10)
		unsigned char UnknownData08_6[0x20]; // 0x450(0x20) UNKNOWN PROPERTY
		TMap LoadedOptionValues; // 0x470(0x50)
		unsigned char UnknownData09_6[0x48]; // 0x4C0(0x48) UNKNOWN PROPERTY
		UCommonListView OptionsList; // 0x508(0x8)
		UCommonTextBlock TextBlock_TitleText; // 0x510(0x8)
		UCommonTextBlock TextBlock_DescriptionText; // 0x518(0x8)
		UImage Image_DisplayImage; // 0x520(0x8)
		FDataTableRowHandle RestoreDefaultsInputRowHandle; // 0x528(0x10)
		UClass SubcategoryHeaderWidgetClass; // 0x538(0x8)
		bool bBindToOnLoadedOptionsChanged; // 0x540(0x1)
		unsigned char UnknownData10_6[0x7]; // 0x541(0x7) UNKNOWN PROPERTY
		TMap SubcategoryHeaderTagToListItems; // 0x548(0x50)
		unsigned char UnknownData11_7[0x128]; // 0x598(0x128) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingKnobsModal");
			return ret;
		}

		void SetSearchString(FString InSearchString); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D26D8
		void SetOptionCategoryTagFilter(FGameplayTagContainer& InOptionCategoryTagFilter); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D25F8
		void SetListDataSource(TEnumAsByte ListType); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D2518
		void RestoreOptionsToDefault(bool bRestoreAllOptions); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D2438
		void OnSetInGameMode(); // Flags: Event|Public|BlueprintEvent 0x7FF4149D2358
		void OnSelectionUpdated(UFortMatchmakingKnobsSpinnerButton CurrentSelection); // Flags: Event|Public|BlueprintEvent 0x7FF4149D2278
		void OnOptionsFiltered(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D2198
		void OnInitForUserOptionValues(TScriptInterface& UserOptionValues); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149D20B8
		void OnInitForOptionsComponent(UFortActorOptionsComponent OptionsComponent); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D1FD8
		void OnHoveredItemChanged(UObject Item, bool bIsHovered); // Flags: Final|Native|Private 0x7FF4149D1EF8
		bool OnHandleRestoreDefaultsInput(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D1E18
		void OnDataInitialized(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D1D38
		void OnCurrentItemSelectionChanged(UObject Item); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D1C58
		void OnAcceptAnimationComplete(bool bApplyAllOptions); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D1B78
		void InitializeData(); // Flags: Native|Public|BlueprintCallable 0x7FF4149D1A98
		void InitForToyOptionsActor(AActor InActor); // Flags: Native|Public|BlueprintCallable 0x7FF4149D19B8
		bool HasNonEventProperties(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D18D8
		bool HasMatchingTags(UObject Option, FGameplayTagContainer& CategoryTags, FGameplayTagContainer& ContextTags); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable 0x7FF4149D17F8
		bool HasEventFunctionProperty(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D1718
		bool HasEventDescriptorProperty(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D1638
		void HandleRestorePropertiesClicked(); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D1558
		void HandleRestoreFunctionsClicked(); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D1478
		void HandleRestoreEventsClicked(); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D1398
		void HandleLeaveIsland(AFortPlayerPawn PlayerPawn); // Flags: Final|Native|Private 0x7FF4149D12B8
		void HandleForcedOffIsland(); // Flags: Final|Native|Private 0x7FF4149D11D8
		void HandleCancelClicked(); // Flags: Native|Event|Public|BlueprintEvent 0x7FF4149D10F8
		EFortModifiedStatus GetSpinnerModificationStatus(UFortMatchmakingKnobsSpinnerButton SpinnerButton); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D1018
		void GetSearchStringFilteredOptionCategoryTags(FGameplayTagContainer& OutSearchStringFilteredOptionCategoryTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D0F38
		FString GetSearchString(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D0E58
		TArray GetScrolledOffWhitelistedPlayers(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D0D78
		EFortModifiedStatus GetModificationStatus(UObject Option); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D0C98
		bool DoesContainString(UObject Option, FString String); // Flags: Final|Native|Static|Protected|BlueprintCallable 0x7FF4149D0BB8
		TScriptInterface BP_GetUserOptionValuesInterface(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D0AD8
		UFortActorOptionsComponent BP_GetOptionsComponent(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D09F8
		TScriptInterface BP_GetLabelOverrideInterface(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D0918
		void ApplyChanges(bool bApplySettingsFromCachedData, bool bApplyAllOptions); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D0838
	};


	// Class FortniteUI.FortCreativeMyIslandContentDebugPanel
	// Inherited from UFortMatchmakingKnobsModal -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x6D8 - 0x6C0)
	class UFortCreativeMyIslandContentDebugPanel : public UFortMatchmakingKnobsModal	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x6C0(0x8) UNKNOWN PROPERTY
		TArray OwnerPermissionAllowList; // 0x6C8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandContentDebugPanel");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeMyIslandContentKnobsPanel
	// Inherited from UFortMatchmakingKnobsModal -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x6C8 - 0x6C0)
	class UFortCreativeMyIslandContentKnobsPanel : public UFortMatchmakingKnobsModal	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x6C0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandContentKnobsPanel");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeMyIslandContentPanelInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortCreativeMyIslandContentPanelInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandContentPanelInterface");
			return ret;
		}

		void BP_ShouldShowPanel(bool& bOutShouldShowPanel, EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const 0x7FF4149D27B8
	};


	// Class FortniteUI.FortCreativeSettingsFlow
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1D8 (0x5D0 - 0x3F8)
	class UFortCreativeSettingsFlow : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData03_3[0x8]; // 0x3F8(0x8) UNKNOWN PROPERTY
		UWidgetSwitcher Switcher_EditorConnected; // 0x400(0x8)
		FName TabNameID; // 0x408(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x40C(0x4) UNKNOWN PROPERTY
		FFortTabButtonLabelInfo TabButtonLabelInfo; // 0x410(0xF0)
		FDataTableRowHandle ChannelBrowserInputRowHandle; // 0x500(0x10)
		TWeakObjectPtr SoftChannelBrowserClass; // 0x510(0x20)
		FDataTableRowHandle DeviceBrowserInputRowHandle; // 0x530(0x10)
		TWeakObjectPtr SoftDeviceBrowserClass; // 0x540(0x20)
		unsigned char UnknownData05_7[0x70]; // 0x560(0x70) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeSettingsFlow");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeMyIslandPanel
	// Inherited from UFortCreativeSettingsFlow -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x6B0 - 0x5D0)
	class UFortCreativeMyIslandPanel : public UFortCreativeSettingsFlow	
	{
	public:
		unsigned char UnknownData03_3[0x20]; // 0x5D0(0x20) UNKNOWN PROPERTY
		UFortTabListWidgetBase TabList_MainContent; // 0x5F0(0x8)
		UCommonAnimatedSwitcher Switcher_MainContent; // 0x5F8(0x8)
		FAthenaMapScreenContainerTabInfo MapScreenContainerTabInfo; // 0x600(0x40)
		bool bLinkTabListToSwitcher; // 0x640(0x1)
		bool bBindToMinigame; // 0x641(0x1)
		bool bIsDefaultMyIslandInfo; // 0x642(0x1)
		bool bIsOverriddenMyIslandInfo; // 0x643(0x1)
		unsigned char UnknownData04_6[0x4]; // 0x644(0x4) UNKNOWN PROPERTY
		FDataTableRowHandle StartEndMinigameInputRowHandle; // 0x648(0x10)
		FText StartMinigameText; // 0x658(0x10)
		FText EndMinigameText; // 0x668(0x10)
		TArray BlockedTabNames; // 0x678(0x10)
		unsigned char UnknownData05_7[0x28]; // 0x688(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandPanel");
			return ret;
		}

		void UpdateStartEndMinigameInput(AFortMinigame Minigame); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D34D8
		void UpdateBackButtonText(FText NewText); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D33F8
		void ShouldShowTab(bool& bOutShouldShowTab, FName TabID, EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149D3318
		void OnTabVisibilitiesUpdated(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D3238
		void OnStartEndMinigameInput(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D3158
		void OnMinigameStateChanged(EFortMinigameState MinigameState); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D3078
		void OnMinigameSettingsChanged(AFortMinigameSettingsBuilding MinigameSettings); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D2F98
		void OnActiveMainContentWidgetChanged(UWidget ActiveWidget, int32_t ActiveWidgetIndex); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D2EB8
		bool IsUpdatingTabVisibilities(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D2DD8
		bool IsOwnerOfCurrentExperience(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D2CF8
		void HandleMinigameStateChanged(AFortMinigame Minigame, EFortMinigameState MinigameState); // Flags: Final|Native|Private 0x7FF4149D2C18
		void HandleMinigameSettingsMachineChanged(UFortMinigameVolumeComponent MinigameVolumeComponent, AFortMinigameSettingsBuilding MinigameSettings); // Flags: Final|Native|Private 0x7FF4149D2B38
		void HandleCreativePermissionsChanged(); // Flags: Final|Native|Private 0x7FF4149D2A58
		UFortMinigameVolumeComponent GetMinigameVolumeComponent(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D2978
		AFortMinigameSettingsBuilding GetMinigameSettingsMachine(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149D2898
	};


	// Class FortniteUI.FortCreativePropertyCategoryTagToTextMap
	// Inherited from UDataAsset -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UFortCreativePropertyCategoryTagToTextMap : public UDataAsset	
	{
	public:
		TMap CategoryTagToTextMap; // 0x30(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativePropertyCategoryTagToTextMap");
			return ret;
		}

		FText GetDisplayName(FGameplayTag& CategoryTag); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4149D35B8
	};


	// Class FortniteUI.FortCreativePropertySubcategoryHeaderListItem
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UFortCreativePropertySubcategoryHeaderListItem : public UObject	
	{
	public:
		FMulticastInlineDelegate OnIsExpandedChangedDynamicDelegate; // 0x28(0x10)
		TArray Options; // 0x38(0x10)
		unsigned char UnknownData01_7[0x20]; // 0x48(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativePropertySubcategoryHeaderListItem");
			return ret;
		}

		void SetIsExpanded(bool bInIsExpanded); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FD0F28
		void OnIsExpandedChangedDynamic__DelegateSignature(bool bIsExpanded); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FD0E48
		bool IsExpanded(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FD0D68
		FGameplayTag GetSubcategoryTag(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FD0C88
	};


	// Class FortniteUI.FortCreativeScoreboardPanel
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x548 - 0x530)
	class UFortCreativeScoreboardPanel : public UCommonActivatablePanelLegacy	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x530(0x8) UNKNOWN PROPERTY
		FDataTableRowHandle MainMenuInputRowHandle; // 0x538(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeScoreboardPanel");
			return ret;
		}

		void KickOffMatchmaking(FOnlineLinkId IslandToMatchmakeTo); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D3698
	};


	// Class FortniteUI.FortCreativeTimerContainerWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x80 (0x3A0 - 0x320)
	class UFortCreativeTimerContainerWidget : public UFortHUDElementWidget	
	{
	public:
		UClass TimerViewModelClass; // 0x320(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x328(0x10) UNKNOWN PROPERTY
		UClass TimerWidgetDefaultClass; // 0x338(0x8)
		TMap InterfaceViewModelMap; // 0x340(0x50)
		TScriptInterface ActiveInterface; // 0x390(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeTimerContainerWidget");
			return ret;
		}

		void OnTimerWidgetCreated(UUserWidget Widget); // Flags: Event|Public|BlueprintEvent 0x7FF4149D3938
		void HandleTimerWidgetActorUpdated(AActor TimerWidgetActor); // Flags: Final|Native|Private 0x7FF4149D3858
		void HandlePlayerEnterVolume(APlayerState PlayerState, AFortVolume FortVolume); // Flags: Final|Native|Private 0x7FF4149D3778
	};


	// Class FortniteUI.FortCreativeTimerViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x50 (0xB8 - 0x68)
	class UFortCreativeTimerViewModel : public UMVVMViewModelBase	
	{
	public:
		FName DefaultTextStyle; // 0x68(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		FText DisplayText; // 0x70(0x10)
		FText DisplayRichText; // 0x80(0x10)
		FText LabelText; // 0x90(0x10)
		FText TimeText; // 0xA0(0x10)
		int32_t RemainingSeconds; // 0xB0(0x4)
		int32_t TotalSeconds; // 0xB4(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeTimerViewModel");
			return ret;
		}

		bool IsTextStyleValid(FName& TextStyle); // Flags: Native|Event|Public|HasOutParms|BlueprintEvent 0x7FF4149D3A18
	};


	// Class FortniteUI.FortDiscoverSurfaceViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x68 (0xD0 - 0x68)
	class UFortDiscoverSurfaceViewModel : public UMVVMViewModelBase	
	{
	public:
		bool bQueryingPageInProgress; // 0x68(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x69(0x7) UNKNOWN PROPERTY
		TArray Providers; // 0x70(0x10)
		FName SurfaceName; // 0x80(0x4)
		unsigned char UnknownData03_7[0x4C]; // 0x84(0x4C) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverSurfaceViewModel");
			return ret;
		}

		void UpdateCachedSurfaceData(bool bShouldForceUpdate); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D42D8
		void StopVisibleImpressions(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D41F8
		void StartVisibleImpressions(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4118
		void StartAnalyticsImpressions(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4038
		bool ShouldQueryOnConstruct(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4149D3F58
		void SendSubviewEvent(UWidget Widget, FString Label, FString Value); // Flags: Final|Native|Public|BlueprintCallable|Const 0x7FF4149D3E78
		int32_t GetProviderIndexFromPanelName(FName PanelName); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D3D98
		void FireExitedImpressionsFromSurface(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4149D3CB8
		void FetchNextPageFromPanelName(int32_t SelectionIndex, FName PanelName); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D3BD8
		void FetchNextPageFromIndex(int32_t SelectionIndex, int32_t ProviderIndex); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D3AF8
	};


	// Class FortniteUI.FortDiscoverBrowseViewModel
	// Inherited from UFortDiscoverSurfaceViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x40 (0x110 - 0xD0)
	class UFortDiscoverBrowseViewModel : public UFortDiscoverSurfaceViewModel	
	{
	public:
		TArray FeaturedCategories; // 0xD0(0x10)
		TArray AllCategories; // 0xE0(0x10)
		FText FeaturedCategoriesPanelDisplayName; // 0xF0(0x10)
		FText AllCategoriesPanelDisplayName; // 0x100(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverBrowseViewModel");
			return ret;
		}

		void SetDataFromProviders(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4578
		UFortDiscoverProviderViewModel GetFeaturedCategoriesProviderViewModel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D4498
		UFortDiscoverProviderViewModel GetAllCategoriesProviderViewModel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D43B8
	};


	// Class FortniteUI.FortDiscoverItemSelectorBase
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortDiscoverItemSelectorBase : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverItemSelectorBase");
			return ret;
		}

		UClass GetTileItemClass(UFortDiscoverTileItemVM InTileItemViewModel); // Flags: RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x7FF4149D4738
		UClass GetRowItemClass(UFortGameActivityProvider InCategory); // Flags: RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x7FF4149D4658
	};


	// Class FortniteUI.FortDiscoverSearchViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x148 (0x1B0 - 0x68)
	class UFortDiscoverSearchViewModel : public UMVVMViewModelBase	
	{
	public:
		FString SearchTerm; // 0x68(0x10)
		bool bIsSearchInProgress; // 0x78(0x1)
		bool bIsCreatorSearchInProgress; // 0x79(0x1)
		bool bIsLinkCodeSearch; // 0x7A(0x1)
		unsigned char UnknownData02_6[0x5]; // 0x7B(0x5) UNKNOWN PROPERTY
		FString ResultsTerm; // 0x80(0x10)
		TArray SearchResults; // 0x90(0x10)
		EDiscoverSearchMode SearchMode; // 0xA0(0x1)
		bool bWasLastCreatorQueryResultSuccessful; // 0xA1(0x1)
		ELinkEntryQueryResult LastLinkEntryQueryResult; // 0xA2(0x1)
		unsigned char UnknownData03_7[0x10D]; // 0xA3(0x10D) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverSearchViewModel");
			return ret;
		}

		void StopAnalyticsVisibilityImpressions(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4FF8
		void StartAnalyticsVisibilityImpressions(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4F18
		void StartAnalyticsSession(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4E38
		void StartAnalyticsImpressions(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4D58
		bool IsAnySearchActiveOrInProgress(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D4C78
		int32_t GetIslandResultCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D4B98
		int32_t GetCreatorResultCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D4AB8
		void FireAnalyticsForBrowseAndSearch(UFortDiscoverBrowseViewModel BrowseViewModel); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D49D8
		void ClearSearch(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D48F8
		void ActionSearch(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D4818
	};


	// Class FortniteUI.FortDiscoverTileItemVM
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x70 (0xE0 - 0x70)
	class UFortDiscoverTileItemVM : public UFortPerUserViewModel	
	{
	public:
		unsigned char UnknownData03_3[0x60]; // 0x70(0x60) UNKNOWN PROPERTY
		char ItemType; // 0xD0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		int32_t ColumnSize; // 0xD4(0x4)
		bool bDisplayAsSquareTile; // 0xD8(0x1)
		unsigned char UnknownData05_7[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverTileItemVM");
			return ret;
		}

		void StopVisibilityImpression(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE83E0
		void StopActiveImpression(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE8300
		void StartVisibilityImpression(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE8220
		void StartActiveImpression(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE8140
		void ResetAnalytics(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE8060
	};


	// Class FortniteUI.FortDynamicMotdFullscreenTile
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x408 - 0x3F8)
	class UFortDynamicMotdFullscreenTile : public UCommonActivatableWidget	
	{
	public:
		UMotdViewModel Motd; // 0x3F8(0x8)
		UFortDynamicMotdMediaPlayer MediaPlayer; // 0x400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdFullscreenTile");
			return ret;
		}

		void SetMotd(UMotdViewModel InMotd); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D5298
		void OnVideoBackgroundsAllowedChanged(bool bAllowVideoBackgrounds); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D51B8
		void OnButtonPressed(UMotdActionBase Action, EMotdButtonStyle Style); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D50D8
	};


	// Class FortniteUI.FortDynamicMotdFullscreenWidget
	// Inherited from UMotdWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x420 - 0x410)
	class UFortDynamicMotdFullscreenWidget : public UMotdWidgetBase	
	{
	public:
		UAthenaScrollBox ScrollBox; // 0x410(0x8)
		UMotdViewModel CurrentMotd; // 0x418(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdFullscreenWidget");
			return ret;
		}

		void SwipeRight(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D5B58
		void SwipeLeft(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D5A78
		bool ShouldUseVerticalTextLayout(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D5998
		void SetSlideIndex(int32_t Index); // Flags: Event|Public|BlueprintEvent 0x7FF4149D58B8
		void SetCurrentMotd(int32_t Index); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D57D8
		void SendManualVideoControlEvent(bool bEnableSecondary); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D56F8
		void OnScrollInput(float ScrollDirection); // Flags: Final|Native|Protected 0x7FF4149D5618
		void OnMotdShown(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D5538
		void OnButtonPressed(EButtonAction ButtonPressed); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D5458
		void HandleInputMethodChanged(ECommonInputType NewInputType); // Flags: Final|Native|Protected 0x7FF4149D5378
	};


	// Class FortniteUI.FortDynamicMotdMediaPlayer
	// Inherited from UObject
	// Size: 0xD0 (0xF8 - 0x28)
	class UFortDynamicMotdMediaPlayer : public UObject	
	{
	public:
		FMulticastInlineDelegate Loaded; // 0x28(0x10)
		FMulticastInlineDelegate Playing; // 0x38(0x10)
		FMulticastInlineDelegate Closed; // 0x48(0x10)
		FMulticastInlineDelegate Ended; // 0x58(0x10)
		FMulticastInlineDelegate TerminalErrorEvent; // 0x68(0x10)
		unsigned char UnknownData02_6[0x8]; // 0x78(0x8) UNKNOWN PROPERTY
		UFortBaseStreamingVideo BasePlayer; // 0x80(0x8)
		UMediaTexture MediaTexture; // 0x88(0x8)
		unsigned char UnknownData03_7[0x68]; // 0x90(0x68) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdMediaPlayer");
			return ret;
		}

		void VideoOnTerminalError(EBaseMediaTerminalErrorReason Reason); // Flags: Final|Native|Private 0x7FF4149D64F8
		void VideoOnStarted(); // Flags: Final|Native|Private 0x7FF4149D6418
		void VideoOnSeeked(); // Flags: Final|Native|Private 0x7FF4149D6338
		void VideoOnOpened(); // Flags: Final|Native|Private 0x7FF4149D6258
		void VideoOnEnded(); // Flags: Final|Native|Private 0x7FF4149D6178
		void VideoOnClosed(); // Flags: Final|Native|Private 0x7FF4149D6098
		void Stop(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D5FB8
		void Start(FMotdVideo& MotdVideo, UMediaTexture InMediaTexture, int32_t InMaxYResolution, bool bDisableCDNFailover, bool bManualLoop, int32_t InLoopOverride); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D5ED8
		void SetPriority(bool bInPriority, bool bInSkipClosedControlBroadcast); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D5DF8
		void Play(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D5D18
		void MetadataSuccess(); // Flags: Final|Native|Private 0x7FF4149D5C38
	};


	// Class FortniteUI.DynamicMotdVideoPlayerState
	// Inherited from UObject
	// Size: 0xF8 (0x120 - 0x28)
	class UDynamicMotdVideoPlayerState : public UObject	
	{
	public:
		FMulticastInlineDelegate PlayingEvent; // 0x28(0x10)
		FMulticastInlineDelegate TerminalEvent; // 0x38(0x10)
		FMulticastInlineDelegate EndedEvent; // 0x48(0x10)
		UFortDynamicMotdMediaPlayer MediaPlayer; // 0x58(0x8)
		FString Name; // 0x60(0x10)
		bool bPreloaded; // 0x70(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x71(0x3) UNKNOWN PROPERTY
		FName TextureParam; // 0x74(0x4)
		bool bPlayImmediately; // 0x78(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		UMediaTexture MediaTexture; // 0x80(0x8)
		unsigned char UnknownData06_6[0x88]; // 0x88(0x88) UNKNOWN PROPERTY
		UGameInstance GameInstance; // 0x110(0x8)
		unsigned char UnknownData07_7[0x8]; // 0x118(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.DynamicMotdVideoPlayerState");
			return ret;
		}

		void TerminalError(EBaseMediaTerminalErrorReason Reason); // Flags: Final|Native|Public 0x7FF4149D6BF8
		void Playing(); // Flags: Final|Native|Public 0x7FF4149D6B18
		void Loaded(); // Flags: Final|Native|Public 0x7FF4149D6A38
		bool IsValid(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D6958
		bool IsFree(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D6878
		void Free(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D6798
		void Ended(); // Flags: Final|Native|Public 0x7FF4149D66B8
		void Closed(); // Flags: Final|Native|Public 0x7FF4149D65D8
	};


	// Class FortniteUI.FortDynamicMotdTeaserWidget
	// Inherited from UMotdWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x478 - 0x410)
	class UFortDynamicMotdTeaserWidget : public UMotdWidgetBase	
	{
	public:
		FMulticastInlineDelegate FullscreenWidgetCreated; // 0x410(0x10)
		FMulticastInlineDelegate VideoPlayerReady; // 0x420(0x10)
		bool bVideoReady; // 0x430(0x1)
		bool bShouldBeActive; // 0x431(0x1)
		unsigned char UnknownData02_6[0x6]; // 0x432(0x6) UNKNOWN PROPERTY
		UMotdViewModel CurrentMotd; // 0x438(0x8)
		TArray MediaPlayerStates; // 0x440(0x10)
		UFortDynamicMotdFullscreenWidget CreatedFullscreenWidget; // 0x450(0x8)
		unsigned char UnknownData03_7[0x20]; // 0x458(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdTeaserWidget");
			return ret;
		}

		UDynamicMotdVideoPlayerState StartVideo(UMotdViewModel Motd, UMediaTexture InTexture, FName InTextureParam, bool bPlayImmediately); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D72F8
		void SetCurrentMotd(int32_t Index); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D7218
		void ReleaseMediaPlayer(FText& Name, bool bAll); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D7138
		void OnVideoBackgroundsAllowedChanged(bool bAllowVideoBackgrounds); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D7058
		void OnMotdShown(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D6F78
		float GetMotdUpdateDebounce(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D6E98
		UDynamicMotdVideoPlayerState GetMediaPlayer(FString& Name); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D6DB8
		void AddFullScreenWidget(TWeakObjectPtr FullScreenWidget, int32_t Index); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149D6CD8
	};


	// Class FortniteUI.FortEulaWidgetsContainer
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x420 - 0x3F8)
	class UFortEulaWidgetsContainer : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_3[0x10]; // 0x3F8(0x10) UNKNOWN PROPERTY
		UCommonActivatableWidgetSwitcher Switcher_EulaWidgets; // 0x408(0x8)
		UFortEulaWidget Widget_OldEula; // 0x410(0x8)
		UFortEulaWidget Widget_NewEula; // 0x418(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEulaWidgetsContainer");
			return ret;
		}
	};


	// Class FortniteUI.FortEventDateTimeTextBlock
	// Inherited from UCommonTextBlock -> UTextBlock -> UTextLayoutWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x3A0 - 0x348)
	class UFortEventDateTimeTextBlock : public UCommonTextBlock	
	{
	public:
		unsigned char UnknownData01_1[0x58]; // 0x348(0x58) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEventDateTimeTextBlock");
			return ret;
		}

		void SetTimespanValue(FTimespan InTimespan, TEnumAsByte InFormatStyle); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF413FD1930
		void SetDateTimeValue(FDateTime InDateTime, TEnumAsByte InFormatStyle, float InRefreshDelay); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF413FD17E8
		void SetCountDownCompletionText(FText InCompletionText); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FD1708
		void OnCurrentTimeTextBlockUpdated__DelegateSignature(double Seconds); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FD1628
		FDateTime GetDateTime(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413FD1548
		void ClearTimer(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FD1468
	};


	// Class FortniteUI.FortEventLevelData
	// Inherited from UDataAsset -> UObject
	// Size: 0x60 (0x90 - 0x30)
	class UFortEventLevelData : public UDataAsset	
	{
	public:
		FString EventLevelStoreFrontName; // 0x30(0x10)
		TWeakObjectPtr EventLevelRewards; // 0x40(0x20)
		UClass CinematicMovieWidget; // 0x60(0x8)
		UFortStreamMediaSource ElectraMediaSource; // 0x68(0x8)
		UMediaPlayer StreamedMediaPlayer; // 0x70(0x8)
		FName CinematicVideoName; // 0x78(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		FDataTableRowHandle InteractionHandle; // 0x80(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEventLevelData");
			return ret;
		}
	};


	// Class FortniteUI.FortEditableFilteredCountedTextBox
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x118 (0x3D0 - 0x2B8)
	class UFortEditableFilteredCountedTextBox : public UUserWidget	
	{
	public:
		int32_t EntryCharLimit; // 0x2B8(0x4)
		EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x2BC(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x2BD(0x3) UNKNOWN PROPERTY
		int32_t EnforcedEntryCharLimit; // 0x2C0(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x2C4(0x4) UNKNOWN PROPERTY
		FText SuggestionText; // 0x2C8(0x10)
		unsigned char UnknownData08_6[0x1]; // 0x2D8(0x1) UNKNOWN PROPERTY
		bool bUseChatSanitizer; // 0x2D9(0x1)
		bool bShouldValidatePersistentID; // 0x2DA(0x1)
		bool bAllowLineBreaks; // 0x2DB(0x1)
		bool bAllowStyleEditing; // 0x2DC(0x1)
		bool bIgnoreCharLimitValidation; // 0x2DD(0x1)
		unsigned char UnknownData09_6[0x2]; // 0x2DE(0x2) UNKNOWN PROPERTY
		FCharRangeList AllowedCharacters; // 0x2E0(0x10)
		bool bReplaceUserTextWithSanitizedString; // 0x2F0(0x1)
		bool bAllowSanitizedStrings; // 0x2F1(0x1)
		unsigned char UnknownData10_6[0x6]; // 0x2F2(0x6) UNKNOWN PROPERTY
		FText DefaultSanitizationErrorText; // 0x2F8(0x10)
		FText AdditionalValidationErrorText; // 0x308(0x10)
		bool bCurrentlyValid; // 0x318(0x1)
		unsigned char UnknownData11_7[0xB7]; // 0x319(0xB7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEditableFilteredCountedTextBox");
			return ret;
		}

		void ValidatePersistentID(FText& Text); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x7FF4149D82B8
		void UpdateCharacterCount(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D81D8
		void SetTextWithForcedSanitization(FText& Text); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D80F8
		void SetEntryCharLimit(int32_t InCharLimit); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent 0x7FF4149D8018
		void OnEditableTextHintChanged(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149D7F38
		void OnEditableTextChanged(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149D7E58
		void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed); // Flags: Event|Public|BlueprintEvent 0x7FF4149D7D78
		void OnCharCountTextChanged(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149D7C98
		void HandleTextCommitted(FText& Text, TEnumAsByte CommitMethod); // Flags: Native|Protected|HasOutParms|BlueprintCallable 0x7FF4149D7BB8
		void HandleTextChanged(FText& Text); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable 0x7FF4149D7AD8
		bool GetSomeBool(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D79F8
		bool GetIgnoreCharLimitValidation(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D7918
		int32_t GetEntryCharLimit(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D7838
		FText GetEditedText(); // Flags: Native|Event|Public|BlueprintEvent|Const 0x7FF4149D7758
		bool GetAllowStyleEditing(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D7678
		bool GetAllowLineBreaks(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D7598
		FString GetAllowedCharactersAsString(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D74B8
		void ForceSetText(FText& Text); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149D73D8
	};


	// Class FortniteUI.FortFilteredNameEntryWidget
	// Inherited from UFortEditableFilteredCountedTextBox -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x400 - 0x3D0)
	class UFortFilteredNameEntryWidget : public UFortEditableFilteredCountedTextBox	
	{
	public:
		TEnumAsByte LastTextCommittedType; // 0x3D0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x3D1(0x7) UNKNOWN PROPERTY
		UCommonButtonBase Button_RenameInputButton; // 0x3D8(0x8)
		FMulticastInlineDelegate OnTextCommitByEnter; // 0x3E0(0x10)
		FMulticastInlineDelegate OnRenameInput; // 0x3F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFilteredNameEntryWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortFrontendExperienceFlowInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortFrontendExperienceFlowInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendExperienceFlowInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortFrontendOverlayInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortFrontendOverlayInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendOverlayInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortFrontendSurvivorTier
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UFortFrontendSurvivorTier : public UUserWidget	
	{
	public:
		FGameplayTag AssociatedQuestCategory; // 0x2B8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x2BC(0x4) UNKNOWN PROPERTY
		UCommonButtonBase Button_GoToQuests; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendSurvivorTier");
			return ret;
		}
	};


	// Class FortniteUI.FortGameFeature_FortGameRegistryObserver
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UFortGameFeature_FortGameRegistryObserver : public UObject	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr AssociatedSettingsRegistry; // 0x30(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGameFeature_FortGameRegistryObserver");
			return ret;
		}
	};


	// Class FortniteUI.FortGameSettingRegistryExtension
	// Inherited from UFortGameSettingRegistryExtensionBase -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortGameSettingRegistryExtension : public UFortGameSettingRegistryExtensionBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGameSettingRegistryExtension");
			return ret;
		}
	};


	// Class FortniteUI.FortGameSettingSubsystem
	// Inherited from UFortLocalPlayerSubsystem -> ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UFortGameSettingSubsystem : public UFortLocalPlayerSubsystem	
	{
	public:
		unsigned char UnknownData02_3[0x18]; // 0x30(0x18) UNKNOWN PROPERTY
		UFortGameSettingRegistry SettingRegistry; // 0x48(0x8)
		UFortGameFeature_FortGameRegistryObserver SettingRegistryObserver; // 0x50(0x8)
		unsigned char UnknownData03_7[0x28]; // 0x58(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGameSettingSubsystem");
			return ret;
		}
	};


	// Class FortniteUI.FortGlobalActionDetailsDataSource
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortGlobalActionDetailsDataSource : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGlobalActionDetailsDataSource");
			return ret;
		}

		void RemoveOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x7FF4149D8558
		FFortGlobalActionDetails GetValue(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x7FF4149D8478
		void AddOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x7FF4149D8398
	};


	// Class FortniteUI.FortGlobalVMResolver
	// Inherited from UMVVMViewModelContextResolver -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortGlobalVMResolver : public UMVVMViewModelContextResolver	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGlobalVMResolver");
			return ret;
		}
	};


	// Class FortniteUI.FortHabaneroGenericEntry
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3F8 - 0x3F8)
	class UFortHabaneroGenericEntry : public UCommonActivatableWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroGenericEntry");
			return ret;
		}

		FText DateTimeAsTimeZoneTimeShort(FDateTime& InDateTime, FString InTimeZone); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF4149D8638
	};


	// Class FortniteUI.FortHabaneroInfoEntry
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x400 - 0x3F8)
	class UFortHabaneroInfoEntry : public UCommonActivatableWidget	
	{
	public:
		UFortHabaneroDisplayData HabaneroDisplayData; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroInfoEntry");
			return ret;
		}

		void OnSetGameMode(FString GameMode); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D8718
	};


	// Class FortniteUI.FortHabaneroInfoModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x448 - 0x3F8)
	class UFortHabaneroInfoModal : public UCommonActivatableWidget	
	{
	public:
		UVerticalBox Vbox_Panels; // 0x3F8(0x8)
		UCommonButtonBase Button_Close; // 0x400(0x8)
		UCommonButtonBase Button_Close_Alt; // 0x408(0x8)
		UCommonButtonBase Button_CloseTouch; // 0x410(0x8)
		UAthenaScrollBox ScrollBox_Panels; // 0x418(0x8)
		unsigned char UnknownData02_6[0x10]; // 0x420(0x10) UNKNOWN PROPERTY
		bool bIsHabaneroTimerEnabled; // 0x430(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x431(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroInfoModal");
			return ret;
		}

		void SetTimerVisibility(ESlateVisibility TimerVisibility); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D8C58
		void SetTimerText(FTimespan& Timespan); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintEvent 0x7FF4149D8B78
		void SetProgress(FString ProgressKey, int32_t CurrentHabanero, int32_t CurrentPosition, float ProgressPercent); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D8A98
		void SetGameType(FString GameMode); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D89B8
		void SendPanelFocusedAnalytics(UWidget Panel, FString Text); // Flags: Final|Native|Protected|BlueprintCallable|Const 0x7FF4149D88D8
		void BP_OnScrollCompleted(bool bScrolledDown); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D87F8
	};


	// Class FortniteUI.FortHabaneroTierWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x428 - 0x3F8)
	class UFortHabaneroTierWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData02_3[0x20]; // 0x3F8(0x20) UNKNOWN PROPERTY
		UFortHabaneroDisplayData HabaneroDisplayData; // 0x418(0x8)
		bool bInitializeToRepresentLocalUser; // 0x420(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x421(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroTierWidget");
			return ret;
		}

		void UpdateWidgetDisplay(FFortHabaneroTier& DisplayData); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149D8EF8
		void StartQueryForRank(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D8E18
		void FailedToFindRank(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D8D38
	};


	// Class FortniteUI.FortHabaneroLobbyWidget
	// Inherited from UFortHabaneroTierWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x440 - 0x428)
	class UFortHabaneroLobbyWidget : public UFortHabaneroTierWidget	
	{
	public:
		UCommonButtonBase Button_Info; // 0x428(0x8)
		FGameplayTag RankedInfoBangTag; // 0x430(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x434(0x4) UNKNOWN PROPERTY
		UClass InfoModalClass; // 0x438(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroLobbyWidget");
			return ret;
		}

		void UpdateProgressToNextHabanero(int32_t UnrealRankPlayerPosition, float ProgressPercent); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D90B8
		void SetBangVisible(bool bIsVisible); // Flags: Event|Protected|BlueprintEvent 0x7FF4149D8FD8
	};


	// Class FortniteUI.FortHUDVisibilityData
	// Inherited from UDataAsset -> UObject
	// Size: 0x30 (0x60 - 0x30)
	class UFortHUDVisibilityData : public UDataAsset	
	{
	public:
		FGameplayTag HUDVisibilityGameplayTag; // 0x30(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FText DisplayText; // 0x38(0x10)
		FText ToolTipText; // 0x48(0x10)
		bool Visible; // 0x58(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x59(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHUDVisibilityData");
			return ret;
		}
	};


	// Class FortniteUI.FortSetting
	// Inherited from UObject
	// Size: 0x158 (0x180 - 0x28)
	class UFortSetting : public UObject	
	{
	public:
		unsigned char UnknownData03_3[0x48]; // 0x28(0x48) UNKNOWN PROPERTY
		UFortLocalPlayer LocalPlayer; // 0x70(0x8)
		TWeakObjectPtr SettingParent; // 0x78(0x8)
		UFortSettingRegistry OwningRegistry; // 0x80(0x8)
		unsigned char UnknownData04_6[0x48]; // 0x88(0x48) UNKNOWN PROPERTY
		FFortSettingNameExtensions CustomExtensions; // 0xD0(0x18)
		unsigned char UnknownData05_7[0x98]; // 0xE8(0x98) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSetting");
			return ret;
		}

		FText GetWarningRichText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D95F8
		FText GetDynamicDetails(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D9518
		ESlateVisibility GetDisplayNameVisibility(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D9438
		FText GetDisplayName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D9358
		FString GetDevName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D9278
		FText GetDescriptionRichText(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D9198
	};


	// Class FortniteUI.FortSettingValue
	// Inherited from UFortSetting -> UObject
	// Size: 0x0 (0x180 - 0x180)
	class UFortSettingValue : public UFortSetting	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValue");
			return ret;
		}
	};


	// Class FortniteUI.FortInputSettingBase
	// Inherited from UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x8 (0x188 - 0x180)
	class UFortInputSettingBase : public UFortSettingValue	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x180(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortInputSettingBase");
			return ret;
		}
	};


	// Class FortniteUI.FortInventoryScreenContainer
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x438 - 0x3F8)
	class UFortInventoryScreenContainer : public UCommonActivatableWidget	
	{
	public:
		UInputComponent InventoryScreenInputComponent; // 0x3F8(0x8)
		FDataTableRowHandle BackInputRowHandle; // 0x400(0x10)
		TArray BlockedInputActions; // 0x410(0x10)
		TArray BlockedInputAxes; // 0x420(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x430(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortInventoryScreenContainer");
			return ret;
		}
	};


	// Class FortniteUI.FortItemManagementMulchPanel
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortItemManagementMulchPanel : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemManagementMulchPanel");
			return ret;
		}

		void ShowMulchConfirmationModal(); // Flags: Native|Public|BlueprintCallable 0x7FF4149D9978
		void NotifyPanelDeactivated(); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D9898
		void NotifyPanelActivated(); // Flags: Native|Protected|BlueprintCallable 0x7FF4149D97B8
		void HideMulchConfirmationModal(); // Flags: Native|Public|BlueprintCallable 0x7FF4149D96D8
	};


	// Class FortniteUI.FortFrontendInventoryFilterFunctionLibrary
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortFrontendInventoryFilterFunctionLibrary : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendInventoryFilterFunctionLibrary");
			return ret;
		}

		FText ToText(EFortFrontendInventoryFilter FrontendInventoryFilter); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF4149D9A58
	};


	// Class FortniteUI.FortItemPreviewScreen
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1B8 (0x720 - 0x568)
	class UFortItemPreviewScreen : public UFortActivatablePanel	
	{
	public:
		unsigned char UnknownData08_3[0x10]; // 0x568(0x10) UNKNOWN PROPERTY
		FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x578(0x10)
		FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x588(0x10)
		FDataTableRowHandle ItemViewZoomOutInputAction; // 0x598(0x10)
		FDataTableRowHandle ItemViewZoomInInputAction; // 0x5A8(0x10)
		FDataTableRowHandle ItemViewRotateInputAction; // 0x5B8(0x10)
		UWidgetAnimation AnimationToHideItemInfo; // 0x5C8(0x8)
		bool bAutoShowDetails; // 0x5D0(0x1)
		bool bFireAnalyticsViewEvent; // 0x5D1(0x1)
		bool bItemDetailsHidden; // 0x5D2(0x1)
		unsigned char UnknownData09_6[0x1]; // 0x5D3(0x1) UNKNOWN PROPERTY
		float HideItemInfoHeaderDurationSecs; // 0x5D4(0x4)
		unsigned char UnknownData10_6[0x8]; // 0x5D8(0x8) UNKNOWN PROPERTY
		bool bAllowItemRotation; // 0x5E0(0x1)
		bool bAllowItemZooming; // 0x5E1(0x1)
		unsigned char UnknownData11_6[0x2]; // 0x5E2(0x2) UNKNOWN PROPERTY
		FGameplayTag PreviewSceneChangerTag; // 0x5E4(0x4)
		FGameplayTag PreviewSceneChangerOverrideTag; // 0x5E8(0x4)
		unsigned char UnknownData12_6[0x4]; // 0x5EC(0x4) UNKNOWN PROPERTY
		AFortItemPreviewSceneChanger PreviewSceneChanger; // 0x5F0(0x8)
		UFortItemView ItemViewObject; // 0x5F8(0x8)
		float CameraEntryTransitionDuration; // 0x600(0x4)
		unsigned char UnknownData13_6[0x4]; // 0x604(0x4) UNKNOWN PROPERTY
		UCurveFloat CameraEntryTransitionCurve; // 0x608(0x8)
		unsigned char UnknownData14_6[0x59]; // 0x610(0x59) UNKNOWN PROPERTY
		bool bPreviewActionsEnabled; // 0x669(0x1)
		unsigned char UnknownData15_6[0x1E]; // 0x66A(0x1E) UNKNOWN PROPERTY
		UWidget Widget_CameraFrame; // 0x688(0x8)
		UCommonButtonBase Button_PreviewAction; // 0x690(0x8)
		UCommonButtonBase Button_PreviewAction1; // 0x698(0x8)
		UCommonButtonBase Button_Camera; // 0x6A0(0x8)
		TSet PreviewActionButtons; // 0x6A8(0x50)
		UCommonActivatableWidget OverrideFocusWidget; // 0x6F8(0x8)
		FMulticastInlineDelegate OnShowItemInfo; // 0x700(0x10)
		UFortItemDownloadIndicator ItemDownloadIndicator; // 0x710(0x8)
		UCommonTextBlock Text_DebugPreviewDetails; // 0x718(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemPreviewScreen");
			return ret;
		}

		void ShowItemDetails(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE6F58
		void RequestChangeFloorMaterialScalarParameter(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413FE6E78
		void RequestChangeBackgroundMaterialScalarParameter(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413FE6D98
		void PreviewAction(FName ActionName); // Flags: Final|RequiredAPI|Native|Protected|BlueprintCallable 0x7FF413FE6CB8
		void OnPreviewActionButtonUpdated(FText& RowDisplayName, UCommonButtonBase Button); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF413FE6BD8
		void HideItemDetails(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE6AF8
		AFortItemPreviewSceneChanger GetPreviewSceneChanger(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FE6A18
	};


	// Class FortniteUI.FortItemPreviewWidget
	// Inherited from UFortItemPreviewScreen -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x780 - 0x720)
	class UFortItemPreviewWidget : public UFortItemPreviewScreen	
	{
	public:
		FMulticastInlineDelegate OnPreviewItemShown; // 0x720(0x10)
		UFortItemVM CurrentItemVM; // 0x730(0x8)
		UFortTypedModularLoadoutVM CurrentLoadoutVM; // 0x738(0x8)
		UFortItemVM FallbackItemVM; // 0x740(0x8)
		TArray VariantOverrides; // 0x748(0x10)
		bool bCanDisplayUserBackpack; // 0x758(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x759(0x7) UNKNOWN PROPERTY
		FGameplayTag ProductOverride; // 0x760(0x4)
		EItemPreviewRestrictionMode RestrictionMode; // 0x764(0x1)
		bool bAllowPawnOverrideOnExclusiveItems; // 0x765(0x1)
		bool bAllowUpdateWhileDeactivated; // 0x766(0x1)
		bool bRestrictZoomToWidget; // 0x767(0x1)
		unsigned char UnknownData03_7[0x18]; // 0x768(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemPreviewWidget");
			return ret;
		}

		void UpdatePreview(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FA4D8
		void ToggleVariantOverrideOnCurrentItem(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FA3F8
		void SetVariantOverrides(TArray& InVariantOverrides); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149FA318
		void SetSlotIndexOverrideAndCurrentItem(int32_t InSlotIndex, UFortItemVM InItemVM); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149DA238
		void SetSlotIndexOverride(int32_t SlotIndex); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149DA158
		void SetRotationOffset(FRotator& InRotationOffset); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4149DA078
		void SetFallbackPreviewItem(UFortItemVM ItemVM); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D9F98
		void SetCurrentPreviewLoadout(UFortTypedModularLoadoutVM LoadoutVM); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D9EB8
		void SetCurrentPreviewItem(UFortItemVM ItemVM); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D9DD8
		TArray GetSpecialPreviewActions(UFortItemVM ItemVM); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D9CF8
		void ClearPreviewItem(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149D9C18
		bool AllowToggleVariantOverrideOnCurrentItem(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149D9B38
	};


	// Class FortniteUI.FortPresentationItemLootInfo
	// Inherited from UObject
	// Size: 0x218 (0x240 - 0x28)
	class UFortPresentationItemLootInfo : public UObject	
	{
	public:
		FFortReceivedItemLootInfo ItemReceivedInfo; // 0x28(0x218)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPresentationItemLootInfo");
			return ret;
		}
	};


	// Class FortniteUI.ItemReceivedHeaderBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2D0 - 0x2B8)
	class UItemReceivedHeaderBase : public UUserWidget	
	{
	public:
		UFortGiftBoxItem GiftBoxItem; // 0x2B8(0x8)
		FString FromUsername; // 0x2C0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ItemReceivedHeaderBase");
			return ret;
		}

		void SetBlueprintGiftBoxItem(UFortGiftBoxItem GiftBox, FString FromUser, TArray& ItemDefs, bool bSelfGift); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x7FF4149FA698
		void InitFromGiftBoxItem_BP(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x7FF4149FA5B8
	};


	// Class FortniteUI.FortKeyboardPresetRotator
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E8 - 0x2E0)
	class UFortKeyboardPresetRotator : public UCommonUserWidget	
	{
	public:
		int32_t SelectedIndex; // 0x2E0(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2E4(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortKeyboardPresetRotator");
			return ret;
		}
	};


	// Class FortniteUI.FortLevelSaveComponentViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x30 (0x98 - 0x68)
	class UFortLevelSaveComponentViewModel : public UMVVMViewModelBase	
	{
	public:
		EBackupSaveState CachedBackupSaveState; // 0x68(0x1)
		EBackupSaveState CachedBackupRestoreState; // 0x69(0x1)
		bool bCachedIsOnPublishedIsland; // 0x6A(0x1)
		unsigned char UnknownData01_7[0x2D]; // 0x6B(0x2D) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortLevelSaveComponentViewModel");
			return ret;
		}

		void UnbindViewModel(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FB1F8
		void RestoreIslandFromBackup(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FB118
		void ResetIsland(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FB038
		bool IsPublishingEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FAF58
		bool IsLastCheckpointDateSet(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FAE78
		void InitializeViewModel(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FAD98
		void HandleCheckpointDateChanged(FDateTime CheckpointDate); // Flags: Final|Native|Private|HasDefaults 0x7FF4149FACB8
		void HandleBackupSaveStateChanged(EBackupSaveState SaveState); // Flags: Final|Native|Private 0x7FF4149FABD8
		void HandleBackupRestoreStateChanged(EBackupSaveState RestoreState); // Flags: Final|Native|Private 0x7FF4149FAAF8
		FTimespan GetTimeSinceLastCheckpoint(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4149FAA18
		bool CanResetIsland(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FA938
		bool CanBackupAndRestoreIsland(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FA858
		void BackupIsland(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FA778
	};


	// Class FortniteUI.FortLoadingScreenCustomWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortLoadingScreenCustomWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortLoadingScreenCustomWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingErrorViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class UFortMatchmakingErrorViewModel : public UMVVMViewModelBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingErrorViewModel");
			return ret;
		}

		bool HasRedirect(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB658
		bool HasError(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB578
		FText GetPlayButtonOverrideText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB498
		FMatchmakingWidgetErrorVisuals GetErrorVisuals(); // Flags: Final|Native|Private|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB3B8
		EFortUIMatchmakingError GetCurrentError(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB2D8
	};


	// Class FortniteUI.FortMatchmakingSuggestionWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x300 - 0x2E0)
	class UFortMatchmakingSuggestionWidget : public UCommonUserWidget	
	{
	public:
		UWidget SharedDataTestVoting_Container; // 0x2E0(0x8)
		UCommonButtonBase Button_SharedDataTest_Accept; // 0x2E8(0x8)
		UCommonButtonBase Button_SharedDataTest_Reject; // 0x2F0(0x8)
		UCommonTextBlock Text_RequestedTextChange; // 0x2F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingSuggestionWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UFortMatchmakingViewModel : public UMVVMViewModelBase	
	{
	public:
		EFortUIMatchmakingStatus MatchmakingStatus; // 0x68(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		int32_t TimeElapsed; // 0x6C(0x4)
		UFortMatchmakingErrorViewModel ErrorViewModel; // 0x70(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingViewModel");
			return ret;
		}

		void ReadyUp(); // Flags: Final|Native|Private|BlueprintCallable 0x7FF4149FC378
		void OpenModeSettings(); // Flags: Final|Native|Private|BlueprintCallable 0x7FF4149FC298
		void LaunchMatch(); // Flags: Final|Native|Private|BlueprintCallable 0x7FF4149FC1B8
		bool IsModeSettingsButtonEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FC0D8
		bool IsDebugStartMatchButtonEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBFF8
		char GetTotalPlayerCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBF18
		FText GetModeSettingsSecondaryText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBE38
		FText GetModeSettingsPrimaryText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBD58
		UClass GetMatchFoundIslandWidget(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBC78
		EIslandJoinability GetGameStatus(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBB98
		float GetDownloadProgress(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FBAB8
		char GetCurrentReadyPlayerCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB9D8
		FText GetCurrentIslandTitle(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB8F8
		UClass GetCurrentIslandCustomLogo(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FB818
		void CancelMatchmaking(); // Flags: Final|Native|Private|BlueprintCallable 0x7FF4149FB738
	};


	// Class FortniteUI.MatchmakingWidgetErrorVisualsContainer
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UMatchmakingWidgetErrorVisualsContainer : public UObject	
	{
	public:
		bool bDefaultDataIsProductSpecific; // 0x28(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		FMatchmakingWidgetErrorVisualsDefaultData DefaultData; // 0x30(0x28)
		TArray ErrorVisualsData; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MatchmakingWidgetErrorVisualsContainer");
			return ret;
		}
	};


	// Class FortniteUI.MatchmakingWidgetErrorVisualsForFortnite
	// Inherited from UMatchmakingWidgetErrorVisualsContainer -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class UMatchmakingWidgetErrorVisualsForFortnite : public UMatchmakingWidgetErrorVisualsContainer	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MatchmakingWidgetErrorVisualsForFortnite");
			return ret;
		}
	};


	// Class FortniteUI.OnPlayButtonClickedWhenErrorAction
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOnPlayButtonClickedWhenErrorAction : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OnPlayButtonClickedWhenErrorAction");
			return ret;
		}
	};


	// Class FortniteUI.OpenParentalControlScreenAction
	// Inherited from UOnPlayButtonClickedWhenErrorAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOpenParentalControlScreenAction : public UOnPlayButtonClickedWhenErrorAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OpenParentalControlScreenAction");
			return ret;
		}
	};


	// Class FortniteUI.OpenDetailsScreenAction
	// Inherited from UOnPlayButtonClickedWhenErrorAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOpenDetailsScreenAction : public UOnPlayButtonClickedWhenErrorAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OpenDetailsScreenAction");
			return ret;
		}
	};


	// Class FortniteUI.OpenCampaignScreenAction
	// Inherited from UOnPlayButtonClickedWhenErrorAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOpenCampaignScreenAction : public UOnPlayButtonClickedWhenErrorAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OpenCampaignScreenAction");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingWidgetContext
	// Inherited from UFortLocalPlayerSubsystem -> ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0xC8 (0xF8 - 0x30)
	class UFortMatchmakingWidgetContext : public UFortLocalPlayerSubsystem	
	{
	public:
		TScriptInterface WidgetExtension; // 0x30(0x10)
		unsigned char UnknownData01_6[0x18]; // 0x40(0x18) UNKNOWN PROPERTY
		FMatchmakingWidgetErrorVisualsDefaultData ErrorVisualsDefaultData; // 0x58(0x28)
		FMatchmakingWidgetErrorVisualsDefaultData ProductSpecificErrorVisualsDefaultData; // 0x80(0x28)
		TMap ErrorVisualsByName; // 0xA8(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingWidgetContext");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingWidgetExtensionInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortMatchmakingWidgetExtensionInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingWidgetExtensionInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortMediaVideoWidgetConfig
	// Inherited from UEpicMediaVideoWidgetConfig -> UObject
	// Size: 0x8 (0x58 - 0x50)
	class UFortMediaVideoWidgetConfig : public UEpicMediaVideoWidgetConfig	
	{
	public:
		bool bUseSkipBoundaries; // 0x50(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x51(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMediaVideoWidgetConfig");
			return ret;
		}
	};


	// Class FortniteUI.FortMinigameInfoViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x28 (0x90 - 0x68)
	class UFortMinigameInfoViewModel : public UMVVMViewModelBase	
	{
	public:
		unsigned char UnknownData01_1[0x28]; // 0x68(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMinigameInfoViewModel");
			return ret;
		}

		void UnbindViewModel(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FCA78
		void InitializeViewModel(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FC998
		void HandleMinigameStateChanged(AFortMinigame Minigame, EFortMinigameState MinigameState); // Flags: Final|Native|Private 0x7FF4149FC8B8
		void HandleMinigameSettingsMachineChanged(UFortMinigameVolumeComponent MinigameVolumeComponent, AFortMinigameSettingsBuilding MinigameSettings); // Flags: Final|Native|Private 0x7FF4149FC7D8
		UFortMinigameVolumeComponent GetMinigameVolumeComponent(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FC6F8
		EFortMinigameState GetMinigameState(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FC618
		AFortMinigameSettingsBuilding GetMinigameSettings(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FC538
		AFortMinigame GetMinigame(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FC458
	};


	// Class FortniteUI.HUDWidgetBehavior
	// Inherited from UObject
	// Size: 0x90 (0xB8 - 0x28)
	class UHUDWidgetBehavior : public UObject	
	{
	public:
		FText HUDLayoutToolName; // 0x28(0x10)
		TArray HudWidgetContentComponents; // 0x38(0x10)
		TMap CustomPropertyDefaultOverrides; // 0x48(0x50)
		TArray BehaviorExtensions; // 0x98(0x10)
		TArray InputActionsData; // 0xA8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDWidgetBehavior");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileActionButtonBehavior
	// Inherited from UHUDWidgetBehavior -> UObject
	// Size: 0x78 (0x130 - 0xB8)
	class UFortMobileActionButtonBehavior : public UHUDWidgetBehavior	
	{
	public:
		unsigned char UnknownData04_3[0x8]; // 0xB8(0x8) UNKNOWN PROPERTY
		TArray ActionNames; // 0xC0(0x10)
		UPaperSprite Sprite; // 0xD0(0x8)
		TWeakObjectPtr DeferredBestSprite; // 0xD8(0x8)
		FGameplayTag HUDLayoutToolSaveTag_Legacy; // 0xE0(0x4)
		unsigned char UnknownData05_6[0x14]; // 0xE4(0x14) UNKNOWN PROPERTY
		TArray ButtonBehaviorComponents; // 0xF8(0x10)
		TArray ButtonBehaviorComponentOverrides; // 0x108(0x10)
		int32_t ForcedZOrder; // 0x118(0x4)
		unsigned char UnknownData06_6[0xC]; // 0x11C(0xC) UNKNOWN PROPERTY
		bool bIsToggleButtonDefaultValue; // 0x128(0x1)
		unsigned char UnknownData07_7[0x7]; // 0x129(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileActionButtonBehavior");
			return ret;
		}

		void HandleInputStackChanged(); // Flags: RequiredAPI|Native|Protected 0x7FF4149FCB58
	};


	// Class FortniteUI.FortMobileActionButtonBehavior_Reload
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UFortMobileActionButtonBehavior_Reload : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileActionButtonBehavior_Reload");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UFortMobileButtonBehaviorComponent : public UObject	
	{
	public:
		UFortMobileActionButtonBehavior ButtonBehavior; // 0x28(0x8)
		TArray ButtonBehaviorComponentOverrides; // 0x30(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x40(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_IconPicker
	// Inherited from UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UFortMobileButtonBehaviorComponent_IconPicker : public UFortMobileButtonBehaviorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_IconPicker");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComboComponent_IconPicker
	// Inherited from UFortMobileButtonBehaviorComponent_IconPicker -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x10 (0x58 - 0x48)
	class UFortMobileButtonBehaviorComboComponent_IconPicker : public UFortMobileButtonBehaviorComponent_IconPicker	
	{
	public:
		TArray IconAssignementQueries; // 0x48(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComboComponent_IconPicker");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_Visibility
	// Inherited from UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UFortMobileButtonBehaviorComponent_Visibility : public UFortMobileButtonBehaviorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_Visibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComboComponent_Visibility
	// Inherited from UFortMobileButtonBehaviorComponent_Visibility -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x10 (0x58 - 0x48)
	class UFortMobileButtonBehaviorComboComponent_Visibility : public UFortMobileButtonBehaviorComponent_Visibility	
	{
	public:
		TArray VisibilityAssignementQueries; // 0x48(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComboComponent_Visibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_Color
	// Inherited from UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UFortMobileButtonBehaviorComponent_Color : public UFortMobileButtonBehaviorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_Color");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_AbilityTagColor
	// Inherited from UFortMobileButtonBehaviorComponent_Color -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x18 (0x60 - 0x48)
	class UFortMobileButtonBehaviorComponent_AbilityTagColor : public UFortMobileButtonBehaviorComponent_Color	
	{
	public:
		TArray ColorOverrides; // 0x48(0x10)
		UAbilitySystemComponent AbilitySystemComponent; // 0x58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_AbilityTagColor");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_InteractionVisibility
	// Inherited from UFortMobileButtonBehaviorComponent_Visibility -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x8 (0x50 - 0x48)
	class UFortMobileButtonBehaviorComponent_InteractionVisibility : public UFortMobileButtonBehaviorComponent_Visibility	
	{
	public:
		FInteractionVisibility InteractionVisibility; // 0x48(0x3)
		unsigned char UnknownData01_7[0x5]; // 0x4B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_InteractionVisibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_TexturePicker
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortMobileButtonBehaviorComponent_TexturePicker : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_TexturePicker");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileEasyLootGrid
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x3A8 - 0x350)
	class UFortMobileEasyLootGrid : public UFortMobileHUDElement	
	{
	public:
		UButton Button_AutoPickUp; // 0x350(0x8)
		UButton Button_CollapsedList; // 0x358(0x8)
		UVerticalBox LootGridListBox; // 0x360(0x8)
		UImage Panel_Background; // 0x368(0x8)
		UCommonListView ListView_Items; // 0x370(0x8)
		UOverlay Overlay_FullBackpack; // 0x378(0x8)
		TWeakObjectPtr InteractionComponent; // 0x380(0x8)
		unsigned char UnknownData02_6[0x8]; // 0x388(0x8) UNKNOWN PROPERTY
		TArray LootGridListItems; // 0x390(0x10)
		unsigned char UnknownData03_7[0x8]; // 0x3A0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileEasyLootGrid");
			return ret;
		}

		void UpdateListPostAnimation(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FD338
		void OnLootFeedBack(bool bEnable); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FD258
		void OnCollapsedListPressed(bool bShouldCollapseList); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FD178
		void OnBackpackFullChanged(bool bFull); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FD098
		void OnAutoPickupPressed(bool bEnable); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FCFB8
		bool IsEasyLootGridEnabledForActor(AFortPlayerController FortPC, AActor PickupItem); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF4149FCED8
		bool IsEasyLootGridEnabled(AFortPlayerController FortPC); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF4149FCDF8
		void HandleCollapsedListPressed(); // Flags: Final|Native|Private 0x7FF4149FCD18
		void HandleAutoPickUpPressed(); // Flags: Final|Native|Private 0x7FF4149FCC38
	};


	// Class FortniteUI.FortMobileEasyLootGridItemEntry
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UFortMobileEasyLootGridItemEntry : public UObject	
	{
	public:
		TWeakObjectPtr LootGridItem; // 0x28(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileEasyLootGridItemEntry");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileEasyLootGridListEntry
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x300 - 0x2B8)
	class UFortMobileEasyLootGridListEntry : public UUserWidget	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		UCommonButtonBase Button_PickUp; // 0x2C0(0x8)
		UCommonButtonBase Button_Consume; // 0x2C8(0x8)
		USizeBox Box_SecondaryAbility; // 0x2D0(0x8)
		UTextBlock Text_WeaponName; // 0x2D8(0x8)
		UTextBlock Text_WeaponRarity; // 0x2E0(0x8)
		UAthenaItemIcon ItemIcon; // 0x2E8(0x8)
		TWeakObjectPtr LootGridItemEntry; // 0x2F0(0x8)
		bool bAnimItemAdded; // 0x2F8(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x2F9(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileEasyLootGridListEntry");
			return ret;
		}

		void SecondaryButtonClicked(); // Flags: Final|Native|Private 0x7FF4149FD6B8
		void PrimaryButtonClicked(); // Flags: Final|Native|Private 0x7FF4149FD5D8
		void OnItemRemoved(UFortMobileEasyLootGrid List); // Flags: Event|Public|BlueprintEvent 0x7FF4149FD4F8
		void OnItemAdded(); // Flags: Event|Public|BlueprintEvent 0x7FF4149FD418
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent_Active_Visibility
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UFortMobileHudWidgetContentComponent_Active_Visibility : public UObject	
	{
	public:
		UFortMobileHudWidgetContentComponent_Active WidgetComponent; // 0x28(0x8)
		TArray TagVisibilities; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent_Active_Visibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent_Active_PlayerTagVisibility
	// Inherited from UFortMobileHudWidgetContentComponent_Active_Visibility -> UObject
	// Size: 0x8 (0x48 - 0x40)
	class UFortMobileHudWidgetContentComponent_Active_PlayerTagVisibility : public UFortMobileHudWidgetContentComponent_Active_Visibility	
	{
	public:
		UAbilitySystemComponent AbilitySystemComponent; // 0x40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent_Active_PlayerTagVisibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UFortMobileHudWidgetContentComponent : public UObject	
	{
	public:
		UHUDWidgetBehavior WidgetBehavior; // 0x28(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent_InteractionRadialCooldown
	// Inherited from UFortMobileHudWidgetContentComponent -> UObject
	// Size: 0x28 (0x68 - 0x40)
	class UFortMobileHudWidgetContentComponent_InteractionRadialCooldown : public UFortMobileHudWidgetContentComponent	
	{
	public:
		TWeakObjectPtr RadialCooldownSoftClass; // 0x40(0x20)
		UInteractionRadialBacchusButton CurrentRadialCooldownWidget; // 0x60(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent_InteractionRadialCooldown");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel
	// Inherited from UObject
	// Size: 0x30 (0x58 - 0x28)
	class UFortMobileHUDWidgetCustomPropertyModel : public UObject	
	{
	public:
		bool bIsVisibleToTheUser; // 0x28(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		FString PropertyDevName; // 0x30(0x10)
		FText PropertyDisplayName; // 0x40(0x10)
		FGameplayTag PropertyTag; // 0x50(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x54(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Bool
	// Inherited from UFortMobileHUDWidgetCustomPropertyModel -> UObject
	// Size: 0x8 (0x60 - 0x58)
	class UFortMobileHUDWidgetCustomPropertyModel_Bool : public UFortMobileHUDWidgetCustomPropertyModel	
	{
	public:
		bool DefaultValue; // 0x58(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x59(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Bool");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_AutorunPreference
	// Inherited from UFortMobileHUDWidgetCustomPropertyModel_Bool -> UFortMobileHUDWidgetCustomPropertyModel -> UObject
	// Size: 0x0 (0x60 - 0x60)
	class UFortMobileHUDWidgetCustomPropertyModel_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Bool	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel_AutorunPreference");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileStickBehavior
	// Inherited from UHUDWidgetBehavior -> UObject
	// Size: 0x40 (0xF8 - 0xB8)
	class UFortMobileStickBehavior : public UHUDWidgetBehavior	
	{
	public:
		TArray XInputActionsData; // 0xB8(0x10)
		TArray YInputActionsData; // 0xC8(0x10)
		TArray SignedSizeInputActionsData; // 0xD8(0x10)
		TArray RotationInputActionsData; // 0xE8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileStickBehavior");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetBehaviorExtension
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UFortMobileHUDWidgetBehaviorExtension : public UObject	
	{
	public:
		TArray HudWidgetContentComponents; // 0x28(0x10)
		UHUDWidgetBehavior OwnerWidgetBehavior; // 0x38(0x8)
		TArray InputActionsData; // 0x40(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetBehaviorExtension");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileStickBehaviorExtension
	// Inherited from UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x40 (0x90 - 0x50)
	class UFortMobileStickBehaviorExtension : public UFortMobileHUDWidgetBehaviorExtension	
	{
	public:
		TArray XInputActionsData; // 0x50(0x10)
		TArray YInputActionsData; // 0x60(0x10)
		TArray SignedSizeInputActionsData; // 0x70(0x10)
		TArray RotationInputActionsData; // 0x80(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileStickBehaviorExtension");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileTextIconDataMapping
	// Inherited from UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UFortMobileTextIconDataMapping : public UPrimaryDataAsset	
	{
	public:
		TMap Mapping; // 0x30(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileTextIconDataMapping");
			return ret;
		}
	};


	// Class FortniteUI.FortModalContainerData
	// Inherited from UDataAsset -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UFortModalContainerData : public UDataAsset	
	{
	public:
		TArray Entries; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortModalContainerData");
			return ret;
		}
	};


	// Class FortniteUI.FortMoveStickHUDElementProxy
	// Inherited from UFortMobileHUDElementProxy -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x3F8 - 0x3C8)
	class UFortMoveStickHUDElementProxy : public UFortMobileHUDElementProxy	
	{
	public:
		UOverlay Overlay_Highlights; // 0x3C8(0x8)
		USizeBox SizeBox_AutorunLockZoneHidden; // 0x3D0(0x8)
		USizeBox SizeBox_AutorunLockZoneSize; // 0x3D8(0x8)
		USizeBox SizeBox_AutorunDirectionArrowSpaceSize; // 0x3E0(0x8)
		FGameplayTag AutorunLockZoneSizePropertyTag; // 0x3E8(0x4)
		FGameplayTag AutoRunPaddingPropertyTag; // 0x3EC(0x4)
		float DefaultAutorunLockZoneSize; // 0x3F0(0x4)
		float DefaultAutorunLockZoneTopPadding; // 0x3F4(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMoveStickHUDElementProxy");
			return ret;
		}
	};


	// Class FortniteUI.FortMPItemShopRow
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2E0 - 0x2B8)
	class UFortMPItemShopRow : public UUserWidget	
	{
	public:
		FMulticastInlineDelegate OnOfferTileFocusedEvent; // 0x2B8(0x10)
		FString FocusedOfferId; // 0x2C8(0x10)
		UUIKitGridPanel GridPanel_Tiles; // 0x2D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMPItemShopRow");
			return ret;
		}

		bool ShouldLoadPresentationsOnScrollComplete(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FE7F80
		void OnOfferTileFocused__DelegateSignature(FString OfferId); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FE7EA0
		UCommonButtonBase CreateEntryTile(UFortItemShopOfferVM OfferVM, UClass TileEntryWidgetClass); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FE7DC0
	};


	// Class FortniteUI.FortMPLobbyOnboardingModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x400 - 0x3F8)
	class UFortMPLobbyOnboardingModal : public UCommonActivatableWidget	
	{
	public:
		UCommonButtonBase Button_GetStarted; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMPLobbyOnboardingModal");
			return ret;
		}

		void ExitModal(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FD798
	};


	// Class FortniteUI.FortMtxStorePanelContainerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortMtxStorePanelContainerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMtxStorePanelContainerInterface");
			return ret;
		}
	};


	// Class FortniteUI.UIKitSelectableButtonViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UUIKitSelectableButtonViewModel : public UMVVMViewModelBase	
	{
	public:
		FText Label; // 0x68(0x10)
		UTexture2D Icon; // 0x78(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitSelectableButtonViewModel");
			return ret;
		}
	};


	// Class FortniteUI.UIKitTabGroupButtonViewModel
	// Inherited from UUIKitSelectableButtonViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x90 - 0x80)
	class UUIKitTabGroupButtonViewModel : public UUIKitSelectableButtonViewModel	
	{
	public:
		bool bEnableTabID; // 0x80(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x81(0x3) UNKNOWN PROPERTY
		FName TabID; // 0x84(0x4)
		bool bEnableSubGroupID; // 0x88(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		FName SubGroupID; // 0x8C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitTabGroupButtonViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortTabViewModel
	// Inherited from UUIKitTabGroupButtonViewModel -> UUIKitSelectableButtonViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x1E0 (0x270 - 0x90)
	class UFortTabViewModel : public UUIKitTabGroupButtonViewModel	
	{
	public:
		bool bEnabled; // 0x90(0x1)
		bool bCollapsed; // 0x91(0x1)
		unsigned char UnknownData01_6[0xE]; // 0x92(0xE) UNKNOWN PROPERTY
		FFortTopBarTabButtonInfo TabInfo; // 0xA0(0x1D0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTabViewModel");
			return ret;
		}

		void SetBangType(EFortBangType Type); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FDDB8
		FText GetTabDisplayName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FDCD8
		UClass GetOverrideTabWidget(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FDBF8
		EFortUIFeature GetLinkedUIFeature(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FDB18
		EFortUIFeature GetForwardOnRemoval(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FDA38
		EFortTopBarTabButtonGroup GetButtonGroup(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FD958
		EFortBangType GetBangType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FD878
	};


	// Class FortniteUI.FortMTXTabViewModel
	// Inherited from UFortTabViewModel -> UUIKitTabGroupButtonViewModel -> UUIKitSelectableButtonViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x270 - 0x270)
	class UFortMTXTabViewModel : public UFortTabViewModel	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMTXTabViewModel");
			return ret;
		}

		void HandleLocalAccountInfoChanged(FFortPrivateAccountInfo NewInfo); // Flags: Final|Native|Private 0x7FF4149FDE98
	};


	// Class FortniteUI.FortNodeCanvasEntityInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortNodeCanvasEntityInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortNodeCanvasEntityInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortNullHUD
	// Inherited from UFortUIStateWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x450 - 0x410)
	class UFortNullHUD : public UFortUIStateWidgetBase	
	{
	public:
		unsigned char UnknownData01_3[0x30]; // 0x410(0x30) UNKNOWN PROPERTY
		UCommonUserWidget AthenaHUDMenu; // 0x440(0x8)
		UCommonUserWidget ActionBar_BottomBar; // 0x448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortNullHUD");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialUserViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UFortSocialUserViewModel : public UMVVMViewModelBase	
	{
	public:
		TWeakObjectPtr SocialUser; // 0x68(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x70(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialUserViewModel");
			return ret;
		}

		void SetSocialUser(UFortSocialUser InSocialUser); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4149FE138
		void SetShouldForceUpdateUser(bool bNewForceUpdateUser); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FE058
		UFortSocialUser GetSocialUser(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FDF78
	};


	// Class FortniteUI.FortOnlineStatusViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x80 - 0x78)
	class UFortOnlineStatusViewModel : public UFortSocialUserViewModel	
	{
	public:
		EPresenceIndicatorState OnlineStatus; // 0x78(0x1)
		bool bHideStatus; // 0x79(0x1)
		bool bIsLocalPlayerSharingActivity; // 0x7A(0x1)
		unsigned char UnknownData01_7[0x5]; // 0x7B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortOnlineStatusViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortOptionsCategoryHeader
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UFortOptionsCategoryHeader : public UObject	
	{
	public:
		FText DisplayText; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortOptionsCategoryHeader");
			return ret;
		}
	};


	// Class FortniteUI.FortOptionsMenuInputData
	// Inherited from UDataAsset -> UObject
	// Size: 0xB0 (0xE0 - 0x30)
	class UFortOptionsMenuInputData : public UDataAsset	
	{
	public:
		FName ActionName; // 0x30(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FText DisplayText; // 0x38(0x10)
		FText PrimaryText; // 0x48(0x10)
		FText SecondaryText; // 0x58(0x10)
		int32_t ElementNumber; // 0x68(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		UCommonTextBlock TabText; // 0x70(0x8)
		FFortActionKeyMapping ActionKeyMapping; // 0x78(0x68)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortOptionsMenuInputData");
			return ret;
		}

		float GetInputScale(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FE2F8
		EFortInputActionGroup GetInputActionGroup(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FE218
	};


	// Class FortniteUI.FortPassLevelViewModel
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x30 (0xA0 - 0x70)
	class UFortPassLevelViewModel : public UFortPerUserViewModel	
	{
	public:
		FString CurrentChapter; // 0x70(0x10)
		FString CurrentSeason; // 0x80(0x10)
		int32_t NumBattleStars; // 0x90(0x4)
		int32_t CurrentLevel; // 0x94(0x4)
		int32_t CurrentXP; // 0x98(0x4)
		int32_t XpToNextLevel; // 0x9C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPassLevelViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortPersistentTabObject
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortPersistentTabObject : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPersistentTabObject");
			return ret;
		}

		void OnTabInitialized(); // Flags: Event|Public|BlueprintEvent 0x7FF4149FE678
		void OnTabExited(); // Flags: Event|Public|BlueprintEvent 0x7FF4149FE598
		void OnTabEntered(); // Flags: Event|Public|BlueprintEvent 0x7FF4149FE4B8
		void OnTabDestroyed(); // Flags: Event|Public|BlueprintEvent 0x7FF4149FE3D8
	};


	// Class FortniteUI.FortPinScreen
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x540 - 0x530)
	class UFortPinScreen : public UCommonActivatablePanelLegacy	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x530(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPinScreen");
			return ret;
		}
	};


	// Class FortniteUI.FortPlayerAvatar
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B8 - 0x2B8)
	class UFortPlayerAvatar : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerAvatar");
			return ret;
		}

		void ResetPlayerAvatar(); // Flags: Event|Public|BlueprintEvent 0x7FF4149FE918
		void RepresentLocalPlayer(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FE838
		void OnSetSocialUser(UFortSocialUser InUser); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x7FF4149FE758
	};


	// Class FortniteUI.FortPlayerAvatarViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xB0 - 0x78)
	class UFortPlayerAvatarViewModel : public UFortSocialUserViewModel	
	{
	public:
		bool bUseLargeImage; // 0x78(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		UTexture2D AvatarTexture; // 0x80(0x8)
		bool bLoading; // 0x88(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		FColor BackgroundColor; // 0x8C(0x4)
		FColor HighlightColor; // 0x90(0x4)
		unsigned char UnknownData05_7[0x1C]; // 0x94(0x1C) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerAvatarViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortPlayerBannerViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x58 (0xD0 - 0x78)
	class UFortPlayerBannerViewModel : public UFortSocialUserViewModel	
	{
	public:
		FName IconId; // 0x78(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		UTexture2D IconTexture; // 0x80(0x8)
		FName ColorId; // 0x88(0x4)
		FLinearColor PrimaryColor; // 0x8C(0x10)
		FLinearColor SecondaryColor; // 0x9C(0x10)
		int32_t CurrentLevel; // 0xAC(0x4)
		bool bUseLargeTexture; // 0xB0(0x1)
		unsigned char UnknownData03_7[0x1F]; // 0xB1(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerBannerViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortPlayerSurveyResponseChoiceBase
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x13A0 - 0x1390)
	class UFortPlayerSurveyResponseChoiceBase : public UCommonButtonBase	
	{
	public:
		UCommonTextBlock Text_Response; // 0x1390(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x1398(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerSurveyResponseChoiceBase");
			return ret;
		}

		void SetChoiceType(TEnumAsByte Type); // Flags: Event|Public|BlueprintEvent 0x7FF4149FEAD8
		void OnSurveyResetChoice(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FE9F8
	};


	// Class FortniteUI.FortPlayerSurveyResponseWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x428 - 0x3F8)
	class UFortPlayerSurveyResponseWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_1[0x30]; // 0x3F8(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerSurveyResponseWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortPluginWidgetInjectionSlot
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2E0 - 0x2B8)
	class UFortPluginWidgetInjectionSlot : public UUserWidget	
	{
	public:
		FString PluginId; // 0x2B8(0x10)
		FString PluginWidgetId; // 0x2C8(0x10)
		UNamedSlot InjectionSlot; // 0x2D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPluginWidgetInjectionSlot");
			return ret;
		}

		TArray GetValidPluginIds(); // Flags: Final|Native|Private|Const 0x7FF4149FEC98
		TArray GetValidInjectableWidgetIds(); // Flags: Final|Native|Private|Const 0x7FF4149FEBB8
	};


	// Class FortniteUI.FortPolymorphicTileView
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x400 - 0x3F8)
	class UFortPolymorphicTileView : public UCommonActivatableWidget	
	{
	public:
		UFortCommonTileView TileView; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPolymorphicTileView");
			return ret;
		}

		void SetListItems(TArray& InListItems); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149FEE58
		UClass GetDesiredEntryClassForItem(UObject Item); // Flags: Event|Public|BlueprintEvent 0x7FF4149FED78
	};


	// Class FortniteUI.FortPolymorphicListView
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x400 - 0x3F8)
	class UFortPolymorphicListView : public UCommonActivatableWidget	
	{
	public:
		UCommonListView ListView; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPolymorphicListView");
			return ret;
		}

		void SetListItems(TArray& InListItems); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4149FF018
		UClass GetDesiredEntryClassForItem(UObject Item); // Flags: Event|Public|BlueprintEvent|Const 0x7FF4149FEF38
	};


	// Class FortniteUI.FortPopupModal
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UFortPopupModal : public UUserWidget	
	{
	public:
		UCommonButtonBase IconTextButton_Close; // 0x2B8(0x8)
		UCommonButtonBase Button_CloseTouch; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPopupModal");
			return ret;
		}
	};


	// Class FortniteUI.FortRankedViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xA0 - 0x68)
	class UFortRankedViewModel : public UMVVMViewModelBase	
	{
	public:
		UFortSocialUser SocialUser; // 0x68(0x8)
		bool bIsIslandRanked; // 0x70(0x1)
		bool bIsPlayerRanked; // 0x71(0x1)
		bool bHasRankProtection; // 0x72(0x1)
		bool bHasSeenRankProtectionFTUE; // 0x73(0x1)
		unsigned char UnknownData02_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		FString RankType; // 0x78(0x10)
		int32_t CurrentRank; // 0x88(0x4)
		int32_t HighestRank; // 0x8C(0x4)
		int32_t CurrentPlayerPosition; // 0x90(0x4)
		float Progress; // 0x94(0x4)
		unsigned char UnknownData03_7[0x8]; // 0x98(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRankedViewModel");
			return ret;
		}

		void SetHasSeenRankProtectionFTUE(bool bInHasSeenRankProtectionFTUE); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FF1D8
		void InitializeRankedViewModal(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4149FF0F8
	};


	// Class FortniteUI.FortRankedWidgetExtensionInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortRankedWidgetExtensionInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRankedWidgetExtensionInterface");
			return ret;
		}

		TWeakObjectPtr GetRankInfoModalOverride(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4149FF2B8
	};


	// Class FortniteUI.FortRedirectorVariantWrapper
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x330 - 0x2E0)
	class UFortRedirectorVariantWrapper : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x2E0(0x8) UNKNOWN PROPERTY
		UFortVariantEditorWidgetBase VariantPicker; // 0x2E8(0x8)
		UPanelWidget Container; // 0x2F0(0x8)
		FMulticastInlineDelegate OnRotationRequestedEvent; // 0x2F8(0x10)
		UFortVariantItemVM VariantItemVM; // 0x308(0x8)
		TArray WaitingChannelVMs; // 0x310(0x10)
		unsigned char UnknownData03_7[0x10]; // 0x320(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRedirectorVariantWrapper");
			return ret;
		}

		void OnRotationRequestedEvent__DelegateSignature(FRotator& RotationOffset, bool bSnap); // Flags: MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults 0x7FF413FEB538
		void HandleVariantEngaged(FMcpVariantChannelInfo& InVariantChannelInfo, UFortVariantItemVM ItemVM); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x7FF413FEB458
		void HandleRotationOffsetRequested(FRotator& RotationOffset, bool bSnap); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintEvent 0x7FF413FEB378
		void AddVariantChannelVM(UFortVariantChannelVM ChannelVM); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FEB298
	};


	// Class FortniteUI.FortRichTextTextureDecorator
	// Inherited from URichTextBlockDecorator -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UFortRichTextTextureDecorator : public URichTextBlockDecorator	
	{
	public:
		UObject LoadedResourceObject; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRichTextTextureDecorator");
			return ret;
		}
	};


	// Class FortniteUI.FortRichTextTextureDecoratorHelpers
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortRichTextTextureDecoratorHelpers : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRichTextTextureDecoratorHelpers");
			return ret;
		}

		FText MakeFortRichTextTexture(TWeakObjectPtr InTexture, bool bUseDesiredSize, int32_t Width, int32_t Height); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF4149FF478
		FText MakeFortRichTextMaterial(TWeakObjectPtr InMaterial, bool bUseDesiredSize, int32_t Width, int32_t Height); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF4149FF398
	};


	// Class FortniteUI.FortSaveLoadoutPopup
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x590 - 0x568)
	class UFortSaveLoadoutPopup : public UFortActivatablePanel	
	{
	public:
		UFortEditableFilteredCountedTextBox Text_EditableLoadoutName; // 0x568(0x8)
		FMulticastInlineDelegate OnActionConfirmedEvent; // 0x570(0x10)
		FMulticastInlineDelegate OnActionDeclinedEvent; // 0x580(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSaveLoadoutPopup");
			return ret;
		}

		void SanitizeText(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FEBA78
		void OnSanitizationReady(bool bSuccess, FString Sanitizedtext); // Flags: Event|Public|BlueprintEvent 0x7FF413FEB998
		void OnLoadoutActionSaveEvent__DelegateSignature(FString NewName); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FEB8B8
		void OnLoadoutActionDeclineEvent__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FEB7D8
		void HandleActionDeclined(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FEB6F8
		void HandleActionConfirmed(FString OptionalNewName); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FEB618
	};


	// Class FortniteUI.FortServerBrowserActionData
	// Inherited from UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0xE0 (0x110 - 0x30)
	class UFortServerBrowserActionData : public UPrimaryDataAsset	
	{
	public:
		EFortServerBrowserAction ActionType; // 0x30(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
		FText Title; // 0x38(0x10)
		FText Description; // 0x48(0x10)
		unsigned char UnknownData03_6[0x8]; // 0x58(0x8) UNKNOWN PROPERTY
		FSlateBrush TileImage; // 0x60(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortServerBrowserActionData");
			return ret;
		}
	};


	// Class FortniteUI.FortServerBrowserActionDataPopup
	// Inherited from UFortServerBrowserActionData -> UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x20 (0x130 - 0x110)
	class UFortServerBrowserActionDataPopup : public UFortServerBrowserActionData	
	{
	public:
		TWeakObjectPtr PopupClass; // 0x110(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortServerBrowserActionDataPopup");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingExperiencePluginTrackerSubsystem
	// Inherited from UFortLocalPlayerSubsystem -> ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UFortSettingExperiencePluginTrackerSubsystem : public UFortLocalPlayerSubsystem	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingExperiencePluginTrackerSubsystem");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingPreviewInput
	// Inherited from UFortInputSettingBase -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x78 (0x200 - 0x188)
	class UFortSettingPreviewInput : public UFortInputSettingBase	
	{
	public:
		unsigned char UnknownData01_1[0x78]; // 0x188(0x78) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingPreviewInput");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingsListEntrySetting_Category
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2F0 - 0x2E0)
	class UFortSettingsListEntrySetting_Category : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x2E0(0x8) UNKNOWN PROPERTY
		UCommonButtonBase Button_Category; // 0x2E8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsListEntrySetting_Category");
			return ret;
		}

		void SetCategoryName(FText& InCategoryName); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x7FF4149FF8D8
		void ExpandCategory(bool bIsInstant); // Flags: Event|Public|BlueprintEvent|Const 0x7FF4149FF7F8
		void CollapseCategory(bool bIsInstant); // Flags: Event|Public|BlueprintEvent|Const 0x7FF4149FF718
		void BP_SetIsSelected(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FF638
		void BP_ResetCategory(); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FF558
	};


	// Class FortniteUI.FortSettingsPanelBase
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x3C8 (0x7C0 - 0x3F8)
	class UFortSettingsPanelBase : public UCommonActivatableWidget	
	{
	public:
		UFortSettingRegistry Registry; // 0x3F8(0x8)
		FFortSettingsFilterState FilterState; // 0x400(0x3A0)
		unsigned char UnknownData01_6[0x10]; // 0x7A0(0x10) UNKNOWN PROPERTY
		FMulticastInlineDelegate BP_OnExecuteNamedAction; // 0x7B0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsPanelBase");
			return ret;
		}

		void OnExecuteNamedActionBP__DelegateSignature(UFortSetting Setting, FName Action); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FEBB58
	};


	// Class FortniteUI.SettingsScreen
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x5D8 - 0x568)
	class USettingsScreen : public UFortActivatablePanel	
	{
	public:
		unsigned char UnknownData01_3[0x60]; // 0x568(0x60) UNKNOWN PROPERTY
		TWeakObjectPtr SettingRegistry; // 0x5C8(0x8)
		UFortSettingsPanelBase Settings_Panel; // 0x5D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsScreen");
			return ret;
		}

		void SaveSettings(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FFEF8
		void ResetSettings(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FFE18
		void OnSettingsDirtyStateChanged(bool bSettingsDirty); // Flags: Event|Protected|BlueprintEvent 0x7FF4149FFD38
		void NavigateToSettings(TArray SettingsCollectionNames); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FFC58
		bool HaveSettingsBeenChanged(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF4149FFB78
		void CloseSettings(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FFA98
		bool AttemptToPopNavigation(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF4149FF9B8
	};


	// Class FortniteUI.FortSettingsScreen
	// Inherited from USettingsScreen -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x170 (0x748 - 0x5D8)
	class UFortSettingsScreen : public USettingsScreen	
	{
	public:
		FVector2D IconOnlyTabIconSize; // 0x5D8(0x10)
		UClass TabButtonClass; // 0x5E8(0x8)
		USettingsScreenTabSchemaCollection TabSchemaCollection; // 0x5F0(0x8)
		UNamedSettingActionCollection NamedSettingActionCollection; // 0x5F8(0x8)
		FDataTableRowHandle ApplySettingsActionRowHandle; // 0x600(0x10)
		unsigned char UnknownData03_6[0x8]; // 0x610(0x8) UNKNOWN PROPERTY
		FDataTableRowHandle ResetSettingsToDefaultActionRowHandle; // 0x618(0x10)
		FDataTableRowHandle BackActionRowHandle; // 0x628(0x10)
		UClass SaveProgressModalClass; // 0x638(0x8)
		UFortProgressModal SaveProgressModalInstance; // 0x640(0x8)
		FDataTableRowHandle TestSettingsActionRowHandle; // 0x648(0x10)
		FDataTableRowHandle ApplyAndTestSettingsActionRowHandle; // 0x658(0x10)
		unsigned char UnknownData04_6[0xC0]; // 0x668(0xC0) UNKNOWN PROPERTY
		UNamedSlot SaveProgressLayer; // 0x728(0x8)
		UCommonButtonBase Button_CloseTouch; // 0x730(0x8)
		unsigned char UnknownData05_7[0x10]; // 0x738(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsScreen");
			return ret;
		}

		void NavigateToSetting(FName SettingCategory, FString SettingToSelect); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A00518
		void HandleTestSettings(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms 0x7FF414A00438
		void HandleTabSelected(FName TabID); // Flags: Final|Native|Private|BlueprintCallable 0x7FF414A00358
		void HandleResetSettingsToDefault(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms 0x7FF414A00278
		void HandleBack(bool& bPassThrough); // Flags: Final|Native|Private|HasOutParms 0x7FF414A00198
		void HandleApplySettings(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms 0x7FF414A000B8
		void HandleApplyAndTestSettings(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms 0x7FF4149FFFD8
	};


	// Class FortniteUI.FortSettingsScreenViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UFortSettingsScreenViewModel : public UMVVMViewModelBase	
	{
	public:
		TArray TopNavTabs; // 0x68(0x10)
		FName SelectedTopNavTabID; // 0x78(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsScreenViewModel");
			return ret;
		}

		void Reset(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A005F8
	};


	// Class FortniteUI.FortSettingTimeWindows
	// Inherited from UFortSetting -> UObject
	// Size: 0x20 (0x1A0 - 0x180)
	class UFortSettingTimeWindows : public UFortSetting	
	{
	public:
		unsigned char UnknownData01_1[0x20]; // 0x180(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingTimeWindows");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscrete
	// Inherited from UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x8 (0x188 - 0x180)
	class UFortSettingValueDiscrete : public UFortSettingValue	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x180(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscrete");
			return ret;
		}

		TArray GetDiscreteOptions(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A00B38
		int32_t GetDiscreteOptionInitialIndex(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A00A58
		int32_t GetDiscreteOptionIndex(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A00978
		int32_t GetDiscreteOptionDefaultIndex(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A00898
		TArray GetDisabledOptionsReasons(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A007B8
		TArray GetDisabledOptions(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A006D8
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic
	// Inherited from UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x80 (0x208 - 0x188)
	class UFortSettingValueDiscreteDynamic : public UFortSettingValueDiscrete	
	{
	public:
		unsigned char UnknownData01_1[0x80]; // 0x188(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic_Vector2D
	// Inherited from UFortSettingValueDiscreteDynamic -> UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x0 (0x208 - 0x208)
	class UFortSettingValueDiscreteDynamic_Vector2D : public UFortSettingValueDiscreteDynamic	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic_Vector2D");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic_Anchors
	// Inherited from UFortSettingValueDiscreteDynamic_Vector2D -> UFortSettingValueDiscreteDynamic -> UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x0 (0x208 - 0x208)
	class UFortSettingValueDiscreteDynamic_Anchors : public UFortSettingValueDiscreteDynamic_Vector2D	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic_Anchors");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic_ControllerPreset
	// Inherited from UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x10 (0x198 - 0x188)
	class UFortSettingValueDiscreteDynamic_ControllerPreset : public UFortSettingValueDiscrete	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x188(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic_ControllerPreset");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialPanelContainerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortSocialPanelContainerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialPanelContainerInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialSidebarPanelInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortSocialSidebarPanelInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialSidebarPanelInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialStyle
	// Inherited from UDataAsset -> UObject
	// Size: 0x9000 (0x9030 - 0x30)
	class UFortSocialStyle : public UDataAsset	
	{
	public:
		FSocialStyle Style; // 0x30(0x8FF0)
		USocialStyleDataAsset OverrideStyle; // 0x9020(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x9028(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialStyle");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialUserInfoViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xB0 - 0x78)
	class UFortSocialUserInfoViewModel : public UFortSocialUserViewModel	
	{
	public:
		FText LastInteractionInfo; // 0x78(0x10)
		FText UserRichPresenceText; // 0x88(0x10)
		FText MutualFriendsText; // 0x98(0x10)
		bool bShouldEncourageEpicFriendship; // 0xA8(0x1)
		bool bIsRebootRallyEligible; // 0xA9(0x1)
		bool bIsFriend; // 0xAA(0x1)
		bool bIsSocialBanned; // 0xAB(0x1)
		bool bIsInviteSent; // 0xAC(0x1)
		bool bIsInZone; // 0xAD(0x1)
		unsigned char UnknownData01_7[0x2]; // 0xAE(0x2) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialUserInfoViewModel");
			return ret;
		}

		bool InZonePresenceEnabled(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A00C18
	};


	// Class FortniteUI.FortSqueegeeWidgetInjectionSlot
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x330 - 0x2B8)
	class UFortSqueegeeWidgetInjectionSlot : public UUserWidget	
	{
	public:
		ESqueegeeWidgetInjection DesiredInjection; // 0x2B8(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x2B9(0x7) UNKNOWN PROPERTY
		FSqueegeeStyleParams StyleParams; // 0x2C0(0x30)
		UNamedSlot InjectionSlot; // 0x2F0(0x8)
		unsigned char UnknownData04_6[0x20]; // 0x2F8(0x20) UNKNOWN PROPERTY
		UFortSqueegeeWidget InjectedSqueegeeWidget; // 0x318(0x8)
		unsigned char UnknownData05_7[0x10]; // 0x320(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSqueegeeWidgetInjectionSlot");
			return ret;
		}

		void ShowActivityDataFromViewModel(UFortActivityViewModel GameActivityViewModel); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A00EB8
		void ShowActivityData(UFortGameActivity GameActivity); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A00DD8
		void SetUnlockPlayer(AFortPlayerController UnlockPlayer); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A00CF8
	};


	// Class FortniteUI.FortSqueegeeWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x300 - 0x2E0)
	class UFortSqueegeeWidget : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData01_1[0x20]; // 0x2E0(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSqueegeeWidget");
			return ret;
		}

		void ShowUnlockPinForActivity(AFortPlayerController UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|Const 0x7FF414A013F8
		void ShowParentalControls(AFortPlayerController UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|Const 0x7FF414A01318
		void SetUnlockPlayer(AFortPlayerController UnlockPlayer); // Flags: Event|Public|BlueprintEvent 0x7FF414A01238
		void SetGameActivity(UFortGameActivity GameActivity); // Flags: Event|Public|BlueprintEvent 0x7FF414A01158
		bool IsCabinModeEnabled(AFortPlayerController UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A01078
		bool AreParentalControlsEnabled(AFortPlayerController UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A00F98
	};


	// Class FortniteUI.FortStandaloneFrontendScreenInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortStandaloneFrontendScreenInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortStandaloneFrontendScreenInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortStartLoginContainer
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x430 - 0x3F8)
	class UFortStartLoginContainer : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_3[0x20]; // 0x3F8(0x20) UNKNOWN PROPERTY
		UCommonActivatableWidgetSwitcher Switcher_StartLogin; // 0x418(0x8)
		UFortPlayedBeforeSelect Widget_PlayedBeforeSelect; // 0x420(0x8)
		UFortStartLoginWidget Widget_StartLogin; // 0x428(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortStartLoginContainer");
			return ret;
		}
	};


	// Class FortniteUI.FortStartLoginWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x418 - 0x3F8)
	class UFortStartLoginWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_3[0x10]; // 0x3F8(0x10) UNKNOWN PROPERTY
		UCommonButtonBase Button_Login; // 0x408(0x8)
		UBackgroundBlur BackgroundBlur_PendingSpinner; // 0x410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortStartLoginWidget");
			return ret;
		}
	};


	// Class FortniteUI.UIKitTabGroupViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UUIKitTabGroupViewModel : public UMVVMViewModelBase	
	{
	public:
		TArray Tabs; // 0x68(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitTabGroupViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortTabGroupViewModel
	// Inherited from UUIKitTabGroupViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x78 - 0x78)
	class UFortTabGroupViewModel : public UUIKitTabGroupViewModel	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTabGroupViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortTeamMemberPedestalNameplateViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x50 (0xB8 - 0x68)
	class UFortTeamMemberPedestalNameplateViewModel : public UMVVMViewModelBase	
	{
	public:
		TWeakObjectPtr SocialUser; // 0x68(0x8)
		UFortSocialUserNameViewModel NameInfo; // 0x70(0x8)
		UFortSocialUserPartyViewModel PartyInfo; // 0x78(0x8)
		UFortSocialUserInfoViewModel UserInfo; // 0x80(0x8)
		UFortOnlineStatusViewModel OnlineStatusInfo; // 0x88(0x8)
		UFortRankedViewModel RankedInfo; // 0x90(0x8)
		UFortPlayerBannerViewModel BannerInfo; // 0x98(0x8)
		bool bIsLocalPlayer; // 0xA0(0x1)
		bool bIsTalking; // 0xA1(0x1)
		bool bIsMutedByLocalPlayer; // 0xA2(0x1)
		unsigned char UnknownData01_6[0x1]; // 0xA3(0x1) UNKNOWN PROPERTY
		float VolumeLevel; // 0xA4(0x4)
		EPedestalNameplateMatchmakingStatus MatchmakingStatus; // 0xA8(0x1)
		bool bIsInLobby; // 0xA9(0x1)
		EPedestalNameplateAction CurrentAvailableAction; // 0xAA(0x1)
		bool bIsActionInProgress; // 0xAB(0x1)
		int32_t DownloadProgress; // 0xAC(0x4)
		UClass OpenProfileActionMenuClass; // 0xB0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTeamMemberPedestalNameplateViewModel");
			return ret;
		}

		void Whisper(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01E78
		void ViewProfile(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01D98
		void ToggleMute(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01CB8
		void SetSocialUserFromPlayerUniqueNetId(FUniqueNetIdRepl& UniqueID); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF414A01BD8
		void SetSocialUser(UFortSocialUser InSocialUser); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01AF8
		void PromoteToLeader(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01A18
		void PerformAction(EPedestalNameplateAction Action); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01938
		void OpenSidebar(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01858
		void KickFromParty(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A01778
		void HandleOnLobbyStarted(); // Flags: Final|Native|Private 0x7FF414A01698
		void HandleOnLobbyDisconnected(); // Flags: Final|Native|Private 0x7FF414A015B8
		UFortSocialUser GetSocialUser(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A014D8
	};


	// Class FortniteUI.FortTeamMemberPedestalSocialNudgeViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x28 (0x90 - 0x68)
	class UFortTeamMemberPedestalSocialNudgeViewModel : public UMVVMViewModelBase	
	{
	public:
		TWeakObjectPtr SocialUser; // 0x68(0x8)
		UFortSocialUserNameViewModel NameInfo; // 0x70(0x8)
		UFortSocialUserInfoViewModel UserInfo; // 0x78(0x8)
		UFortPlayerAvatarViewModel AvatarInfo; // 0x80(0x8)
		EPedestalSocialNudgeAction CurrentAvailableAction; // 0x88(0x1)
		bool bIsInviteInProgress; // 0x89(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x8A(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTeamMemberPedestalSocialNudgeViewModel");
			return ret;
		}

		void SetSocialUserFromPlayerUniqueNetId(FUniqueNetIdRepl& UniqueID); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF414A02498
		void SetSocialUser(UFortSocialUser InSocialUser); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A023B8
		void PerformAction(EPedestalSocialNudgeAction Action); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A022D8
		void OpenSidebar(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A021F8
		void HandleOnLobbyStarted(); // Flags: Final|Native|Private 0x7FF414A02118
		void HandleOnLobbyDisconnected(); // Flags: Final|Native|Private 0x7FF414A02038
		UFortSocialUser GetSocialUser(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A01F58
	};


	// Class FortniteUI.FortTextChatChannelVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x20 (0x88 - 0x68)
	class UFortTextChatChannelVM : public UMVVMViewModelBase	
	{
	public:
		FString ChannelName; // 0x68(0x10)
		EFortTextChatChannelType ChannelType; // 0x78(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x79(0x3) UNKNOWN PROPERTY
		int32_t UnreadMessagesCount; // 0x7C(0x4)
		bool bIsMuted; // 0x80(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x81(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortTextChatMessageVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x40 (0xA8 - 0x68)
	class UFortTextChatMessageVM : public UMVVMViewModelBase	
	{
	public:
		FName MessageId; // 0x68(0x4)
		EFortTextChatMessageType MessageType; // 0x6C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x6D(0x3) UNKNOWN PROPERTY
		FText Text; // 0x70(0x10)
		FDateTime DateReceived; // 0x80(0x8)
		UFortPlayerAvatarViewModel PlayerAvatar; // 0x88(0x8)
		FString DisplayName; // 0x90(0x10)
		bool bPreviousMessageWasFromSameSender; // 0xA0(0x1)
		bool bPreviousMessageIsSameGameOrParty; // 0xA1(0x1)
		unsigned char UnknownData03_7[0x6]; // 0xA2(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatMessageVM");
			return ret;
		}

		void ViewProfile(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A02658
		void Report(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A02578
	};


	// Class FortniteUI.FortTextChatPlayerVM
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x28 (0x98 - 0x70)
	class UFortTextChatPlayerVM : public UFortPerUserViewModel	
	{
	public:
		TArray Channels; // 0x70(0x10)
		TArray Messages; // 0x80(0x10)
		FName CurrentChannelId; // 0x90(0x4)
		EFortTextChatChannelType CurrentChannelType; // 0x94(0x1)
		bool bNewerMessagesAppearedForTheCurrentChannel; // 0x95(0x1)
		bool bIsFirstNewMessageForTheCurrentChannel; // 0x96(0x1)
		unsigned char UnknownData01_7[0x1]; // 0x97(0x1) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatPlayerVM");
			return ret;
		}

		void SetNewerMessagesAppearedForTheCurrentChannel(bool bInNewerMessagesAppearedForTheCurrentChannel); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A02F18
		bool GetNewerMessagesAppearedForTheCurrentChannel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A02E38
		UFortTextChatMessageVM GetMessageVM(FString MessageId); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A02D58
		TArray GetMessages(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A02C78
		bool GetIsFirstNewMessageForTheCurrentChannel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A02B98
		EFortTextChatChannelType GetCurrentChannelType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A02AB8
		FName GetCurrentChannelId(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A029D8
		UFortTextChatChannelVM GetChannelVM(FString ChannelId); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A028F8
		TArray GetChannels(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A02818
		void ChangeCurrentChannel(FName& InChannelId); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF414A02738
	};


	// Class FortniteUI.FortTimespanDataSource
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortTimespanDataSource : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTimespanDataSource");
			return ret;
		}

		void RemoveOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x7FF414A031B8
		FTimespan GetValue(); // Flags: Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x7FF414A030D8
		void AddOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x7FF414A02FF8
	};


	// Class FortniteUI.FortTouchStick
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x380 - 0x370)
	class UFortTouchStick : public UBacchusHUDElement	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x370(0x8) UNKNOWN PROPERTY
		UHUDWidgetBehavior WidgetBehavior; // 0x378(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTouchStick");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction
	// Inherited from UGameFeatureAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortUIGameFeatureAction : public UGameFeatureAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction_ExtendMatchmakingWidget
	// Inherited from UFortUIGameFeatureAction -> UGameFeatureAction -> UObject
	// Size: 0x98 (0xC0 - 0x28)
	class UFortUIGameFeatureAction_ExtendMatchmakingWidget : public UFortUIGameFeatureAction	
	{
	public:
		TWeakObjectPtr ExtensionClass; // 0x28(0x20)
		TWeakObjectPtr ErrorVisualsClass; // 0x48(0x20)
		TWeakObjectPtr ActiveExtension; // 0x68(0x8)
		unsigned char UnknownData01_7[0x50]; // 0x70(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction_ExtendMatchmakingWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction_ExtendRankedWidget
	// Inherited from UFortUIGameFeatureAction -> UGameFeatureAction -> UObject
	// Size: 0x80 (0xA8 - 0x28)
	class UFortUIGameFeatureAction_ExtendRankedWidget : public UFortUIGameFeatureAction	
	{
	public:
		TWeakObjectPtr ExtensionClass; // 0x28(0x20)
		TArray ActiveRankedWidgetExtensions; // 0x48(0x10)
		unsigned char UnknownData01_7[0x50]; // 0x58(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction_ExtendRankedWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction_SetLobbyData
	// Inherited from UFortUIGameFeatureAction -> UGameFeatureAction -> UObject
	// Size: 0xD8 (0x100 - 0x28)
	class UFortUIGameFeatureAction_SetLobbyData : public UFortUIGameFeatureAction	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FFrontendLobbyData FrontendLobbyData; // 0x30(0xA8)
		TArray LoadedLobbyActors; // 0xD8(0x10)
		unsigned char UnknownData03_7[0x18]; // 0xE8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction_SetLobbyData");
			return ret;
		}
	};


	// Class FortniteUI.FortUISpecialEventSubsystem
	// Inherited from UGameInstanceSubsystem -> USubsystem -> UObject
	// Size: 0x28 (0x58 - 0x30)
	class UFortUISpecialEventSubsystem : public UGameInstanceSubsystem	
	{
	public:
		FMulticastInlineDelegate OnNewUISpecialEventState; // 0x30(0x10)
		FMulticastInlineDelegate OnTemporarySpecialUIEvent; // 0x40(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x50(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUISpecialEventSubsystem");
			return ret;
		}

		void SpecialUIEventDelegate__DelegateSignature(TEnumAsByte InEventName); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FF41F8
		void SetCurrentUISpecialEventState(TEnumAsByte InNewEventState); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4118
		TEnumAsByte GetCurrentUIEventState(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4038
		void CallTemporarySpecialUIEvent(TEnumAsByte InNewTemporaryEvent); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF3EF0
	};


	// Class FortniteUI.FortUIStyleDefinitionAsset
	// Inherited from UDataAsset -> UObject
	// Size: 0xDC0 (0xDF0 - 0x30)
	class UFortUIStyleDefinitionAsset : public UDataAsset	
	{
	public:
		FFortUIStyleDefinition StyleDefinition; // 0x30(0xDC0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIStyleDefinitionAsset");
			return ret;
		}
	};


	// Class FortniteUI.FortUserWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UFortUserWidget : public UUserWidget	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		bool bConsumePointerInput; // 0x2C0(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x2C1(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUserWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortUserChoiceWidget
	// Inherited from UFortUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2C8 - 0x2C8)
	class UFortUserChoiceWidget : public UFortUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUserChoiceWidget");
			return ret;
		}

		void SetChoices(FChoiceData& ChoiceItems); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x7FF414A03298
	};


	// Class FortniteUI.FortVariantChannelVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x100 (0x168 - 0x68)
	class UFortVariantChannelVM : public UMVVMViewModelBase	
	{
	public:
		TArray VariantItems; // 0x68(0x10)
		FText RowDisplayName; // 0x78(0x10)
		UFortItemVM CosmeticItem; // 0x88(0x8)
		ECosmeticVariantRowType RowType; // 0x90(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x91(0x7) UNKNOWN PROPERTY
		FMcpVariantChannelInfo VariantChannelInfo; // 0x98(0x40)
		UFortVariantItemVM SelectedVariantItem; // 0xD8(0x8)
		UFortVariantItemVM EquippedVariantItem; // 0xE0(0x8)
		bool bAllowOwnershipVisibility; // 0xE8(0x1)
		bool bShowUnownedAsLocked; // 0xE9(0x1)
		unsigned char UnknownData04_6[0x6]; // 0xEA(0x6) UNKNOWN PROPERTY
		FText DisclaimerText; // 0xF0(0x10)
		unsigned char UnknownData05_7[0x68]; // 0x100(0x68) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantChannelVM");
			return ret;
		}

		void ShowVariantEngaged(UFortVariantItemVM InVariant); // Flags: Native|Public|BlueprintCallable 0x7FF414A03538
		void HandleVariantEngaged(UFortVariantItemVM InVariant); // Flags: Native|Public|BlueprintCallable 0x7FF414A03458
		UFortVariantItemVM GetSelectedVariantItem(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A03378
	};


	// Class FortniteUI.FortVariantTiledChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x168 - 0x168)
	class UFortVariantTiledChannelVM : public UFortVariantChannelVM	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantTiledChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortRankedVariantTiledChannelVM
	// Inherited from UFortVariantTiledChannelVM -> UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x170 - 0x168)
	class UFortRankedVariantTiledChannelVM : public UFortVariantTiledChannelVM	
	{
	public:
		AFortPlayerController OwningPlayer; // 0x168(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRankedVariantTiledChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantRichColorChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x40 (0x1A8 - 0x168)
	class UFortVariantRichColorChannelVM : public UFortVariantChannelVM	
	{
	public:
		TArray ColorSwatches; // 0x168(0x10)
		UFortCosmeticRichColorVariant CachedCosmeticVariant; // 0x178(0x8)
		unsigned char UnknownData01_7[0x28]; // 0x180(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantRichColorChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantNumericChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x30 (0x198 - 0x168)
	class UFortVariantNumericChannelVM : public UFortVariantChannelVM	
	{
	public:
		UFortVariantItemVM ItemVM; // 0x168(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x170(0x10) UNKNOWN PROPERTY
		UFortCosmeticNumericalVariant NumericalVariant; // 0x180(0x8)
		FText NumDisplay; // 0x188(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantNumericChannelVM");
			return ret;
		}

		void ChangeNumericalValue(int32_t NumericalDelta); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A03618
	};


	// Class FortniteUI.FortVariantSliderChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x40 (0x1A8 - 0x168)
	class UFortVariantSliderChannelVM : public UFortVariantChannelVM	
	{
	public:
		UFortVariantItemVM ItemVM; // 0x168(0x8)
		UFortCosmeticFloatSliderVariant FloatVariant; // 0x170(0x8)
		AFortPlayerController OwningPlayer; // 0x178(0x8)
		float SliderStep; // 0x180(0x4)
		float CurrentFloatValue; // 0x184(0x4)
		float CurrentProgress; // 0x188(0x4)
		float CurrentProgressBar; // 0x18C(0x4)
		FText SliderDisplayText; // 0x190(0x10)
		bool bIsLocked; // 0x1A0(0x1)
		bool bRealTimePreviewUpdate; // 0x1A1(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x1A2(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSliderChannelVM");
			return ret;
		}

		void SetFloatValue(float InFloatValue, bool bCommit); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A036F8
	};


	// Class FortniteUI.FortVariantTextureChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x178 - 0x168)
	class UFortVariantTextureChannelVM : public UFortVariantChannelVM	
	{
	public:
		AFortPlayerController OwningPlayer; // 0x168(0x8)
		unsigned char UnknownData02_6[0x4]; // 0x170(0x4) UNKNOWN PROPERTY
		bool bShowArchivedItems; // 0x174(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x175(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantTextureChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantItemButtonMP
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x80 (0x1460 - 0x13E0)
	class UFortVariantItemButtonMP : public UCommonButtonLegacy	
	{
	public:
		unsigned char UnknownData03_3[0x10]; // 0x13E0(0x10) UNKNOWN PROPERTY
		FLinearColor LockedTintColor; // 0x13F0(0x10)
		FName IconParamName; // 0x1400(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x1404(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr VariantMaterial; // 0x1408(0x20)
		TWeakObjectPtr ExplicitlyNoneIcon; // 0x1428(0x20)
		UImage Image_VariantDisplay; // 0x1448(0x8)
		UFortApplyVarianceToInterfaceMaterialFlow MaterialVarianceFlowUI; // 0x1450(0x8)
		unsigned char UnknownData05_7[0x8]; // 0x1458(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantItemButtonMP");
			return ret;
		}

		void SetupVariantPreviewImage(); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF414A038B8
		UFortVariantItemVM GetAssociatedVariant(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A037D8
	};


	// Class FortniteUI.FortVariantItemVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0xC8 (0x130 - 0x68)
	class UFortVariantItemVM : public UMVVMViewModelBase	
	{
	public:
		UFortItemVM CosmeticItem; // 0x68(0x8)
		UFortApplyVarianceToInterfaceMaterialFlow MaterialVarianceFlowUI; // 0x70(0x8)
		UMaterialInterface OriginalMaterial; // 0x78(0x8)
		bool bOwned; // 0x80(0x1)
		bool bEquipped; // 0x81(0x1)
		bool bDisabled; // 0x82(0x1)
		bool bHasConflict; // 0x83(0x1)
		bool bIsOwnershipVisibilityAllowed; // 0x84(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		FGameplayTag VariantChannel; // 0x88(0x4)
		FGameplayTag VariantTag; // 0x8C(0x4)
		FString VariantCustomData; // 0x90(0x10)
		FVariantDisplayInfo VariantDisplayInfo; // 0xA0(0x38)
		FText ConflictingText; // 0xD8(0x10)
		bool bIsConflicting; // 0xE8(0x1)
		unsigned char UnknownData05_6[0x7]; // 0xE9(0x7) UNKNOWN PROPERTY
		FText AgeGateText; // 0xF0(0x10)
		bool bHasAgeGate; // 0x100(0x1)
		bool bShowUnownedAsLocked; // 0x101(0x1)
		unsigned char UnknownData06_6[0x6]; // 0x102(0x6) UNKNOWN PROPERTY
		FText UnlockRequirements; // 0x108(0x10)
		bool bIsLocked; // 0x118(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x119(0x7) UNKNOWN PROPERTY
		FText DisclaimerText; // 0x120(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantItemVM");
			return ret;
		}

		void ApplyMaterialVariance(UImage Image); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A03998
	};


	// Class FortniteUI.FortVariantRichColorItemVM
	// Inherited from UFortVariantItemVM -> UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x140 - 0x130)
	class UFortVariantRichColorItemVM : public UFortVariantItemVM	
	{
	public:
		FText ColorName; // 0x130(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantRichColorItemVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantTextureItemVM
	// Inherited from UFortVariantItemVM -> UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x138 - 0x130)
	class UFortVariantTextureItemVM : public UFortVariantItemVM	
	{
	public:
		UAthenaCosmeticItemDefinition VariantCosmeticDef; // 0x130(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantTextureItemVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantRankedItemVM
	// Inherited from UFortVariantItemVM -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UFortVariantRankedItemVM : public UFortVariantItemVM	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantRankedItemVM");
			return ret;
		}

		void OnRankUpdated(int32_t InNewRank, uint32_t InPlayerId); // Flags: Final|Native|Public 0x7FF414A03A78
	};


	// Class FortniteUI.FortVariantSelectorFilterVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0xA0 (0x108 - 0x68)
	class UFortVariantSelectorFilterVM : public UMVVMViewModelBase	
	{
	public:
		FText Label; // 0x68(0x10)
		UFortVariantSelectorSubFilterVM MainFilter; // 0x78(0x8)
		FFortVariantFilterTabInfo_Primary PrimaryFilterInfo; // 0x80(0x88)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSelectorFilterVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantSelectorSubFilterVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0xA8 (0x110 - 0x68)
	class UFortVariantSelectorSubFilterVM : public UMVVMViewModelBase	
	{
	public:
		unsigned char UnknownData01_3[0x78]; // 0x68(0x78) UNKNOWN PROPERTY
		TWeakObjectPtr Icon; // 0xE0(0x20)
		FText Label; // 0x100(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSelectorSubFilterVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantSelectorVM
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x198 (0x208 - 0x70)
	class UFortVariantSelectorVM : public UFortPerUserViewModel	
	{
	public:
		TMap ProductOverrideChannels; // 0x70(0x50)
		UAthenaVariantPickerConfig ConfigurationData; // 0xC0(0x8)
		TArray PrimaryFilters; // 0xC8(0x10)
		TArray SecondaryFilters; // 0xD8(0x10)
		TArray VariantSets; // 0xE8(0x10)
		unsigned char UnknownData05_6[0x10]; // 0xF8(0x10) UNKNOWN PROPERTY
		TArray CurrentVariantOverrides; // 0x108(0x10)
		UFortLockerCategoryItemVM SelectedCategory; // 0x118(0x8)
		UFortItemVM SelectedItem; // 0x120(0x8)
		UFortVariantItemVM InspectedVariantItemVM; // 0x128(0x8)
		TArray VariantChannels; // 0x130(0x10)
		unsigned char UnknownData06_6[0x30]; // 0x140(0x30) UNKNOWN PROPERTY
		UFortVariantSelectorFilterVM CurrentPrimaryFilter; // 0x170(0x8)
		UFortVariantSelectorSubFilterVM CurrentSecondaryFilter; // 0x178(0x8)
		unsigned char UnknownData07_6[0x50]; // 0x180(0x50) UNKNOWN PROPERTY
		bool bAllowDisplayUnownedVariants; // 0x1D0(0x1)
		unsigned char UnknownData08_6[0x1]; // 0x1D1(0x1) UNKNOWN PROPERTY
		bool bShowUnownedAsLocked; // 0x1D2(0x1)
		bool bShowAgeGateWarnings; // 0x1D3(0x1)
		bool bShowFilterFullSize; // 0x1D4(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x1D5(0x3) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnVariantEngagedEvent; // 0x1D8(0x10)
		FMulticastInlineDelegate OnVariantOverridesChangedEvent; // 0x1E8(0x10)
		FMulticastInlineDelegate OnRotationRequestedEvent; // 0x1F8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSelectorVM");
			return ret;
		}

		void UpdateVariantChannels(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4C78
		void UpdateVariantChannelConflicts(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4B98
		void SetShowArchivedVariants(bool bShow); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4AB8
		void SetSelectedItem(UFortItemVM InSelectedItem); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF49D8
		void SetSelectedCategory(UFortLockerCategoryItemVM InSelectedCategory); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF48F8
		void SetCurrentSecondaryFilter(UFortVariantSelectorSubFilterVM InCurrentSecondaryFilter); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4818
		void SetCurrentPrimaryFilter(UFortVariantSelectorFilterVM InCurrentPrimaryFilter); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4738
		void SetConfigurationData(UAthenaVariantPickerConfig InConfigurationData); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF4658
		void OnVariantOverridesChangedEvent__DelegateSignature(TArray& InVariantOverridesInfo); // Flags: MulticastDelegate|Public|Delegate|HasOutParms 0x7FF413FF4578
		void OnVariantChangedEvent__DelegateSignature(FMcpVariantChannelInfo& InChannelInfo); // Flags: MulticastDelegate|Public|Delegate|HasOutParms 0x7FF413FF4498
		void OnRotationRequestedEvent__DelegateSignature(FRotator& RotationOffset, bool bSnap); // Flags: MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults 0x7FF413FF43B8
		void DismissVariantChannels(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF42D8
	};


	// Class FortniteUI.FortVariantSetVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x30 (0x98 - 0x68)
	class UFortVariantSetVM : public UMVVMViewModelBase	
	{
	public:
		TArray VariantChannels; // 0x68(0x10)
		ECosmeticVariantRowType RowType; // 0x78(0x1)
		unsigned char UnknownData01_7[0x1F]; // 0x79(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSetVM");
			return ret;
		}

		void HandleRotationRequested(FRotator& RotationOffset, bool bSnap); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF414A03C38
		ECosmeticVariantRowType GetRowType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A03B58
	};


	// Class FortniteUI.FortVehicleFuelGauge
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1F8 (0x4B0 - 0x2B8)
	class UFortVehicleFuelGauge : public UUserWidget	
	{
	public:
		unsigned char UnknownData02_3[0x1A8]; // 0x2B8(0x1A8) UNKNOWN PROPERTY
		UMaterialInstanceDynamic ImageSecondaryMeterMaterial; // 0x460(0x8)
		FName ImageMeterFillParamName; // 0x468(0x4)
		FName SecondaryMeterFillLineColorParamName; // 0x46C(0x4)
		FLinearColor SecondaryMeterFillLineColorDefault; // 0x470(0x10)
		FLinearColor SecondaryMeterFillLineColorLowFuel; // 0x480(0x10)
		UOverlay Overlay_Meter; // 0x490(0x8)
		UOverlay Overlay_FuelIcon; // 0x498(0x8)
		UImage Image_MeterIconGlow; // 0x4A0(0x8)
		unsigned char UnknownData03_7[0x8]; // 0x4A8(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVehicleFuelGauge");
			return ret;
		}

		void UpdateFuelChanged(float FuelPercent, bool bIsFuelLow); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A044F8
		void ShowInfiniteFuel(bool bHasInfiniteFuel); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x7FF414A04418
		void SetMeterOverlayVisibility(ESlateVisibility NewVisibility); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A04338
		void SetIconOverlayVisibility(ESlateVisibility NewVisibility); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A04258
		void OnVehicleUpdated(AFortAthenaVehicle NewVehicle); // Flags: Event|Public|BlueprintEvent 0x7FF414A04178
		void OnTankFull(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent 0x7FF414A04098
		void OnRefuelingCosmeticsStarted(); // Flags: Native|Event|Public|BlueprintEvent 0x7FF414A03FB8
		void OnRefuelingCosmeticsFinished(bool bIsFuelLow); // Flags: Native|Event|Public|BlueprintEvent 0x7FF414A03ED8
		float GetCurrentFuelValue(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A03DF8
		void BP_HandleExtensionWidgetCreated(UUserWidget Widget, EUIExtensionSlot SlotType); // Flags: Event|Protected|BlueprintEvent 0x7FF414A03D18
	};


	// Class FortniteUI.FortVideoWidgetBase
	// Inherited from UEpicMediaVideoWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x4E0 - 0x4A0)
	class UFortVideoWidgetBase : public UEpicMediaVideoWidgetBase	
	{
	public:
		FMulticastInlineDelegate MediaPreEndEvent; // 0x4A0(0x10)
		UFortMediaSubtitlesPlayer SubtitlePlayer; // 0x4B0(0x8)
		ULocalizedOverlays SubtitleOverlays; // 0x4B8(0x8)
		USubtitleDisplay Subtitles; // 0x4C0(0x8)
		unsigned char UnknownData01_7[0x18]; // 0x4C8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVideoWidgetBase");
			return ret;
		}

		void SetMediaPreEndTimeSeconds(float InSeconds); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A045D8
	};


	// Class FortniteUI.FortViewModelsManager
	// Inherited from UGameInstanceSubsystem -> USubsystem -> UObject
	// Size: 0xF0 (0x120 - 0x30)
	class UFortViewModelsManager : public UGameInstanceSubsystem	
	{
	public:
		TMap ViewModelCache; // 0x30(0x50)
		unsigned char UnknownData01_7[0xA0]; // 0x80(0xA0) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortViewModelsManager");
			return ret;
		}
	};


	// Class FortniteUI.FortWeaponReticleRechargeStackBasePipBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2C0 - 0x2B8)
	class UFortWeaponReticleRechargeStackBasePipBase : public UUserWidget	
	{
	public:
		UImage ImagePip; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortWeaponReticleRechargeStackBasePipBase");
			return ret;
		}

		void SetPipProgressColor(FLinearColor Color, FName PipColorMatParamName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF414A04878
		void SetImagePip(UImage Image); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF414A04798
		void SetFillPercent(float FillPercent, FName PipPercentMatParamName); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent 0x7FF414A046B8
	};


	// Class FortniteUI.FortWeaponReticleRechargeStackBasePipCollectionBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UFortWeaponReticleRechargeStackBasePipCollectionBase : public UUserWidget	
	{
	public:
		UDynamicEntryBox PipDynamicEntryBox; // 0x2B8(0x8)
		int32_t CurrentCount; // 0x2C0(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2C4(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortWeaponReticleRechargeStackBasePipCollectionBase");
			return ret;
		}

		void UpdateRemainingRechargeTimeAtIndex(float FillPercent, int32_t Index, FName PipPercentMatParamName, bool ShouldSetPipColor, FLinearColor NotReadyColor, FLinearColor ReadyColor, FName PipColorMatParamName); // Flags: Final|Native|Protected|HasDefaults|BlueprintCallable 0x7FF414A04DB8
		void UpdateRemainingRechargeTime(float TimeRemaining, float TotalDuration, FName PipPercentMatParamName, bool ShouldSetPipColor, FLinearColor NotReadyColor, FLinearColor ReadyColor, FName PipColorMatParamName); // Flags: Final|Native|Protected|HasDefaults|BlueprintCallable 0x7FF414A04CD8
		void SetPipColor(float Progress, int32_t Index, FLinearColor NotReadyColor, FLinearColor ReadyColor, FName PipColorMatParamName); // Flags: Final|Native|Protected|HasDefaults|BlueprintCallable 0x7FF414A04BF8
		void SetDynamicEntryBox(UDynamicEntryBox DynamicEntryBox); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF414A04B18
		UDynamicEntryBox GetDynamicEntryBox(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A04A38
		int32_t GetCurrentCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A04958
	};


	// Class FortniteUI.GamePhaseWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x328 - 0x320)
	class UGamePhaseWidget : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x320(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.GamePhaseWidget");
			return ret;
		}

		void OnMinigameStateChanged(AFortMinigame Minigame, EFortMinigameState NewMinigameState); // Flags: Native|Protected 0x7FF414A05058
		void OnMinigameReady(AFortMinigame Minigame); // Flags: Event|Protected|BlueprintEvent 0x7FF414A04F78
		void MinigameStateChangedEvent(AFortMinigame Minigame, EFortMinigameState NewMinigameState); // Flags: Event|Protected|BlueprintEvent 0x7FF414A04E98
	};


	// Class FortniteUI.GameStateComponent_PlayerFeedback
	// Inherited from UGameStateComponent -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x0 (0xA0 - 0xA0)
	class UGameStateComponent_PlayerFeedback : public UGameStateComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.GameStateComponent_PlayerFeedback");
			return ret;
		}
	};


	// Class FortniteUI.HudBindingCheckInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UHudBindingCheckInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HudBindingCheckInterface");
			return ret;
		}

		void ShowBindWidgets(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent 0x7FF414A053D8
		bool ShouldShowPromptInHud(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent 0x7FF414A052F8
		void HideBindWidgets(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent 0x7FF414A05218
		void GetBindActions(TArray& OutActions); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x7FF414A05138
	};


	// Class FortniteUI.HUDLayoutToolV2_WidgetPreview
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x328 - 0x2E0)
	class UHUDLayoutToolV2_WidgetPreview : public UCommonUserWidget	
	{
	public:
		UCreateHUDWidgetDragDropOperation CreateHUDWidgetOperation; // 0x2E0(0x8)
		unsigned char UnknownData02_6[0x10]; // 0x2E8(0x10) UNKNOWN PROPERTY
		float DragDistanceThresholdMillimeters; // 0x2F8(0x4)
		unsigned char UnknownData03_6[0x1C]; // 0x2FC(0x1C) UNKNOWN PROPERTY
		UCommonTextBlock TextBlock_InstancesLeftCounter; // 0x318(0x8)
		UBorder Border_Background; // 0x320(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDLayoutToolV2_WidgetPreview");
			return ret;
		}

		void HandleOperationDrop(UDragDropOperation Operation); // Flags: Final|Native|Private 0x7FF414A054B8
	};


	// Class FortniteUI.HUDLayoutToolV2_AutorunPreview
	// Inherited from UHUDLayoutToolV2_WidgetPreview -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x330 - 0x328)
	class UHUDLayoutToolV2_AutorunPreview : public UHUDLayoutToolV2_WidgetPreview	
	{
	public:
		UOverlay Overlay_AutorunLockZone; // 0x328(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDLayoutToolV2_AutorunPreview");
			return ret;
		}
	};


	// Class FortniteUI.HUDLayoutToolV2_MoveStickPreview
	// Inherited from UHUDLayoutToolV2_WidgetPreview -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x338 - 0x328)
	class UHUDLayoutToolV2_MoveStickPreview : public UHUDLayoutToolV2_WidgetPreview	
	{
	public:
		UOverlay Overlay_ImprovedMoveStick; // 0x328(0x8)
		UOverlay Overlay_OriginalMoveStick; // 0x330(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDLayoutToolV2_MoveStickPreview");
			return ret;
		}
	};


	// Class FortniteUI.InteractionRadialBacchusButton
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x338 - 0x320)
	class UInteractionRadialBacchusButton : public UFortHUDElementWidget	
	{
	public:
		UImage Timer_Image; // 0x320(0x8)
		UWidgetAnimation RadialTimerAnimation; // 0x328(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x330(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.InteractionRadialBacchusButton");
			return ret;
		}

		void OnInteractionTimerChanged(AActor TrackedActor, float duration, float Remaining); // Flags: Final|Native|Private 0x7FF414A05598
	};


	// Class FortniteUI.ItemCostWidgetBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE8 (0x3A0 - 0x2B8)
	class UItemCostWidgetBase : public UUserWidget	
	{
	public:
		UBorder RarityBorder; // 0x2B8(0x8)
		UHorizontalBox ResourceWidgetsContainer; // 0x2C0(0x8)
		bool bShowRarityData : 1; // 0x2C8:0(0x1)
		bool bUseBackgroundForAffordabilityFeedback : 1; // 0x2C8:1(0x1)
		unsigned char UnknownData02_5[0x7]; // 0x2C9(0x7) UNKNOWN PROPERTY
		TArray ResourceWidgets; // 0x2D0(0x10)
		unsigned char UnknownData03_7[0xC0]; // 0x2E0(0xC0) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ItemCostWidgetBase");
			return ret;
		}

		void SetRarityData(FFortRarityItemData& RarityData); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF414A05838
		void SetItemCostInternal(TMap& Costs); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable 0x7FF414A05758
		UFortResourceWidget CreateResourceCountWidget(bool bInUseBackgroundForAffordabilityFeedback, TEnumAsByte ResourceType); // Flags: Event|Protected|BlueprintEvent 0x7FF414A05678
	};


	// Class FortniteUI.ItemShopPreviewData
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UItemShopPreviewData : public UObject	
	{
	public:
		UFortItemVM ItemVM; // 0x28(0x8)
		unsigned char UnknownData01_7[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ItemShopPreviewData");
			return ret;
		}

		bool HasLoadoutOverride(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A05918
	};


	// Class FortniteUI.LastKillerInfoExtensionWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class ULastKillerInfoExtensionWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.LastKillerInfoExtensionWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.MobileHUDElementCanvas
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x370 - 0x350)
	class UMobileHUDElementCanvas : public UFortMobileHUDElement	
	{
	public:
		UClass HUDElementClassToCreate; // 0x350(0x8)
		UFortMobileHUDElement CreatedWidget; // 0x358(0x8)
		UCanvasPanelSlot AsCanvasPanelSlot; // 0x360(0x8)
		UCanvasPanel CanvasPanel_Wrapper; // 0x368(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MobileHUDElementCanvas");
			return ret;
		}
	};


	// Class FortniteUI.MotdActionBase
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UMotdActionBase : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdActionBase");
			return ret;
		}

		bool ShouldCloseWidget(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A05AD8
		void CallToAction(AFortPlayerController PlayerController); // Flags: Native|Public|BlueprintCallable 0x7FF414A059F8
	};


	// Class FortniteUI.PrmChannel
	// Inherited from UObject
	// Size: 0x80 (0xA8 - 0x28)
	class UPrmChannel : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x80]; // 0x28(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.PrmChannel");
			return ret;
		}
	};


	// Class FortniteUI.MotdChannel
	// Inherited from UPrmChannel -> UObject
	// Size: 0xB8 (0x160 - 0xA8)
	class UMotdChannel : public UPrmChannel	
	{
	public:
		unsigned char UnknownData01_1[0xB8]; // 0xA8(0xB8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdChannel");
			return ret;
		}
	};


	// Class FortniteUI.MotdDiscoveryAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x20 (0x50 - 0x30)
	class UMotdDiscoveryAction : public UMotdActionBase	
	{
	public:
		unsigned char UnknownData01_1[0x20]; // 0x30(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdDiscoveryAction");
			return ret;
		}
	};


	// Class FortniteUI.MotdDiscoverySearchAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UMotdDiscoverySearchAction : public UMotdActionBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdDiscoverySearchAction");
			return ret;
		}
	};


	// Class FortniteUI.MotdIslandSelectAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x18 (0x48 - 0x30)
	class UMotdIslandSelectAction : public UMotdActionBase	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdIslandSelectAction");
			return ret;
		}
	};


	// Class FortniteUI.MotdListViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xA0 - 0x68)
	class UMotdListViewModel : public UMVVMViewModelBase	
	{
	public:
		TArray Motds; // 0x68(0x10)
		TArray MotdCache; // 0x78(0x10)
		unsigned char UnknownData01_7[0x18]; // 0x88(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdListViewModel");
			return ret;
		}
	};


	// Class FortniteUI.MotdNavigateToLockerAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UMotdNavigateToLockerAction : public UMotdActionBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdNavigateToLockerAction");
			return ret;
		}
	};


	// Class FortniteUI.MotdSettingsAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x18 (0x48 - 0x30)
	class UMotdSettingsAction : public UMotdActionBase	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdSettingsAction");
			return ret;
		}
	};


	// Class FortniteUI.MotdVideoAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x60 (0x90 - 0x30)
	class UMotdVideoAction : public UMotdActionBase	
	{
	public:
		FMulticastInlineDelegate VideoEnded; // 0x30(0x10)
		FMulticastInlineDelegate VideoStarted; // 0x40(0x10)
		unsigned char UnknownData01_7[0x40]; // 0x50(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdVideoAction");
			return ret;
		}

		void HandleMotdVideoTerminalError(EBaseMediaTerminalErrorReason Reason); // Flags: Final|Native|Private 0x7FF414A05D78
		void HandleMotdVideoEnded(); // Flags: Final|Native|Private 0x7FF414A05C98
		void HandleMotdVideoClosed(); // Flags: Final|Native|Private 0x7FF414A05BB8
	};


	// Class FortniteUI.MotdViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x108 (0x170 - 0x68)
	class UMotdViewModel : public UMVVMViewModelBase	
	{
	public:
		FText FullScreenTitle; // 0x68(0x10)
		FText FullScreenBody; // 0x78(0x10)
		FText TeaserTitle; // 0x88(0x10)
		FMotdBackground FullScreenBackground; // 0x98(0x48)
		FMotdBackground TeaserBackground; // 0xE0(0x48)
		TArray Buttons; // 0x128(0x10)
		bool bIsVerticalTextLayout; // 0x138(0x1)
		unsigned char UnknownData01_7[0x37]; // 0x139(0x37) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdViewModel");
			return ret;
		}

		bool HasTeaserVideoBackground(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A05F38
		bool HasFullScreenVideoBackground(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A05E58
	};


	// Class FortniteUI.MultiInteractDisplayWidgetBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x300 - 0x2E0)
	class UMultiInteractDisplayWidgetBase : public UCommonUserWidget	
	{
	public:
		UCommonVisibilitySwitcher VisibilitySwitcher; // 0x2E0(0x8)
		UHorizontalBox HorBoxInteractionIconContainer; // 0x2E8(0x8)
		UTextBlock Text_InteractionCount; // 0x2F0(0x8)
		bool bTextVersion; // 0x2F8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x2F9(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MultiInteractDisplayWidgetBase");
			return ret;
		}

		void CheckCurrentInteractionCount(int32_t CurrentCount); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A06018
	};


	// Class FortniteUI.NamedSettingAction
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UNamedSettingAction : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingActionCollection
	// Inherited from UDataAsset -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UNamedSettingActionCollection : public UDataAsset	
	{
	public:
		TMap NamedSettingActions; // 0x30(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingActionCollection");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_PushWidgetAsActivatablePanel
	// Inherited from UNamedSettingAction -> UObject
	// Size: 0x28 (0x50 - 0x28)
	class UNamedSettingAction_PushWidgetAsActivatablePanel : public UNamedSettingAction	
	{
	public:
		TWeakObjectPtr ModalWidgetClass; // 0x28(0x20)
		bool bSuspendUntilComplete; // 0x48(0x1)
		EActivatePanelOption Header; // 0x49(0x1)
		EActivatePanelOption Footer; // 0x4A(0x1)
		EActivatePanelOption ChatWidget; // 0x4B(0x1)
		unsigned char UnknownData01_7[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_PushWidgetAsActivatablePanel");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_ColorCalibration
	// Inherited from UNamedSettingAction_PushWidgetAsActivatablePanel -> UNamedSettingAction -> UObject
	// Size: 0x8 (0x58 - 0x50)
	class UNamedSettingAction_ColorCalibration : public UNamedSettingAction_PushWidgetAsActivatablePanel	
	{
	public:
		bool bSetupForColorConfiguration; // 0x50(0x1)
		bool bSetupForFullRangeTest; // 0x51(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x52(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_ColorCalibration");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_InputPresets
	// Inherited from UNamedSettingAction -> UObject
	// Size: 0x58 (0x80 - 0x28)
	class UNamedSettingAction_InputPresets : public UNamedSettingAction	
	{
	public:
		TWeakObjectPtr WeakSettingWidget; // 0x28(0x8)
		TWeakObjectPtr WeakFortPlayerController; // 0x30(0x8)
		TWeakObjectPtr WeakInstigatorSetting; // 0x38(0x8)
		TWeakObjectPtr ModalWidgetClass; // 0x40(0x20)
		bool bSuspendUntilComplete; // 0x60(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x61(0x7) UNKNOWN PROPERTY
		FText DialogTitle; // 0x68(0x10)
		FName ConfirmAction; // 0x78(0x4)
		FName DeclineAction; // 0x7C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_InputPresets");
			return ret;
		}

		void HandleConfirmationDialogResult(EFortDialogResult Result, FName ResultName); // Flags: Native|Protected 0x7FF414A060F8
	};


	// Class FortniteUI.NamedSettingAction_ControllerPresets
	// Inherited from UNamedSettingAction_InputPresets -> UNamedSettingAction -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UNamedSettingAction_ControllerPresets : public UNamedSettingAction_InputPresets	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_ControllerPresets");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_KeyboardPresets
	// Inherited from UNamedSettingAction_InputPresets -> UNamedSettingAction -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UNamedSettingAction_KeyboardPresets : public UNamedSettingAction_InputPresets	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_KeyboardPresets");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_PushModalWidget
	// Inherited from UNamedSettingAction -> UObject
	// Size: 0x28 (0x50 - 0x28)
	class UNamedSettingAction_PushModalWidget : public UNamedSettingAction	
	{
	public:
		TWeakObjectPtr ModalWidgetClass; // 0x28(0x20)
		bool bSuspendUntilComplete; // 0x48(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_PushModalWidget");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_SafeZone
	// Inherited from UNamedSettingAction_PushModalWidget -> UNamedSettingAction -> UObject
	// Size: 0x0 (0x50 - 0x50)
	class UNamedSettingAction_SafeZone : public UNamedSettingAction_PushModalWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_SafeZone");
			return ret;
		}
	};


	// Class FortniteUI.NamedSettingAction_ViewPurchaseHistory
	// Inherited from UNamedSettingAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UNamedSettingAction_ViewPurchaseHistory : public UNamedSettingAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.NamedSettingAction_ViewPurchaseHistory");
			return ret;
		}
	};


	// Class FortniteUI.PrmSurface
	// Inherited from UObject
	// Size: 0xA8 (0xD0 - 0x28)
	class UPrmSurface : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0xA8]; // 0x28(0xA8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.PrmSurface");
			return ret;
		}
	};


	// Class FortniteUI.PrmMotdSurface
	// Inherited from UPrmSurface -> UObject
	// Size: 0x120 (0x1F0 - 0xD0)
	class UPrmMotdSurface : public UPrmSurface	
	{
	public:
		unsigned char UnknownData01_1[0x120]; // 0xD0(0x120) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.PrmMotdSurface");
			return ret;
		}
	};


	// Class FortniteUI.ProductModeUserFacingData
	// Inherited from UObject
	// Size: 0x50 (0x78 - 0x28)
	class UProductModeUserFacingData : public UObject	
	{
	public:
		TMap ProductModeValueMap; // 0x28(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ProductModeUserFacingData");
			return ret;
		}
	};


	// Class FortniteUI.RebootRallyQRCode
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x1390 - 0x1390)
	class URebootRallyQRCode : public UCommonButtonBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.RebootRallyQRCode");
			return ret;
		}

		void SetIsInvite(bool bIsInvite); // Flags: Event|Public|BlueprintEvent 0x7FF414A061D8
	};


	// Class FortniteUI.ScrollableActivatableWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x418 - 0x3F8)
	class UScrollableActivatableWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData01_1[0x20]; // 0x3F8(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ScrollableActivatableWidget");
			return ret;
		}

		void TransitionToFullscreen(bool bIsFullscreen); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A06558
		bool IsFullscreen(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414A06478
		void HandleSwipeUp(); // Flags: Event|Public|BlueprintEvent 0x7FF414A06398
		void HandleSwipeDown(); // Flags: Event|Public|BlueprintEvent 0x7FF414A062B8
	};


	// Class FortniteUI.SettingCategoryNavigator
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x318 - 0x2E0)
	class USettingCategoryNavigator : public UCommonUserWidget	
	{
	public:
		UObject SelectedItem; // 0x2E0(0x8)
		unsigned char UnknownData01_6[0x20]; // 0x2E8(0x20) UNKNOWN PROPERTY
		UListView ListView_Categories; // 0x308(0x8)
		UWidgetAnimation CollapseNavigatorAnim; // 0x310(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingCategoryNavigator");
			return ret;
		}

		void OnInputMethodChanged(ECommonInputType CurrentInput); // Flags: Final|Native|Private 0x7FF414A067F8
		void BP_ExpandNavigator(bool bInstant); // Flags: Event|Protected|BlueprintEvent 0x7FF414A06718
		void BP_CollapseNavigator(bool bInstant); // Flags: Event|Protected|BlueprintEvent 0x7FF414A06638
	};


	// Class FortniteUI.SettingsScreenTabSchemaCollection
	// Inherited from UDataAsset -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class USettingsScreenTabSchemaCollection : public UDataAsset	
	{
	public:
		TMap TabSchemaCollection; // 0x30(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsScreenTabSchemaCollection");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_Disabled
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_Disabled : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_Disabled");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyGameplayTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyGameplayTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyGameplayTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyGameUITabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyGameUITabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyGameUITabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyAudioTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyAudioTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyAudioTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyVideoTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyVideoTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyVideoTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyTouchAndMotionTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyTouchAndMotionTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyTouchAndMotionTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyTouchWeaponTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyTouchWeaponTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyTouchWeaponTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyMouseAndKeyboardTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyMouseAndKeyboardTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyMouseAndKeyboardTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyControllerTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyControllerTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyControllerTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyKeyboardKeybindingsTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyKeyboardKeybindingsTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyKeyboardKeybindingsTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyControllerKeybindingsTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyControllerKeybindingsTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyControllerKeybindingsTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SettingsTabDisplayCondition_LegacyAccountTabCondition
	// Inherited from USettingsTabDisplayCondition -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USettingsTabDisplayCondition_LegacyAccountTabCondition : public USettingsTabDisplayCondition	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsTabDisplayCondition_LegacyAccountTabCondition");
			return ret;
		}
	};


	// Class FortniteUI.SidebarListEmptyPanelButton
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x13A0 - 0x1390)
	class USidebarListEmptyPanelButton : public UCommonButtonBase	
	{
	public:
		UCommonTextBlock ButtonText; // 0x1390(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x1398(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SidebarListEmptyPanelButton");
			return ret;
		}
	};


	// Class FortniteUI.AthenaSpatialStyleChallengeScreenData
	// Inherited from UDataAsset -> UObject
	// Size: 0x18 (0x48 - 0x30)
	class UAthenaSpatialStyleChallengeScreenData : public UDataAsset	
	{
	public:
		TArray CharacterStyleChallenges; // 0x30(0x10)
		UFortChallengeBundleScheduleDefinition CharacterStyleChallengesSchedule; // 0x40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaSpatialStyleChallengeScreenData");
			return ret;
		}
	};


	// Class FortniteUI.SpatialWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USpatialWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SpatialWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortSubscriptionContentInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortSubscriptionContentInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSubscriptionContentInterface");
			return ret;
		}
	};


	// Class FortniteUI.ThresholdScrollBox
	// Inherited from UScrollBox -> UPanelWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0xB40 - 0xB38)
	class UThresholdScrollBox : public UScrollBox	
	{
	public:
		float ScrollThreshold; // 0xB38(0x4)
		unsigned char UnknownData01_7[0x4]; // 0xB3C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ThresholdScrollBox");
			return ret;
		}
	};


	// Class FortniteUI.TimerDeviceConversionFunctions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTimerDeviceConversionFunctions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.TimerDeviceConversionFunctions");
			return ret;
		}

		FSlateColor GetSlateColorFromRemainingSeconds(int32_t RemainingSeconds, int32_t SecondsThreshold, FLinearColor FirstColor, FLinearColor SecondColor); // Flags: Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF414A06D38
		FSlateColor GetSlateColorFromMappedSecondsRange(int32_t RemainingSeconds, int32_t Start, int32_t End, FLinearColor FirstValue, FLinearColor LastValue); // Flags: Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF414A06C58
		float GetFloatFromRemainingSeconds(int32_t RemainingSeconds, int32_t SecondsThreshold, float FirstValue, float SecondValue); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF414A06B78
		float GetFloatFromMappedSecondsRange(int32_t RemainingSeconds, int32_t Start, int32_t End, float FirstValue, float LastValue); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF414A06A98
		FLinearColor GetColorFromRemainingSeconds(int32_t RemainingSeconds, int32_t SecondsThreshold, FLinearColor FirstColor, FLinearColor SecondColor); // Flags: Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF414A069B8
		FLinearColor GetColorFromMappedSecondsRange(int32_t RemainingSeconds, int32_t Start, int32_t End, FLinearColor FirstValue, FLinearColor LastValue); // Flags: Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF414A068D8
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar
	// Inherited from UFortMobileHUDWidgetCustomPropertyModel -> UObject
	// Size: 0x28 (0x80 - 0x58)
	class UFortMobileHUDWidgetCustomPropertyModel_Scalar : public UFortMobileHUDWidgetCustomPropertyModel	
	{
	public:
		double DefaultValue; // 0x58(0x8)
		double PropertyLowerBound; // 0x60(0x8)
		double PropertyUpperBound; // 0x68(0x8)
		double PropertyStepSize; // 0x70(0x8)
		EFormatStyle FormatStyle; // 0x78(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x79(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference
	// Inherited from UFortMobileHUDWidgetCustomPropertyModel_Scalar -> UFortMobileHUDWidgetCustomPropertyModel -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UFortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Scalar	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Scalar_AutorunPreference");
			return ret;
		}
	};


	// Class FortniteUI.UIKitBlock
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x2E8 - 0x2B8)
	class UUIKitBlock : public UUserWidget	
	{
	public:
		FUIKitBlockTiming TransitionTiming; // 0x2B8(0x2C)
		unsigned char UnknownData01_7[0x4]; // 0x2E4(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitBlock");
			return ret;
		}

		void SetBlockTiming(FUIKitBlockTiming& Timing); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF414A08078
		void RequestTransition(EUIKitBlockVisualState State); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A07F98
		void RequestInstantTransition(EUIKitBlockInstantTransitionState State); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A07EB8
		void PlayTransition(UWidgetAnimation Animation, bool bPlayForward); // Flags: Final|Native|Public|BlueprintCallable 0x7FF414A07DD8
		void OnTransitionUnhoveredRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07CF8
		void OnTransitionUnfocusedRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07C18
		void OnTransitionSelectedRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07B38
		void OnTransitionReleasedRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07A58
		void OnTransitionPressedRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07978
		void OnTransitionHoveredRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07898
		void OnTransitionFocusedRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A077B8
		void OnTransitionEnabledRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A076D8
		void OnTransitionDisabledRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A075F8
		void OnTransitionDeselectedIdleRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07518
		void OnTransitionDeselectedFocusedRequested(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07438
		void OnInstantTransitionToUnlocked(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07358
		void OnInstantTransitionToSelected(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07278
		void OnInstantTransitionToLocked(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A07198
		void OnInstantTransitionToEnabled(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A070B8
		void OnInstantTransitionToDisabled(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A06FD8
		void OnInstantTransitionToDeselected(); // Flags: Event|Protected|BlueprintEvent 0x7FF414A06EF8
		float GetTransitionTime(EUIKitBlockVisualState State); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure 0x7FF414A06E18
	};


	// Class FortniteUI.UIKitBlueprintFunctionLibrary
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UUIKitBlueprintFunctionLibrary : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitBlueprintFunctionLibrary");
			return ret;
		}

		FVector2f TrackedInputPointer_GetScreenSpacePosition(FTrackedInputPointer& TrackedInput); // Flags: Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF414A08238
		void PlayAnimationDuringTime(UUserWidget Widget, UWidgetAnimation Animation, float PlayTime, bool bPlayForward); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF414A08158
	};


	// Class FortniteUI.UIKitModularButton
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x13B0 - 0x1390)
	class UUIKitModularButton : public UCommonButtonBase	
	{
	public:
		TArray ModularBlocks; // 0x1390(0x10)
		bool bEnableOnClickedAnalytics; // 0x13A0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x13A1(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitModularButton");
			return ret;
		}

		void UnregisterModularBlock(UUIKitBlock bLock); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140DB6E8
		void UnregisterAllModularBlocks(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140DB608
		void SetBlocksTiming(FUIKitBlockTiming& Timing); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable 0x7FF4140DB468
		void RequestTransitionOnBlocks(EUIKitBlockVisualState State); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140DB388
		void RequestInstantTransitionOnBlocks(EUIKitBlockInstantTransitionState State); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140DB2A8
		void RegisterModularBlock(UUIKitBlock bLock); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140DB1C8
	};


	// Class FortniteUI.UIKitHoldableModularButton
	// Inherited from UUIKitModularButton -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE8 (0x1490 - 0x13A8)
	class UUIKitHoldableModularButton : public UUIKitModularButton	
	{
	public:
		UClass HoldInputData; // 0x13A8(0x8)
		FMulticastInlineDelegate OnModularButtonHoldTriggered; // 0x13B0(0x10)
		bool bHoldConsumeInput; // 0x13C0(0x1)
		unsigned char UnknownData01_7[0xCF]; // 0x13C1(0xCF) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitHoldableModularButton");
			return ret;
		}

		FEventReply BP_OnHoldTriggered(ECommonInputType CurrentInputType); // Flags: BlueprintCosmetic|Event|Protected|BlueprintEvent 0x7FF4140DB7C8
	};


	// Class FortniteUI.UIKitTabGroup
	// Inherited from UCommonTabListWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x4F0 - 0x458)
	class UUIKitTabGroup : public UCommonTabListWidgetBase	
	{
	public:
		FMulticastInlineDelegate OnUIKitTabSelected; // 0x458(0x10)
		FMulticastInlineDelegate OnUIKitTabClicked; // 0x468(0x10)
		FMulticastInlineDelegate OnTabClicked; // 0x478(0x10)
		TArray LocalTabsViewModels; // 0x488(0x10)
		TMap CachedViewModels; // 0x498(0x50)
		bool bEnableTabAnalytics; // 0x4E8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x4E9(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitTabGroup");
			return ret;
		}

		void SetInputActions(FDataTableRowHandle NextTab, FDataTableRowHandle PreviousTab); // Flags: Final|Native|Protected|BlueprintCallable 0x7FF413FF6BF8
		bool SelectTabByIndex(int32_t Index, bool bSuppressClickFeedback); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF6B18
		void SelectPreviousTab(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF6A38
		void SelectNextTab(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF6958
		void OnTabInteraction__DelegateSignature(FName TabID, UMVVMViewModelBase TabVM); // Flags: MulticastDelegate|Public|Delegate 0x7FF413FF6878
		bool IsTabViewModelValid(UUIKitTabGroupButtonViewModel TabVM); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 0x7FF413FF6798
		bool IsRebuildingTabList(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF66B8
		void HandleTabSelected(FName TabID); // Flags: Final|Native|Protected 0x7FF413FF65D8
		void HandleTabButtonClicked(UCommonButtonBase SelectedTabButton, int32_t ButtonIndex); // Flags: Final|Native|Protected 0x7FF413FF64F8
		UUIKitTabGroupButtonViewModel GetTabViewModelByID(FName TabNameID); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF6418
		UMVVMViewModelBase GetTabViewModel(FName TabID); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF6338
		int32_t GetTabIndexByID(FName TabNameID); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF6258
		FName GetTabIDbyIndex(int32_t Index); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF6178
		UCommonButtonBase GetTabButtonBaseByViewModel(UMVVMViewModelBase TabViewModel); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF6098
		int32_t GetSelectedTabIndex(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413FF5FB8
		void DeselectAll(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF413FF5ED8
	};


	// Class FortniteUI.UIKitTabGroupCategories
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2F0 - 0x2E0)
	class UUIKitTabGroupCategories : public UCommonUserWidget	
	{
	public:
		TArray LocalCategoriesViewModels; // 0x2E0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitTabGroupCategories");
			return ret;
		}
	};


	// Class FortniteUI.UIKitTabGroupCategoriesViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UUIKitTabGroupCategoriesViewModel : public UMVVMViewModelBase	
	{
	public:
		TArray Categories; // 0x68(0x10)

		static UClass* StaticClass() const {
