#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Figure_Core
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Struct /FigureCharacter/Figure_Core/AnimBP/ABP_Figure_PlaceHolder.ABP_Figure_PlaceHolder_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x11F (0x120 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_219 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData02_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xF0(0x30)
	};

}
