#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: HUD
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class /RidingContent/HUD/BBE_Crouch.BBE_Crouch_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_Crouch_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RidingContent/HUD/BBE_Crouch.BBE_Crouch_C");
			return ret;
		}
	};


	// Class /RidingContent/HUD/BBE_Sprint.BBE_Sprint_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_Sprint_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RidingContent/HUD/BBE_Sprint.BBE_Sprint_C");
			return ret;
		}
	};


	// Class /RidingContent/HUD/BBE_RiderUse.BBE_RiderUse_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_RiderUse_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RidingContent/HUD/BBE_RiderUse.BBE_RiderUse_C");
			return ret;
		}
	};


	// Class /RidingContent/HUD/BBE_RiderExit.BBE_RiderExit_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_RiderExit_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RidingContent/HUD/BBE_RiderExit.BBE_RiderExit_C");
			return ret;
		}
	};


	// Class /RidingContent/HUD/BBE_ThrowConsumableRiding.BBE_ThrowConsumableRiding_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_ThrowConsumableRiding_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RidingContent/HUD/BBE_ThrowConsumableRiding.BBE_ThrowConsumableRiding_C");
			return ret;
		}
	};


	// Class /RidingContent/HUD/BBE_RiderEmote.BBE_RiderEmote_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_RiderEmote_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RidingContent/HUD/BBE_RiderEmote.BBE_RiderEmote_C");
			return ret;
		}
	};


	// Class /Valet/HUD/BBE_ValetEmoteSquadComms.BBE_ValetEmoteSquadComms_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_ValetEmoteSquadComms_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Valet/HUD/BBE_ValetEmoteSquadComms.BBE_ValetEmoteSquadComms_C");
			return ret;
		}
	};


	// Class /Valet/HUD/BB_ValetBoost.BB_ValetBoost_C
	// Inherited from UFortMobileActionButtonBehavior_ValetBoost -> UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x138 - 0x138)
	class UBB_ValetBoost_C : public UFortMobileActionButtonBehavior_ValetBoost	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Valet/HUD/BB_ValetBoost.BB_ValetBoost_C");
			return ret;
		}
	};


	// Class /Valet/HUD/BB_ValetHandbrake.BB_ValetHandbrake_C
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UBB_ValetHandbrake_C : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Valet/HUD/BB_ValetHandbrake.BB_ValetHandbrake_C");
			return ret;
		}
	};


	// Class /EventMode/HUD/BB_Focus.BB_Focus_C
	// Inherited from UFortMobileActionButtonBehavior_Focus -> UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x138 - 0x138)
	class UBB_Focus_C : public UFortMobileActionButtonBehavior_Focus	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EventMode/HUD/BB_Focus.BB_Focus_C");
			return ret;
		}
	};


	// Class /Sportbike/HUD/BBE_SportbikeBoost.BBE_SportbikeBoost_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_SportbikeBoost_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Sportbike/HUD/BBE_SportbikeBoost.BBE_SportbikeBoost_C");
			return ret;
		}
	};


	// Class /Tank/HUD/BBE_TankTargetADS.BBE_TankTargetADS_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_TankTargetADS_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Tank/HUD/BBE_TankTargetADS.BBE_TankTargetADS_C");
			return ret;
		}
	};


	// Class /Tank/HUD/BBE_TankHonk.BBE_TankHonk_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_TankHonk_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Tank/HUD/BBE_TankHonk.BBE_TankHonk_C");
			return ret;
		}
	};


	// Class /Tank/HUD/BBE_TankExit.BBE_TankExit_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_TankExit_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Tank/HUD/BBE_TankExit.BBE_TankExit_C");
			return ret;
		}
	};


	// Class /Tank/HUD/BBE_TankBoost.BBE_TankBoost_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_TankBoost_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Tank/HUD/BBE_TankBoost.BBE_TankBoost_C");
			return ret;
		}
	};


	// Class /Tank/HUD/BBE_TankBuildMode.BBE_TankBuildMode_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_TankBuildMode_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Tank/HUD/BBE_TankBuildMode.BBE_TankBuildMode_C");
			return ret;
		}
	};


	// Class /Tank/HUD/BBE_TankSwitchSeat.BBE_TankSwitchSeat_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_TankSwitchSeat_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Tank/HUD/BBE_TankSwitchSeat.BBE_TankSwitchSeat_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BB_Rock_CameraToggle.BB_Rock_CameraToggle_C
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UBB_Rock_CameraToggle_C : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BB_Rock_CameraToggle.BB_Rock_CameraToggle_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BBE_Rock_ToggleRadio.BBE_Rock_ToggleRadio_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_Rock_ToggleRadio_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BBE_Rock_ToggleRadio.BBE_Rock_ToggleRadio_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BB_Rock_Jump.BB_Rock_Jump_C
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UBB_Rock_Jump_C : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BB_Rock_Jump.BB_Rock_Jump_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BB_Rock_Handbrake.BB_Rock_Handbrake_C
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UBB_Rock_Handbrake_C : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BB_Rock_Handbrake.BB_Rock_Handbrake_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BBE_Rock_RadioNext.BBE_Rock_RadioNext_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_Rock_RadioNext_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BBE_Rock_RadioNext.BBE_Rock_RadioNext_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BBE_Rock_VehicleExit.BBE_Rock_VehicleExit_C
	// Inherited from UFortMobileActionButtonBehaviorExtension -> UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x0 (0x80 - 0x80)
	class UBBE_Rock_VehicleExit_C : public UFortMobileActionButtonBehaviorExtension	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BBE_Rock_VehicleExit.BBE_Rock_VehicleExit_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/BB_Rock_Boost.BB_Rock_Boost_C
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UBB_Rock_Boost_C : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/BB_Rock_Boost.BB_Rock_Boost_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/Widgets/WBP_RockSpeedometer_Preview.WBP_RockSpeedometer_Preview_C
	// Inherited from UHUDLayoutToolV2_WidgetPreview -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x330 - 0x328)
	class UWBP_RockSpeedometer_Preview_C : public UHUDLayoutToolV2_WidgetPreview	
	{
	public:
		UImage Image_ProgressBar; // 0x328(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/Widgets/WBP_RockSpeedometer_Preview.WBP_RockSpeedometer_Preview_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/Widgets/WBP_RockSpeedometer_Proxy.WBP_RockSpeedometer_Proxy_C
	// Inherited from UFortMobileHUDElementProxy -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x3E0 - 0x3C8)
	class UWBP_RockSpeedometer_Proxy_C : public UFortMobileHUDElementProxy	
	{
	public:
		UImage Image_ProgressBar; // 0x3C8(0x8)
		UOverlay Overlay; // 0x3D0(0x8)
		UCommonTextBlock Text_BoostAmount; // 0x3D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/Widgets/WBP_RockSpeedometer_Proxy.WBP_RockSpeedometer_Proxy_C");
			return ret;
		}
	};


	// Class /RockVehicle/HUD/RockVehicle_HUD.RockVehicle_HUD_C
	// Inherited from UFortAthenaVehicleDashboardWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x5D8 - 0x588)
	class URockVehicle_HUD_C : public UFortAthenaVehicleDashboardWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x588(0x8)
		UWidgetAnimation BoostGain; // 0x590(0x8)
		UImage Image_ProgressBar; // 0x598(0x8)
		UOverlay Overlay; // 0x5A0(0x8)
		UCommonTextBlock Text_BoostAmount; // 0x5A8(0x8)
		URockVehicleBoostTank BoostTank; // 0x5B0(0x8)
		double CurrentBoostPercent; // 0x5B8(0x8)
		double DisplayBoostPercent; // 0x5C0(0x8)
		double DisplayInterpRate; // 0x5C8(0x8)
		double NotifyBoostGainPercent; // 0x5D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/RockVehicle_HUD.RockVehicle_HUD_C");
			return ret;
		}

		void BindTo(UObject AssociatedObject); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5C2CA600
		void UnbindFrom(UObject AssociatedObject); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5C2CE200
		void OnBoostTankChanged(float DeltaSeconds); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C2CE400
		void UpdateBoostAmount(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C2CE100
		void Tick(FGeometry MyGeometry, float InDeltaTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D5C2CE300
		void NotifyBoostGain(double Percent); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C2CE500
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D5C2CE700
		void ExecuteUbergraph_RockVehicle_HUD(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D5C2CE600
	};


	// Class /RockVehicle/HUD/Widgets/WBP_RockSpeedometer.WBP_RockSpeedometer_C
	// Inherited from UFortAthenaVehicleDashboardWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x5D8 - 0x588)
	class UWBP_RockSpeedometer_C : public UFortAthenaVehicleDashboardWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x588(0x8)
		UWidgetAnimation BoostGain; // 0x590(0x8)
		UImage Image_ProgressBar; // 0x598(0x8)
		UOverlay Overlay; // 0x5A0(0x8)
		UCommonTextBlock Text_BoostAmount; // 0x5A8(0x8)
		URockVehicleBoostTank BoostTank; // 0x5B0(0x8)
		double CurrentBoostPercent; // 0x5B8(0x8)
		double DisplayBoostPercent; // 0x5C0(0x8)
		double DisplayInterpRate; // 0x5C8(0x8)
		double NotifyBoostGainPercent; // 0x5D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/Widgets/WBP_RockSpeedometer.WBP_RockSpeedometer_C");
			return ret;
		}

		void BindTo(UObject AssociatedObject); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5C905D00
		void UnbindFrom(UObject AssociatedObject); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D5C905700
		void OnBoostTankChanged(float DeltaSeconds); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C905900
		void UpdateBoostAmount(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C905600
		void Tick(FGeometry MyGeometry, float InDeltaTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D5C905800
		void NotifyBoostGain(double Percent); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C905A00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D5C905C00
		void ExecuteUbergraph_WBP_RockSpeedometer(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D5C905B00
	};


	// Class /RockVehicle/HUD/Widgets/WBP_RockSpeedometer_Wrapper.WBP_RockSpeedometer_Wrapper_C
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x370 - 0x350)
	class UWBP_RockSpeedometer_Wrapper_C : public UFortMobileHUDElement	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x8)
		UWBP_RockSpeedometer_C WBP_RockSpeedometer; // 0x358(0x8)
		AFortAthenaVehicle CachedVehicle; // 0x360(0x8)
		AFortPlayerController ChachedPlayerController; // 0x368(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RockVehicle/HUD/Widgets/WBP_RockSpeedometer_Wrapper.WBP_RockSpeedometer_Wrapper_C");
			return ret;
		}

		void OnEnterVehicleDriver(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C905000
		void OnFullyExitVehicle(); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C904F00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D5C905300
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D5C905200
		void OnSeatChanged(int32_t SeatIndex); // Flags: BlueprintCallable|BlueprintEvent 0x15D5C904E00
		void ExecuteUbergraph_WBP_RockSpeedometer_Wrapper(int32_t EntryPoint); // Flags: Final 0x15D5C905100
	};


	// Class /HoverboardV2/HUD/HoverboardUIDirector.HoverboardUIDirector_C
	// Inherited from ADynamicUIDirectorBase -> AActor -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class AHoverboardUIDirector_C : public ADynamicUIDirectorBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		USceneComponent DefaultSceneRoot; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/HoverboardV2/HUD/HoverboardUIDirector.HoverboardUIDirector_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D60F2E400
		void UpdateUIScene(AFortPlayerPawn FortPlayerPawn, AActor NewVehicle, AActor OldVehicle); // Flags: BlueprintCallable|BlueprintEvent 0x15D60F2E300
		void OnPawnSet(); // Flags: BlueprintCallable|BlueprintEvent 0x15D60F2E500
		void ExecuteUbergraph_HoverboardUIDirector(int32_t EntryPoint); // Flags: Final 0x15D60F2E600
	};

}
