#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: UI
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class /Game/UI/Foundation/SoftwareCursors/ArrowCursorWidget.ArrowCursorWidget_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B8 - 0x2B8)
	class UArrowCursorWidget_C : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/SoftwareCursors/ArrowCursorWidget.ArrowCursorWidget_C");
			return ret;
		}

		FSlateBrush GetBackground(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x7FF414F93B20
	};


	// Class /Game/UI/Foundation/RichTextData/CommonUIRichTextData.CommonUIRichTextData_C
	// Inherited from UCommonUIRichTextData -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UCommonUIRichTextData_C : public UCommonUIRichTextData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/RichTextData/CommonUIRichTextData.CommonUIRichTextData_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base.TextStyle-Base_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base.TextStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-HeaderParent.TextStyle-HeaderParent_C
	// Inherited from UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-HeaderParent_C : public UTextStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-HeaderParent.TextStyle-HeaderParent_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M.TextStyle-Header-M_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M.TextStyle-Header-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-NavyBlue.TextStyle-Header-M-NavyBlue_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-NavyBlue_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-NavyBlue.TextStyle-Header-M-NavyBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Base.ButtonStyle-Base_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Base_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Base.ButtonStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-TextOnlyBase_Empty.ButtonStyle-TextOnlyBase_Empty_C
	// Inherited from UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-TextOnlyBase_Empty_C : public UButtonStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-TextOnlyBase_Empty.ButtonStyle-TextOnlyBase_Empty_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextScrollStyle-Base.TextScrollStyle-Base_C
	// Inherited from UCommonTextScrollStyle -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UTextScrollStyle-Base_C : public UCommonTextScrollStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextScrollStyle-Base.TextScrollStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Shell/windowchromebuttons.windowchromebuttons_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x300 - 0x2E0)
	class Uwindowchromebuttons_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UWidgetAnimation FadeOut; // 0x2E8(0x8)
		UWidgetAnimation FadeIn; // 0x2F0(0x8)
		UWindowTitleBarArea WindowTitleBarArea; // 0x2F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Shell/windowchromebuttons.windowchromebuttons_C");
			return ret;
		}

		void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D60B5B400
		void OnMouseLeave(FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D60B5B300
		void ExecuteUbergraph_windowchromebuttons(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D60B5B500
	};


	// Class /Game/UI/Foundation/Lightbox/Lightbox.Lightbox_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x378 - 0x2E0)
	class ULightbox_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UWidgetAnimation FadeOut; // 0x2E8(0x8)
		UWidgetAnimation FadeIn; // 0x2F0(0x8)
		UBorder Border_Darken; // 0x2F8(0x8)
		UButton ClickCatcher; // 0x300(0x8)
		UNamedSlot Content; // 0x308(0x8)
		UBorder Dimmer; // 0x310(0x8)
		USafeZone SafeZone; // 0x318(0x8)
		UCommonVisibilityWidgetLegacy WindowButtons; // 0x320(0x8)
		UOverlay WindowsOverlay; // 0x328(0x8)
		Uwindowchromebuttons_C WindowTitleBar; // 0x330(0x8)
		FMulticastInlineDelegate IntroEnded; // 0x338(0x10)
		FMulticastInlineDelegate OutroEnded; // 0x348(0x10)
		bool ShowWindowControlButtons; // 0x358(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x359(0x7) UNKNOWN PROPERTY
		double DimAmount; // 0x360(0x8)
		FLinearColor BackgroundColor; // 0x368(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Lightbox/Lightbox.Lightbox_C");
			return ret;
		}

		void RemoveContent(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60B5A800
		void AddContent(UCommonUserWidget Content); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60B5B100
		void Outro(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60B5AB00
		void Intro(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60B5AD00
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60B5AF00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60B5B000
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60B5A900
		void WidgetAnimationEvt_FadeIn_K2Node_WidgetAnimationEvent(); // Flags: BlueprintEvent 0x15D60B5A700
		void WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent(); // Flags: BlueprintEvent 0x15D60B5A600
		void ExecuteUbergraph_Lightbox(int32_t EntryPoint); // Flags: Final 0x15D60B5AE00
		void OutroEnded__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D60B5AA00
		void IntroEnded__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D60B5AC00
	};


	// Class /Game/UI/Foundation/Input/CommonUI_HoldData_Base.CommonUI_HoldData_Base_C
	// Inherited from UCommonUIHoldData -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UCommonUI_HoldData_Base_C : public UCommonUIHoldData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Input/CommonUI_HoldData_Base.CommonUI_HoldData_Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Utilities/EditableTextUtilities.EditableTextUtilities_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEditableTextUtilities_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Utilities/EditableTextUtilities.EditableTextUtilities_C");
			return ret;
		}

		void CheckIfNeedsTrimming(FText Text, int32_t Limit, UObject __WorldContext, FText& TrimmedText, bool& WasTrimmed); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D3F1CE900
		void LimitTextLength(UWidget EditableTextWidget, int32_t Length, UObject __WorldContext, bool& WasTrimmed); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D3F1CE800
	};


	// Class /Game/UI/Foundation/Buttons/CloseButton.CloseButton_C
	// Inherited from UBacchusCloseButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x49 (0x1439 - 0x13F0)
	class UCloseButton_C : public UBacchusCloseButton	
	{
	public:
		UBorder Border_Container; // 0x13F0(0x8)
		UImage CloseIcon; // 0x13F8(0x8)
		USizeBox SizeBox_Control; // 0x1400(0x8)
		UCommonTextBlock Text_ButtonAction; // 0x1408(0x8)
		FText Button_Description; // 0x1410(0x10)
		bool FontSizeOveride; // 0x1420(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1421(0x3) UNKNOWN PROPERTY
		int32_t FontSize; // 0x1424(0x4)
		FMargin Padding_Overide; // 0x1428(0x10)
		bool PaddingOveride; // 0x1438(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/CloseButton.CloseButton_C");
			return ret;
		}

		void SetText(FText Text); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D61D63600
		void HandleSize(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D61D63700
	};


	// Class /Game/UI/Foundation/Input/ShortInteraction_HoldData.ShortInteraction_HoldData_C
	// Inherited from UCommonUI_HoldData_Base_C -> UCommonUIHoldData -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UShortInteraction_HoldData_C : public UCommonUI_HoldData_Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Input/ShortInteraction_HoldData.ShortInteraction_HoldData_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Modals/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C
	// Inherited from UFortConfirmationWindow -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x798 - 0x750)
	class UConfirmationWindow_C : public UFortConfirmationWindow	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x750(0x8)
		UWidgetAnimation Intro; // 0x758(0x8)
		USizeBox SizeBox; // 0x760(0x8)
		UCommonBorder TapToCloseZone; // 0x768(0x8)
		UWBP_CaptureForPostBufferUpdate_C WBP_CaptureForPostBufferUpdate; // 0x770(0x8)
		FLinearColor ButtonIconColor; // 0x778(0x10)
		USoundBase IntroSound; // 0x788(0x8)
		USoundBase OutroSound; // 0x790(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Modals/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C");
			return ret;
		}

		void Handle Configure Decline Button(UCommonButtonBase New Button); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D620B4200
		void ConfigureConfirmationButton(UCommonButtonBase Button, FConfirmationDialogAction& Action, bool bSimpleConfirm); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D620B0400
		void PlayShowSound(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D620B3F00
		FEventReply TapToClose(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D620B3C00
		void SetupNonInteractiveContent(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D620B3D00
		FDataTableRowHandle GetInputAction(FName RowName, bool UseInputAction); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D620B0100
		void Initialize(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D620B4100
		void OnBeginOutro(); // Flags: Event|Protected|BlueprintEvent 0x15D620B4000
		void ConfigureDeclineButton(UCommonButtonBase Button); // Flags: Event|Protected|BlueprintEvent 0x15D620B0300
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D620B0500
		void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D620B0600
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D620B3E00
		void ExecuteUbergraph_ConfirmationWindow(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D620B0200
	};


	// Class /Game/UI/Foundation/MessageCenter/BasicNotification.BasicNotification_C
	// Inherited from UFortUINotification -> UObject
	// Size: 0x0 (0xF0 - 0xF0)
	class UBasicNotification_C : public UFortUINotification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MessageCenter/BasicNotification.BasicNotification_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/MessageCenter/BattlePassPageUnlockNotification.BattlePassPageUnlockNotification_C
	// Inherited from UFortUIBattlePassPageUnlockNotification -> UFortUINotification -> UObject
	// Size: 0x0 (0x110 - 0x110)
	class UBattlePassPageUnlockNotification_C : public UFortUIBattlePassPageUnlockNotification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MessageCenter/BattlePassPageUnlockNotification.BattlePassPageUnlockNotification_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/MessageCenter/FriendNotification.FriendNotification_C
	// Inherited from UFortUIFriendNotification -> UFortUINotification -> UObject
	// Size: 0x8 (0x140 - 0x138)
	class UFriendNotification_C : public UFortUIFriendNotification	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x138(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MessageCenter/FriendNotification.FriendNotification_C");
			return ret;
		}

		void JoinPartyInvite(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66972800
		void ShowFriendInvites(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66972700
		void ExecuteUbergraph_FriendNotification(int32_t EntryPoint); // Flags: Final 0x15D66972900
	};


	// Class /Game/UI/Login/AccountSelect/AccountNotFound.AccountNotFound_C
	// Inherited from UFortAccountNotFound -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x560 - 0x558)
	class UAccountNotFound_C : public UFortAccountNotFound	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x558(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/AccountSelect/AccountNotFound.AccountNotFound_C");
			return ret;
		}

		void BndEvt__AccountNotFound_Button_Back_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D66619400
		void BndEvt__AccountNotFound_Button_Web_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D6661F500
		void ExecuteUbergraph_AccountNotFound(int32_t EntryPoint); // Flags: Final 0x15D6661F600
	};


	// Class /Game/UI/Login/AccountSelect/PlayedBeforeSelectMP.PlayedBeforeSelectMP_C
	// Inherited from UFortStartLoginWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x438 - 0x418)
	class UPlayedBeforeSelectMP_C : public UFortStartLoginWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x418(0x8)
		UWidgetAnimation Intro; // 0x420(0x8)
		USafeZone SafeZone; // 0x428(0x8)
		UPlatformGameInstance As_Platform_Game_Instance; // 0x430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/AccountSelect/PlayedBeforeSelectMP.PlayedBeforeSelectMP_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6808FF00
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6808FA00
		void OnOrientationChanged(TEnumAsByte inScreenOrientation); // Flags: BlueprintCallable|BlueprintEvent 0x15D6808FB00
		void BndEvt__PlayedBeforeSelectMP_Button_Yes_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D6808FE00
		void OnActivated(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6808C800
		void ExecuteUbergraph_PlayedBeforeSelectMP(int32_t EntryPoint); // Flags: Final 0x15D6808C700
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BaseParent.TextStyle-BaseParent_C
	// Inherited from UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BaseParent_C : public UTextStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BaseParent.TextStyle-BaseParent_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XXS-B.TextStyle-Base-XXS-B_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XXS-B_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XXS-B.TextStyle-Base-XXS-B_C");
			return ret;
		}
	};


	// Class /Game/UI/InGame/Mission/SpeechBubbleWidget.SpeechBubbleWidget_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2F0 - 0x2E0)
	class USpeechBubbleWidget_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UCommonTextBlock BubbleText; // 0x2E8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/InGame/Mission/SpeechBubbleWidget.SpeechBubbleWidget_C");
			return ret;
		}

		void InitFromObject(UObject InitObject); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D81FF8300
		void ExecuteUbergraph_SpeechBubbleWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D81FF8400
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_Eula_GamePad.ButtonStyle-Skew_Eula_GamePad_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Skew_Eula_GamePad_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_Eula_GamePad.ButtonStyle-Skew_Eula_GamePad_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-L-Grey.TextStyle-Header-L-Grey_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-L-Grey_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-L-Grey.TextStyle-Header-L-Grey_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-L-Black.TextStyle-Header-L-Black_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-L-Black_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-L-Black.TextStyle-Header-L-Black_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew.ButtonStyle-Skew_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Skew_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew.ButtonStyle-Skew_C");
			return ret;
		}
	};


	// Class /Game/UI/Login/CorrectiveAction/CorrectiveActionDisplayNameScreen.CorrectiveActionDisplayNameScreen_C
	// Inherited from UFortCorrectiveActionDisplayNameScreen -> UFortCorrectiveActionScreen -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x440 - 0x428)
	class UCorrectiveActionDisplayNameScreen_C : public UFortCorrectiveActionDisplayNameScreen	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x428(0x8)
		UImage Image_DisplayNameEntrySpinner; // 0x430(0x8)
		UCommonTextBlock Text_DisplayNameEntryError; // 0x438(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/CorrectiveAction/CorrectiveActionDisplayNameScreen.CorrectiveActionDisplayNameScreen_C");
			return ret;
		}

		void OnShowFailureReason(FText& FailureReason); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6808E000
		void OnShowCorrectiveActionProcessing(bool bShowProcessing); // Flags: Event|Protected|BlueprintEvent 0x15D6808F500
		void OnShowDisplayNameDownloading(bool bShowDownloading); // Flags: Event|Protected|BlueprintEvent 0x15D6808F300
		void BndEvt__CorrectiveActionDisplayNameScreen_Button_Continue_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D6808F000
		void BndEvt__CorrectiveActionDisplayNameScreen_Button_PrivacyPolicy_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D6808F100
		void ExecuteUbergraph_CorrectiveActionDisplayNameScreen(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6808E900
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-S.TextStyle-Header-M-S_C
	// Inherited from UTextStyle-Header-M_C -> UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-S_C : public UTextStyle-Header-M_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-S.TextStyle-Header-M-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Login/SplashScreen/SplashScreenWidget.SplashScreenWidget_C
	// Inherited from UFortSplashScreenWidget -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x588 - 0x540)
	class USplashScreenWidget_C : public UFortSplashScreenWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x540(0x8)
		UWBP_UIKit_Button_Loud_C Button_PressToStart; // 0x548(0x8)
		UCommonLazyImage I_Fortnite; // 0x550(0x8)
		FText GamepadText; // 0x558(0x10)
		FText MouseText; // 0x568(0x10)
		FText MobileText; // 0x578(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/SplashScreen/SplashScreenWidget.SplashScreenWidget_C");
			return ret;
		}

		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D6808ED00
		void OnInputMethodChanged(ECommonInputType InputType); // Flags: Event|Protected|BlueprintEvent 0x15D6808EF00
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6808E800
		void BndEvt__SplashScreenWidget_Button_PressToStart_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D6808EC00
		void ExecuteUbergraph_SplashScreenWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6808EE00
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-FullyInvisible.ButtonStyle-FullyInvisible_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-FullyInvisible_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-FullyInvisible.ButtonStyle-FullyInvisible_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/BottomBar/AthenaBoundActionBar_BottomBar.AthenaBoundActionBar_BottomBar_C
	// Inherited from UAthenaBoundActionBar -> UCommonBoundActionBar -> UDynamicEntryBoxBase -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x270 - 0x270)
	class UAthenaBoundActionBar_BottomBar_C : public UAthenaBoundActionBar	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/BottomBar/AthenaBoundActionBar_BottomBar.AthenaBoundActionBar_BottomBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Login/HealthWarning/HealthWarningScreen.HealthWarningScreen_C
	// Inherited from UHealthWarningScreen -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x5A8 - 0x568)
	class UHealthWarningScreen_C : public UHealthWarningScreen	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x568(0x8)
		UWidgetAnimation FinishingAnim; // 0x570(0x8)
		USafeZone SafeZone; // 0x578(0x8)
		FMulticastInlineDelegate HealthWarningCompleted; // 0x580(0x10)
		FTimerHandle ShowTimer; // 0x590(0x8)
		FMargin IconPadding; // 0x598(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/HealthWarning/HealthWarningScreen.HealthWarningScreen_C");
			return ret;
		}

		void HandleShowTimerComplete(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6808DF00
		void ExecuteUbergraph_HealthWarningScreen(int32_t EntryPoint); // Flags: Final 0x15D6808E500
		void HealthWarningCompleted__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6808E600
	};


	// Class /Game/UI/Frontend/StoreMain/WebLogin.WebLogin_C
	// Inherited from UFortWebLoginWidget -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x550 - 0x538)
	class UWebLogin_C : public UFortWebLoginWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x538(0x8)
		UCircularThrobber Throbber; // 0x540(0x8)
		UBorder WebContent; // 0x548(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/StoreMain/WebLogin.WebLogin_C");
			return ret;
		}

		void DisplayWidget(UWidget WebWidget); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D6808CF00
		void DismissWidget(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D6808CA00
		void ExecuteUbergraph_WebLogin(int32_t EntryPoint); // Flags: Final 0x15D6808D000
	};


	// Class /Game/UI/Login/AccountSelect/InviteEventTitle.InviteEventTitle_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2C0 - 0x2B8)
	class UInviteEventTitle_C : public UUserWidget	
	{
	public:
		UCommonLazyImage TitleImage; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/AccountSelect/InviteEventTitle.InviteEventTitle_C");
			return ret;
		}
	};


	// Class /Game/UI/ItemReceived/ItemReceivedHeaders/ItemReceivedCurrencyHeader.ItemReceivedCurrencyHeader_C
	// Inherited from UItemReceivedHeaderSubWidgetBase_C -> UItemReceivedHeaderBase -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x361 - 0x301)
	class UItemReceivedCurrencyHeader_C : public UItemReceivedHeaderSubWidgetBase_C	
	{
	public:
		unsigned char UnknownData01_3[0x7]; // 0x301(0x7) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x308(0x8)
		UCommonTextBlock BattlepassTier; // 0x310(0x8)
		UCommonTextBlock BattlepassUpgraded; // 0x318(0x8)
		UCommonWidgetSwitcherLegacy CommonWidgetSwitcher_Icon; // 0x320(0x8)
		UCommonWidgetSwitcherLegacy CommonWidgetSwitcher_Title; // 0x328(0x8)
		UCurrencyListView_C CurrencyListView; // 0x330(0x8)
		UImage ImageBattlePassIconGold; // 0x338(0x8)
		UImage ImageBattlePassIconSilver; // 0x340(0x8)
		UItemReceivedAccountWidget_C ItemReceivedAccountWidget; // 0x348(0x8)
		FMulticastInlineDelegate ActivateWidgetFromPresentationScreen; // 0x350(0x10)
		bool AlreadyActivated; // 0x360(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/ItemReceived/ItemReceivedHeaders/ItemReceivedCurrencyHeader.ItemReceivedCurrencyHeader_C");
			return ret;
		}

		void ActiveFromPresentation(FCurrencyDataWithGiftBox CurrencyDataArray); // Flags: BlueprintCallable|BlueprintEvent 0x15D80763200
		void ExecuteUbergraph_ItemReceivedCurrencyHeader(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D80763E00
		void ActivateWidgetFromPresentationScreen__DelegateSignature(UFortGiftBoxItem GiftBox, TArray& CurrencyArray); // Flags: Public|Delegate|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D80763D00
	};


	// Class /Game/UI/Frontend/Misc/RestrictedCountryRatingIcons.RestrictedCountryRatingIcons_C
	// Inherited from URestrictedCountryRatingIcons -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2F0 - 0x2F0)
	class URestrictedCountryRatingIcons_C : public URestrictedCountryRatingIcons	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Misc/RestrictedCountryRatingIcons.RestrictedCountryRatingIcons_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XL-70pc.TextStyle-Base-XL-70pc_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XL-70pc_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XL-70pc.TextStyle-Base-XL-70pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border_LightNavy_VGrad.Border_LightNavy_VGrad_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder_LightNavy_VGrad_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border_LightNavy_VGrad.Border_LightNavy_VGrad_C");
			return ret;
		}
	};


	// Class /Game/UI/ItemReceived/ItemReceivedHeaders/ItemReceivedAccountWidget.ItemReceivedAccountWidget_C
	// Inherited from UFortAccountWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x328 - 0x318)
	class UItemReceivedAccountWidget_C : public UFortAccountWidgetBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x8)
		UCommonTextBlock CommonTextBlock_UserMessage; // 0x320(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/ItemReceived/ItemReceivedHeaders/ItemReceivedAccountWidget.ItemReceivedAccountWidget_C");
			return ret;
		}

		void OnAccountInfoChanged(FFortPublicAccountInfo& Result); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D80761800
		void ExecuteUbergraph_ItemReceivedAccountWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D80761B00
	};


	// Class /Game/UI/ItemReceived/ItemReceivedHeaders/CurrencyListView.CurrencyListView_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UCurrencyListView_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UCommonListView DataListView; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/ItemReceived/ItemReceivedHeaders/CurrencyListView.CurrencyListView_C");
			return ret;
		}

		void AddDataToList(FCurrencyData CurrencyData); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D80761600
		void RunClearListView(); // Flags: BlueprintCallable|BlueprintEvent 0x15D80761300
		void ExecuteUbergraph_CurrencyListView(int32_t EntryPoint); // Flags: Final 0x15D80761700
	};


	// Class /Game/UI/ItemReceived/ItemReceivedHeaders/CurrencyListViewItem.CurrencyListViewItem_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x2D8 - 0x2B8)
	class UCurrencyListViewItem_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UCommonRichTextBlock CurrencyMessage; // 0x2C0(0x8)
		FText DisplayMessage; // 0x2C8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/ItemReceived/ItemReceivedHeaders/CurrencyListViewItem.CurrencyListViewItem_C");
			return ret;
		}

		void SetQuantityAndType(int32_t inInt, FText To); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D80761500
		void BP_OnEntryReleased(); // Flags: Event|Protected|BlueprintEvent 0x15D80767900
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D80767A00
		void BP_OnItemSelectionChanged(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent 0x15D80760100
		void OnListItemObjectSet(UObject ListItemObject); // Flags: Event|Protected|BlueprintEvent 0x15D80761100
		void ExecuteUbergraph_CurrencyListViewItem(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D80761400
	};


	// Class /Game/UI/ItemReceived/ItemReceivedHeaders/CurrencyListObject.CurrencyListObject_C
	// Inherited from UObject
	// Size: 0x38 (0x60 - 0x28)
	class UCurrencyListObject_C : public UObject	
	{
	public:
		FCurrencyData Data; // 0x28(0x38)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/ItemReceived/ItemReceivedHeaders/CurrencyListObject.CurrencyListObject_C");
			return ret;
		}
	};


	// Class /Game/UI/ItemReceived/ItemReceivedHeaders/ItemReceivedHeaderSubWidgetBase.ItemReceivedHeaderSubWidgetBase_C
	// Inherited from UItemReceivedHeaderBase -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x31 (0x301 - 0x2D0)
	class UItemReceivedHeaderSubWidgetBase_C : public UItemReceivedHeaderBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D0(0x8)
		UFortGiftBoxItem GiftBoxItem_BP; // 0x2D8(0x8)
		FString FromUserName_BP; // 0x2E0(0x10)
		TArray ItemDefs; // 0x2F0(0x10)
		bool bSelfGift; // 0x300(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/ItemReceived/ItemReceivedHeaders/ItemReceivedHeaderSubWidgetBase.ItemReceivedHeaderSubWidgetBase_C");
			return ret;
		}

		void SetBlueprintGiftBoxItem(UFortGiftBoxItem GiftBox, FString FromUser, TArray& ItemDefs, bool bSelfGift); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D80767800
		void InitFromGiftBoxItem_BP(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D80767000
		void ExecuteUbergraph_ItemReceivedHeaderSubWidgetBase(int32_t EntryPoint); // Flags: Final 0x15D80766F00
	};


	// Class /Game/UI/DamageText/Base/ImpactNumbers.ImpactNumbers_C
	// Inherited from AFortDamageNumbersActor -> AFortClientOnlyActor -> AActor -> UObject
	// Size: 0x8 (0x628 - 0x620)
	class AImpactNumbers_C : public AFortDamageNumbersActor	
	{
	public:
		USceneComponent DefaultSceneRoot; // 0x620(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/DamageText/Base/ImpactNumbers.ImpactNumbers_C");
			return ret;
		}
	};


	// Class /Game/UI/Items/ItemUIFunctionLibrary.ItemUIFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UItemUIFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Items/ItemUIFunctionLibrary.ItemUIFunctionLibrary_C");
			return ret;
		}

		void IsNullItem(UObject ItemObject, UObject __WorldContext, bool& Is Null Item); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6709A900
		void Truncate Integer Value(int32_t Value, int32_t Min Fractional Digits, int32_t Max Fractional Digits, UObject __WorldContext, FText& Formatted Value); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6709A700
		void Convert Tier To Integer(EFortItemTier Tier, UObject __WorldContext, int32_t& Numeric Tier); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6709AA00
		void ParseLevelRequiredFromString(FString InString, UObject __WorldContext, int32_t& OutInt); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6709A800
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M.TextStyle-Base-M_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M.TextStyle-Base-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M-I.TextStyle-Base-M-I_C
	// Inherited from UTextStyle-Base-M_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M-I_C : public UTextStyle-Base-M_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M-I.TextStyle-Base-M-I_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M.TextStyle-Button-Primary-M_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M.TextStyle-Button-Primary-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M-Disabled.TextStyle-Button-Primary-M-Disabled_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M-Disabled_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M-Disabled.TextStyle-Button-Primary-M-Disabled_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton.TextStyle-MediumButton_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-MediumButton_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton.TextStyle-MediumButton_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_S.ItemCardPowerRatingTextStyle_S_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_S_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_S.ItemCardPowerRatingTextStyle_S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XL.ItemCardPowerRatingTextStyle_XL_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_XL_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XL.ItemCardPowerRatingTextStyle_XL_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XS.ItemCardPowerRatingTextStyle_XS_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_XS_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XS.ItemCardPowerRatingTextStyle_XS_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S.TextStyle-Button-BottomBar-S_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-BottomBar-S_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S.TextStyle-Button-BottomBar-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S-Selected.TextStyle-Button-BottomBar-S-Selected_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-BottomBar-S-Selected_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S-Selected.TextStyle-Button-BottomBar-S-Selected_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton-Disabled.TextStyle-MediumButton-Disabled_C
	// Inherited from UTextStyle-MediumButton_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-MediumButton-Disabled_C : public UTextStyle-MediumButton_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton-Disabled.TextStyle-MediumButton-Disabled_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumBase.ButtonStyle-MediumBase_C
	// Inherited from UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-MediumBase_C : public UButtonStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumBase.ButtonStyle-MediumBase_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentNoCues.ButtonStyle-MediumTransparentNoCues_C
	// Inherited from UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-MediumTransparentNoCues_C : public UButtonStyle-MediumBase_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentNoCues.ButtonStyle-MediumTransparentNoCues_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S.TextStyle-Base-S_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S.TextStyle-Base-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B.TextStyle-Base-S-B_C
	// Inherited from UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B_C : public UTextStyle-Base-S_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B.TextStyle-Base-S-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue.TextStyle-Base-S-B-Blue_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Blue_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue.TextStyle-Base-S-B-Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-ToolTip-B.TextStyle-Base-ToolTip-B_C
	// Inherited from UTextStyle-Base-S-B-Blue_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-ToolTip-B_C : public UTextStyle-Base-S-B-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-ToolTip-B.TextStyle-Base-ToolTip-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-ToolTip-Body.TextStyle-Base-ToolTip-Body_C
	// Inherited from UTextStyle-Base-S-B-Blue_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-ToolTip-Body_C : public UTextStyle-Base-S-B-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-ToolTip-Body.TextStyle-Base-ToolTip-Body_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS.TextStyle-Base-XS_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS.TextStyle-Base-XS_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-40pc.TextStyle-Base-XS-40pc_C
	// Inherited from UTextStyle-Base-XS_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-40pc_C : public UTextStyle-Base-XS_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-40pc.TextStyle-Base-XS-40pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B.TextStyle-Base-XS-B_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B.TextStyle-Base-XS-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White.TextStyle_BurbSmBk_15_White_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_White_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White.TextStyle_BurbSmBk_15_White_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_DarkBlue.TextStyle_BurbSmBk_15_DarkBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_DarkBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_DarkBlue.TextStyle_BurbSmBk_15_DarkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White50pc.TextStyle_BurbSmBk_15_White50pc_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_White50pc_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White50pc.TextStyle_BurbSmBk_15_White50pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_LightBlue.TextStyle_BurbSmBk_15_LightBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_LightBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_LightBlue.TextStyle_BurbSmBk_15_LightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-40pc.TextStyle-Base-S-B-40pc_C
	// Inherited from UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-40pc_C : public UTextStyle-Base-S_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-40pc.TextStyle-Base-S-B-40pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Clear.ButtonStyle-Clear_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Clear_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Clear.ButtonStyle-Clear_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_Red.TextStyle_BurbSmBk_15_Red_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_Red_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_Red.TextStyle_BurbSmBk_15_Red_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-Gray.TextStyle-Base-S-Gray_C
	// Inherited from UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-Gray_C : public UTextStyle-Base-S_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-Gray.TextStyle-Base-S-Gray_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Icon_Transparent.ButtonStyle-Icon_Transparent_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Icon_Transparent_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Icon_Transparent.ButtonStyle-Icon_Transparent_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue-40.TextStyle-Base-S-B-Blue-40_C
	// Inherited from UTextStyle-Base-S-B-Blue_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Blue-40_C : public UTextStyle-Base-S-B-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue-40.TextStyle-Base-S-B-Blue-40_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-L.TextStyle-Base-L_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-L_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-L.TextStyle-Base-L_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-L-B.TextStyle-Base-L-B_C
	// Inherited from UTextStyle-Base-L_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-L-B_C : public UTextStyle-Base-L_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-L-B.TextStyle-Base-L-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M-B.TextStyle-Base-M-B_C
	// Inherited from UTextStyle-Base-M_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M-B_C : public UTextStyle-Base-M_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M-B.TextStyle-Base-M-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M-B_Blue.TextStyle-Base-M-B_Blue_C
	// Inherited from UTextStyle-Base-M-B_C -> UTextStyle-Base-M_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M-B_Blue_C : public UTextStyle-Base-M-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M-B_Blue.TextStyle-Base-M-B_Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings.ButtonStyle-GamepadBindings_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-GamepadBindings_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings.ButtonStyle-GamepadBindings_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-Blue.TextStyle-Base-XS-Blue_C
	// Inherited from UTextStyle-Base-XS_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-Blue_C : public UTextStyle-Base-XS_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-Blue.TextStyle-Base-XS-Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B-DarkBlueFade.TextStyle-Base-XS-B-DarkBlueFade_C
	// Inherited from UTextStyle-Base-XS-Blue_C -> UTextStyle-Base-XS_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B-DarkBlueFade_C : public UTextStyle-Base-XS-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B-DarkBlueFade.TextStyle-Base-XS-B-DarkBlueFade_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray.TextStyle-Base-S-B-Gray_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Gray_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray.TextStyle-Base-S-B-Gray_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray50.TextStyle-Base-S-B-Gray50_C
	// Inherited from UTextStyle-Base-S-B-Gray_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Gray50_C : public UTextStyle-Base-S-B-Gray_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray50.TextStyle-Base-S-B-Gray50_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentWithCues.ButtonStyle-MediumTransparentWithCues_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-MediumTransparentWithCues_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentWithCues.ButtonStyle-MediumTransparentWithCues_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Cyan.TextStyle-BurbankSmall-XS-Cyan_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BurbankSmall-XS-Cyan_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Cyan.TextStyle-BurbankSmall-XS-Cyan_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_M.ItemCardPowerRatingTextStyle_M_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_M_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_M.ItemCardPowerRatingTextStyle_M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Gray.TextStyle-BurbankSmall-XS-Gray_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BurbankSmall-XS-Gray_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Gray.TextStyle-BurbankSmall-XS-Gray_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_L.ItemCardPowerRatingTextStyle_L_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_L_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_L.ItemCardPowerRatingTextStyle_L_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-Blue.TextStyle-Header-M-Blue_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-Blue_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-Blue.TextStyle-Header-M-Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-L.TextStyle-Header-L_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-L_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-L.TextStyle-Header-L_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-XL.TextStyle-Header-XL_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-XL_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-XL.TextStyle-Header-XL_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-Yellow.TextStyle-Header-M-Yellow_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-Yellow_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-Yellow.TextStyle-Header-M-Yellow_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Main-Recolor.ButtonStyle-Tab-Main-Recolor_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Tab-Main-Recolor_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Main-Recolor.ButtonStyle-Tab-Main-Recolor_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/SocialPanelTab.SocialPanelTab_C
	// Inherited from UFortSocialTab -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x1458 - 0x1430)
	class USocialPanelTab_C : public UFortSocialTab	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1430(0x8)
		UWidgetAnimation Unselected; // 0x1438(0x8)
		UWidgetAnimation OnFriendsOnlineUpdated; // 0x1440(0x8)
		UWidgetAnimation Hovered; // 0x1448(0x8)
		UWidgetAnimation Selected; // 0x1450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanelTab.SocialPanelTab_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D66A8FA00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D66A8EF00
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent 0x15D620BCF00
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent 0x15D66A8F900
		void ExecuteUbergraph_SocialPanelTab(int32_t EntryPoint); // Flags: Final 0x15D66ED5F00
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-XL-BrightBlue.TextStyle-Header-XL-BrightBlue_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-XL-BrightBlue_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-XL-BrightBlue.TextStyle-Header-XL-BrightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower.TextStyle-Header-HomeBasePower_C
	// Inherited from UTextStyle-Header-L_C -> UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-HomeBasePower_C : public UTextStyle-Header-L_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower.TextStyle-Header-HomeBasePower_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower-XS.TextStyle-Header-HomeBasePower-XS_C
	// Inherited from UTextStyle-Header-L_C -> UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-HomeBasePower-XS_C : public UTextStyle-Header-L_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower-XS.TextStyle-Header-HomeBasePower-XS_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-ShellTopBar.Border-ShellTopBar_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ShellTopBar_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ShellTopBar.Border-ShellTopBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Movie/VideoPlayerWidget.VideoPlayerWidget_C
	// Inherited from UFortVideoPlayerWidget -> UFortUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3C0 - 0x3C0)
	class UVideoPlayerWidget_C : public UFortVideoPlayerWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Movie/VideoPlayerWidget.VideoPlayerWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-S_Gorse.TextStyle-Base-S-B-S_Gorse_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-S_Gorse_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-S_Gorse.TextStyle-Base-S-B-S_Gorse_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/Settings/OptionsMenuHeader.OptionsMenuHeader_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2D (0x30D - 0x2E0)
	class UOptionsMenuHeader_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UImage Image; // 0x2E8(0x8)
		USizeBox SizeBoxContainer; // 0x2F0(0x8)
		USpacer SpacerBottom; // 0x2F8(0x8)
		UCommonTextBlock TextHeader; // 0x300(0x8)
		int32_t FontSizeMobile; // 0x308(0x4)
		ESettingType LocalSettingType; // 0x30C(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/OptionsMenuHeader.OptionsMenuHeader_C");
			return ret;
		}

		void SetFontSize(UCommonTextBlock Text, int32_t DefaultSize, int32_t MobileSize); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D620BCE00
		void HandlePawnSet(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66A8E700
		void UpdateSize(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D75E4DF00
		void Center On Widget(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66A8BD00
		void BP_OnItemSelectionChanged(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent 0x15D66A8DA00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D620BE400
		void OnMouseLeave(FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D75E4E100
		void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D66A8F700
		void OnListItemObjectSet(UObject ListItemObject); // Flags: Event|Protected|BlueprintEvent 0x15D817BF000
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D6697E900
		void BP_OnEntryReleased(); // Flags: Event|Protected|BlueprintEvent 0x15D7ADE2700
		void CenterOnWidget(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66A8BC00
		void ExecuteUbergraph_OptionsMenuHeader(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66A8A700
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-Horizon.TextStyle-Header-M-Horizon_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-Horizon_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-Horizon.TextStyle-Header-M-Horizon_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextScrollStyle-NoFade.TextScrollStyle-NoFade_C
	// Inherited from UCommonTextScrollStyle -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UTextScrollStyle-NoFade_C : public UCommonTextScrollStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextScrollStyle-NoFade.TextScrollStyle-NoFade_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/MainMenu/MainMenuButton.MainMenuButton_C
	// Inherited from UFortMainMenuButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x21 (0x1509 - 0x14E8)
	class UMainMenuButton_C : public UFortMainMenuButton	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x14E8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x14F0(0x8)
		UImage Image_Icon_RightSide; // 0x14F8(0x8)
		USizeBox SizeBox_Mobile; // 0x1500(0x8)
		bool ShowExternalLinkIcon; // 0x1508(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/MainMenu/MainMenuButton.MainMenuButton_C");
			return ret;
		}

		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85C000
		void UpdateRightSideIconColor(FLinearColor Color); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B85BE00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85C400
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85C300
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85C200
		void BndEvt__UI_BigGoldButton_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent 0x15D6B85C500
		void UpdateRightSideIcon(TWeakObjectPtr SoftMaterial); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B85BF00
		void ExecuteUbergraph_MainMenuButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B85C100
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_Error.ButtonStyle-Skew_Error_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Skew_Error_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_Error.ButtonStyle-Skew_Error_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/PowerRating/Border-PowerBar.Border-PowerBar_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-PowerBar_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/PowerRating/Border-PowerBar.Border-PowerBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Stats/HomebaseRatingBar.HomebaseRatingBar_C
	// Inherited from UFortMaterialProgressBar -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3E0 - 0x3E0)
	class UHomebaseRatingBar_C : public UFortMaterialProgressBar	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Stats/HomebaseRatingBar.HomebaseRatingBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_BlueMenuButton_Settings.Athena_ButtonStyle_BlueMenuButton_Settings_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UAthena_ButtonStyle_BlueMenuButton_Settings_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_BlueMenuButton_Settings.Athena_ButtonStyle_BlueMenuButton_Settings_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Right.ButtonStyle_PageChevron_Right_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_PageChevron_Right_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Right.ButtonStyle_PageChevron_Right_C");
			return ret;
		}
	};


	// Class /Game/UI/Sidebar/ListEntries/MultiActionConfirmationMenu.MultiActionConfirmationMenu_C
	// Inherited from UFortMultiFriendActionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x470 - 0x450)
	class UMultiActionConfirmationMenu_C : public UFortMultiFriendActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x450(0x8)
		UWidgetAnimation Opened; // 0x458(0x8)
		UHorizontalBox ConfirmationButtons; // 0x460(0x8)
		UCommonRichTextBlock Text_ActionText; // 0x468(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Sidebar/ListEntries/MultiActionConfirmationMenu.MultiActionConfirmationMenu_C");
			return ret;
		}

		void UpdateText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B85A700
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85A900
		void OnActionUpdated(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85AA00
		void OnOpenedAnimationFinished(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6B85A800
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85AD00
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85AC00
		void ExecuteUbergraph_MultiActionConfirmationMenu(int32_t EntryPoint); // Flags: Final 0x15D6B85AB00
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Primary/ButtonStyle-Primary-M.ButtonStyle-Primary-M_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Primary-M_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Primary/ButtonStyle-Primary-M.ButtonStyle-Primary-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/IconTextButton.IconTextButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x199 (0x1579 - 0x13E0)
	class UIconTextButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UCommonTextBlock CenterButtonTextWidget; // 0x13E8(0x8)
		UBorder ContentBorder; // 0x13F0(0x8)
		UHorizontalBox HorizontalBox_ButtonContent; // 0x13F8(0x8)
		UImage LeftSideImage; // 0x1400(0x8)
		UNamedSlot RightExtraContentSlot; // 0x1408(0x8)
		FText ButtonText; // 0x1410(0x10)
		FSlateBrush IconBrush; // 0x1420(0xB0)
		UClass ControllerInputStyle; // 0x14D0(0x8)
		UClass MouseKeyboardStyle; // 0x14D8(0x8)
		TEnumAsByte ContentAlignment; // 0x14E0(0x1)
		bool bMouseKeyboardStyleSet; // 0x14E1(0x1)
		unsigned char UnknownData03_6[0x6]; // 0x14E2(0x6) UNKNOWN PROPERTY
		FText OverrideButtonText; // 0x14E8(0x10)
		TEnumAsByte ButtonTextJustification; // 0x14F8(0x1)
		bool bDisplayAllCaps; // 0x14F9(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x14FA(0x6) UNKNOWN PROPERTY
		double PressProgress; // 0x1500(0x8)
		bool bIgnoreInputActionWidgetText; // 0x1508(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x1509(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate FocusChangedEvent; // 0x1510(0x10)
		FSlateFontInfo Font; // 0x1520(0x58)
		bool UseLightInput; // 0x1578(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/IconTextButton.IconTextButton_C");
			return ret;
		}

		void BindCommonInputSubsystem(bool bBind); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B85E400
		FEventReply OnFocusReceived(FGeometry MyGeometry, FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B85D700
		void GetPressProgress(double& Progress); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B85DD00
		void Get Dynamic Material(UMaterialInstanceDynamic& Ret Material); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B85DE00
		void ShowIcon(bool bShouldShow); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85CB00
		void SetTextInternal(FText InButtonText); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B85CC00
		void SetInitialMouseKeyboardStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85CF00
		void UpdateTextStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85FF00
		void SetContentAlignment(TEnumAsByte ContentAlignment); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85D100
		void UpdateContentAlignment(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B85CA00
		void SetMouseKeyboardStyle(UClass ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85CE00
		void UpdateStyle(bool UsingGamepad); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85C900
		void UpdateText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6B85C800
		void SetControllerStyle(UClass ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85D000
		void UpdateTextAndStyle(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85C700
		void InitializeButton(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85DC00
		void Set Icon(FSlateBrush IconBrush); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85D300
		void Set Text(FText ButtonText); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85D200
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85D900
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85D400
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B85CD00
		void OnTriggeredInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B85D600
		void OnActionProgress(float HeldPercent); // Flags: Event|Protected|BlueprintEvent 0x15D6B85DA00
		void OnActionComplete(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85DB00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85E200
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85E100
		void OnTriggeringInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B85D500
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85D800
		void BndEvt__UI_BigGoldButton_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent 0x15D6B85E300
		void ExecuteUbergraph_IconTextButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B85E000
		void FocusChangedEvent__DelegateSignature(bool HasFocus); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6B85DF00
	};


	// Class /Game/UI/Foundation/Buttons/ScrollingTextButton.ScrollingTextButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xF3 (0x14D3 - 0x13E0)
	class UScrollingTextButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UCommonTextBlock CenterButtonTextWidget; // 0x13E8(0x8)
		UBorder ContentBorder; // 0x13F0(0x8)
		UImage LeftSideImage; // 0x13F8(0x8)
		FText ButtonText; // 0x1400(0x10)
		FSlateBrush IconBrush; // 0x1410(0xB0)
		UClass ControllerInputStyle; // 0x14C0(0x8)
		UClass MouseKeyboardStyle; // 0x14C8(0x8)
		TEnumAsByte ContentAlignment; // 0x14D0(0x1)
		bool bMouseKeyboardStyleSet; // 0x14D1(0x1)
		bool UseLightInput; // 0x14D2(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ScrollingTextButton.ScrollingTextButton_C");
			return ret;
		}

		void SetInitialMouseKeyboardStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85EC00
		void UpdateTextStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60151F00
		void SetContentAlignment(TEnumAsByte ContentAlignment); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85EE00
		void UpdateContentAlignment(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D6B85E900
		void SetMouseKeyboardStyle(UClass ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85EB00
		void UpdateStyle(bool UsingGamepad); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85E800
		void UpdateText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60152100
		void SetControllerStyle(UClass ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85ED00
		void UpdateTextAndStyle(bool bUsingGamepad); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60152000
		void InitializeButton(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85F600
		void Set Icon(FSlateBrush IconBrush); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85F000
		void Set Text(FText ButtonText); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6B85EF00
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6B85EA00
		void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent 0x15D6B85FA00
		void OnTriggeredInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D6B85F200
		void OnActionProgress(float HeldPercent); // Flags: Event|Protected|BlueprintEvent 0x15D6B85F400
		void OnActionComplete(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85F500
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85F800
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6B85F100
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent 0x15D6B85F300
		void BndEvt__UI_BigGoldButton_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent 0x15D6B85F900
		void ExecuteUbergraph_ScrollingTextButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6B85F700
	};


	// Class /Game/UI/Foundation/Modals/PlayerReporting/SocialBanModal.SocialBanModal_C
	// Inherited from UFortSocialBanModal -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x88 (0x5C8 - 0x540)
	class USocialBanModal_C : public UFortSocialBanModal	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x540(0x8)
		UCommonTextBlock disclaimer; // 0x548(0x8)
		UCommonTextBlock disclaimer; // 0x550(0x8)
		UCommonTextBlock disclaimer; // 0x558(0x8)
		UImage Image_Severe; // 0x560(0x8)
		ULightbox_C Lightbox; // 0x568(0x8)
		UCommonWidgetSwitcherLegacy Switcher_Message; // 0x570(0x8)
		UCommonTextBlock Title; // 0x578(0x8)
		UCommonTextBlock Title; // 0x580(0x8)
		UImage Triangles; // 0x588(0x8)
		UImage Triangles; // 0x590(0x8)
		UImage Triangles; // 0x598(0x8)
		UVerticalBox VBox_Banned; // 0x5A0(0x8)
		UVerticalBox VBox_Warned; // 0x5A8(0x8)
		UWidgetSwitcher WidgetSwitcher_SeverityImage; // 0x5B0(0x8)
		FMulticastInlineDelegate OnCloseSucceeded; // 0x5B8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Modals/PlayerReporting/SocialBanModal.SocialBanModal_C");
			return ret;
		}

		void OnDisplayModeSet(bool bIsBanned); // Flags: Event|Protected|BlueprintEvent 0x15D60151B00
		void ExecuteUbergraph_SocialBanModal(int32_t EntryPoint); // Flags: Final 0x15D60151D00
		void OnCloseSucceeded__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D60151C00
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-ToolTipShadow.Border-SolidBG-ToolTipShadow_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-ToolTipShadow_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-ToolTipShadow.Border-SolidBG-ToolTipShadow_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/PanelButton.PanelButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1430 - 0x13E0)
	class UPanelButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UNamedSlot ContentSlot; // 0x13E8(0x8)
		UClass ControllerInputStyle; // 0x13F0(0x8)
		UClass MouseKeyboardStyle; // 0x13F8(0x8)
		TEnumAsByte InputActionHorizontalAlignment; // 0x1400(0x1)
		TEnumAsByte InputActionVerticalAlignment; // 0x1401(0x1)
		unsigned char UnknownData02_6[0x6]; // 0x1402(0x6) UNKNOWN PROPERTY
		FVector2D InputActionRenderTranslation; // 0x1408(0x10)
		bool InputActionUseRimBrush; // 0x1418(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x1419(0x7) UNKNOWN PROPERTY
		FVector2D InputActionRimBrushSize; // 0x1420(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/PanelButton.PanelButton_C");
			return ret;
		}

		void UpdateInputActionLayout(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60153900
		void UpdateStyle(bool bUsingGamepad); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60153800
		void InitializeButton(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60153E00
		void UpdateTextAndStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60153700
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60153A00
		void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent 0x15D60150100
		void OnTriggeredInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D60153B00
		void OnActionProgress(float HeldPercent); // Flags: Event|Protected|BlueprintEvent 0x15D60153C00
		void OnActionComplete(); // Flags: Event|Protected|BlueprintEvent 0x15D60153D00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60154000
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D60154200
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D60154100
		void ExecuteUbergraph_PanelButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D60153F00
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-RotatorBorder.ButtonStyle-RotatorBorder_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-RotatorBorder_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-RotatorBorder.ButtonStyle-RotatorBorder_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextRotatorWhite.TextRotatorWhite_C
	// Inherited from UCommonRotator -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x1410 - 0x13F8)
	class UTextRotatorWhite_C : public UCommonRotator	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x13F8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1400(0x8)
		UCommonBorder MainBorder; // 0x1408(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextRotatorWhite.TextRotatorWhite_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60153400
		void ExecuteUbergraph_TextRotatorWhite(int32_t EntryPoint); // Flags: Final 0x15D60153300
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-ToolTip.Border-SolidBG-ToolTip_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-ToolTip_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-ToolTip.Border-SolidBG-ToolTip_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA0 (0x380 - 0x2E0)
	class UXpBarToolTip_C : public UCommonUserWidget	
	{
	public:
		UCommonTextBlock CommonTextBlock; // 0x2E0(0x8)
		UCommonTextBlock CommonTextBlock; // 0x2E8(0x8)
		UCommonTextBlock CommonTextBlock; // 0x2F0(0x8)
		UCommonTextBlock CommonTextBlock; // 0x2F8(0x8)
		UCommonTextBlock CommonTextBlock; // 0x300(0x8)
		UImage Image; // 0x308(0x8)
		UImage Image; // 0x310(0x8)
		UImage Image; // 0x318(0x8)
		UImage Image; // 0x320(0x8)
		UImage Image; // 0x328(0x8)
		FText HeaderText; // 0x330(0x10)
		FText CommanderXPText; // 0x340(0x10)
		FText BoostXPText; // 0x350(0x10)
		FText RestedXPText; // 0x360(0x10)
		FText BodyText; // 0x370(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C");
			return ret;
		}

		FText GetBodyText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152F00
		FText GetRestedXPText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152B00
		FText GetBoostXPText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152E00
		FText GetCommanderXPText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152D00
		FText GetHeaderText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152C00
	};


	// Class /Game/UI/Tooltips/Tooltip-Custom-S.Tooltip-Custom-S_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x320 - 0x2B8)
	class UTooltip-Custom-S_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UImage _hr_; // 0x2C0(0x8)
		UHorizontalBox Body_HBox; // 0x2C8(0x8)
		UNamedSlot Content_Slot; // 0x2D0(0x8)
		UHorizontalBox Header_HBox; // 0x2D8(0x8)
		UImage Icon_Header; // 0x2E0(0x8)
		USpacer Spacer_Header; // 0x2E8(0x8)
		USpacer Spacer_Icon; // 0x2F0(0x8)
		UTextBlock Text_Header; // 0x2F8(0x8)
		FText HeaderText; // 0x300(0x10)
		USlateBrushAsset Icon_Brush; // 0x310(0x8)
		UUserWidget ContentWidget; // 0x318(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Tooltips/Tooltip-Custom-S.Tooltip-Custom-S_C");
			return ret;
		}

		FSlateBrush Get Icon Brush(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152400
		FText Get Header Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152500
		FText Get Body Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60152600
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60152800
		void ExecuteUbergraph_Tooltip-Custom-S(int32_t EntryPoint); // Flags: Final 0x15D60152700
	};


	// Class /Game/UI/Tooltips/Tooltip-Basic-S.Tooltip-Basic-S_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x358 - 0x2E0)
	class UTooltip-Basic-S_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UImage _hr_; // 0x2E8(0x8)
		UHorizontalBox Body_HBox; // 0x2F0(0x8)
		UHorizontalBox Header_HBox; // 0x2F8(0x8)
		UImage Icon_Header; // 0x300(0x8)
		USpacer Spacer_Icon; // 0x308(0x8)
		UCommonTextBlock Text_Body; // 0x310(0x8)
		UCommonTextBlock Text_Header; // 0x318(0x8)
		FText BodyText; // 0x320(0x10)
		FText HeaderText; // 0x330(0x10)
		USlateBrushAsset Icon_Brush; // 0x340(0x8)
		UClass Body_Style; // 0x348(0x8)
		UClass Header_Style; // 0x350(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Tooltips/Tooltip-Basic-S.Tooltip-Basic-S_C");
			return ret;
		}

		FSlateBrush Get Icon Brush(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60156100
		FText Get Header Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60156200
		FText Get Body Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60156300
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60152300
		void ExecuteUbergraph_Tooltip-Basic-S(int32_t EntryPoint); // Flags: Final 0x15D60152200
	};


	// Class /Game/UI/Tooltips/TooltipLibrary.TooltipLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTooltipLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Tooltips/TooltipLibrary.TooltipLibrary_C");
			return ret;
		}

		void CreateXPTooltip(APlayerController Owner, FText Header, FText CommanderXP, FText BoostXP, FText RestXP, FText Body, UObject __WorldContext, UCommonUserWidget& Out); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D60155D00
		void Create Compare Item Tooltip(APlayerController Owning Player, FText Header Text, USlateBrushAsset Header Icon, UFortItem Item, UFortItem ComparedItem, UObject __WorldContext, UWidget& Return Value); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D60156000
		void Create Item Tooltip(APlayerController Owning Player, FText Header Text, USlateBrushAsset Header Icon, UFortItem Item, int32_t OverrideQuantity, UObject __WorldContext, UWidget& Return Value); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D60155E00
		void Set Enabled And Tooltip Text(UWidget Widget, bool Enabled, FText Tooltip Text, UObject __WorldContext); // Flags: Static|Public|BlueprintCallable|BlueprintEvent 0x15D60155C00
		void Create Custom Tooltip(APlayerController Owning Player, FText Header Text, USlateBrushAsset Icon Brush, UUserWidget Widget, UObject __WorldContext, UUserWidget& Output); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D60155F00
		void Create Basic Tooltip(APlayerController Owning Player, FText Body Text, FText Header Text, USlateBrushAsset Icon Brush, UClass Header Style, UClass Body Style, UObject __WorldContext, UUserWidget& Output); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D3FBE2800
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Radio/ButtonStyle-Primary-Radio-M.ButtonStyle-Primary-Radio-M_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Primary-Radio-M_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Radio/ButtonStyle-Primary-Radio-M.ButtonStyle-Primary-Radio-M_C");
			return ret;
		}
	};


	// Class /Game/UI/RadioButtonGroup/FortRadioButtonGroup.FortRadioButtonGroup_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x320 - 0x2B8)
	class UFortRadioButtonGroup_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		USizeBox SizeBox_Buttons; // 0x2C0(0x8)
		UVerticalBox VerticalBox_Buttons; // 0x2C8(0x8)
		TArray Buttons; // 0x2D0(0x10)
		TArray CreatedButtons; // 0x2E0(0x10)
		FMulticastInlineDelegate RadioButtonClicked_Event; // 0x2F0(0x10)
		double WidthOverride; // 0x300(0x8)
		UCommonButtonGroupLegacy CreatedButtonsGroup; // 0x308(0x8)
		UClass CommonButtonGroup; // 0x310(0x8)
		double HeightOverride; // 0x318(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/RadioButtonGroup/FortRadioButtonGroup.FortRadioButtonGroup_C");
			return ret;
		}

		void CenterOnWidget(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60158000
		void OnButtonClicked_Bind(UCommonButtonLegacy AssociatedButton, int32_t ButtonIndex); // Flags: BlueprintCallable|BlueprintEvent 0x15D60157D00
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60157F00
		void UpdateButtons(); // Flags: BlueprintCallable|BlueprintEvent 0x15D60157B00
		void ExecuteUbergraph_FortRadioButtonGroup(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D60157E00
		void RadioButtonClicked_Event__DelegateSignature(int32_t SelectedIndex); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D60157C00
	};


	// Class /Game/UI/Frontend/Settings/OptionsMenuSetting.OptionsMenuSetting_C
	// Inherited from UFortOptionsMenuSetting -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x80 (0x3D0 - 0x350)
	class UOptionsMenuSetting_C : public UFortOptionsMenuSetting	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x8)
		UButton Button; // 0x358(0x8)
		UIconTextButton_C ButtonTouchTooltip; // 0x360(0x8)
		UHorizontalBox HorizontalBox_Right; // 0x368(0x8)
		UMenuAnchor MenuAnchorSettingDescription; // 0x370(0x8)
		USizeBox SizeBoxContainer; // 0x378(0x8)
		USizeBox SizeBoxLabel; // 0x380(0x8)
		UImage SliderBackground; // 0x388(0x8)
		UCommonTextBlock SliderText; // 0x390(0x8)
		UCommonTextBlock SliderValue; // 0x398(0x8)
		USpacer Spacer_Right; // 0x3A0(0x8)
		USpacer SpacerBottom; // 0x3A8(0x8)
		UMaterialInstanceDynamic Slider_Texture; // 0x3B0(0x8)
		TEnumAsByte RoundingMode; // 0x3B8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x3B9(0x7) UNKNOWN PROPERTY
		FVector2D ToolTipSizeMobile; // 0x3C0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/OptionsMenuSetting.OptionsMenuSetting_C");
			return ret;
		}

		void SetFontSize(UCommonTextBlock Text, int32_t DefaulFontSize, int32_t MobileFont); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6015A500
		void Update Visuals_BP(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6015A200
		void ConvertSettingsValueToSliderValue(double SettingsValue, double& SliderValue); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60156D00
		void UpdateSliderTexture(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015A000
		void ConvertSliderValueToSettingsValue(double SliderValue, double& SettingsValue); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60156C00
		void SetSliderTextRenderScale(double Scale Normalized); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6015A400
		void Hide Tooltip(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60156900
		void Show Tooltip(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015A300
		UUserWidget OnGetUserMenuContent(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60156800
		void HandlePawnSet(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60156A00
		void UpdateSize(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015A100
		void OnListItemObjectSet(UObject ListItemObject); // Flags: Event|Protected|BlueprintEvent 0x15D60156700
		void BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D60157600
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_86_OnMouseCaptureEndEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D60157300
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_107_OnControllerCaptureEndEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D60157500
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature(float Value); // Flags: BlueprintEvent 0x15D60157200
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature(float Value); // Flags: BlueprintEvent 0x15D60157400
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D60157000
		void BP_OnEntryReleased(); // Flags: Event|Protected|BlueprintEvent 0x15D60157100
		void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D60156600
		void OnMouseLeave(FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 0x15D60156500
		void Refresh(); // Flags: BlueprintCallable|BlueprintEvent 0x15D60156400
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60156E00
		void BP_OnItemSelectionChanged(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent 0x15D60156F00
		void UpdateVisuals(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x15D60159F00
		void ExecuteUbergraph_OptionsMenuSetting(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D60156B00
	};


	// Class /Game/UI/Frontend/Settings/Deadzone/DeadzoneAdjustment.DeadzoneAdjustment_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x29 (0x2E1 - 0x2B8)
	class UDeadzoneAdjustment_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UImage Deadzone_Adjustment; // 0x2C0(0x8)
		UOptionsMenuSetting_C Deadzone_Adjustment_Slider; // 0x2C8(0x8)
		UImage Deadzone_Max; // 0x2D0(0x8)
		UIconTextButton_C ResetButton; // 0x2D8(0x8)
		ESettingType SettingType; // 0x2E0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/Deadzone/DeadzoneAdjustment.DeadzoneAdjustment_C");
			return ret;
		}

		UWidget DoCustomNavigation(EUINavigation Navigation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D60159B00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60159C00
		void OnValueChanged_Bind(float Value); // Flags: BlueprintCallable|BlueprintEvent 0x15D60159900
		void ExecuteUbergraph_DeadzoneAdjustment(int32_t EntryPoint); // Flags: Final 0x15D60159A00
	};


	// Class /Game/UI/Foundation/Profile/PlayerBanner.PlayerBanner_C
	// Inherited from UFortAccountWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x390 - 0x318)
	class UPlayerBanner_C : public UFortAccountWidgetBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x8)
		UImage BannerImage; // 0x320(0x8)
		UCommonLoadGuard LoadGuard; // 0x328(0x8)
		UImage SurroundImage; // 0x330(0x8)
		UCommonLoadGuard SurroundLoadGuard; // 0x338(0x8)
		bool bUseLargeTexture; // 0x340(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x341(0x7) UNKNOWN PROPERTY
		FUniqueNetIdRepl OwnerNetId; // 0x348(0x30)
		FName CurrentBannerColorId; // 0x378(0x4)
		FName CurrentBannerIconId; // 0x37C(0x4)
		bool SurroundEnabled; // 0x380(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x381(0x7) UNKNOWN PROPERTY
		UMaterialInterface BannerMaterialInstance; // 0x388(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Profile/PlayerBanner.PlayerBanner_C");
			return ret;
		}

		void Update Material Instance(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015C600
		void UnbindDelegates(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60158500
		void SetupSurround(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60158700
		void SetBannerIconAndColorFromProfile(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60158B00
		void SetBannerIconAndColor(FName IconId, FName ColorId); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60158C00
		void ToggleBannerMask(bool Enable); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60158600
		void RefreshSurround(int32_t Level); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60158E00
		void OnSurroundIconLoaded(UObject LoadedObject); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60159000
		void EnableSurround(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60159400
		void ClearBannerState(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60159600
		void OnBannerIconLoaded(UObject LoadedObject); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60159100
		void GetBannerMID(UMaterialInstanceDynamic& BannerMID); // Flags: Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D60159200
		void SetBannerOwner(FUniqueNetIdRepl OwnerId); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D60158800
		void SetBannerColorId(FName InBannerColorId); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60158D00
		void SetBannerIconId(FName InBannerIconId); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D60158A00
		void SetBannerImage(FFortHomeBaseInfo Image info, bool& Success); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D60158900
		void Account Info Changed(FFortPublicAccountInfo NewInfo); // Flags: BlueprintCallable|BlueprintEvent 0x15D60159700
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60159500
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D60158F00
		void ExecuteUbergraph_PlayerBanner(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D60159300
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_SocialInteraction.ButtonStyle-Skew_SocialInteraction_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Skew_SocialInteraction_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_SocialInteraction.ButtonStyle-Skew_SocialInteraction_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-MainL.Border-MainL_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-MainL_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-MainL.Border-MainL_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-MainModal.Border-MainModal_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-MainModal_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-MainModal.Border-MainModal_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-ModalHeader.Border-ModalHeader_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ModalHeader_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ModalHeader.Border-ModalHeader_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border_LightBlue_VGrad.Border_LightBlue_VGrad_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder_LightBlue_VGrad_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border_LightBlue_VGrad.Border_LightBlue_VGrad_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings_NonInteractable.ButtonStyle-GamepadBindings_NonInteractable_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-GamepadBindings_NonInteractable_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings_NonInteractable.ButtonStyle-GamepadBindings_NonInteractable_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-ItemInfo-Unlocked.Border-ItemInfo-Unlocked_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ItemInfo-Unlocked_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ItemInfo-Unlocked.Border-ItemInfo-Unlocked_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-ItemInfo-Locked.Border-ItemInfo-Locked_C
	// Inherited from UBorder-ItemInfo-Unlocked_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ItemInfo-Locked_C : public UBorder-ItemInfo-Unlocked_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ItemInfo-Locked.Border-ItemInfo-Locked_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-StatItem.Border-SolidBG-StatItem_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-StatItem_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-StatItem.Border-SolidBG-StatItem_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-ShellBlue.Border-SolidBG-ShellBlue_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-ShellBlue_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-ShellBlue.Border-SolidBG-ShellBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-Bang.Border-Bang_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-Bang_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-Bang.Border-Bang_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Bangs/NormalBangWrapper.NormalBangWrapper_C
	// Inherited from UFortBangWrapper_NUI -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x82 (0x37A - 0x2F8)
	class UNormalBangWrapper_C : public UFortBangWrapper_NUI	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2F8(0x8)
		UWidgetAnimation IntroSuperBang; // 0x300(0x8)
		UWidgetAnimation Intro; // 0x308(0x8)
		UWidgetAnimation TutorialGlow; // 0x310(0x8)
		USizeBox BangBox; // 0x318(0x8)
		USizeBox BigBang; // 0x320(0x8)
		USizeBox BigBangCount; // 0x328(0x8)
		UCommonTextBlock CommonTextBlock; // 0x330(0x8)
		UNamedSlot Content; // 0x338(0x8)
		UCommonTextBlock CountText; // 0x340(0x8)
		UWidgetSwitcher ModeSwitcher; // 0x348(0x8)
		USizeBox SmallBang; // 0x350(0x8)
		USizeBox SmallBangCount; // 0x358(0x8)
		USizeBox SuperBang; // 0x360(0x8)
		UCommonBorder TutorialBorder; // 0x368(0x8)
		bool UseSmallVersion; // 0x370(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x371(0x3) UNKNOWN PROPERTY
		int32_t Count; // 0x374(0x4)
		bool bUseSuperBangNoCount; // 0x378(0x1)
		bool ShouldSuppressBang; // 0x379(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Bangs/NormalBangWrapper.NormalBangWrapper_C");
			return ret;
		}

		void SetShouldSuppressBang(bool ShouldSuppressBang); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015E100
		void InitialReset(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015E600
		void TriggerReset(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015DE00
		void TriggerIntro(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015DF00
		void Adjust Bang Image Translation(FVector2D Translation); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015A600
		void Update Bang Icon Version(int32_t InCount); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015DD00
		void SetTutorialBorderStyle(UClass BorderStyle); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015E000
		void OnStopCallout(); // Flags: Event|Protected|BlueprintEvent 0x15D6015E300
		void OnStartCallout(FName TutorialObjectiveName, ETutorialType TutorialType); // Flags: Event|Protected|BlueprintEvent 0x15D6015E400
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6015E200
		void OnBangStateChanged(bool bEnabled, int32_t Count); // Flags: Event|Protected|BlueprintEvent 0x15D6015E500
		void ExecuteUbergraph_NormalBangWrapper(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6015E700
	};


	// Class /Game/UI/Foundation/Buttons/IconTabButton_Legacy.IconTabButton_Legacy_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x150 (0x1530 - 0x13E0)
	class UIconTabButton_Legacy_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UNormalBangWrapper_C BangWrapper; // 0x13E8(0x8)
		UCommonTextBlock CenterButtonTextWidget; // 0x13F0(0x8)
		UHorizontalBox ContentHB; // 0x13F8(0x8)
		UImage LeftSideImage; // 0x1400(0x8)
		USizeBox SizeBoxShell; // 0x1408(0x8)
		FText ButtonText; // 0x1410(0x10)
		FSlateBrush IconBrush; // 0x1420(0xB0)
		bool UseText; // 0x14D0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x14D1(0x3) UNKNOWN PROPERTY
		FLinearColor SelectedIconTint; // 0x14D4(0x10)
		FLinearColor DeselectedIconTint; // 0x14E4(0x10)
		FLinearColor HoveredIconTint; // 0x14F4(0x10)
		bool bBangEnabled; // 0x1504(0x1)
		bool ChangeIconColorWhenSelected; // 0x1505(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x1506(0x2) UNKNOWN PROPERTY
		FSlateColor SelectedIconColor; // 0x1508(0x14)
		FSlateColor UnSelectedIconColor; // 0x151C(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/IconTabButton_Legacy.IconTabButton_Legacy_C");
			return ret;
		}

		void Play Hover Sound(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6015D200
		void SetChangeIconColorWhenSelected(bool ChangeColorWhenSelected, FSlateColor SelectedColor, FSlateColor UnselectedColor); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6015CE00
		void Update Bang State(bool bBangEnabled, int32_t Count); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015CA00
		void SetTutorialBorderStyle(UClass BorderStyle); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015CC00
		void ShowText(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015CB00
		void Set Icon(FSlateBrush IconBrush); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015D000
		void Set Text(FText ButtonText); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015CF00
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6015D100
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6015CD00
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent 0x15D6015D700
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent 0x15D6015DB00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6015D500
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D6015D800
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D6015D600
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent 0x15D6015D900
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent 0x15D6015DA00
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent 0x15D6015D300
		void ExecuteUbergraph_IconTabButton_Legacy(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6015D400
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Manage.ButtonStyle-Tab-Manage_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Tab-Manage_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Manage.ButtonStyle-Tab-Manage_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/SoloButton.SoloButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x62 (0x1442 - 0x13E0)
	class USoloButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation Pressed; // 0x13E8(0x8)
		UWidgetAnimation Hover; // 0x13F0(0x8)
		UBorder Border_Container; // 0x13F8(0x8)
		UImage ButtonBacking; // 0x1400(0x8)
		USizeBox SizeBox_Control; // 0x1408(0x8)
		UCommonTextBlock Text_ButtonAction; // 0x1410(0x8)
		FText Button_Description; // 0x1418(0x10)
		bool FontSizeOveride; // 0x1428(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x1429(0x3) UNKNOWN PROPERTY
		int32_t FontSize; // 0x142C(0x4)
		FMargin Padding_Overide; // 0x1430(0x10)
		bool PaddingOveride; // 0x1440(0x1)
		bool IsDisabled; // 0x1441(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/SoloButton.SoloButton_C");
			return ret;
		}

		void SetText(FText Text); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6015F600
		void HandleSize(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6015F800
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6015FA00
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6015F700
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D6015FC00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D6015FB00
		void BP_OnClicked(); // Flags: Event|Protected|BlueprintEvent 0x15D6015FF00
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent 0x15D6015FE00
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent 0x15D6015FD00
		void ExecuteUbergraph_SoloButton(int32_t EntryPoint); // Flags: Final 0x15D6015F900
	};


	// Class /Game/UI/Foundation/TabbedView/HorizontalTabList_Legacy.HorizontalTabList_Legacy_C
	// Inherited from UFortTabListWidgetBase_Legacy -> UCommonTabListWidgetLegacy -> UCommonTabListWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA0 (0x5A8 - 0x508)
	class UHorizontalTabList_Legacy_C : public UFortTabListWidgetBase_Legacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x508(0x8)
		UImage ImageGamepadKeyPrompt; // 0x510(0x8)
		UImage ImageHorizRule; // 0x518(0x8)
		UCommonActionWidget NextTabAction; // 0x520(0x8)
		USizeBox NextTabActionWrapper; // 0x528(0x8)
		UOverlay Overlay_Container; // 0x530(0x8)
		UCommonActionWidget PreviousTabAction; // 0x538(0x8)
		USizeBox PreviousTabActionWrapper; // 0x540(0x8)
		UHorizontalBox TabButtonBox; // 0x548(0x8)
		FMargin TabButtonPadding; // 0x550(0x10)
		UClass ButtonStyle; // 0x560(0x8)
		bool UseButtonStyle; // 0x568(0x1)
		bool ShowGamePadInputPrompt; // 0x569(0x1)
		bool ShowRail; // 0x56A(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x56B(0x1) UNKNOWN PROPERTY
		int32_t MinTabWidth; // 0x56C(0x4)
		bool ForceTabLabelsCollapsed; // 0x570(0x1)
		bool ForceTabIconsCollapsed; // 0x571(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x572(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate RefreshGamepad; // 0x578(0x10)
		UClass DebugButtonTypeDisplay; // 0x588(0x8)
		int32_t DebugTabCount; // 0x590(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x594(0x4) UNKNOWN PROPERTY
		double PreviousTabActionPaddingRight; // 0x598(0x8)
		double NextTabActionPaddingLeft; // 0x5A0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/TabbedView/HorizontalTabList_Legacy.HorizontalTabList_Legacy_C");
			return ret;
		}

		void DebugCreateTabsForDesigner(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D63E23E00
		void UpdateTabStyles(UCommonButtonBase ButtonWidget); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D63E23400
		void SetVerticalAlignment(TEnumAsByte FillVertically); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D63E23600
		void UpdateGamepadKeyVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D63E23500
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E23900
		void Refresh Next/Previous Visibility(); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E23800
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E24100
		void CustomEvent(FName TabID); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E24000
		void HandleOnInputMethodChanged(ECommonInputType bNewInputType); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E23C00
		void CustomEvent(ESlateVisibility InVisibility); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E23F00
		void HandleTabCreation(FName TabNameID, UCommonButtonBase TabButton); // Flags: Event|Protected|BlueprintEvent 0x15D63E23B00
		void HandleTabRemoval(FName TabNameID, UCommonButtonBase TabButton); // Flags: Event|Protected|BlueprintEvent 0x15D63E23A00
		void ExecuteUbergraph_HorizontalTabList_Legacy(int32_t EntryPoint); // Flags: Final 0x15D63E23D00
		void RefreshGamepad__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D63E23700
	};


	// Class /Game/UI/Foundation/Movie/ActivatableMovieWidget.ActivatableMovieWidget_C
	// Inherited from UFortActivatableVideoPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x660 - 0x648)
	class UActivatableMovieWidget_C : public UFortActivatableVideoPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x648(0x8)
		USafeZone MainSafeZone; // 0x650(0x8)
		USafeZone SafeZone; // 0x658(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Movie/ActivatableMovieWidget.ActivatableMovieWidget_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E23100
		void ExecuteUbergraph_ActivatableMovieWidget(int32_t EntryPoint); // Flags: Final 0x15D63E23000
	};


	// Class /Game/UI/Foundation/Progress/ProgressWidget.ProgressWidget_C
	// Inherited from UFortProgressWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x310 - 0x2F8)
	class UProgressWidget_C : public UFortProgressWidget	
	{
	public:
		USizeBox ProgressSizeBox; // 0x2F8(0x8)
		UImage ProgressSpinner; // 0x300(0x8)
		UVerticalBox ProgressVBox; // 0x308(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Progress/ProgressWidget.ProgressWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Modals/ProgressModal/ProgressModalWidget.ProgressModalWidget_C
	// Inherited from UFortProgressModal -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x660 - 0x650)
	class UProgressModalWidget_C : public UFortProgressModal	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x650(0x8)
		ULightbox_C Lightbox; // 0x658(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Modals/ProgressModal/ProgressModalWidget.ProgressModalWidget_C");
			return ret;
		}

		FEventReply OnAnalogValueChanged(FGeometry MyGeometry, FAnalogInputEvent InAnalogInputEvent); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D63E22700
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E22C00
		void HandleIntroEnded(); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E22900
		void HandleOutroEnded(); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E22800
		void OnBeginIntro(); // Flags: Event|Protected|BlueprintEvent 0x15D63E22600
		void OnBeginOutro(); // Flags: Event|Protected|BlueprintEvent 0x15D63E22500
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E22B00
		void ExecuteUbergraph_ProgressModalWidget(int32_t EntryPoint); // Flags: Final 0x15D63E22A00
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Left.ButtonStyle_PageChevron_Left_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_PageChevron_Left_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Left.ButtonStyle_PageChevron_Left_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/ReferAFriendActionMenu.ReferAFriendActionMenu_C
	// Inherited from UFortReferFriendActionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x4A0 - 0x440)
	class UReferAFriendActionMenu_C : public UFortReferFriendActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x440(0x8)
		UWidgetAnimation ConfirmationOpened; // 0x448(0x8)
		UWidgetAnimation Opened; // 0x450(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x458(0x8)
		UCommonRichTextBlock CommonRichTextBlock; // 0x460(0x8)
		UCommonRichTextBlock CommonRichTextBlock; // 0x468(0x8)
		UBorder EntryBorder; // 0x470(0x8)
		UImage Image_AddFriendsQR; // 0x478(0x8)
		UImage Image_PartyUpQR; // 0x480(0x8)
		UImage Image_Platform; // 0x488(0x8)
		UCommonRichTextBlock Text_DisplayName; // 0x490(0x8)
		UWidgetSwitcher WidgetSwitcher_QR; // 0x498(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ReferAFriendActionMenu.ReferAFriendActionMenu_C");
			return ret;
		}

		void Set QRt Image(EReferFriendOrigin Origin); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D63E25400
		FEventReply OnKeyUp(FGeometry MyGeometry, FKeyEvent InKeyEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D63E25700
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent 0x15D63E25600
		void OnRequestOriginChanged(EReferFriendOrigin RequestOrigin); // Flags: Event|Public|BlueprintEvent 0x15D63E25500
		void ExecuteUbergraph_ReferAFriendActionMenu(int32_t EntryPoint); // Flags: Final 0x15D63E25800
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingButton.LocalUserSettingButton_C
	// Inherited from UFortLocalUserSettingButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x1420 - 0x1400)
	class ULocalUserSettingButton_C : public UFortLocalUserSettingButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1400(0x8)
		UWidgetAnimation OnHover; // 0x1408(0x8)
		UBorder Border_InteractionIndicator; // 0x1410(0x8)
		UImage Image_AnimatedArrow; // 0x1418(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingButton.LocalUserSettingButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E25200
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E25100
		void ExecuteUbergraph_LocalUserSettingButton(int32_t EntryPoint); // Flags: Final 0x15D63E25000
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingTitle.LocalUserSettingTitle_C
	// Inherited from UFortLocalUserSettingTitleButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x1418 - 0x13F0)
	class ULocalUserSettingTitle_C : public UFortLocalUserSettingTitleButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UWidgetAnimation OnExpansion; // 0x13F8(0x8)
		UWidgetAnimation OnHover; // 0x1400(0x8)
		UImage ExpandDirectionTick; // 0x1408(0x8)
		USizeBox SB_EntryContent; // 0x1410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingTitle.LocalUserSettingTitle_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E24B00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E24C00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E24D00
		void OnExpansionChanged(bool bIsExpanded); // Flags: Event|Public|BlueprintEvent 0x15D63E24900
		void ExecuteUbergraph_LocalUserSettingTitle(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E24A00
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingSection.LocalUserSettingSection_C
	// Inherited from UFortLocalUserSettingsSection -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x338 - 0x338)
	class ULocalUserSettingSection_C : public UFortLocalUserSettingsSection	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingSection.LocalUserSettingSection_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingsMenu.LocalUserSettingsMenu_C
	// Inherited from UFortLocalUserSettingsMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x430 - 0x430)
	class ULocalUserSettingsMenu_C : public UFortLocalUserSettingsMenu	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingsMenu.LocalUserSettingsMenu_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/Art/ButtonStyle_VoiceHeader.ButtonStyle_VoiceHeader_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_VoiceHeader_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/Art/ButtonStyle_VoiceHeader.ButtonStyle_VoiceHeader_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/VoiceChannelHeaderButton.VoiceChannelHeaderButton_C
	// Inherited from UFortVoiceChannelHeaderButton -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA8 (0x1508 - 0x1460)
	class UVoiceChannelHeaderButton_C : public UFortVoiceChannelHeaderButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1460(0x8)
		UWidgetAnimation OnExpansion; // 0x1468(0x8)
		UWidgetAnimation JoinSlideOut; // 0x1470(0x8)
		UWidgetAnimation ScaleUp; // 0x1478(0x8)
		UFortMobileImage ExpandDirectionTick; // 0x1480(0x8)
		UHorizontalBox HBox_Join; // 0x1488(0x8)
		UImage Image_VoiceChatWarning; // 0x1490(0x8)
		UCommonRichTextBlock JoinText; // 0x1498(0x8)
		UImage NotTransmitting; // 0x14A0(0x8)
		UCommonRichTextBlock OffText; // 0x14A8(0x8)
		UWidgetSwitcher OnOffSwitcher; // 0x14B0(0x8)
		UCommonRichTextBlock OnText; // 0x14B8(0x8)
		UOverlay Overlay; // 0x14C0(0x8)
		UImage SelectionBackplate; // 0x14C8(0x8)
		UWidgetSwitcher SimultaneousChannelSwitcher; // 0x14D0(0x8)
		UWidgetSwitcher Switch_Transmitting; // 0x14D8(0x8)
		UImage Transmitting; // 0x14E0(0x8)
		FLinearColor VoiceStatusActiveColor; // 0x14E8(0x10)
		FLinearColor VoiceStatusWarningColor; // 0x14F8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/VoiceChannelHeaderButton.VoiceChannelHeaderButton_C");
			return ret;
		}

		void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction); // Flags: Event|Protected|BlueprintEvent 0x15D63E28100
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E24400
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E28400
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent 0x15D63E24600
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent 0x15D63E24500
		void OnListItemObjectSet(UObject ListItemObject); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E28200
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D63E24300
		void ExecuteUbergraph_VoiceChannelHeaderButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E28300
	};


	// Class /Game/UI/SocialPanel/VoiceChannelHeaderOptions.VoiceChannelHeaderOptions_C
	// Inherited from UFortVoiceChannelHeaderButton -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x12B (0x158B - 0x1460)
	class UVoiceChannelHeaderOptions_C : public UFortVoiceChannelHeaderButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1460(0x8)
		UWidgetAnimation OnHover; // 0x1468(0x8)
		UWidgetAnimation OnExpansion; // 0x1470(0x8)
		UWidgetAnimation JoinSlideOut; // 0x1478(0x8)
		UWidgetAnimation ScaleUp; // 0x1480(0x8)
		UButton Button_Options; // 0x1488(0x8)
		UHorizontalBox ChannelInfoPanel; // 0x1490(0x8)
		UFortMobileImage ExpandDirectionTick; // 0x1498(0x8)
		UHorizontalBox hb_friends; // 0x14A0(0x8)
		UHorizontalBox HB_Input; // 0x14A8(0x8)
		UHorizontalBox hb_teammates; // 0x14B0(0x8)
		UHorizontalBox HBox_Join; // 0x14B8(0x8)
		UHorizontalBox HorizontalBox_Buttons; // 0x14C0(0x8)
		UHorizontalBox HorizontalBox_Options; // 0x14C8(0x8)
		UCommonActionWidget InputActionWidget; // 0x14D0(0x8)
		UIconTextButton_C JoinLeaveButtonStw; // 0x14D8(0x8)
		UImage NotTransmitting; // 0x14E0(0x8)
		UOverlay Overlay; // 0x14E8(0x8)
		UIconTextButton_C ReportButtonStw; // 0x14F0(0x8)
		UImage SelectionBackplate; // 0x14F8(0x8)
		UWidgetSwitcher Switch_Transmitting; // 0x1500(0x8)
		UCommonActivatableWidgetSwitcher Switcher_Social; // 0x1508(0x8)
		UCommonActivatableWidgetSwitcher Switcher_VoiceReporting; // 0x1510(0x8)
		UCommonTextBlock Text_Bullet_F; // 0x1518(0x8)
		UCommonTextBlock Text_Bullet_FT; // 0x1520(0x8)
		UCommonTextBlock Text_Options; // 0x1528(0x8)
		UCommonTextBlock Text_Social_Friends_Only; // 0x1530(0x8)
		UCommonTextBlock Text_Social_Friends_Only; // 0x1538(0x8)
		UCommonTextBlock Text_Social_None; // 0x1540(0x8)
		UCommonTextBlock Text_VoiceReporting_Off; // 0x1548(0x8)
		UCommonTextBlock Text_VoiceReporting_On; // 0x1550(0x8)
		UImage Transmitting; // 0x1558(0x8)
		UWrapBox WrapBox_Header_Status; // 0x1560(0x8)
		FLinearColor VoiceStatusActiveColor; // 0x1568(0x10)
		FLinearColor VoiceStatusWarningColor; // 0x1578(0x10)
		bool Is_Expanded; // 0x1588(0x1)
		bool Old; // 0x1589(0x1)
		bool Hovered; // 0x158A(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/VoiceChannelHeaderOptions.VoiceChannelHeaderOptions_C");
			return ret;
		}

		UWidget DoCustomNavigation(EUINavigation Navigation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D63E27400
		void SetJoinOrLeaveButton(bool Join); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D63E26B00
		void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction); // Flags: Event|Protected|BlueprintEvent 0x15D63E26E00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E27700
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E27500
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent 0x15D63E27A00
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent 0x15D63E27900
		void OnListItemObjectSet(UObject ListItemObject); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E27000
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D63E27600
		void On Options Expansion Changed(bool IsExpanded); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E27100
		void BndEvt__SidebarVoiceChannelHeader_Button_194_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D63E27F00
		void BndEvt__SidebarVoiceChannelHeader_Button_Options_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D63E27E00
		void BndEvt__SidebarVoiceChannelHeader_Button_Options_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D63E27D00
		void SetExpansionState(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D63E26C00
		void BP_OnFocusReceived(); // Flags: Event|Protected|BlueprintEvent 0x15D63E27800
		void HandleHeaderClicked(); // Flags: Event|Protected|BlueprintEvent 0x15D63E27200
		void Set Header Status Visuals(bool Old); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E26D00
		void OnUpdateOptionsVisuals(ESocialCommsPermission VoicePermission, bool bVoiceReportingIsAvailable, bool bIsRecording, bool bCanJoinOrLeave, bool bMightBeAbleToReport); // Flags: Event|Protected|BlueprintEvent 0x15D63E26F00
		void BndEvt__VoiceChannelHeaderOptions_JoinLeaveButtonStw_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D63E27C00
		void BndEvt__VoiceChannelHeaderOptions_ReportButtonStw_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D63E27B00
		void ExecuteUbergraph_VoiceChannelHeaderOptions(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E27300
	};


	// Class /Game/UI/SocialPanel/SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x13F8 - 0x13E0)
	class USocialPanelWeGameFriendButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation OnHovered; // 0x13E8(0x8)
		UCommonTextBlock Text_LinkPrompt; // 0x13F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E26500
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E26400
		void ExecuteUbergraph_SocialPanelWeGameFriendButton(int32_t EntryPoint); // Flags: Final 0x15D63E2A500
	};


	// Class /Game/UI/SocialPanel/Art/ButtonStyle_VoiceSettings.ButtonStyle_VoiceSettings_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_VoiceSettings_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/Art/ButtonStyle_VoiceSettings.ButtonStyle_VoiceSettings_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/MissedInvitesActionMenu.MissedInvitesActionMenu_C
	// Inherited from UFortMissedInvitesActionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x490 - 0x440)
	class UMissedInvitesActionMenu_C : public UFortMissedInvitesActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x440(0x8)
		UWidgetAnimation ConfirmationOpened; // 0x448(0x8)
		UWidgetAnimation Opened; // 0x450(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x458(0x8)
		UCommonRichTextBlock CommonRichTextBlock; // 0x460(0x8)
		UCommonRichTextBlock CommonRichTextBlock; // 0x468(0x8)
		UBorder EntryBorder; // 0x470(0x8)
		UImage Image; // 0x478(0x8)
		UImage Image_Platform; // 0x480(0x8)
		UCommonRichTextBlock Text_DisplayName; // 0x488(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/MissedInvitesActionMenu.MissedInvitesActionMenu_C");
			return ret;
		}

		FEventReply OnKeyUp(FGeometry MyGeometry, FKeyEvent InKeyEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D63E2A300
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2A200
		void ExecuteUbergraph_MissedInvitesActionMenu(int32_t EntryPoint); // Flags: Final 0x15D63E2A400
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/ButtonStyle_TransparentList_Social.ButtonStyle_TransparentList_Social_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_TransparentList_Social_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/ButtonStyle_TransparentList_Social.ButtonStyle_TransparentList_Social_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/EditNicknameButton.EditNicknameButton_C
	// Inherited from UFortEditNicknameButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x1438 - 0x1420)
	class UEditNicknameButton_C : public UFortEditNicknameButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		UWidgetAnimation OnHovered; // 0x1428(0x8)
		UBorder ClickCapture; // 0x1430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/EditNicknameButton.EditNicknameButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E29300
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E29200
		void ExecuteUbergraph_EditNicknameButton(int32_t EntryPoint); // Flags: Final 0x15D63E29100
	};


	// Class /Game/UI/SocialPanel/UserActionMenuInputButton.UserActionMenuInputButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x13E0 - 0x13E0)
	class UUserActionMenuInputButton_C : public UCommonButtonLegacy	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/UserActionMenuInputButton.UserActionMenuInputButton_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/UserListHeaderEntry.UserListHeaderEntry_C
	// Inherited from USocialUserListHeaderEntry -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x1438 - 0x1408)
	class UUserListHeaderEntry_C : public USocialUserListHeaderEntry	
	{
	public:
		unsigned char UnknownData01_3[0x8]; // 0x1408(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation OnExpansion; // 0x1418(0x8)
		UWidgetAnimation OnHover; // 0x1420(0x8)
		UFortMobileImage ExpandDirectionTick; // 0x1428(0x8)
		USizeBox SB_EntryContent; // 0x1430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/UserListHeaderEntry.UserListHeaderEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2C500
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent 0x15D63E2C600
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E28500
		void OnListItemObjectSet(UObject ListItemObject); // Flags: BlueprintCallable|BlueprintEvent 0x15D63E2C200
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E2C300
		void ExecuteUbergraph_UserListHeaderEntry(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E2C400
	};


	// Class /Game/UI/SocialPanel/SocialInteraction.SocialInteraction_C
	// Inherited from USocialInteractionButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x14E8 - 0x1490)
	class USocialInteraction_C : public USocialInteractionButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1490(0x8)
		UWidgetAnimation OnHover; // 0x1498(0x8)
		UImage EncourageEpicFriend; // 0x14A0(0x8)
		UImage InteractionIcon; // 0x14A8(0x8)
		UMenuAnchor MenuAnchor_Actions; // 0x14B0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14B8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14C8(0x10)
		FLinearColor AddFriendColor; // 0x14D8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialInteraction.SocialInteraction_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2BF00
		void OnInteractionSet(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2BC00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E22D00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E2BE00
		void ExecuteUbergraph_SocialInteraction(int32_t EntryPoint); // Flags: Final 0x15D63E2BD00
	};


	// Class /Game/UI/SocialPanel/UserActionMenu.UserActionMenu_C
	// Inherited from UFortSocialInteractionMenu -> USocialInteractionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x520 - 0x4F0)
	class UUserActionMenu_C : public UFortSocialInteractionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x4F0(0x8)
		UWidgetAnimation ConfirmationOpened; // 0x4F8(0x8)
		UWidgetAnimation Opened; // 0x500(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x508(0x8)
		UBorder EntryBorder; // 0x510(0x8)
		UFortMobileImage Image_Platform; // 0x518(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/UserActionMenu.UserActionMenu_C");
			return ret;
		}

		void OnToggleConfirmation(bool bIsVisible); // Flags: Event|Protected|BlueprintEvent 0x15D63E2B200
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2B300
		void ExecuteUbergraph_UserActionMenu(int32_t EntryPoint); // Flags: Final 0x15D63E2B400
	};


	// Class /Game/UI/SocialPanel/SocialConfirmationButton.SocialConfirmationButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1428 - 0x13E0)
	class USocialConfirmationButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation OnHover; // 0x13E8(0x8)
		UBorder Border_InteractionIndicator; // 0x13F0(0x8)
		UImage InteractionIcon; // 0x13F8(0x8)
		UMenuAnchor MenuAnchor_Actions; // 0x1400(0x8)
		UCommonTextBlock Text_InteractionName; // 0x1408(0x8)
		bool bIsAccept; // 0x1410(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1411(0x7) UNKNOWN PROPERTY
		FText DisplayText; // 0x1418(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialConfirmationButton.SocialConfirmationButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2B900
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2B800
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E2B600
		void ExecuteUbergraph_SocialConfirmationButton(int32_t EntryPoint); // Flags: Final 0x15D63E2B700
	};


	// Class /Game/UI/SocialPanel/SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C
	// Inherited from UFortSocialPanelView_FriendLinkButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1438 - 0x13F0)
	class USocialPanel_FriendLinkButton_C : public UFortSocialPanelView_FriendLinkButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UWidgetAnimation OnCopied; // 0x13F8(0x8)
		UWidgetAnimation OnHovered; // 0x1400(0x8)
		UMenuAnchor MenuAnchor_Actions; // 0x1408(0x8)
		UFortMobileImage SharingIcon; // 0x1410(0x8)
		UCommonWidgetSwitcherLegacy Switcher_CopyState; // 0x1418(0x8)
		UCommonTextBlock Text_CopyConfirmed; // 0x1420(0x8)
		UCommonTextBlock Text_FriendLinkInstructions; // 0x1428(0x8)
		UCommonTextBlock Text_LinkPrompt; // 0x1430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2AF00
		void OnCopiedToClipboard(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2AC00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2B000
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E2AE00
		void OnShareButtonTypeSet(EFriendLinkShareButtonType Type); // Flags: Event|Protected|BlueprintEvent 0x15D63E2AB00
		void ExecuteUbergraph_SocialPanel_FriendLinkButton(int32_t EntryPoint); // Flags: Final 0x15D63E2AD00
	};


	// Class /Game/UI/SocialPanel/ListEntries/TeamMemberListEntry.TeamMemberListEntry_C
	// Inherited from UFortTeamMemberListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1500 - 0x14B0)
	class UTeamMemberListEntry_C : public UFortTeamMemberListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation Selected; // 0x14B8(0x8)
		UWidgetAnimation Hovered; // 0x14C0(0x8)
		UImage Arrow; // 0x14C8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14D8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14E0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/TeamMemberListEntry.TeamMemberListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2A700
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D63E2A900
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2A800
		void ExecuteUbergraph_TeamMemberListEntry(int32_t EntryPoint); // Flags: Final 0x15D63E2A600
	};


	// Class /Game/UI/SocialPanel/ListEntries/JoinRequestUserListEntry.JoinRequestUserListEntry_C
	// Inherited from UFortSocialUserListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x1500 - 0x14A0)
	class UJoinRequestUserListEntry_C : public UFortSocialUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation Selected; // 0x14A8(0x8)
		UWidgetAnimation Hovered; // 0x14B0(0x8)
		UImage Arrow; // 0x14B8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14C0(0x8)
		UCommonRichTextBlock JoinRequest; // 0x14C8(0x8)
		UCommonRichTextBlock Text_DisplayName; // 0x14D0(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14D8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14E0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/JoinRequestUserListEntry.JoinRequestUserListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2E000
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D63E2E200
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2E100
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E2DE00
		void ExecuteUbergraph_JoinRequestUserListEntry(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E2DF00
	};


	// Class /Game/UI/SocialPanel/ListEntries/UserListEntry_XS.UserListEntry_XS_C
	// Inherited from UFortSocialUserListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x14F8 - 0x14A0)
	class UUserListEntry_XS_C : public UFortSocialUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation Selected; // 0x14A8(0x8)
		UWidgetAnimation Hovered; // 0x14B0(0x8)
		UImage Arrow; // 0x14B8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14C0(0x8)
		UCommonRichTextBlock Text_DisplayName; // 0x14C8(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14D0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14D8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14E8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/UserListEntry_XS.UserListEntry_XS_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2D500
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D63E2D700
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2D600
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D63E2D300
		void ExecuteUbergraph_UserListEntry_XS(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E2D400
	};


	// Class /Game/UI/SocialPanel/ListEntries/UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C
	// Inherited from UFortUserSearchResultListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x1510 - 0x14B0)
	class UUserSearchResultListEntry_XS_C : public UFortUserSearchResultListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation Selected; // 0x14B8(0x8)
		UWidgetAnimation Hovered; // 0x14C0(0x8)
		UImage Arrow; // 0x14C8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UImage Image_Lock; // 0x14D8(0x8)
		UCommonRichTextBlock Text_DisplayName; // 0x14E0(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14E8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14F0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x1500(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2CA00
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D63E2CC00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2CB00
		void SetNamePlatformAndMutuals(FText& DisplayName, FText& Platform, int32_t MutualCount); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D63E2C800
		void ExecuteUbergraph_UserSearchResultListEntry_XS(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E2C900
	};


	// Class /Game/UI/SocialPanel/SuggestedFriendListEntry.SuggestedFriendListEntry_C
	// Inherited from UFortConnectionsUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x14E0 - 0x1480)
	class USuggestedFriendListEntry_C : public UFortConnectionsUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1480(0x8)
		UWidgetAnimation Selected; // 0x1488(0x8)
		UWidgetAnimation Hovered; // 0x1490(0x8)
		UImage Arrow; // 0x1498(0x8)
		UBorder Border_Background; // 0x14A0(0x8)
		UBorder Border_Highlight; // 0x14A8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14B0(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14B8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14C0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14D0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SuggestedFriendListEntry.SuggestedFriendListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2F800
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D63E2FA00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2F900
		void ExecuteUbergraph_SuggestedFriendListEntry(int32_t EntryPoint); // Flags: Final 0x15D63E2F700
	};


	// Class /Game/UI/SocialPanel/JoinablePartyActionMenu.JoinablePartyActionMenu_C
	// Inherited from UFortJoinablePartyActionMenu -> USocialInteractionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x520 - 0x4F8)
	class UJoinablePartyActionMenu_C : public UFortJoinablePartyActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x4F8(0x8)
		UWidgetAnimation ConfirmationOpened; // 0x500(0x8)
		UWidgetAnimation Opened; // 0x508(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x510(0x8)
		UBorder EntryBorder; // 0x518(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/JoinablePartyActionMenu.JoinablePartyActionMenu_C");
			return ret;
		}

		void OnToggleConfirmation(bool bIsVisible); // Flags: Event|Protected|BlueprintEvent 0x15D63E2F000
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2F100
		void ExecuteUbergraph_JoinablePartyActionMenu(int32_t EntryPoint); // Flags: Final 0x15D63E2F200
	};


	// Class /Game/UI/SocialPanel/JoinablePartyEntry.JoinablePartyEntry_C
	// Inherited from UFortJoinablePartyListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x1518 - 0x14A0)
	class UJoinablePartyEntry_C : public UFortJoinablePartyListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation Selected; // 0x14A8(0x8)
		UWidgetAnimation Hovered; // 0x14B0(0x8)
		UBorder AnimatedInputBorder; // 0x14B8(0x8)
		UImage Arrow; // 0x14C0(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x14C8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UBorder EntryBorder; // 0x14D8(0x8)
		USizeBox Exclamation; // 0x14E0(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14E8(0x8)
		FSlateColor InviteFontColor; // 0x14F0(0x14)
		FSlateColor DefaultFontColor; // 0x1504(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/JoinablePartyEntry.JoinablePartyEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2ED00
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D66784E00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D63E2EE00
		void OnInviteStatusUpdated(bool bIsInvited); // Flags: Event|Protected|BlueprintEvent 0x15D63E2EB00
		void ExecuteUbergraph_JoinablePartyEntry(int32_t EntryPoint); // Flags: Final 0x15D63E2EC00
	};


	// Class /Game/UI/SocialPanel/MissedInvitesEntry.MissedInvitesEntry_C
	// Inherited from UFortMissedInvitesListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1460 - 0x1410)
	class UMissedInvitesEntry_C : public UFortMissedInvitesListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation Selected; // 0x1418(0x8)
		UWidgetAnimation Hovered; // 0x1420(0x8)
		UBorder AnimatedInputBorder; // 0x1428(0x8)
		UImage Arrow; // 0x1430(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x1438(0x8)
		UBorder EntryBorder; // 0x1440(0x8)
		USizeBox Exclamation; // 0x1448(0x8)
		UCommonRichTextBlock Text_MissedInvitesText; // 0x1450(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x1458(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/MissedInvitesEntry.MissedInvitesEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE1E00
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE2000
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE1F00
		void ExecuteUbergraph_MissedInvitesEntry(int32_t EntryPoint); // Flags: Final 0x15D7ACE1D00
	};


	// Class /Game/UI/Sidebar/ListEntries/MultiFriendActionListEntry.MultiFriendActionListEntry_C
	// Inherited from UFortMultiFriendActionListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x1450 - 0x1410)
	class UMultiFriendActionListEntry_C : public UFortMultiFriendActionListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation Selected; // 0x1418(0x8)
		UWidgetAnimation Hovered; // 0x1420(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x1428(0x8)
		UBorder EntryBorder; // 0x1430(0x8)
		UCommonRichTextBlock Text_MissedInvitesText; // 0x1438(0x8)
		UCommonRichTextBlock Text_MissedInvitesText_Hover; // 0x1440(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x1448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Sidebar/ListEntries/MultiFriendActionListEntry.MultiFriendActionListEntry_C");
			return ret;
		}

		void GetText(EMultiFriendAction InAction, FText& Text); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D7ACE1400
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE1600
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE1900
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE1700
		void OnActionUpdated(EMultiFriendAction InAction); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE1300
		void BndEvt__MultiFriendActionListEntry_InputActionWidget_K2Node_ComponentBoundEvent_1_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent 0x15D7ACE1800
		void ExecuteUbergraph_MultiFriendActionListEntry(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACE1500
	};


	// Class /Game/UI/SocialPanel/InviteListEntry_FriendInvite_XS.InviteListEntry_FriendInvite_XS_C
	// Inherited from UFortConnectionsUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x14F0 - 0x1480)
	class UInviteListEntry_FriendInvite_XS_C : public UFortConnectionsUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1480(0x8)
		UWidgetAnimation Selected; // 0x1488(0x8)
		UWidgetAnimation Hovered; // 0x1490(0x8)
		UImage Arrow; // 0x1498(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x14A0(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14A8(0x8)
		UBorder EntryBorder; // 0x14B0(0x8)
		UCommonRichTextBlock Text_SentRequest; // 0x14B8(0x8)
		FLinearColor Online; // 0x14C0(0x10)
		FLinearColor Offline; // 0x14D0(0x10)
		FLinearColor Away; // 0x14E0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/InviteListEntry_FriendInvite_XS.InviteListEntry_FriendInvite_XS_C");
			return ret;
		}

		void HandleOnlineIndicatorView(char OnlineStatus); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE0B00
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE0F00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE0D00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE0E00
		void ExecuteUbergraph_InviteListEntry_FriendInvite_XS(int32_t EntryPoint); // Flags: Final 0x15D7ACE0C00
	};


	// Class /Game/UI/SocialPanel/ReferAFriendEntry.ReferAFriendEntry_C
	// Inherited from UFortReferFriendListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1460 - 0x1410)
	class UReferAFriendEntry_C : public UFortReferFriendListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation Selected; // 0x1418(0x8)
		UWidgetAnimation Hovered; // 0x1420(0x8)
		UBorder AnimatedInputBorder; // 0x1428(0x8)
		UImage Arrow; // 0x1430(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x1438(0x8)
		UBorder EntryBorder; // 0x1440(0x8)
		USizeBox Exclamation; // 0x1448(0x8)
		UCommonRichTextBlock Text_MissedInvitesText; // 0x1450(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x1458(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ReferAFriendEntry.ReferAFriendEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE0500
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE0700
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE0600
		void ExecuteUbergraph_ReferAFriendEntry(int32_t EntryPoint); // Flags: Final 0x15D7ACE0400
	};


	// Class /Game/UI/SocialPanel/ListEntries/VoiceChatMemberListEntry.VoiceChatMemberListEntry_C
	// Inherited from UFortVoiceChatMemberListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x14F8 - 0x14B0)
	class UVoiceChatMemberListEntry_C : public UFortVoiceChatMemberListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation Selected; // 0x14B8(0x8)
		UWidgetAnimation Hovered; // 0x14C0(0x8)
		UImage Arrow; // 0x14C8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14D8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14E8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/VoiceChatMemberListEntry.VoiceChatMemberListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE3F00
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE4100
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE4000
		void ExecuteUbergraph_VoiceChatMemberListEntry(int32_t EntryPoint); // Flags: Final 0x15D7ACE3E00
	};


	// Class /Game/UI/SocialPanel/LeavePartyConfirmationMenu.LeavePartyConfirmationMenu_C
	// Inherited from UFortLeavePartyMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x458 - 0x448)
	class ULeavePartyConfirmationMenu_C : public UFortLeavePartyMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x448(0x8)
		UWidgetAnimation Opened; // 0x450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LeavePartyConfirmationMenu.LeavePartyConfirmationMenu_C");
			return ret;
		}

		void OnOpened(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE3800
		void ExecuteUbergraph_LeavePartyConfirmationMenu(int32_t EntryPoint); // Flags: Final 0x15D7ACE3900
	};


	// Class /Game/UI/SocialPanel/LeavePartyListEntry.LeavePartyListEntry_C
	// Inherited from UFortLeavePartyListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1458 - 0x1410)
	class ULeavePartyListEntry_C : public UFortLeavePartyListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation Selected; // 0x1418(0x8)
		UWidgetAnimation Hovered; // 0x1420(0x8)
		UBorder AnimatedInputBorder; // 0x1428(0x8)
		UImage Arrow; // 0x1430(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x1438(0x8)
		UBorder EntryBorder; // 0x1440(0x8)
		UCommonRichTextBlock Text_LeavePartyText; // 0x1448(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x1450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LeavePartyListEntry.LeavePartyListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE3500
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE3700
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE3600
		void ExecuteUbergraph_LeavePartyListEntry(int32_t EntryPoint); // Flags: Final 0x15D7ACE3400
	};


	// Class /Game/UI/SocialPanel/ListEntries/PartyMemberListEntry.PartyMemberListEntry_C
	// Inherited from UFortPartyMemberListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1500 - 0x14B0)
	class UPartyMemberListEntry_C : public UFortPartyMemberListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation Selected; // 0x14B8(0x8)
		UWidgetAnimation Hovered; // 0x14C0(0x8)
		UImage Arrow; // 0x14C8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14D8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14E0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/PartyMemberListEntry.PartyMemberListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE2D00
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACE2F00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE2E00
		void ExecuteUbergraph_PartyMemberListEntry(int32_t EntryPoint); // Flags: Final 0x15D7ACE2C00
	};


	// Class /Game/UI/Foundation/Stats/PowerRatingWidget.PowerRatingWidget_C
	// Inherited from UFortPlayerPowerRating -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8C (0x394 - 0x308)
	class UPowerRatingWidget_C : public UFortPlayerPowerRating	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x308(0x8)
		UCommonTextBlock BaseRatingValue; // 0x310(0x8)
		UCommonTextBlock BaseRatingValue_Large; // 0x318(0x8)
		UImage BuffedRatingOuterGlow; // 0x320(0x8)
		UHomebaseRatingBar_C HomebaseRatingBar; // 0x328(0x8)
		UImage Image_Power; // 0x330(0x8)
		UCommonWidgetSwitcherLegacy ModeTypeSwitcher; // 0x338(0x8)
		UVerticalBox OversizedMode; // 0x340(0x8)
		UImage PowerIconGlow; // 0x348(0x8)
		UImage Rating_Glow_Large; // 0x350(0x8)
		USizeBox RatingBar; // 0x358(0x8)
		UHorizontalBox RegularMode; // 0x360(0x8)
		UCommonNumericTextBlock TeamRatingValue; // 0x368(0x8)
		UCommonNumericTextBlock TeamRatingValue_Large; // 0x370(0x8)
		bool ShowDualPower; // 0x378(0x1)
		bool ShowProgress; // 0x379(0x1)
		bool ShowGlow; // 0x37A(0x1)
		bool UseLargeStyle; // 0x37B(0x1)
		bool UseOversizedMode; // 0x37C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x37D(0x3) UNKNOWN PROPERTY
		double InterpDuration; // 0x380(0x8)
		USoundBase PowerIncreasedSound; // 0x388(0x8)
		int32_t Power_Rating_Num; // 0x390(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Stats/PowerRatingWidget.PowerRatingWidget_C");
			return ret;
		}

		void UpdateWidgetState(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE6200
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE2700
		void OnBasePowerRatingUpdated(int32_t BasePowerRating); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE2500
		void OnTeamPowerRatingUpdated(int32_t TeamPowerRating); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE2200
		void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE2400
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE6300
		void OnTeamMembershipChanged(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE2300
		void ExecuteUbergraph_PowerRatingWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACE2600
	};


	// Class /Game/UI/Foundation/Stats/Moonbeam_PowerRatingWidget.Moonbeam_PowerRatingWidget_C
	// Inherited from UFortPlayerPowerRating -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xB8 (0x3C0 - 0x308)
	class UMoonbeam_PowerRatingWidget_C : public UFortPlayerPowerRating	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x308(0x8)
		UCommonTextBlock BaseRatingValue; // 0x310(0x8)
		UCommonTextBlock BaseRatingValue_Large; // 0x318(0x8)
		UImage BuffedRatingOuterGlow; // 0x320(0x8)
		UHomebaseRatingBar_C HomebaseRatingBar; // 0x328(0x8)
		UImage Image_Power; // 0x330(0x8)
		UCommonWidgetSwitcherLegacy ModeTypeSwitcher; // 0x338(0x8)
		UImage Moonbeam_Power_Back; // 0x340(0x8)
		UVerticalBox OversizedMode; // 0x348(0x8)
		UImage PowerIconGlow; // 0x350(0x8)
		UImage Rating_Glow_Large; // 0x358(0x8)
		USizeBox RatingBar; // 0x360(0x8)
		UHorizontalBox RegularMode; // 0x368(0x8)
		UCommonNumericTextBlock TeamRatingValue; // 0x370(0x8)
		UCommonNumericTextBlock TeamRatingValue_Large; // 0x378(0x8)
		bool ShowDualPower; // 0x380(0x1)
		bool ShowProgress; // 0x381(0x1)
		bool ShowGlow; // 0x382(0x1)
		bool UseLargeStyle; // 0x383(0x1)
		bool UseOversizedMode; // 0x384(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x385(0x3) UNKNOWN PROPERTY
		double InterpDuration; // 0x388(0x8)
		USoundBase PowerIncreasedSound; // 0x390(0x8)
		int32_t Power_Rating_Num; // 0x398(0x4)
		FLinearColor PowerBackingColor; // 0x39C(0x10)
		FSlateColor FontColor; // 0x3AC(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Stats/Moonbeam_PowerRatingWidget.Moonbeam_PowerRatingWidget_C");
			return ret;
		}

		void SetBackgroundColor(FLinearColor NewColor); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE5900
		void UpdateWidgetState(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE5800
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE6000
		void OnBasePowerRatingUpdated(int32_t BasePowerRating); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE5E00
		void OnTeamPowerRatingUpdated(int32_t TeamPowerRating); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE5B00
		void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE5D00
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE5A00
		void OnTeamMembershipChanged(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE5C00
		void ExecuteUbergraph_Moonbeam_PowerRatingWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACE5F00
	};


	// Class /Game/UI/Frontend/ItemManagement/InventoryPanel/ItemTileButtonStyles/ItemManagementTileButtonStyle-Base.ItemManagementTileButtonStyle-Base_C
	// Inherited from UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UItemManagementTileButtonStyle-Base_C : public UButtonStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/ItemManagement/InventoryPanel/ItemTileButtonStyles/ItemManagementTileButtonStyle-Base.ItemManagementTileButtonStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Profile/BP_BannerEditorTile.BP_BannerEditorTile_C
	// Inherited from UFortPlayerProfileBannerEditorTile -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1440 - 0x13F0)
	class UBP_BannerEditorTile_C : public UFortPlayerProfileBannerEditorTile	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UImage ColorImage; // 0x13F8(0x8)
		UCommonWidgetSwitcherLegacy CommonWidgetSwitcher; // 0x1400(0x8)
		UImage IconImage; // 0x1408(0x8)
		UCommonLoadGuard IconLoadGuard; // 0x1410(0x8)
		UImage Image_BannerEditBorder; // 0x1418(0x8)
		UNormalBangWrapper_C NormalBangWrapper; // 0x1420(0x8)
		UMaterialInstanceDynamic ColorMID; // 0x1428(0x8)
		FMulticastInlineDelegate BannerTileBangUpdated; // 0x1430(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Profile/BP_BannerEditorTile.BP_BannerEditorTile_C");
			return ret;
		}

		void Mark Item As Seen(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE4900
		void Update Bang State(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE4700
		void OnListItemObjectSet(UObject ListItemObject); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE4800
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE4C00
		void HandleBannerIconLoadGuardFinished(UObject Object); // Flags: BlueprintCallable|BlueprintEvent 0x15D7ACE4A00
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE4D00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE4E00
		void ExecuteUbergraph_BP_BannerEditorTile(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACE4B00
		void BannerTileBangUpdated__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D7ACE4F00
	};


	// Class /Game/UI/Foundation/Profile/WBP_LocalPlayerBannerEditor.WBP_LocalPlayerBannerEditor_C
	// Inherited from UFortPlayerProfileBannerEditor -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1D0 (0x500 - 0x330)
	class UWBP_LocalPlayerBannerEditor_C : public UFortPlayerProfileBannerEditor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x330(0x8)
		UWBP_UIKit_Button_Regular_C ApplyButton; // 0x338(0x8)
		UCloseButton_C Button_CloseTouch; // 0x340(0x8)
		UWBP_UIKit_Button_Generic_C Button_Next; // 0x348(0x8)
		UWBP_UIKit_Button_Generic_C Button_Previous; // 0x350(0x8)
		UWBP_UIKit_StatusIndicator_C CategoryStatusIndicator; // 0x358(0x8)
		UCommonTextBlock CategoryText; // 0x360(0x8)
		UCommonTextBlock FoundersNoteText; // 0x368(0x8)
		UPlayerBanner_C HomebaseBanner; // 0x370(0x8)
		UWBP_UIKit_Tabs_C TabCategories; // 0x378(0x8)
		UCommonTileView TileView_Items; // 0x380(0x8)
		FMulticastInlineDelegate CloseBannerEditor; // 0x388(0x10)
		int32_t IconCategoryIndex; // 0x398(0x4)
		int32_t ColorCategoryIndex; // 0x39C(0x4)
		FName CurrentCategory; // 0x3A0(0x4)
		bool bViewingIcons; // 0x3A4(0x1)
		bool bPickingTile; // 0x3A5(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x3A6(0x2) UNKNOWN PROPERTY
		FName TempChosenIcon; // 0x3A8(0x4)
		FName TempChosenColor; // 0x3AC(0x4)
		UCommonButtonGroupLegacy ButtonGroup; // 0x3B0(0x8)
		FTimerHandle UpdateBangTimerHandle; // 0x3B8(0x8)
		bool bIsActiveWidget; // 0x3C0(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x3C1(0x7) UNKNOWN PROPERTY
		USoundBase AppearSoundCue; // 0x3C8(0x8)
		FSlateFontInfo Font; // 0x3D0(0x58)
		FText Text; // 0x428(0x10)
		FText Text_button; // 0x438(0x10)
		unsigned char UnknownData05_6[0x8]; // 0x448(0x8) UNKNOWN PROPERTY
		FSlateBrush In_Brush; // 0x450(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Profile/WBP_LocalPlayerBannerEditor.WBP_LocalPlayerBannerEditor_C");
			return ret;
		}

		void Is Banner Item Changed(UObject Item, bool& bNeedToUpdate); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE6A00
		void Close Banner Editor(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE7A00
		void Select Next Category(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE9900
		void Select Previous Category(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE9700
		void Select Previous Tab(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE9600
		void Select Next Tab(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE9800
		void Unregister Input Events for STW(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE8F00
		void Register Input Events for STW(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE9E00
		void SetTabButtons(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE9200
		void IsActiveWidget(bool& IsActivated); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D7ACE6900
		void HandleInputMethodChanged(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE6D00
		void Update Category Navigation Visibility(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE8B00
		void Reset Color Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE9D00
		void Reset Icon Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE9B00
		void Update Right Color Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE8600
		void Update Left Color Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE8800
		void Update Right Icon Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE8500
		void Update Left Icon Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE8700
		int32_t Get Prev Color Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D7ACE7000
		int32_t Get Next Color Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D7ACE7200
		int32_t Get Prev Icon Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D7ACE6F00
		int32_t Get Next Icon Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D7ACE7100
		void Update Color Button Bang State(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE8A00
		void Update Icon Button Bang State(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE8900
		void Update Bang States(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE8E00
		void FoundsPackTextUpdate(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE7300
		void Reset Pickers and Views(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE9A00
		void Reset for Keyboard and Mouse(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE9C00
		void Update Temp State On Item Selected(UObject Item); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACEC600
		void Refresh Apply Button State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACEA000
		void Apply Chosen Item(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE4300
		void Set Picking Tile State(bool bPickingTile); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE9300
		void Attempt Leave Picker(bool& Left); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACE8400
		void Navigate to Chosen Color(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE6800
		void Navigate to Chosen Icon(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE6700
		void OnWidgetDeactivated(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACEA300
		void Update Banner Icon Tileview(FName CurrentCategory); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE8C00
		void Update Banner Color Tileview(FName CurrentCategory); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE8D00
		void Increment Color Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE6C00
		void Increment Icon Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE6B00
		void Decrement Color Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE7700
		void Decrement Icon Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACE7600
		void Previous Category(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D7ACEA100
		void Next Category(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D7ACE6600
		void Set Current Category(FName CurrentCategory); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE9400
		void Setup Tileview For Colorswatches(FName& CategoryRowName); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE9100
		void Setup Tileview For Icons(FName CategoryRowName); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACE9000
		void OnWidgetActivated(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACEA400
		void BndEvt__CommonTileView_0_K2Node_ComponentBoundEvent_888_OnListViewItemClicked__DelegateSignature(UObject Item); // Flags: BlueprintEvent 0x15D7ACE7B00
		void BndEvt__CommonTileView_0_K2Node_ComponentBoundEvent_306_OnListViewItemWidgetCreated__DelegateSignature(UUserWidget Widget); // Flags: BlueprintEvent 0x15D7ACE7D00
		void BannerTileBangUpdated_Event(); // Flags: BlueprintCallable|BlueprintEvent 0x15D7ACE8300
		void Handle Bang State Changed(); // Flags: BlueprintCallable|BlueprintEvent 0x15D7ACE6E00
		void OnShowPreviousCategory(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE6400
		void OnShowNextCategory(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE6500
		void BndEvt__CloseButton_97_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D7ACE7E00
		void BndEvt__BP_LocalPlayerBannerEditor_ApplyButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D7ACE8200
		void BndEvt__CommonTileView_0_K2Node_ComponentBoundEvent_66_OnListViewItemSelected__DelegateSignature(UObject Item, bool bIsSelected); // Flags: BlueprintEvent 0x15D7ACE7C00
		void BndEvt__BP_LocalPlayerBannerEditor_Button_CloseEditorButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D7ACE8100
		void RefreshBannerEditor(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACE9F00
		void BndEvt__BP_LocalPlayerBannerEditor_Button_Next_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D7ACE8000
		void BndEvt__BP_LocalPlayerBannerEditor_Button_Previous_0_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D7ACE7F00
		void OnTabSelected(FName TabID); // Flags: BlueprintCallable|BlueprintEvent 0x15D7ACEA500
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE7500
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACE7800
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACEA200
		void ExecuteUbergraph_WBP_LocalPlayerBannerEditor(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACE7400
		void CloseBannerEditor__DelegateSignature(FName IconId, FName ColorId); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D7ACE7900
	};


	// Class /Game/UI/Frontend/Parties/TeamMemberManage.TeamMemberManage_C
	// Inherited from UFortTeamMemberManage -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x620 - 0x5E8)
	class UTeamMemberManage_C : public UFortTeamMemberManage	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5E8(0x8)
		UWBP_LocalPlayerBannerEditor_C BP_LocalPlayerBannerEditor; // 0x5F0(0x8)
		UWBP_UIKit_Button_Regular_C CloseProfileButton; // 0x5F8(0x8)
		UCommonWidgetSwitcherLegacy ContentSwitcher; // 0x600(0x8)
		USizeBox TeamMemberManageOptions; // 0x608(0x8)
		UWBP_UIKit_Backplate_C WBP_UIKit_Backplate; // 0x610(0x8)
		UWBP_UIKit_Scrim_C WBP_UIKit_Scrim; // 0x618(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Parties/TeamMemberManage.TeamMemberManage_C");
			return ret;
		}

		void OnParticipationChanged(bool bIsParticipating); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEBA00
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEBD00
		void BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_1_CloseBannerEditor__DelegateSignature(FName IconId, FName ColorId); // Flags: BlueprintEvent 0x15D7ACEC000
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEBC00
		void BndEvt__ContentSwitcher_K2Node_ComponentBoundEvent_2_OnActiveWidgetChanged__DelegateSignature(UWidget ActiveWidget, int32_t ActiveWidgetIndex); // Flags: BlueprintEvent 0x15D7ACEBF00
		void OpenBannerEditor(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEB900
		void BndEvt__TeamMemberManage_CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D7ACEBE00
		void ExecuteUbergraph_TeamMemberManage(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACEBB00
	};


	// Class /Game/UI/SocialPanel/ListEntries/FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C
	// Inherited from UFortSocialEventRSVPWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x29 (0x2E1 - 0x2B8)
	class UFortSocialEventRSVPWidget_C : public UFortSocialEventRSVPWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UOverlay Overlay_AdditionalEvents; // 0x2C0(0x8)
		UCommonTextBlock Text_AdditionalEvents; // 0x2C8(0x8)
		UCommonTextBlock Text_EventName; // 0x2D0(0x8)
		UCommonTextBlock Text_MonthDay; // 0x2D8(0x8)
		ESlateVisibility In_Visibility; // 0x2E0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACEB400
		void OnRefreshDisplay(FText& EventName, FText& Date, FText& AdditionalEvents); // Flags: Event|Public|HasOutParms|BlueprintEvent 0x15D7ACEB200
		void ExecuteUbergraph_FortSocialEventRSVPWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACEB300
	};


	// Class /Game/UI/Frontend/Showdown/PrimarySkewButton.PrimarySkewButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1428 - 0x13E0)
	class UPrimarySkewButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation Pressed; // 0x13E8(0x8)
		UWidgetAnimation Hover; // 0x13F0(0x8)
		UCommonTextBlock CenterButtonTextWidget; // 0x13F8(0x8)
		UImage Image_ButtonTop; // 0x1400(0x8)
		UImage Image_Shadow; // 0x1408(0x8)
		bool ToUpper; // 0x1410(0x1)
		bool XL; // 0x1411(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x1412(0x6) UNKNOWN PROPERTY
		FText ButtonNameText; // 0x1418(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Showdown/PrimarySkewButton.PrimarySkewButton_C");
			return ret;
		}

		FEventReply OnMouseButtonUp(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACEAA00
		FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACEAB00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACEAD00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEAF00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEAE00
		void BP_OnClicked(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEB000
		void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent 0x15D7ACEB100
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACEA900
		void ExecuteUbergraph_PrimarySkewButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACEAC00
	};


	// Class /Game/UI/Login/SafeZone/SafeZoneEditor.SafeZoneEditor_C
	// Inherited from UFortSafeZoneEditor -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x5B8 - 0x578)
	class USafeZoneEditor_C : public UFortSafeZoneEditor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x578(0x8)
		UVerticalBox Default; // 0x580(0x8)
		UImage Image; // 0x588(0x8)
		UImage LowerLeftCorner; // 0x590(0x8)
		UImage LowerRightCorner; // 0x598(0x8)
		USafeZone SafeZone; // 0x5A0(0x8)
		UImage UpperLeftCorner; // 0x5A8(0x8)
		UImage UpperRightCorner; // 0x5B0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/SafeZone/SafeZoneEditor.SafeZoneEditor_C");
			return ret;
		}

		void BndEvt__SafeZoneEditor_Button_Done_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D7ACEE600
		void BndEvt__SafeZoneEditor_Button_Back_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D7ACEE700
		void ExecuteUbergraph_SafeZoneEditor(int32_t EntryPoint); // Flags: Final 0x15D7ACEE500
	};


	// Class /Game/UI/SocialPanel/ListEntries/UserListEntry.UserListEntry_C
	// Inherited from UFortSocialUserListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x14F8 - 0x14A0)
	class UUserListEntry_C : public UFortSocialUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation Selected; // 0x14A8(0x8)
		UWidgetAnimation Hovered; // 0x14B0(0x8)
		UImage Arrow; // 0x14B8(0x8)
		UIconTextButton_C EmptyButtonToEatOneMouseUpEvent; // 0x14C0(0x8)
		UCommonRichTextBlock Text_DisplayName; // 0x14C8(0x8)
		UUserActionMenuInputButton_C UserActionMenuInputButton; // 0x14D0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14D8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14E8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/UserListEntry.UserListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEE000
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent 0x15D7ACEE200
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACEE100
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D7ACEDE00
		void ExecuteUbergraph_UserListEntry(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACEDF00
	};


	// Class /Game/UI/SocialPanel/ListEntries/LocalUserEntry.LocalUserEntry_C
	// Inherited from UFortSocialEventRSVPLocalUserEntry -> UFortLocalUserEntry -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x14A8 - 0x1440)
	class ULocalUserEntry_C : public UFortSocialEventRSVPLocalUserEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1440(0x8)
		UWidgetAnimation Hovered; // 0x1448(0x8)
		UBorder Border_OnlineStatusIndicator; // 0x1450(0x8)
		UFortMobileImage FortMobileImage_enforzer; // 0x1458(0x8)
		UImage Image_MicIcon; // 0x1460(0x8)
		UBorder LocalUserEntryBorder; // 0x1468(0x8)
		UFortMobileImage SettingsIcon; // 0x1470(0x8)
		FLinearColor Online; // 0x1478(0x10)
		FLinearColor Offline; // 0x1488(0x10)
		FLinearColor Away; // 0x1498(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/LocalUserEntry.LocalUserEntry_C");
			return ret;
		}

		void HandleOnlineIndicatorView(ELocalUserOnlineStatus InLocalUserOnlineStatus); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D7ACED600
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACED900
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACED800
		void OnOnlineStatusChanged(ELocalUserOnlineStatus OnlineStatus); // Flags: Event|Protected|BlueprintEvent 0x15D7ACED500
		void ExecuteUbergraph_LocalUserEntry(int32_t EntryPoint); // Flags: Final 0x15D7ACED700
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_ClearSocialSearch.ButtonStyle_ClearSocialSearch_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_ClearSocialSearch_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_ClearSocialSearch.ButtonStyle_ClearSocialSearch_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C
	// Inherited from UFortFriendSearchButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x45 (0x14C5 - 0x1480)
	class USocialPanel_FriendSearchBar_C : public UFortFriendSearchButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1480(0x8)
		UWidgetAnimation OnHovered; // 0x1488(0x8)
		UImage AddFriendBanIcon; // 0x1490(0x8)
		UBorder ClickCapture; // 0x1498(0x8)
		UCommonRichTextBlock RichText_CannotAddFriends; // 0x14A0(0x8)
		UCommonRichTextBlock RichText_SocialBan; // 0x14A8(0x8)
		UFortMobileImage SharingIcon; // 0x14B0(0x8)
		UFortSimpleWidgetAnimationsPanel SimpleWidgetAnimationsPanel; // 0x14B8(0x8)
		FName ShakeAnimation; // 0x14C0(0x4)
		bool bShakeAnimationIsPlaying; // 0x14C4(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C");
			return ret;
		}

		FEventReply On_ClickCapture_MouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D7ACECC00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACECF00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D7ACECE00
		void BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(FText& Text); // Flags: HasOutParms|BlueprintEvent 0x15D7ACED000
		void ExecuteUbergraph_SocialPanel_FriendSearchBar(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D7ACECD00
	};


	// Class /Game/UI/Frontend/Settings/ColorCalibration.ColorCalibration_C
	// Inherited from UFortColorCalibrationScreen -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x540 - 0x538)
	class UColorCalibration_C : public UFortColorCalibrationScreen	
	{
	public:
		UImage InputBlocker; // 0x538(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/ColorCalibration.ColorCalibration_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Input/KeybindWidget.KeybindWidget_C
	// Inherited from UFortKeybindWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0xB30 - 0xB20)
	class UKeybindWidget_C : public UFortKeybindWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB20(0x8)
		UImage Image_Preview; // 0xB28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Input/KeybindWidget.KeybindWidget_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D66758200
		void ExecuteUbergraph_KeybindWidget(int32_t EntryPoint); // Flags: Final 0x15D66758100
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/GamepadInfoSelectorPanel_v3.GamepadInfoSelectorPanel_v3_C
	// Inherited from UFortGamePadInfoSelectorPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xC8 (0x630 - 0x568)
	class UGamepadInfoSelectorPanel_v3_C : public UFortGamePadInfoSelectorPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x568(0x8)
		UCommonBorder CommonBorder_Reset; // 0x570(0x8)
		UFortRadioButtonGroup_C FortRadioButtonGroup_Configs; // 0x578(0x8)
		UFortRadioButtonGroup_C FortRadioButtonGroup_Platforms; // 0x580(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_Reset1; // 0x588(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_Reset2; // 0x590(0x8)
		UKeybindWidget_C KeybindWidget_Reset; // 0x598(0x8)
		UOptionsMenuHeader_C OptionsMenuHeader_Configs; // 0x5A0(0x8)
		UOptionsMenuHeader_C OptionsMenuHeader_Platforms; // 0x5A8(0x8)
		UButton ResetButton; // 0x5B0(0x8)
		UVerticalBox VerticalBox_Platforms; // 0x5B8(0x8)
		FDataTableRowHandle Back; // 0x5C0(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorBack; // 0x5D0(0x10)
		FDataTableRowHandle Apply; // 0x5E0(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorApply; // 0x5F0(0x10)
		FDataTableRowHandle Reset; // 0x600(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorReset; // 0x610(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorFocus; // 0x620(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/GamepadInfoSelectorPanel_v3.GamepadInfoSelectorPanel_v3_C");
			return ret;
		}

		UWidget BP_GetDesiredFocusTarget(); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 0x15D66757F00
		void HandleReset(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66757500
		void HandleApply(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66757700
		void HandleBack(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66757600
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent 0x15D66757D00
		void OnAddedToFocusPath(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D66757400
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D66757E00
		void BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D66758000
		void ExecuteUbergraph_GamepadInfoSelectorPanel_v3(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66757C00
		void GamepadInfoSelectorFocus__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66757900
		void GamepadInfoSelectorReset__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66757800
		void GamepadInfoSelectorApply__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66757B00
		void GamepadInfoSelectorBack__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66757A00
	};


	// Class /Game/UI/Foundation/Buttons/GamepadKeyTextButton.GamepadKeyTextButton_C
	// Inherited from UFortGamepadCustomListItem -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA8 (0x1498 - 0x13F0)
	class UGamepadKeyTextButton_C : public UFortGamepadCustomListItem	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UKeybindWidget_C BoundKey; // 0x13F8(0x8)
		UBorder ContentBorder; // 0x1400(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_Desc; // 0x1408(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_NoKey; // 0x1410(0x8)
		USizeBox SizeBox_Nokey; // 0x1418(0x8)
		FText ButtonText; // 0x1420(0x10)
		UClass ControllerInputStyle; // 0x1430(0x8)
		TEnumAsByte ContentAlignment; // 0x1438(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1439(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate ChangeTheBinding_Button; // 0x1440(0x10)
		FName ActionNameData; // 0x1450(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x1454(0x4) UNKNOWN PROPERTY
		FKey KeyData; // 0x1458(0x18)
		FText TextData; // 0x1470(0x10)
		FKey KeyNone; // 0x1480(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/GamepadKeyTextButton.GamepadKeyTextButton_C");
			return ret;
		}

		void SetNonInteractableStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66756C00
		void SetContentAlignment(TEnumAsByte ContentAlignment); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66756F00
		void UpdateContentAlignment(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D66756900
		void OnListItemObjectSet(UObject ListItemObject); // Flags: Event|Protected|BlueprintEvent 0x15D66757100
		void SetData(FKey Key, FText DescText, FName ActionName); // Flags: BlueprintCallable|BlueprintEvent 0x15D66756E00
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D66757000
		void SetDataAndUpdateButton(FKey Key, FText DescText, FName ActionName); // Flags: BlueprintCallable|BlueprintEvent 0x15D66756D00
		void UpdateButton(UGamepadKeyTextButton_C Button); // Flags: BlueprintCallable|BlueprintEvent 0x15D66756A00
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66756B00
		void ExecuteUbergraph_GamepadKeyTextButton(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66757200
		void ChangeTheBinding_Button__DelegateSignature(FName ActionName, FKey Key); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66757300
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C
	// Inherited from UFortGamePadCustomActionSelectorPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xB8 (0x620 - 0x568)
	class UGamepadCustomActionSelectorPanel_v3_C : public UFortGamePadCustomActionSelectorPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x568(0x8)
		UButton Button_Clear; // 0x570(0x8)
		UCommonBorder CommonBorder_Clear; // 0x578(0x8)
		UCommonListView CommonListView_GamepadActions; // 0x580(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_Clear1; // 0x588(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_Clear2; // 0x590(0x8)
		UKeybindWidget_C KeybindWidget_Clear; // 0x598(0x8)
		UOptionsMenuHeader_C OptionsMenuHeader; // 0x5A0(0x8)
		FDataTableRowHandle Back; // 0x5A8(0x10)
		FMulticastInlineDelegate CustomActionSelected; // 0x5B8(0x10)
		TArray CurrentInputData; // 0x5C8(0x10)
		FMulticastInlineDelegate CustomClosedUsingBack; // 0x5D8(0x10)
		FMulticastInlineDelegate CustomClearButton; // 0x5E8(0x10)
		FKey KeyNone; // 0x5F8(0x18)
		FDataTableRowHandle Clear; // 0x610(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C");
			return ret;
		}

		void HandleClear(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66759F00
		void CreateCustomListItem(FName ActionName, EFortInputActionGroup InputActionGroup, UGamepadKeyTextButton_C& ReturnItem); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675A500
		void HandleBack(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6675A000
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D66756400
		void UpdatePanel(TArray& InputData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D66759E00
		void BP_OnItemClicked_Bind(UObject Item); // Flags: BlueprintCallable|BlueprintEvent 0x15D66756500
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D66756700
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent 0x15D66756600
		void BndEvt__Button_Clear_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Flags: BlueprintEvent 0x15D66756800
		void ExecuteUbergraph_GamepadCustomActionSelectorPanel_v3(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6675A100
		void CustomClearButton__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675A300
		void CustomClosedUsingBack__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675A200
		void CustomActionSelected__DelegateSignature(int32_t SelectedIndex, FName ActionName); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675A400
	};


	// Class /Game/UI/Foundation/Border/Border-Bottom-Box-Rounded-DkBlue.Border-Bottom-Box-Rounded-DkBlue_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-Bottom-Box-Rounded-DkBlue_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-Bottom-Box-Rounded-DkBlue.Border-Bottom-Box-Rounded-DkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/GamepadMappingInfo_v3.GamepadMappingInfo_v3_C
	// Inherited from UFortGamepadMappingInfo -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x484 (0x764 - 0x2E0)
	class UGamepadMappingInfo_v3_C : public UFortGamepadMappingInfo	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UCommonBorder CommonBorder_LeftBumperSeparator; // 0x2E8(0x8)
		UCommonBorder CommonBorder_RightBumperSeparator; // 0x2F0(0x8)
		UCommonBorder CommonBorder_Legend; // 0x2F8(0x8)
		UDeadzoneAdjustment_C DeadzoneAdjustment_Look; // 0x300(0x8)
		UDeadzoneAdjustment_C DeadzoneAdjustment_Move; // 0x308(0x8)
		UKeybindWidget_C DPadDown; // 0x310(0x8)
		UKeybindWidget_C DpadDown2; // 0x318(0x8)
		UGamepadKeyTextButton_C DpadDown_Custom; // 0x320(0x8)
		UKeybindWidget_C DPadLeft; // 0x328(0x8)
		UKeybindWidget_C DpadLeft2; // 0x330(0x8)
		UGamepadKeyTextButton_C DpadLeft_Custom; // 0x338(0x8)
		UKeybindWidget_C DPadRight; // 0x340(0x8)
		UKeybindWidget_C DpadRight2; // 0x348(0x8)
		UGamepadKeyTextButton_C DpadRight_Custom; // 0x350(0x8)
		UKeybindWidget_C DPadUp; // 0x358(0x8)
		UKeybindWidget_C DpadUp2; // 0x360(0x8)
		UGamepadKeyTextButton_C DpadUp_Custom; // 0x368(0x8)
		UGamepadKeyTextButton_C FaceBottom_Custom; // 0x370(0x8)
		UKeybindWidget_C FaceButtonBot; // 0x378(0x8)
		UKeybindWidget_C FaceButtonLeft; // 0x380(0x8)
		UKeybindWidget_C FaceButtonRight; // 0x388(0x8)
		UKeybindWidget_C FaceButtonTop; // 0x390(0x8)
		UGamepadKeyTextButton_C FaceLeft_Custom; // 0x398(0x8)
		UGamepadKeyTextButton_C FaceRight_Custom; // 0x3A0(0x8)
		UGamepadKeyTextButton_C FaceTop_Custom; // 0x3A8(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_DeadzoneWarning; // 0x3B0(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_DoubleTap; // 0x3B8(0x8)
		UFortRichTextBlockLegacy FortRichTextBlock_Hold; // 0x3C0(0x8)
		UGamepadCustomActionSelectorPanel_v3_C GamepadCustomActionSelectorPanel_v3; // 0x3C8(0x8)
		UHorizontalBox HorizontalBox_LB_RB; // 0x3D0(0x8)
		UHorizontalBox HorizontalBox_LB_RT; // 0x3D8(0x8)
		UHorizontalBox HorizontalBox_LT_RB; // 0x3E0(0x8)
		UHorizontalBox HorizontalBox_AllText; // 0x3E8(0x8)
		UHorizontalBox HorizontalBox_CustomButtons; // 0x3F0(0x8)
		UHorizontalTabList_Legacy_C HorizontalTabList_CustomModes; // 0x3F8(0x8)
		UImage Image_DoubleTap; // 0x400(0x8)
		UImage Image_Gamepad; // 0x408(0x8)
		UImage Image_Hold; // 0x410(0x8)
		UImage Image_LightBox; // 0x418(0x8)
		UCommonTextBlock LB_RBAction; // 0x420(0x8)
		UCommonTextBlock LB_RTAction; // 0x428(0x8)
		UGamepadKeyTextButton_C LB_Custom; // 0x430(0x8)
		UKeybindWidget_C LS; // 0x438(0x8)
		UGamepadKeyTextButton_C LS_Click_Custom; // 0x440(0x8)
		UKeybindWidget_C LSCombo1; // 0x448(0x8)
		UKeybindWidget_C LSCombo2; // 0x450(0x8)
		UKeybindWidget_C LStick; // 0x458(0x8)
		UKeybindWidget_C LStick2; // 0x460(0x8)
		UKeybindWidget_C LStickClick; // 0x468(0x8)
		UKeybindWidget_C LStickClick2; // 0x470(0x8)
		UKeybindWidget_C LT; // 0x478(0x8)
		UCommonTextBlock LT_RBAction; // 0x480(0x8)
		UGamepadKeyTextButton_C LT_Custom; // 0x488(0x8)
		UKeybindWidget_C LTCombo; // 0x490(0x8)
		UOverlay Overlay_DeadzoneAdjustment; // 0x498(0x8)
		UGamepadKeyTextButton_C RB_Custom; // 0x4A0(0x8)
		UKeybindWidget_C RS; // 0x4A8(0x8)
		UGamepadKeyTextButton_C RS_Click_Custom; // 0x4B0(0x8)
		UKeybindWidget_C RSCombo; // 0x4B8(0x8)
		UKeybindWidget_C RSCombo2; // 0x4C0(0x8)
		UKeybindWidget_C RStick; // 0x4C8(0x8)
		UKeybindWidget_C RStickClick; // 0x4D0(0x8)
		UKeybindWidget_C RT; // 0x4D8(0x8)
		UGamepadKeyTextButton_C RT_Custom; // 0x4E0(0x8)
		UKeybindWidget_C RTCombo; // 0x4E8(0x8)
		UGamepadKeyTextButton_C Select_Custom; // 0x4F0(0x8)
		USizeBox Separator_LB_RBfromLB_RT; // 0x4F8(0x8)
		UKeybindWidget_C SpecialLeft; // 0x500(0x8)
		UKeybindWidget_C SpecialRight; // 0x508(0x8)
		UGamepadKeyTextButton_C Start_Custom; // 0x510(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Bottom; // 0x518(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Left; // 0x520(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Left; // 0x528(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Left; // 0x530(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Right; // 0x538(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Right; // 0x540(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Right; // 0x548(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Top; // 0x550(0x8)
		UCommonTextBlock Text_Gamepad_Face_Button_Top; // 0x558(0x8)
		UCommonTextBlock Text_Gamepad_LB; // 0x560(0x8)
		UCommonTextBlock Text_Gamepad_LT; // 0x568(0x8)
		UCommonTextBlock Text_Gamepad_RB; // 0x570(0x8)
		UCommonTextBlock Text_Gamepad_RS; // 0x578(0x8)
		UCommonTextBlock Text_Gamepad_RS_Click; // 0x580(0x8)
		UCommonTextBlock Text_Gamepad_RS_Click; // 0x588(0x8)
		UCommonTextBlock Text_Gamepad_RS_Click; // 0x590(0x8)
		UCommonTextBlock Text_Gamepad_RT; // 0x598(0x8)
		UCommonTextBlock Text_Gamepad_Select; // 0x5A0(0x8)
		UCommonTextBlock Text_Gamepad_Select; // 0x5A8(0x8)
		UCommonTextBlock Text_Gamepad_Start; // 0x5B0(0x8)
		UCommonTextBlock Text_Mode; // 0x5B8(0x8)
		UCommonTextBlock Text_PS4_Dpad_Down; // 0x5C0(0x8)
		UCommonTextBlock Text_PS4_Dpad_Left; // 0x5C8(0x8)
		UCommonTextBlock Text_PS4_Dpad_Right; // 0x5D0(0x8)
		UCommonTextBlock Text_PS4_Dpad_Up; // 0x5D8(0x8)
		UCommonTextBlock Text_PS4_LS; // 0x5E0(0x8)
		UCommonTextBlock Text_PS4_LS_Click; // 0x5E8(0x8)
		UCommonTextBlock Text_PS4_LS_Click; // 0x5F0(0x8)
		UCommonTextBlock Text_Xbox_Dpad_Down; // 0x5F8(0x8)
		UCommonTextBlock Text_Xbox_Dpad_Left; // 0x600(0x8)
		UCommonTextBlock Text_Xbox_Dpad_Right; // 0x608(0x8)
		UCommonTextBlock Text_Xbox_Dpad_Up; // 0x610(0x8)
		UCommonTextBlock Text_Xbox_LS; // 0x618(0x8)
		UCommonTextBlock Text_Xbox_LS_Click; // 0x620(0x8)
		UCommonTextBlock Text_Xbox_LS_Click; // 0x628(0x8)
		UVerticalBox VerticalBox_PS4_LS_And_Dpad; // 0x630(0x8)
		UVerticalBox VerticalBox_Xbox_LS_And_Dpad; // 0x638(0x8)
		UVerticalBox VerticalBoxMenu_Map; // 0x640(0x8)
		TArray XB1_Images; // 0x648(0x10)
		TArray PS4_Images; // 0x658(0x10)
		TArray Appropriate_Platform_Images; // 0x668(0x10)
		TArray GamepadConfigTextWidgets; // 0x678(0x10)
		TArray ButtonTextLabels_STW_CombatPro_Build; // 0x688(0x10)
		TArray ButtonTextLabels_STW_CombatPro_Combat; // 0x698(0x10)
		TArray Erebus_Images; // 0x6A8(0x10)
		TArray ButtonTextLabels_STW_BuilderPro_Build; // 0x6B8(0x10)
		UGamepadKeyTextButton_C LastClickedButton; // 0x6C8(0x8)
		EFortInputActionGroup CurrentInputActionGroup; // 0x6D0(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x6D1(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate CustomKeySelected; // 0x6D8(0x10)
		TArray CustomKeyButtons; // 0x6E8(0x10)
		FMulticastInlineDelegate Image_LightboxClicked; // 0x6F8(0x10)
		FName CombatModeIdName; // 0x708(0x4)
		FName BuildModeIdName; // 0x70C(0x4)
		FName EditModeIdName; // 0x710(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x714(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate CustomButtonNavLeft; // 0x718(0x10)
		TArray Generic_Images; // 0x728(0x10)
		FName DeadZoneMoveIdName; // 0x738(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x73C(0x4) UNKNOWN PROPERTY
		TArray XSX_Images; // 0x740(0x10)
		TArray PS5_Images; // 0x750(0x10)
		FName LTMAbilitiesModeIdName; // 0x760(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/GamepadMappingInfo_v3.GamepadMappingInfo_v3_C");
			return ret;
		}

		void ShowAthenaLTMAbilitiesTab(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675BC00
		void HideAthenaLTMAbilitiesTab(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66758900
		void ShowDeadZoneTab(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675BB00
		void HideDeadZoneTab(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66758800
		void GamepadMappingInfoNavLeft(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66759200
		void ShowEditModeTab(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675BA00
		void HideEditModeTab(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66758700
		FEventReply On_Image_LightBox_MouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675C300
		void GetCustomButtonDataForKey(FKey Key, FName& ActionName, FText& DescText); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66759000
		void SetTextForMode(EFortInputActionGroup Selection); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675BD00
		void SetButtonTextLabelsFromTextArray(TArray& Array); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6675BF00
		void InitializeListOfButtonTextForSTW_BuilderProBuild(TArray& ButtonTextLabels); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675C600
		void GetControllerImage(TWeakObjectPtr& Texture); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D66759100
		void ClearAllComboTextLines(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66759B00
		void InitializeListOfButtonTextForSTWCombatProCombat(TArray& ButtonTextLabels); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675C400
		void SetTextFieldVisibilityForExtraLine(UTextBlock TextWidget); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675BE00
		void GetDesiredSlateVisibilityForAbilityChordFromTextDisplay(UTextBlock TextWidget, ESlateVisibility& DesiredSlateVisibility); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D66758F00
		void InitializeListOfButtonTextForSTWCombatProBuild(TArray& ButtonTextLabels); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675C500
		void InitializeListOfButtonLabelTextWidgets(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66758500
		void Handle Config Changed Hide or Show Unused Text Lines(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66758E00
		void Handle Config Changed STW Combat Mode(int32_t Config); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66758C00
		void Handle Config Changed STW Build Mode(int32_t Config); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66758D00
		void HandleConfigChanged(EFortInputActionGroup Mode, int32_t Config); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D66758B00
		void HandleConfigChanged_Athena(EFortInputActionGroup Mode, int32_t Config); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D66758A00
		void OnConfigChanged(EFortInputActionGroup Mode, int32_t Config); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675C100
		void Update Displayed Mapping(int32_t Platform, EFortInputActionGroup Mode, int32_t Configuration); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675B800
		void OnLoaded_CDBC1B27496027B96D10BC9A64224F3D(UObject Loaded); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675C000
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D66759A00
		void Update Controller Images(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675B900
		void OnButtonClicked_Bind(UCommonButtonLegacy Button); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675C200
		void UpdateCustomButtons(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675B700
		void DeadZoneTabSelected(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66759400
		void DeadZoneTabDeselected(); // Flags: BlueprintCallable|BlueprintEvent 0x15D66759500
		void DeadzoneMoveResetButtonClicked_Bind(UCommonButtonLegacy Button); // Flags: BlueprintCallable|BlueprintEvent 0x15D66759600
		void DeadzoneLookResetButtonClicked_Bind(UCommonButtonLegacy Button); // Flags: BlueprintCallable|BlueprintEvent 0x15D66759700
		void ExecuteUbergraph_GamepadMappingInfo_v3(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D66759300
		void CustomButtonNavLeft__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66759900
		void Image_LightboxClicked__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66758600
		void CustomKeySelected__DelegateSignature(FKey Key); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D66759800
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/TabGamePadConfig_v3.TabGamePadConfig_v3_C
	// Inherited from UFortGamepadInputOptions -> UFortInputOptions -> UFortOptionsTab -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x108 (0x580 - 0x478)
	class UTabGamePadConfig_v3_C : public UFortGamepadInputOptions	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x478(0x8)
		UGamepadInfoSelectorPanel_v3_C GamepadInfoSelectorPanel_v3; // 0x480(0x8)
		UGamepadMappingInfo_v3_C GamepadMappingInfo_v3; // 0x488(0x8)
		FMulticastInlineDelegate GamepadMappingInfoChanged; // 0x490(0x10)
		TArray InputPresets; // 0x4A0(0x10)
		TArray InputPresetNames_NoCustom; // 0x4B0(0x10)
		int32_t PresetMappingIndex; // 0x4C0(0x4)
		int32_t PlatformMappingIndex; // 0x4C4(0x4)
		int32_t CustomInputTemplatePresetIndex; // 0x4C8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x4CC(0x4) UNKNOWN PROPERTY
		UGamepadKeyTextButton_C DisplayObject; // 0x4D0(0x8)
		EFortInputActionGroup CurrentInputActionGroup; // 0x4D8(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x4D9(0x3) UNKNOWN PROPERTY
		int32_t CustomResetToDefaultConfig; // 0x4DC(0x4)
		FKey CustomKeySelection; // 0x4E0(0x18)
		FName CustomActionSelection; // 0x4F8(0x4)
		int32_t CustomInputActionGroupSelectionIndex; // 0x4FC(0x4)
		int32_t CustomActionSelectionIndex; // 0x500(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x504(0x4) UNKNOWN PROPERTY
		FKey Key_None; // 0x508(0x18)
		UClass RadioButtonClass; // 0x520(0x8)
		UClass RadioButtonStyle; // 0x528(0x8)
		TArray InputDataForActionsPanel; // 0x530(0x10)
		FMulticastInlineDelegate TabGamePadConfigBack; // 0x540(0x10)
		FMulticastInlineDelegate TabGamePadConfigApply; // 0x550(0x10)
		FMulticastInlineDelegate TabGamePadActionsThatNeedBinds; // 0x560(0x10)
		FMulticastInlineDelegate OverrideResetModal; // 0x570(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/TabGamePadConfig_v3.TabGamePadConfig_v3_C");
			return ret;
		}

		void GamepadInfoSelectorNavRight(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675E200
		void AreWeOkayWithThisChange(FName ActionName, FKey Key, bool& IsOkay); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D7ACEC100
		void HandleGamepadInfoSelectorFocus(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675DC00
		void NavigateToSelectedConfig(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675D600
		void ChangeCustomClearVisibilityForInputType(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675B100
		void ChangeCustomResetVisibilityForInputType(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675B000
		void HandleGamepadInfoSelectorApply(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675DE00
		void HandleGamepadInfoSelectorBack(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675DD00
		void ChangeCustomTabListVisibilityForInputType(ECommonInputType Selection); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675AF00
		TArray CreateCustomResetToDefaultList(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675AC00
		void CloseCustomActionsPanel(bool FocusLastButton); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675AE00
		void SelectSameItemInActionsList(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675D000
		void SetupDisplayObject(FName ActionName, FKey Key, UGamepadKeyTextButton_C& DisplayObject); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675CF00
		bool IsCustomConfig(int32_t PresetIndex); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6675D800
		void HandleGamepadMappingInfoChange(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675DB00
		void GetCurrentPlatformIndex(int32_t& PlatformIndex); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D6675DF00
		void UpdateData(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675CB00
		void PreConstructData(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675D100
		void InitializeData(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6675D900
		void DialogResult_017CD690454514A07B4DE5BE109AEC6E(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675E600
		void DialogResult_7D7E06D747FFEF9849D3CAA2D3D91717(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675E500
		void Gamepad Config Changed(UCommonButtonLegacy AssociatedButton, int32_t ButtonIndex); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675E300
		void GamepadPlatformConfigChanged(UCommonButtonLegacy AssociatedButton, int32_t ButtonIndex); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675E000
		void CenterOnTab(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x15D6015DC00
		void UpdateOptionsTab(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x15D6675CA00
		void CustomDoResetToDefault(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675A800
		void CustomKeySelected_Bind(FKey Key); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675A700
		void CustomActionSelected_Bind(int32_t SelectedIndex, FName ActionName); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675AB00
		void CustomClosedUsingBack_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675A900
		void CustomClearButton_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675AA00
		void ModesTabSelected_Bind(FName TabID); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675D700
		void HandleUsingGamepadChanged(ECommonInputType NewInputType); // Flags: Event|Protected|BlueprintEvent 0x15D6675DA00
		void OnTabDeactivated_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675D400
		void OnTabActivated_Bind(); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675D500
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6675D200
		void DeadZoneLookSettingValueChanged_Bind(float Value); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675A600
		void DeadZoneMoveSettingValueChanged_Bind(float Value); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675E700
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D6675AD00
		void ExecuteUbergraph_TabGamePadConfig_v3(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6675E400
		void OverrideResetModal__DelegateSignature(bool bOverride); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675D300
		void TabGamePadActionsThatNeedBinds__DelegateSignature(TArray& ScreenLabels); // Flags: Public|Delegate|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6675CE00
		void TabGamePadConfigApply__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675CD00
		void TabGamePadConfigBack__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675CC00
		void GamepadMappingInfoChanged__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D6675E100
	};


	// Class /Game/UI/Frontend/Settings/OptionsMenu.OptionsMenu_C
	// Inherited from UFortOptionsMenu -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0xFE8 - 0xFC0)
	class UOptionsMenu_C : public UFortOptionsMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xFC0(0x8)
		UFortHUDElementWrapper_C FortHUDElementWrapper; // 0xFC8(0x8)
		USizeBox SizeBox_ContentLetoSplitscreen; // 0xFD0(0x8)
		USizeBox SizeBox_HeadingLeto; // 0xFD8(0x8)
		UTabGamePadConfig_v3_C TabGamepadConfig; // 0xFE0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/OptionsMenu.OptionsMenu_C");
			return ret;
		}

		void LoadTabClasses(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675F500
		void Handle Tab Gamepad Config Action Handler States_SAVE(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D6675F800
		void DialogResult_826C59EC4C294BC872A644878B35A13B(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675FB00
		void DialogResult_B31FF5BD4C0772716F27509EA83B418E(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675FA00
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent 0x15D6675FD00
		void HandleTabGamePadActionsNeedBinds(TArray& ScreenLabels); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D6675F700
		void HandleTabGamepadConfigActionHandlerStates(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent 0x15D6675F600
		void OnSettingsTabListPopulated(); // Flags: Event|Protected|BlueprintEvent 0x15D6675F300
		void BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature(FName TabID, UCommonButtonBase TabButton); // Flags: BlueprintEvent 0x15D6675FE00
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent 0x15D6675FC00
		void On Override Reset Modal(bool bOverride); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675F400
		void OnShowResetToDefaultModal(); // Flags: Event|Protected|BlueprintEvent 0x15D6675F200
		void OnSplitscreenUpdateSizing(); // Flags: Event|Protected|BlueprintEvent 0x15D6675F100
		void ExecuteUbergraph_OptionsMenu(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6675F900
	};


	// Class /Game/UI/SocialPanel/VoiceChannelSettings.VoiceChannelSettings_C
	// Inherited from UFortVoiceSettingsDisplay -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x88 (0x458 - 0x3D0)
	class UVoiceChannelSettings_C : public UFortVoiceSettingsDisplay	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3D0(0x8)
		UWidgetAnimation GearHover; // 0x3D8(0x8)
		UCommonActionWidget ActionWidget_InputDisplay; // 0x3E0(0x8)
		UImage AlertIcon; // 0x3E8(0x8)
		UIconTextButton_C Button_NextInputDevice; // 0x3F0(0x8)
		UIconTextButton_C Button_NextOutputDevice; // 0x3F8(0x8)
		UIconTextButton_C Button_TogglePTT; // 0x400(0x8)
		UIconTextButton_C Button_VoiceSettings; // 0x408(0x8)
		UImage GearIcon; // 0x410(0x8)
		UFortMobileImage Image_TitleIcon; // 0x418(0x8)
		UCommonRichTextBlock InputDevice; // 0x420(0x8)
		UCommonRichTextBlock OutputDevice; // 0x428(0x8)
		UKeybindWidget_C PTTKeybindWidget; // 0x430(0x8)
		UCommonRichTextBlock PushToTalk; // 0x438(0x8)
		UCommonTextBlock Text_LowPowerMode; // 0x440(0x8)
		UImage VoiceDisabledIcon; // 0x448(0x8)
		UCommonRichTextBlock VoiceDisabledText; // 0x450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/VoiceChannelSettings.VoiceChannelSettings_C");
			return ret;
		}

		void OnComplete_CAAD0AF4467900CF5BC6B8B8CA0C330F(UUserWidget UserWidget); // Flags: BlueprintCallable|BlueprintEvent 0x15D6675EB00
		void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D6675F000
		void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D6675EF00
		void BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D6675EE00
		void ShowVoiceSettingsButton(); // Flags: Event|Protected|BlueprintEvent 0x15D6675EA00
		void BndEvt__VoiceChannelSettings_Button_VoiceSettings_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D6675ED00
		void ExecuteUbergraph_VoiceChannelSettings(int32_t EntryPoint); // Flags: Final 0x15D6675EC00
	};


	// Class /Game/UI/SocialPanel/SocialPanelView_UserLists.SocialPanelView_UserLists_C
	// Inherited from UFortSocialPanelView_UserLists -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE8 (0x6D8 - 0x5F0)
	class USocialPanelView_UserLists_C : public UFortSocialPanelView_UserLists	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5F0(0x8)
		UWidgetAnimation WeGameButtonHovered; // 0x5F8(0x8)
		UWidgetAnimation SwitcherTransition; // 0x600(0x8)
		UWidgetAnimation NoFriendsArrowBounce; // 0x608(0x8)
		UWidgetAnimation MenuAnchorItemOpen; // 0x610(0x8)
		UWidgetAnimation Open; // 0x618(0x8)
		UWidgetAnimation Open; // 0x620(0x8)
		UImage bckgrnd; // 0x628(0x8)
		UImage CircularThrobber_UserSearch; // 0x630(0x8)
		UCommonRichTextBlock CommonRichTextBlock; // 0x638(0x8)
		UImage EmptyListImage; // 0x640(0x8)
		UFortMobileImage FortMobileImage; // 0x648(0x8)
		UImage Image_MicDisabled; // 0x650(0x8)
		UFortMobileImage Image_MicIcon; // 0x658(0x8)
		UFortMobileImage Image_MicIcon; // 0x660(0x8)
		UFortMobileImage Image_MicIcon; // 0x668(0x8)
		UImage Image_MicIcon; // 0x670(0x8)
		UFortMobileImage Image_TitleIcon; // 0x678(0x8)
		UCommonRichTextBlock RichText_LeavePlatformPartyTitle; // 0x680(0x8)
		UCommonRichTextBlock RichText_VoiceChatDisabled; // 0x688(0x8)
		UCommonRichTextBlock RichText_VoiceChatDisabledHeader; // 0x690(0x8)
		UCommonRichTextBlock RichText_VoiceChatDisabledWarningMessage; // 0x698(0x8)
		URichTextBlock RichTextBlock; // 0x6A0(0x8)
		USocialPanel_FriendLinkButton_C SocialPanel_FriendLinkButton; // 0x6A8(0x8)
		UCommonTextBlock Text_LowPowerMode; // 0x6B0(0x8)
		UCommonRichTextBlock VoiceChat_AcceptDescription; // 0x6B8(0x8)
		UCommonRichTextBlock VoiceChat_AcceptTitle; // 0x6C0(0x8)
		UWBP_UIKit_Button_Regular_C WBP_UIKit_Button_LearnMore; // 0x6C8(0x8)
		UWBP_UIKit_Button_Regular_C WBP_UIKit_Button_TurnOn; // 0x6D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanelView_UserLists.SocialPanelView_UserLists_C");
			return ret;
		}

		void BndEvt__Switcher_UserLists_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(UWidget ActiveWidget, int32_t ActiveWidgetIndex); // Flags: BlueprintEvent 0x15D80751E00
		void OnSetVoiceChannelButtonText(FText& ButtonText); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D80751B00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D80751D00
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D80751A00
		void UpdateAudioModerationAcceptPanelText(FText& Title, FText& Description); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D80751900
		void BndEvt__SocialPanelView_UserLists_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D80751F00
		void BndEvt__SocialPanelView_UserLists_WBP_UIKit_Button_Regular_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase Button); // Flags: BlueprintEvent 0x15D80752000
		void ExecuteUbergraph_SocialPanelView_UserLists(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D80751C00
	};


	// Class /Game/UI/SocialPanel/SocialPanel.SocialPanel_C
	// Inherited from UFortSocialPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x5A8 - 0x578)
	class USocialPanel_C : public UFortSocialPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x578(0x8)
		UWidgetAnimation OnOpened; // 0x580(0x8)
		UImage Image_Back; // 0x588(0x8)
		ULightbox_C Lightbox; // 0x590(0x8)
		USafeZone SafeZone; // 0x598(0x8)
		USocialPanel_TopBarExtension_C SocialPanel_TopBarExtension; // 0x5A0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel.SocialPanel_C");
			return ret;
		}

		void Play Panel Animation Sound(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D80750B00
		void ClosePanelAfterAnimation(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D80751300
		FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D80750C00
		void BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D80751500
		void ClosePanel(); // Flags: Event|Protected|BlueprintEvent 0x15D80751400
		void HandleOutroEnded(); // Flags: BlueprintCallable|BlueprintEvent 0x15D80750F00
		void OnBeginOutro(); // Flags: Event|Protected|BlueprintEvent 0x15D80750D00
		void OnBeginIntro(); // Flags: Event|Protected|BlueprintEvent 0x15D80750E00
		void HandleIntroEnded(); // Flags: BlueprintCallable|BlueprintEvent 0x15D80751000
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D80751200
		void ExecuteUbergraph_SocialPanel(int32_t EntryPoint); // Flags: Final 0x15D80751100
	};


	// Class /Game/UI/SocialPanel/SocialPanel_TopBarExtension.SocialPanel_TopBarExtension_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x1408 - 0x13E0)
	class USocialPanel_TopBarExtension_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation Hovered; // 0x13E8(0x8)
		UImage Arrow; // 0x13F0(0x8)
		UImage Image_PlatformIcon; // 0x13F8(0x8)
		UMiniPartyBar_C MiniPartyBar; // 0x1400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel_TopBarExtension.SocialPanel_TopBarExtension_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D80750A00
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D80750900
		void ExecuteUbergraph_SocialPanel_TopBarExtension(int32_t EntryPoint); // Flags: Final 0x15D80750800
	};


	// Class /Game/UI/Frontend/Parties/MiniPartyBar.MiniPartyBar_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x320 - 0x2E0)
	class UMiniPartyBar_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UIconTextButton_C ButtonLocalPlayer; // 0x2E8(0x8)
		UImage LineSeparator; // 0x2F0(0x8)
		UTeamMemberBanner_C LocalPlayer; // 0x2F8(0x8)
		UTeamMemberBanner_C RemotePlayer1; // 0x300(0x8)
		UTeamMemberBanner_C RemotePlayer2; // 0x308(0x8)
		UTeamMemberBanner_C RemotePlayer3; // 0x310(0x8)
		UTeamMemberManage_C NewLocalPlayerWidget; // 0x318(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Parties/MiniPartyBar.MiniPartyBar_C");
			return ret;
		}

		UWidget Get Banners Tooltip Widget(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D80753B00
		void HandlePartybarUIFeatureChanged(EFortUIFeature Feature, EFortUIFeatureState FeatureState); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D80753A00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D80753E00
		void BndEvt__ButtonLocalPlayer_K2Node_ComponentBoundEvent_81_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D80753F00
		void ExecuteUbergraph_MiniPartyBar(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D80753C00
	};


	// Class /Game/UI/Frontend/Parties/TeamMemberBanner.TeamMemberBanner_C
	// Inherited from UFortCampaignTeamMemberBanner -> UFortCampaignTeamMemberEntry -> UFortTeamMemberEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x1460 - 0x1420)
	class UTeamMemberBanner_C : public UFortCampaignTeamMemberBanner	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		UIconTextButton_C ButtonPartyFinder; // 0x1428(0x8)
		UOverlay Connected; // 0x1430(0x8)
		USizeBox Connecting; // 0x1438(0x8)
		UImage Image; // 0x1440(0x8)
		UOverlay Open; // 0x1448(0x8)
		UImage OpenImage; // 0x1450(0x8)
		UCommonWidgetSwitcherLegacy Switcher_MemberState; // 0x1458(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Parties/TeamMemberBanner.TeamMemberBanner_C");
			return ret;
		}

		void OpenPartyFinder(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D80754200
		void HandleMouseHoverVisualState(bool Hover); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D80750200
		void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D80750600
		void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D80750500
		void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy Button); // Flags: BlueprintEvent 0x15D80750400
		void OnTeamMemberConnectionStateChanged(EFortMemberConnectionState NewConnectionState); // Flags: Event|Protected|BlueprintEvent 0x15D80750100
		void ExecuteUbergraph_TeamMemberBanner(int32_t EntryPoint); // Flags: Final 0x15D80750300
	};


	// Class /Game/UI/Frontend/FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C
	// Inherited from UFortFrontendItemViewSettingsManager -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFrontendItemViewSettingsManager_C : public UFortFrontendItemViewSettingsManager	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C");
			return ret;
		}

		void IsJunoBuilding(UFortItemDefinition FortItemDefinition, bool& IsJunoBuilding); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D80753700
		bool Is Hero or Previews on Hero(UFortItemDefinition Item Definition, int32_t SubSlotIndex); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 0x15D80753800
		FFortItemViewSettings GetItemViewSettings(EFrontEndCamera Camera, ESubGame GameMode, UItemDefinitionBase ItemDefinition, int32_t SubSlotIndex); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 0x15D80753900
	};


	// Class /Game/UI/Foundation/Config/DefaultUIDataConfiguration.DefaultUIDataConfiguration_C
	// Inherited from UFortUIDataConfiguration -> UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x0 (0x4320 - 0x4320)
	class UDefaultUIDataConfiguration_C : public UFortUIDataConfiguration	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Config/DefaultUIDataConfiguration.DefaultUIDataConfiguration_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B-S.TextStyle-Base-XS-B-S_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B-S_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B-S.TextStyle-Base-XS-B-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XXS-B-S.TextStyle-Base-XXS-B-S_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XXS-B-S_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XXS-B-S.TextStyle-Base-XXS-B-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-S.TextStyle-Base-S-B-S_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-S_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-S.TextStyle-Base-S-B-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-S.TextStyle-Header-S_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-S_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-S.TextStyle-Header-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Watermark/BuildWatermark.BuildWatermark_C
	// Inherited from UFortBuildWatermark -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x340 - 0x338)
	class UBuildWatermark_C : public UFortBuildWatermark	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x338(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Watermark/BuildWatermark.BuildWatermark_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075E700
		void HandlePartyJoined(); // Flags: BlueprintCallable|BlueprintEvent 0x15D8075E400
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075E600
		void HandlePlayerStateChanged(FFortTeamMemberInfo& PlayerInfo); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D8075E300
		void ExecuteUbergraph_BuildWatermark(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D8075E500
	};


	// Class /Game/UI/Foundation/Movie/Legacy_MovieWidget.Legacy_MovieWidget_C
	// Inherited from UFortMovieWidget -> UFortUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x340 - 0x300)
	class ULegacy_MovieWidget_C : public UFortMovieWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x300(0x8)
		UImage Video_Image; // 0x308(0x8)
		UScaleBox Video_ScaleBox; // 0x310(0x8)
		bool shouldloop; // 0x318(0x1)
		bool AutoPlay; // 0x319(0x1)
		bool MaintainAspectRatio; // 0x31A(0x1)
		unsigned char UnknownData01_6[0x5]; // 0x31B(0x5) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnMediaReadyToPlay; // 0x320(0x10)
		FMulticastInlineDelegate OnMediaFailedToOpen; // 0x330(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Movie/Legacy_MovieWidget.Legacy_MovieWidget_C");
			return ret;
		}

		void SetDelayedContentValues(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075D900
		void Play(bool ShouldRewind); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075DA00
		void StopPlaying(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075D800
		void Init(UMediaPlayer InMediaPlayer, UMediaSource InMediaSource, UObject InMediaSoundWave, int32_t AudioTrack); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D8075DF00
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075E100
		void MediaDimensionsUpdated(float NewWidth, float NewHeight); // Flags: Event|Public|BlueprintEvent 0x15D8075DE00
		void OnMediaLoaded(); // Flags: BlueprintCallable|BlueprintEvent 0x15D8075DC00
		void ExecuteUbergraph_Legacy_MovieWidget(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D8075E000
		void OnMediaFailedToOpen__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D8075DD00
		void OnMediaReadyToPlay__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent 0x15D8075DB00
	};


	// Class /Game/UI/Foundation/Subtitles/Subtitles.Subtitles_C
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x330 - 0x320)
	class USubtitles_C : public UFortHUDElementWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x320(0x8)
		USubtitleDisplay SubtitleDisplay; // 0x328(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Subtitles/Subtitles.Subtitles_C");
			return ret;
		}

		void TagCountChanged_A7AB416146C6024A11C1AD94F917A95C(int32_t TagCount); // Flags: BlueprintCallable|BlueprintEvent 0x15D8075D300
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075D400
		void ExecuteUbergraph_Subtitles(int32_t EntryPoint); // Flags: Final 0x15D8075D500
	};


	// Class /Game/UI/InGame/HUD/MicIndicator/MicIndicator.MicIndicator_C
	// Inherited from UFortMicIndicatorWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2A (0x33A - 0x310)
	class UMicIndicator_C : public UFortMicIndicatorWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x8)
		UOverlay 01_NotSpeaking; // 0x318(0x8)
		UOverlay 02_Speaking; // 0x320(0x8)
		UOverlay 03_Muted; // 0x328(0x8)
		UWidgetSwitcher MicStateSwitcher; // 0x330(0x8)
		bool bIsMuted; // 0x338(0x1)
		bool bIsTalking; // 0x339(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/InGame/HUD/MicIndicator/MicIndicator.MicIndicator_C");
			return ret;
		}

		void OnPlayerTalkingChanged(bool bIsTalking); // Flags: Event|Protected|BlueprintEvent 0x15D8075D000
		void OnPlayerMuted(bool bIsMuted); // Flags: Event|Protected|BlueprintEvent 0x15D8075D100
		void ExecuteUbergraph_MicIndicator(int32_t EntryPoint); // Flags: Final 0x15D8075D200
	};


	// Class /Game/UI/Foundation/MicIndicator/Cinematic-TeamMics.Cinematic-TeamMics_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x260 (0x540 - 0x2E0)
	class UCinematic-TeamMics_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2E0(0x8)
		UMicIndicator_C MicIndicator; // 0x2E8(0x8)
		UCommonWidgetSwitcherLegacy SwitcherConnectingStranger; // 0x2F0(0x8)
		UCommonTextBlock TextBlock; // 0x2F8(0x8)
		UCommonTextBlock TextPlayerName; // 0x300(0x8)
		unsigned char UnknownData01_6[0x8]; // 0x308(0x8) UNKNOWN PROPERTY
		FFortTeamMemberInfo MemberInfo; // 0x310(0x230)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MicIndicator/Cinematic-TeamMics.Cinematic-TeamMics_C");
			return ret;
		}

		void Update(FFortTeamMemberInfo UpdatedMemberInfo); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D8075CB00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075CD00
		void ExecuteUbergraph_Cinematic-TeamMics(int32_t EntryPoint); // Flags: Final 0x15D8075CC00
	};


	// Class /Game/UI/Foundation/MicIndicator/TeamMicStack.TeamMicStack_C
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x348 - 0x320)
	class UTeamMicStack_C : public UFortHUDElementWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x320(0x8)
		UVerticalBox _Vertical_Box__Team_Members; // 0x328(0x8)
		UCommonBorder BorderFrame; // 0x330(0x8)
		TArray TeamMembers; // 0x338(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MicIndicator/TeamMicStack.TeamMicStack_C");
			return ret;
		}

		void ClearContents(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075C900
		void AppendTeamMember(FFortTeamMemberInfo& TeamMemberInfo); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D8075CA00
		void HandleTeamMemberChanged(FFortTeamMemberInfo Member Info); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075FE00
		void HandleTeamMemberRemoved(int32_t Member Index); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075FD00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075C800
		void HandlePartyLeft(); // Flags: BlueprintCallable|BlueprintEvent 0x15D8075FF00
		void ExecuteUbergraph_TeamMicStack(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D8075C700
	};


	// Class /Game/UI/Foundation/StateLayouts/Cinematic.Cinematic_C
	// Inherited from UFortUIStateWidget_NUI -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x59 (0x601 - 0x5A8)
	class UCinematic_C : public UFortUIStateWidget_NUI	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5A8(0x8)
		UNamedSlot LocalizedAudioOnlyMovieSlot; // 0x5B0(0x8)
		UCommonWidgetStackLegacy MainContentStack; // 0x5B8(0x8)
		UNamedSlot MovieSlot; // 0x5C0(0x8)
		UOverlay OverlayMovieOverlay; // 0x5C8(0x8)
		USubtitles_C Subtitles; // 0x5D0(0x8)
		UTeamMicStack_C TeamMicStack; // 0x5D8(0x8)
		UBuildWatermark_C Widget_BuildWatermark; // 0x5E0(0x8)
		ULegacy_MovieWidget_C MovieWidget; // 0x5E8(0x8)
		UFortMediaSubtitlesPlayer SubtitlesPlayer; // 0x5F0(0x8)
		UObject CinematicMediaSoundWave; // 0x5F8(0x8)
		bool bFinished; // 0x600(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/StateLayouts/Cinematic.Cinematic_C");
			return ret;
		}

		void GetAudioTrackIndex(int32_t& AudioTrack); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D8075F400
		void StopAndClearSubtitles(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075E900
		void ClearOldSubtitlesIfNecessary(bool NewSubtitlesExist, UFortMediaSubtitlesPlayer NewSubtitles); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075F800
		void SetMoviePlaying(bool MoviePlaying); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075EC00
		void ClearMovieWidget(UFortMovieWidget& MovieWidgetToClear); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D8075F900
		void ClearMovieSlot(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075FA00
		UWidget PopContentWidgetInternal(FContentPushState State); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D8075EE00
		void SkipMovie(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075EA00
		void ClearMovie(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075FB00
		void Show Movie(UMediaPlayer MediaPlayer, UMediaSource MediaSource); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D8075EB00
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075F700
		void HandleClientEvent_QueueCinematic(UObject EventSource, UObject EventFocus, FFortClientEvent& ClientEvent); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D8075F300
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D8075F600
		void HandleEndReached(); // Flags: BlueprintCallable|BlueprintEvent 0x15D8075F100
		void HandleClientEvent_SkipCinematic(UObject EventSource, UObject EventFocus, FFortClientEvent& ClientEvent); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent 0x15D8075F200
		void PushContentWidgetInternal(UWidget Widget, FContentPushState State); // Flags: Event|Protected|BlueprintEvent 0x15D8075ED00
		void OnEnterState(EFortUIState PreviousUIState); // Flags: Event|Public|BlueprintEvent 0x15D8075F000
		void OnExitState(EFortUIState NextUIState); // Flags: Event|Public|BlueprintEvent 0x15D8075EF00
		void ExecuteUbergraph_Cinematic(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D8075F500
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B-Black.TextStyle-Base-XS-B-Black_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B-Black_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B-Black.TextStyle-Base-XS-B-Black_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/SoftwareCursors/InvisibleCursorWidget.InvisibleCursorWidget_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B8 - 0x2B8)
	class UInvisibleCursorWidget_C : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/SoftwareCursors/InvisibleCursorWidget.InvisibleCursorWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankDark.TextStyle-Button-Primary-M_Skew_BurbankDark_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M_Skew_BurbankDark_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankDark.TextStyle-Button-Primary-M_Skew_BurbankDark_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankLightBlue.TextStyle-Button-Primary-M_Skew_BurbankLightBlue_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M_Skew_BurbankLightBlue_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankLightBlue.TextStyle-Button-Primary-M_Skew_BurbankLightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BurbankSmall-20-Black.TextStyle-BurbankSmall-20-Black_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BurbankSmall-20-Black_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BurbankSmall-20-Black.TextStyle-BurbankSmall-20-Black_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White50pc.TextStyle_BurbSmBk_20_White50pc_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_20_White50pc_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White50pc.TextStyle_BurbSmBk_20_White50pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White.TextStyle_BurbSmBk_20_White_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_20_White_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White.TextStyle_BurbSmBk_20_White_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_LightBlue.TextStyle_BurbSmBk_20_LightBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_20_LightBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_LightBlue.TextStyle_BurbSmBk_20_LightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle_BurbankSmall_M_White.TextStyle_BurbankSmall_M_White_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbankSmall_M_White_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle_BurbankSmall_M_White.TextStyle_BurbankSmall_M_White_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle_BurbankSmall_L_DarkBlue.TextStyle_BurbankSmall_L_DarkBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbankSmall_L_DarkBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle_BurbankSmall_L_DarkBlue.TextStyle_BurbankSmall_L_DarkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-ChoiceResponse.ButtonStyle-PlayerSurvey-ChoiceResponse_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-PlayerSurvey-ChoiceResponse_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-ChoiceResponse.ButtonStyle-PlayerSurvey-ChoiceResponse_C");
			return ret;
		}
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C
	// Inherited from UFortPlayerSurveyResponseChoiceBase -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2E1 (0x1681 - 0x13A0)
	class UPlayerSurveyResponseChoice_C : public UFortPlayerSurveyResponseChoiceBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13A0(0x8)
		UBorder Border_InputActionCircle; // 0x13A8(0x8)
		UImage Image_Checkbox; // 0x13B0(0x8)
		UCommonActionWidget InputActionWidget_Select; // 0x13B8(0x8)
		FSlateBrush Brush_RadioUnchecked; // 0x13C0(0xB0)
		FSlateBrush Brush_RadioChecked; // 0x1470(0xB0)
		FSlateBrush Brush_CheckboxUnchecked; // 0x1520(0xB0)
		FSlateBrush Brush_CheckboxChecked; // 0x15D0(0xB0)
		TEnumAsByte ChoiceType; // 0x1680(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C");
			return ret;
		}

		void Update Text Scale(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D83A84C00
		void GetCurrentButtonBrush(FSlateBrush& CurrentBrush); // Flags: Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D83A85100
		void UpdateChoiceImage(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D83A84A00
		void UpdateInputActionRenderOpacity(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D83A84900
		void UpdateButtonColor(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D83A84B00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D83A85500
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D83A85300
		void SetChoiceType(TEnumAsByte Type); // Flags: Event|Public|BlueprintEvent 0x15D83A84D00
		void OnSurveyResetChoice(); // Flags: Event|Protected|BlueprintEvent 0x15D83A84E00
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent 0x15D83A85400
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent 0x15D83A85600
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D83A84F00
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent 0x15D83A85000
		void BndEvt__PlayerSurveyResponseChoice_InputActionWidget_Select_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent 0x15D83A85700
		void ExecuteUbergraph_PlayerSurveyResponseChoice(int32_t EntryPoint); // Flags: Final 0x15D83A85200
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyOrthogonalIndicator.PlayerSurveyOrthogonalIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UPlayerSurveyOrthogonalIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UCommonActionWidget InputActionWidget_Move; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyOrthogonalIndicator.PlayerSurveyOrthogonalIndicator_C");
			return ret;
		}

		void UpdateGamepadControlsVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D83A84500
		void BndEvt__InputActionWidget_Move_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent 0x15D83A84700
		void ExecuteUbergraph_PlayerSurveyOrthogonalIndicator(int32_t EntryPoint); // Flags: Final 0x15D83A84600
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyVerticalIndicator.PlayerSurveyVerticalIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UPlayerSurveyVerticalIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UCommonActionWidget InputActionWidget_Move; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyVerticalIndicator.PlayerSurveyVerticalIndicator_C");
			return ret;
		}

		void UpdateGamepadControlsVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D83A88400
		void BndEvt__InputActionWidget_Move_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent 0x15D83A84400
		void ExecuteUbergraph_PlayerSurveyVerticalIndicator(int32_t EntryPoint); // Flags: Final 0x15D83A84300
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyHorizontalIndicator.PlayerSurveyHorizontalIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C8 - 0x2B8)
	class UPlayerSurveyHorizontalIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B8(0x8)
		UCommonActionWidget InputActionWidget_Move; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyHorizontalIndicator.PlayerSurveyHorizontalIndicator_C");
			return ret;
		}

		void UpdateGamepadControlsVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D83A88100
		void BndEvt__InputActionWidget_Move_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent 0x15D83A88300
		void ExecuteUbergraph_PlayerSurveyHorizontalIndicator(int32_t EntryPoint); // Flags: Final 0x15D83A88200
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyMultipleChoiceResponse.PlayerSurveyMultipleChoiceResponse_C
	// Inherited from UFortPlayerSurveyMultipleChoiceResponseBase -> UFortPlayerSurveyChoiceResponseWidget -> UFortPlayerSurveyResponseWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x488 - 0x448)
	class UPlayerSurveyMultipleChoiceResponse_C : public UFortPlayerSurveyMultipleChoiceResponseBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x448(0x8)
		UOverlay Overlay_OrthogonalIndicator; // 0x450(0x8)
		UOverlay Overlay_VerticalIndicator; // 0x458(0x8)
		UPlayerSurveyOrthogonalIndicator_C PlayerSurveyOrthogonalIndicator; // 0x460(0x8)
		UPlayerSurveyVerticalIndicator_C PlayerSurveyVerticalIndicator; // 0x468(0x8)
		USizeBox SizeBox_Responses; // 0x470(0x8)
		double BaseColumnWidth; // 0x478(0x8)
		double AdditionalColumnWidth; // 0x480(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyMultipleChoiceResponse.PlayerSurveyMultipleChoiceResponse_C");
			return ret;
		}

		void SetNumberOfResponses(int32_t NumberOfResponses); // Flags: Event|Protected|BlueprintEvent 0x15D83A87F00
		void OnAddedToFocusPath(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D83A88000
		void ExecuteUbergraph_PlayerSurveyMultipleChoiceResponse(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D63E2FD00
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveySingleChoiceResponse.PlayerSurveySingleChoiceResponse_C
	// Inherited from UFortPlayerSurveySingleChoiceResponseBase -> UFortPlayerSurveyChoiceResponseWidget -> UFortPlayerSurveyResponseWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x488 - 0x448)
	class UPlayerSurveySingleChoiceResponse_C : public UFortPlayerSurveySingleChoiceResponseBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x448(0x8)
		UOverlay Overlay_OrthogonalIndicator; // 0x450(0x8)
		UOverlay Overlay_VerticalIndicator; // 0x458(0x8)
		UPlayerSurveyOrthogonalIndicator_C PlayerSurveyOrthogonalIndicator; // 0x460(0x8)
		UPlayerSurveyVerticalIndicator_C PlayerSurveyVerticalIndicator; // 0x468(0x8)
		USizeBox SizeBox_Responses; // 0x470(0x8)
		double BaseColumnWidth; // 0x478(0x8)
		double AdditionalColumnWidth; // 0x480(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveySingleChoiceResponse.PlayerSurveySingleChoiceResponse_C");
			return ret;
		}

		void SetNumberOfResponses(int32_t NumberOfResponses); // Flags: Event|Protected|BlueprintEvent 0x15D83A87C00
		void OnAddedToFocusPath(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D83A87D00
		void ExecuteUbergraph_PlayerSurveySingleChoiceResponse(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D83A87E00
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-YellowSkew.ButtonStyle-PlayerSurvey-YellowSkew_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-PlayerSurvey-YellowSkew_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-YellowSkew.ButtonStyle-PlayerSurvey-YellowSkew_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_AngledBlueMenuButton.Athena_ButtonStyle_AngledBlueMenuButton_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UAthena_ButtonStyle_AngledBlueMenuButton_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_AngledBlueMenuButton.Athena_ButtonStyle_AngledBlueMenuButton_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle_Radial.ButtonStyle_Radial_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_Radial_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle_Radial.ButtonStyle_Radial_C");
			return ret;
		}
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C
	// Inherited from UFortPlayerSurveyRatingChoiceBase -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x13B0 - 0x13A0)
	class UPlayerSurveyRatingChoice_C : public UFortPlayerSurveyRatingChoiceBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13A0(0x8)
		UCommonActionWidget InputActionWidget_Select; // 0x13A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C");
			return ret;
		}

		void GetCurrentButtonBrush(FSlateBrush& CurrentBrush); // Flags: Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D83A87000
		void UpdateInputActionRenderOpacity(); // Flags: Private|BlueprintCallable|BlueprintEvent 0x15D83A86D00
		void UpdateTextStyle(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D83A86C00
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent 0x15D83A87400
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent 0x15D83A87200
		void OnSurveyResetChoice(); // Flags: Event|Protected|BlueprintEvent 0x15D83A86E00
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D83A86F00
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent 0x15D83A87300
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent 0x15D83A87500
		void ExecuteUbergraph_PlayerSurveyRatingChoice(int32_t EntryPoint); // Flags: Final 0x15D83A87100
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyRatingResponse.PlayerSurveyRatingResponse_C
	// Inherited from UFortPlayerSurveyRatingResponseBase -> UFortPlayerSurveyResponseWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x450 - 0x440)
	class UPlayerSurveyRatingResponse_C : public UFortPlayerSurveyRatingResponseBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x440(0x8)
		UPlayerSurveyHorizontalIndicator_C PlayerSurveyHorizontalIndicator; // 0x448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyRatingResponse.PlayerSurveyRatingResponse_C");
			return ret;
		}

		void OnAddedToFocusPath(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent 0x15D83A86700
		void OnResponsesSet_BP(); // Flags: Event|Protected|BlueprintEvent 0x15D83A86600
		void ExecuteUbergraph_PlayerSurveyRatingResponse(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D83A86800
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyWidget.PlayerSurveyWidget_C
	// Inherited from UFortPlayerSurveyWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x618 - 0x600)
	class UPlayerSurveyWidget_C : public UFortPlayerSurveyWidgetBase	
	{
	public:
		UImage Overlay; // 0x600(0x8)
		USafeZone SafeZone; // 0x608(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x610(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyWidget.PlayerSurveyWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/ItemShop/MultiProduct/MPItemShop_VaultWorld.MPItemShop_VaultWorld_C
	// Inherited from AVaultWorld_C -> AFortItemPreviewWorld -> AActor -> UObject
	// Size: 0x58 (0x3A9 - 0x351)
	class AMPItemShop_VaultWorld_C : public AVaultWorld_C	
	{
	public:
		unsigned char UnknownData03_3[0x7]; // 0x351(0x7) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x358(0x8)
		UStaticMeshComponent floor; // 0x360(0x8)
		float FloorVisibility_FloorMask_33DB417F4F318DD14C0CDB92ED647F56; // 0x368(0x4)
		TEnumAsByte FloorVisibility__Direction_33DB417F4F318DD14C0CDB92ED647F56; // 0x36C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x36D(0x3) UNKNOWN PROPERTY
		UTimelineComponent FloorVisibility; // 0x370(0x8)
		float TransitionForward_FX_Transition_Fade_A94F40F44CC1E033CF6C509AB9A33280; // 0x378(0x4)
		float TransitionForward_Forward_A94F40F44CC1E033CF6C509AB9A33280; // 0x37C(0x4)
		TEnumAsByte TransitionForward__Direction_A94F40F44CC1E033CF6C509AB9A33280; // 0x380(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x381(0x7) UNKNOWN PROPERTY
		UTimelineComponent TransitionForward; // 0x388(0x8)
		UMaterialInterface DefaultBackgroundMaterial; // 0x390(0x8)
		UMaterialInterface DefaultFloorMaterial; // 0x398(0x8)
		UStaticMeshComponent Background; // 0x3A0(0x8)
		bool IsMaterialBackground; // 0x3A8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/ItemShop/MultiProduct/MPItemShop_VaultWorld.MPItemShop_VaultWorld_C");
			return ret;
		}

		void StopTransitions(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661A9B00
		void HandleMaterialBackground(UMaterialInterface MaterialBackground); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661A8800
		void HandleTextureBackground(UTexture2D& TextureBackground); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D661A8D00
		void Set Background from Child Actor(); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661A9200
		void AssignBackgroundMaterial(UMaterialInterface SourceMaterial); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661AC300
		void AssignFloorMaterial(UMaterialInterface SourceMaterial); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661AC100
		void TransitionBackgroundBackward(double Backward, double FXTransitionFade, UMaterialInstanceDynamic Mid); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661A9600
		void TransitionBackgroundForward(double Forward, double FXTransitionFade, UMaterialInstanceDynamic Mid); // Flags: Public|BlueprintCallable|BlueprintEvent 0x15D661A9C00
		void SetupBackgroundMaterial(UTexture2D& TextureBackground, UMaterialInstanceDynamic Mid, bool IsFloor, bool FirstTimeSetup); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent 0x15D661A9300
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D661AA200
		void TransitionForward__FinishedFunc(); // Flags: BlueprintEvent 0x15D661A9700
		void TransitionForward__UpdateFunc(); // Flags: BlueprintEvent 0x15D661A9D00
		void FloorVisibility__FinishedFunc(); // Flags: BlueprintEvent 0x15D661A8700
		void FloorVisibility__UpdateFunc(); // Flags: BlueprintEvent 0x15D661A8C00
		void OnTransitionBackground(bool bPlayForward, EBackgroundIntensityLevel IntensityTransition); // Flags: Event|Protected|BlueprintEvent 0x15D661A8A00
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent 0x15D661A8B00
		void OnInitialBackgroundTransition(); // Flags: Event|Protected|BlueprintEvent 0x15D661A8900
		void OnSetupTextureBackground(UTexture2D LoadedBackgroundTexture, FVaultWorldBackgroundData& BackgroundInfo); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D661A9000
		void OnSetupMaterialBackground(UMaterialInterface LoadedBackgroundMaterial, FVaultWorldBackgroundData& BackgroundInfo); // Flags: Event|Protected|HasOutParms|BlueprintEvent 0x15D661A8F00
		void OnUpdateDisplay(bool bShowFloor, bool bShowEffects); // Flags: Event|Protected|BlueprintEvent 0x15D661A9100
		void OnNewSceneBackgroundChildActor(AFortStaticMeshActor NewActor); // Flags: Event|Protected|BlueprintEvent 0x15D661A8E00
		void ExecuteUbergraph_MPItemShop_VaultWorld(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D661A8500
	};


	// Class /Game/UI/Foundation/Environment/Cameras/FrontendCamera_VaultRotator.FrontendCamera_VaultRotator_C
	// Inherited from AFortCameraBase -> ACameraActor -> AActor -> UObject
	// Size: 0x18 (0xA28 - 0xA10)
	class AFrontendCamera_VaultRotator_C : public AFortCameraBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA10(0x8)
		UCameraComponent LoginCamera; // 0xA18(0x8)
		AVaultRotator_C ActiveVaultRotator; // 0xA20(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Environment/Cameras/FrontendCamera_VaultRotator.FrontendCamera_VaultRotator_C");
			return ret;
		}

		void SetVaultRotatorLighting(FName ItemRotatorTag); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent 0x15D6AFC8200
		void BP_OnActivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D6AFC7F00
		void BP_OnDeactivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D6AFC8000
		void ExecuteUbergraph_FrontendCamera_VaultRotator(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D6AFC7400
	};


	// Class /Game/UI/Foundation/Environment/Cameras/FrontendCamera_Manage.FrontendCamera_Manage_C
	// Inherited from AFortCameraBase -> ACameraActor -> AActor -> UObject
	// Size: 0x10 (0xA20 - 0xA10)
	class AFrontendCamera_Manage_C : public AFortCameraBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA10(0x8)
		UCameraComponent LoginCamera; // 0xA18(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Environment/Cameras/FrontendCamera_Manage.FrontendCamera_Manage_C");
			return ret;
		}

		void BP_OnActivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D84D4F400
		void BP_OnDeactivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D83525800
		void ExecuteUbergraph_FrontendCamera_Manage(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D84D4F300
	};


	// Class /Game/UI/Foundation/Input/CommonUIInputData.CommonUIInputData_C
	// Inherited from UCommonUIInputData -> UObject
	// Size: 0x0 (0x78 - 0x78)
	class UCommonUIInputData_C : public UCommonUIInputData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Input/CommonUIInputData.CommonUIInputData_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/UIManager_Startup.UIManager_Startup_C
	// Inherited from UFortUIManager_Startup -> UFortUIManager -> UObject
	// Size: 0x0 (0x128 - 0x128)
	class UUIManager_Startup_C : public UFortUIManager_Startup	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/UIManager_Startup.UIManager_Startup_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/UIManager_Athena.UIManager_Athena_C
	// Inherited from UFortUIManager_Athena -> UFortUIManager -> UObject
	// Size: 0x0 (0x148 - 0x148)
	class UUIManager_Athena_C : public UFortUIManager_Athena	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/UIManager_Athena.UIManager_Athena_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Environment/Cameras/FrontendCamera_Main.FrontendCamera_Main_C
	// Inherited from AFortCameraBase -> ACameraActor -> AActor -> UObject
	// Size: 0x10 (0xA20 - 0xA10)
	class AFrontendCamera_Main_C : public AFortCameraBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA10(0x8)
		UCameraComponent LoginCamera; // 0xA18(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Environment/Cameras/FrontendCamera_Main.FrontendCamera_Main_C");
			return ret;
		}

		void BP_OnActivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D952CB500
		void ExecuteUbergraph_FrontendCamera_Main(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D41F19300
	};


	// Class /Game/UI/Foundation/Environment/Cameras/FrontendCamera_Inspect.FrontendCamera_Inspect_C
	// Inherited from AFortCameraBase -> ACameraActor -> AActor -> UObject
	// Size: 0x10 (0xA20 - 0xA10)
	class AFrontendCamera_Inspect_C : public AFortCameraBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA10(0x8)
		UCameraComponent LoginCamera; // 0xA18(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Environment/Cameras/FrontendCamera_Inspect.FrontendCamera_Inspect_C");
			return ret;
		}

		void BP_OnActivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D952CAC00
		void BP_OnDeactivated(AFortPlayerController PlayerController); // Flags: Event|Public|BlueprintEvent 0x15D952CAD00
		void ExecuteUbergraph_FrontendCamera_Inspect(int32_t EntryPoint); // Flags: Final|HasDefaults 0x15D952CAE00
	};


	// Class /Game/UI/Foundation/Environment/Cameras/TVPostProcessBP.TVPostProcessBP_C
	// Inherited from AActor -> UObject
	// Size: 0x19 (0x2A9 - 0x290)
	class ATVPostProcessBP_C : public AActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x290(0x8)
		UBillboardComponent Billboard; // 0x298(0x8)
		USceneComponent Root; // 0x2A0(0x8)
		bool DisableOnStartup; // 0x2A8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Environment/Cameras/TVPostProcessBP.TVPostProcessBP_C");
			return ret;
		}

		void IsEnabledForCurrentSubgame(bool& bEnabled); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 0x15D8361FD00
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent 0x15D4D762900
		void Camera_DisableEffects(); // Flags: BlueprintCallable|BlueprintEvent 0x15D86191400
		void FrontEndCameraSwitch(); // Flags: BlueprintCallable|BlueprintEvent 0x15D86190700
		void ExecuteCameraSwitch(); // Flags: BlueprintCallable|BlueprintEvent 0x15D86A2C500
		void ExecuteUbergraph_TVPostProcessBP(int32_t EntryPoint); // Flags: Final 0x15D86A26600
	};


	// Class /Game/UI/Foundation/Border/Border-FloatingShadow.Border-FloatingShadow_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-FloatingShadow_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-FloatingShadow.Border-FloatingShadow_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border_Solid_DkBlue.Border_Solid_DkBlue_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder_Solid_DkBlue_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border_Solid_DkBlue.Border_Solid_DkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border_Navy_VGrad.Border_Navy_VGrad_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder_Navy_VGrad_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border_Navy_VGrad.Border_Navy_VGrad_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border_StatRow_WhiteLowOpacity.Border_StatRow_WhiteLowOpacity_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder_StatRow_WhiteLowOpacity_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border_StatRow_WhiteLowOpacity.Border_StatRow_WhiteLowOpacity_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-DkBlue.Border-SolidBG-DkBlue_C
	// Inherited from UCommonBorderStyle -> UObject
