#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: _Verse
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class /Solaris/_Verse/VNI/VerseNative.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuter : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UConcurrency : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fConcurrency_N_Rtask_L_Nt_20where_20t_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fConcurrency_N_Rawaitable_L_Npayload_20where_20payload_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fConcurrency_N_Rawaitable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency_awaitable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UConcurrency_awaitable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency_awaitable");
			return ret;
		}

		UConcurrency_task Await(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency_task
	// Inherited from UObject
	// Size: 0x90 (0xB8 - 0x28)
	class UConcurrency_task : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x90]; // 0x28(0x90) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency_task");
			return ret;
		}

		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUnsettled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D291C(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUninterrupted(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D2914(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RSettled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D290C(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RInterrupted(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D2904(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCompleted(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D28FC(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceling(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D28F4(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D28EC(relative to base address)
		UConcurrency_task Cancel(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UConcurrency_task Await(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RActive(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D28E4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency_task_group
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UConcurrency_task_group : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x28(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency_task_group");
			return ret;
		}

		int64_t _L_2fVerse_2eorg_2fConcurrency_2ftask__group_N_RGetNumActive(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D2924(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Native
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UNative : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Native");
			return ret;
		}

		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.task_Concurrency_awaitable$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Concurrency_awaitable$Await : public UConcurrency_task	
	{
	public:
		UConcurrency_awaitable* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData00_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.task_Concurrency_awaitable$Await");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Concurrency_task$Await : public UConcurrency_task	
	{
	public:
		UConcurrency_task* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData00_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF74D0D28D4(relative to base address)
	};


	// Class /Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Cancel
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x9 (0xC1 - 0xB8)
	class Utask_Concurrency_task$Cancel : public UConcurrency_task	
	{
	public:
		UConcurrency_task* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Cancel");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF74D0D28DC(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_0 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /Verse/_Verse/VNI/Verse.Random
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class URandom : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Random");
			return ret;
		}

		TArray _L_2fVerse_2eorg_2fRandom_N_RShuffle_L_N_Kt_20where_20t_R(TArray<__verse_0xB2CDDD72_Argument> __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int64_t _L_2fVerse_2eorg_2fRandom_N_RGetRandomInt_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100464(relative to base address)
		double _L_2fVerse_2eorg_2fRandom_N_RGetRandomFloat_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10045C(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.task_Verse_event$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Verse_event$Await : public UConcurrency_task	
	{
	public:
		UVerse_event* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData00_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.task_Verse_event$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF74D100454(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse : public UObject	
	{
	public:
		double __verse_0x34BB10F0_PiFloat; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fVerse_N_Rsubscribable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerse_N_Rsubscribable_L_Nt_20where_20t_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerse_N_Rsignalable_L_Npayload_20where_20payload_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		TArray _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		TArray _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAll_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_L_Kt_M_Kt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Many_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveElement_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		TArray _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Many_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemove_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsFinite_U_L_Nfloat_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsAlmostZero_U_L_Nfloat_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lfloat_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eInsert_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_M_Kt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eFind_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Many_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerse_N_Rlistenable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerse_N_Rlistenable_L_Npayload_20where_20payload_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerse_N_Revent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerse_N_Revent_L_Nt_20where_20t_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar32_R(int32_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100564(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar_R(char __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10056C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10057C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100574(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RTanh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10055C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RTan_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100554(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RSqrt_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10054C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RSinh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100544(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RSin_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10053C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int64_t _L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RRound_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100534(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RQuotient_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10052C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RPow_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100524(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RMod_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10051C(relative to base address)
		int64_t _L_2fVerse_2eorg_2fVerse_N_RMin_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RMin_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int64_t _L_2fVerse_2eorg_2fVerse_N_RMax_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RMax_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UVerse_message _L_2fVerse_2eorg_2fVerse_N_RMakeMessageInternal_L_N_Kchar_M_N_Kchar_M_N_5b_Kchar_5dlocalizable__value_R(Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100514(relative to base address)
		UVerse_localizable_int _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UVerse_localizable_float _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UVerse_localizable_message _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nmessage_R(UVerse_message* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UVerse_localizable_string _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RLog_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nmessage_R(UVerse_message* __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10050C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nint_M_N_QWhere_Nlocale_R(Ftuple_Lint_M_QWhere_Nlocale_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nfloat_M_N_QWhere_Nlocale_R(Ftuple_Lfloat_M_QWhere_Nlocale_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_N_Kchar_M_N_QWhere_Nlocale_R(Ftuple_L_Kchar_M_QWhere_Nlocale_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RLn_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100504(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RLerp_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004FC(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RJoin_L_N_K_Kchar_M_N_Kchar_R(Ftuple_L_K_Kchar_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004F4(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RIsAlmostEqual_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RInt_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004EC(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RGetSecondsSinceEpoch(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004E4(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RFloor_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004DC(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RExp_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004D4(relative to base address)
		EVerseFalse _L_2fVerse_2eorg_2fVerse_N_RErr_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004CC(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RCosh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004C4(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RCos_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004BC(relative to base address)
		TArray _L_2fVerse_2eorg_2fVerse_N_RConcatenate_L_N_K_Kt_20where_20t_R(TArray<TArray> __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int64_t _L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004B4(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RCeil_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004AC(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10049C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1004A4(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArcSin_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100494(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArcCos_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10048C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArTanh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100484(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArSinh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10047C(relative to base address)
		double _L_2fVerse_2eorg_2fVerse_N_RArCosh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D100474(relative to base address)
		FVerse_locale Verse_locale$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerse_locale Verse_locale$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_cancelable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_cancelable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_cancelable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_disposable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_disposable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_disposable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_enableable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_enableable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_enableable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_event
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UVerse_event : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x28]; // 0x28(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_event");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fsignalable_N_RSignal_L_Npayload_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D10046C(relative to base address)
		int64_t _L_2fVerse_2eorg_2fVerse_2fevent_N_RGetAwaitCount(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D2924(relative to base address)
		UConcurrency_task Await(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_invalidatable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_invalidatable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_invalidatable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_listenable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_listenable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_listenable");
			return ret;
		}
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_value
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_localizable_value : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_value");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_float
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse_localizable_float : public UVerse_localizable_value	
	{
	public:
		double __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_float");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_int
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse_localizable_int : public UVerse_localizable_value	
	{
	public:
		int64_t __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_int");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_message
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse_localizable_message : public UVerse_localizable_value	
	{
	public:
		UVerse_message* __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_message");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_string
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UVerse_localizable_string : public UVerse_localizable_value	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_string");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_message
	// Inherited from UObject
	// Size: 0x70 (0x98 - 0x28)
	class UVerse_message : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x28(0x20) UNKNOWN PROPERTY
		TMap<__verse_0x85420AD2_Substitutions, UVerse_localizable_value*> __verse_0x85420AD2_Substitutions; // 0x48(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_message");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_signalable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_signalable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_signalable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fsignalable_N_RSignal_L_Npayload_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_subscribable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_subscribable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_subscribable");
			return ret;
		}

		UObject _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_1 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class URestricted : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.Restricted");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fRestricted_N_Rsticky__event_L_Nt_20where_20t_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fRestricted_N_Rsticky__event(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class URestricted_sticky_event : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fsignalable_N_RSignal_L_Npayload_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D34963C(relative to base address)
		void _L_2fVerse_2eorg_2fRestricted_2fsticky__event_N_RIsSignaled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D349634(relative to base address)
		int64_t _L_2fVerse_2eorg_2fRestricted_2fsticky__event_N_RGetAwaitCount(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D0D2924(relative to base address)
		void _L_2fVerse_2eorg_2fRestricted_2fsticky__event_N_RClearSignal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D34962C(relative to base address)
		UConcurrency_task Await(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.task_Restricted_sticky_event$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Restricted_sticky_event$Await : public UConcurrency_task	
	{
	public:
		URestricted_sticky_event* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData00_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.task_Restricted_sticky_event$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF74D349624(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_2 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.task_VerseEngine_subscribable_event$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_VerseEngine_subscribable_event$Await : public UConcurrency_task	
	{
	public:
		UVerseEngine_subscribable_event* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData00_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.task_VerseEngine_subscribable_event$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF74D34D960(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseEngine : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_EntityHelpers
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseEngine_Entity_EntityHelpers : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_EntityHelpers");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Nvk__component_R(UEntityComponent* __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D978(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Nvk__component_M_NType_20where_20Type_R(Ftuple_Lvk__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D970(relative to base address)
		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Nvk__component_R(UEntityComponent* __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D968(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_vk_entity
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerseEngine_Entity_vk_entity : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_vk_entity");
			return ret;
		}

		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RRemoveComponent_L_Nvk__component_R(UEntityComponent* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D9C0(relative to base address)
		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RIsEqual_L_Nvk__entity_R(UVerseEngine_Entity_vk_entity* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D9B8(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RHasComponents_L_N_Ksubtype_Lvk__component_R_R(TArray<UClass*> __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D9B0(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetName(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D9A8(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetFullname(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D9A0(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D998(relative to base address)
		TArray _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D990(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_REnsureComponents_L_N_Ksubtype_Lvk__component_R_R(TArray<UClass*> __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RDestroy(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D988(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D980(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_base
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseEngine_multicast_delegate_base : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_base");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate
	// Inherited from UVerseEngine_multicast_delegate_base -> UObject
	// Size: 0x40 (0x68 - 0x28)
	class UVerseEngine_multicast_delegate : public UVerseEngine_multicast_delegate_base	
	{
	public:
		unsigned char UnknownData00_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate");
			return ret;
		}

		UObject _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D34D9E0(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_REmpty(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D34D9D0(relative to base address)
		void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_RBroadcast_L_Nt_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D34D9C8(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_subscription
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UVerseEngine_multicast_delegate_subscription : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x28(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_subscription");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D34D9D8(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_subscribable_event
	// Inherited from UVerseEngine_multicast_delegate -> UVerseEngine_multicast_delegate_base -> UObject
	// Size: 0x28 (0x90 - 0x68)
	class UVerseEngine_subscribable_event : public UVerseEngine_multicast_delegate	
	{
	public:
		unsigned char UnknownData00_1[0x28]; // 0x68(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_subscribable_event");
			return ret;
		}

		UConcurrency_task Await(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Execution.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_3 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Execution.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/Execution.execution_subscribable
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class Uexecution_subscribable : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Execution.execution_subscribable");
			return ret;
		}

		UObject _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D642918(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Execution.execution_subscription
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class Uexecution_subscription : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x28(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Execution.execution_subscription");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunBefore_L_Nexecution__subscription_R(Uexecution_subscription* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D642908(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunAfter_L_Nexecution__subscription_R(Uexecution_subscription* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D642900(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D642910(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_4 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.Simulation
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class USimulation : public UObject	
	{
	public:
		UVerse_message* __verse_0x231BDA57_editable_empty_message; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.Simulation");
			return ret;
		}

		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_5 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Root : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary._Root");
			return ret;
		}

		TArray _L_2fUnrealEngine_2ecom_2fTemporary_N_RSortBy_L_N_Kt_M_Ntype_7b___L_Nt_M_Nt_R_3ccomputes_3e_3cdecides_3e_Nvoid_7d_20where_20t_R(Ftuple_L_Kany_Mtype_7b___L_Nany_M_Nany_R_3ccomputes_3e_3cdecides_3e_Nvoid_7d_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1116C0(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USpatialMath : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath");
			return ret;
		}

		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2i_R(FSpatialMath_vector2i __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R(Ftuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1116B8(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R(Ftuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1116B0(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R(Ftuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1116A8(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R(Ftuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1116A0(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111698(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111690(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquaredXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111688(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector3_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lvector3_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector2_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lvector2_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eInvert_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111680(relative to base address)
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetYawPitchRollDegrees_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111678(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalUp_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalRight_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalForward_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAxis_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111670(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAngle_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111668(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyYaw_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111660(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111658(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111650(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111648(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyRoll_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111640(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyPitch_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111638(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R(Ftuple_Lfloat_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R(Ftuple_Lfloat_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R(Ftuple_Lvector2i_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R(Ftuple_Lint_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZero(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZAxis(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RYAxis(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RXAxis(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVectorNoScale_L_Ntransform_M_Nvector3_R(Ftuple_Ltransform_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111628(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVector_L_Ntransform_M_Nvector3_R(Ftuple_Ltransform_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111630(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2i_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2_L_Nvector2i_R(FSpatialMath_vector2i __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111608(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111620(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2i_R(FSpatialMath_vector2i __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111618(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111610(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nrotation_R(FVerseRotation __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111600(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RSlerp_L_Nrotation_M_Nrotation_M_Nfloat_R(Ftuple_Lrotation_Mrotation_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115F8(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115F0(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115E8(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RRadiansToDegrees_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115D8(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115E0(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115C8(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115D0(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeComponentWiseDeltaRotation_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115C0(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115B8(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int64_t _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115B0(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115A8(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111590(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111580(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111580(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111588(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1115A0(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111590(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111598(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111578(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RAngularDistance_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D111570(relative to base address)
		FSpatialMath_vector3 SpatialMath_vector3$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector3 SpatialMath_vector3$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2i SpatialMath_vector2i$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2i SpatialMath_vector2i$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 SpatialMath_vector2$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_vector2 SpatialMath_vector2$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_transform SpatialMath_transform$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_transform SpatialMath_transform$Factory(); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseColors/_Verse/VNI/VerseColors.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_6 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseColors/_Verse/VNI/VerseColors.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseColors/_Verse/VNI/VerseColors.Colors
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UColors : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseColors/_Verse/VNI/VerseColors.Colors");
			return ret;
		}

		void _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R(Ftuple_Lcolor_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10952C(relative to base address)
		void _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R(Ftuple_Lcolor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D109524(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R(Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10951C(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R(Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D109514(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R(Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094EC(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R(Ftuple_Lcolor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094F4(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R(Ftuple_Lfloat_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D109504(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R(Ftuple_Lcolor_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094FC(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R(Ftuple_Lint_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D10950C(relative to base address)
		Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094E4(relative to base address)
		Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094DC(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094D4(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094C4(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094CC(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094BC(relative to base address)
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D1094B4(relative to base address)
		FColors_color Colors_color$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FColors_color Colors_color$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseColors/_Verse/VNI/VerseColors.Colors_NamedColors
	// Inherited from UObject
	// Size: 0xDC8 (0xDF0 - 0x28)
	class UColors_NamedColors : public UObject	
	{
	public:
		FColors_color __verse_0x9FBDE6AE_AliceBlue; // 0x28(0x18)
		FColors_color __verse_0xB3F7599D_AntiqueWhite; // 0x40(0x18)
		FColors_color __verse_0x37EE68B4_Aqua; // 0x58(0x18)
		FColors_color __verse_0xA52EBB79_Aquamarine; // 0x70(0x18)
		FColors_color __verse_0xD06EFB2A_Azure; // 0x88(0x18)
		FColors_color __verse_0x8CE5D6D0_Beige; // 0xA0(0x18)
		FColors_color __verse_0xC6B3972A_Bisque; // 0xB8(0x18)
		FColors_color __verse_0x65E4346F_Black; // 0xD0(0x18)
		FColors_color __verse_0x513D3B5F_BlanchedAlmond; // 0xE8(0x18)
		FColors_color __verse_0x80217580_Blue; // 0x100(0x18)
		FColors_color __verse_0x31D0653D_BlueViolet; // 0x118(0x18)
		FColors_color __verse_0xAD308F8F_Brown; // 0x130(0x18)
		FColors_color __verse_0xED3A42A8_Burlywood; // 0x148(0x18)
		FColors_color __verse_0x921A6303_CadetBlue; // 0x160(0x18)
		FColors_color __verse_0x9E2BDE1B_Chartreuse; // 0x178(0x18)
		FColors_color __verse_0x082AED19_Chocolate; // 0x190(0x18)
		FColors_color __verse_0x196BEF87_Coral; // 0x1A8(0x18)
		FColors_color __verse_0xC6BCD84F_CornflowerBlue; // 0x1C0(0x18)
		FColors_color __verse_0xEE818697_Cornsilk; // 0x1D8(0x18)
		FColors_color __verse_0x6733DEF7_Crimson; // 0x1F0(0x18)
		FColors_color __verse_0x2D925695_Cyan; // 0x208(0x18)
		FColors_color __verse_0x935B7248_DarkBlue; // 0x220(0x18)
		FColors_color __verse_0x3EE8515D_DarkCyan; // 0x238(0x18)
		FColors_color __verse_0x5817F032_DarkGoldenrod; // 0x250(0x18)
		FColors_color __verse_0x916F3C35_DarkGray; // 0x268(0x18)
		FColors_color __verse_0x37F798B1_DarkGreen; // 0x280(0x18)
		FColors_color __verse_0x6B6176B1_DarkGrey; // 0x298(0x18)
		FColors_color __verse_0x9A5F61FB_DarkKhaki; // 0x2B0(0x18)
		FColors_color __verse_0x97899EDF_DarkMagenta; // 0x2C8(0x18)
		FColors_color __verse_0xC2E62C73_DarkOliveGreen; // 0x2E0(0x18)
		FColors_color __verse_0x7431D49D_DarkOrange; // 0x2F8(0x18)
		FColors_color __verse_0xA0C47F58_DarkOrchid; // 0x310(0x18)
		FColors_color __verse_0xA3246E28_DarkRed; // 0x328(0x18)
		FColors_color __verse_0x5A06EB6C_DarkSalmon; // 0x340(0x18)
		FColors_color __verse_0xF141484E_DarkSeaGreen; // 0x358(0x18)
		FColors_color __verse_0x4167AB57_DarkSlateBlue; // 0x370(0x18)
		FColors_color __verse_0x4353E52A_DarkSlateGray; // 0x388(0x18)
		FColors_color __verse_0xB95DAFAE_DarkSlateGrey; // 0x3A0(0x18)
		FColors_color __verse_0x26DA5155_DarkTurquoise; // 0x3B8(0x18)
		FColors_color __verse_0x3E781A05_DarkViolet; // 0x3D0(0x18)
		FColors_color __verse_0x53E148EA_DeepPink; // 0x3E8(0x18)
		FColors_color __verse_0xA474CD21_DeepSkyBlue; // 0x400(0x18)
		FColors_color __verse_0xEC312FE8_DimGray; // 0x418(0x18)
		FColors_color __verse_0x163F656C_DimGrey; // 0x430(0x18)
		FColors_color __verse_0x617B6862_DodgerBlue; // 0x448(0x18)
		FColors_color __verse_0xC636E104_Firebrick; // 0x460(0x18)
		FColors_color __verse_0x06164DB2_FloralWhite; // 0x478(0x18)
		FColors_color __verse_0x4939E624_ForestGreen; // 0x490(0x18)
		FColors_color __verse_0x8069E472_Fuchsia; // 0x4A8(0x18)
		FColors_color __verse_0x71D0705F_Gainsboro; // 0x4C0(0x18)
		FColors_color __verse_0x1EDD5A5B_GhostWhite; // 0x4D8(0x18)
		FColors_color __verse_0x0363FA56_Gold; // 0x4F0(0x18)
		FColors_color __verse_0x13A0B098_Goldenrod; // 0x508(0x18)
		FColors_color __verse_0x82153BFD_Gray; // 0x520(0x18)
		FColors_color __verse_0x853EAC70_Green; // 0x538(0x18)
		FColors_color __verse_0x94CAEBA0_GreenYellow; // 0x550(0x18)
		FColors_color __verse_0x781B7179_Grey; // 0x568(0x18)
		FColors_color __verse_0x6FB30324_Honeydew; // 0x580(0x18)
		FColors_color __verse_0x2D404B19_Hotpink; // 0x598(0x18)
		FColors_color __verse_0x2CE09720_IndianRed; // 0x5B0(0x18)
		FColors_color __verse_0x180B2901_Indigo; // 0x5C8(0x18)
		FColors_color __verse_0x1086E2EC_Ivory; // 0x5E0(0x18)
		FColors_color __verse_0x2896553A_Khaki; // 0x5F8(0x18)
		FColors_color __verse_0xB93AFCDC_Lavender; // 0x610(0x18)
		FColors_color __verse_0x4CF8F931_LavenderBlush; // 0x628(0x18)
		FColors_color __verse_0x08B4792E_LawnGreen; // 0x640(0x18)
		FColors_color __verse_0xCC22276F_LemonChiffon; // 0x658(0x18)
		FColors_color __verse_0x607C97F4_LightBlue; // 0x670(0x18)
		FColors_color __verse_0x89B3D40E_LightCoral; // 0x688(0x18)
		FColors_color __verse_0xCDCFB4E1_LightCyan; // 0x6A0(0x18)
		FColors_color __verse_0x6C11FD65_LightGoldenrodYellow; // 0x6B8(0x18)
		FColors_color __verse_0x6248D989_LightGray; // 0x6D0(0x18)
		FColors_color __verse_0x15E697F9_LightGreen; // 0x6E8(0x18)
		FColors_color __verse_0x9846930D_LightGrey; // 0x700(0x18)
		FColors_color __verse_0xC34ABDCC_LightPink; // 0x718(0x18)
		FColors_color __verse_0xC57DAB84_LightSalmon; // 0x730(0x18)
		FColors_color __verse_0x0FE57B41_LightSeaGreen; // 0x748(0x18)
		FColors_color __verse_0x4077C098_LightSkyBlue; // 0x760(0x18)
		FColors_color __verse_0xCABFF9F6_LightSlateGray; // 0x778(0x18)
		FColors_color __verse_0x30B1B372_LightSlateGrey; // 0x790(0x18)
		FColors_color __verse_0xEFD2DF75_LightSteelBlue; // 0x7A8(0x18)
		FColors_color __verse_0x5732C477_LightYellow; // 0x7C0(0x18)
		FColors_color __verse_0xA58A0A97_Lime; // 0x7D8(0x18)
		FColors_color __verse_0xC8D6E552_LimeGreen; // 0x7F0(0x18)
		FColors_color __verse_0xD014B08F_Linen; // 0x808(0x18)
		FColors_color __verse_0xC5065659_Magenta; // 0x820(0x18)
		FColors_color __verse_0x2C6B6225_Maroon; // 0x838(0x18)
		FColors_color __verse_0x603DC640_MediumAquamarine; // 0x850(0x18)
		FColors_color __verse_0x03344EDD_MediumBlue; // 0x868(0x18)
		FColors_color __verse_0xEB235F60_MediumOrchid; // 0x880(0x18)
		FColors_color __verse_0x80AC62AF_MediumPurple; // 0x898(0x18)
		FColors_color __verse_0xA2F1456A_MediumSeaGreen; // 0x8B0(0x18)
		FColors_color __verse_0x81A3E0C2_MediumSlateBlue; // 0x8C8(0x18)
		FColors_color __verse_0x8259C923_MediumSpringGreen; // 0x8E0(0x18)
		FColors_color __verse_0xE61E1AC0_MediumTurquoise; // 0x8F8(0x18)
		FColors_color __verse_0x750A73D1_MediumVioletRed; // 0x910(0x18)
		FColors_color __verse_0x54B068FD_MidnightBlue; // 0x928(0x18)
		FColors_color __verse_0x2D5517E3_MintCream; // 0x940(0x18)
		FColors_color __verse_0xC9B38859_MistyRose; // 0x958(0x18)
		FColors_color __verse_0x045E548D_Moccasin; // 0x970(0x18)
		FColors_color __verse_0x66A473BA_NavajoWhite; // 0x988(0x18)
		FColors_color __verse_0x621CB82D_Navy; // 0x9A0(0x18)
		FColors_color __verse_0x4433768E_OldLace; // 0x9B8(0x18)
		FColors_color __verse_0x4ADCED0B_Olive; // 0x9D0(0x18)
		FColors_color __verse_0x662F5053_OliveDrab; // 0x9E8(0x18)
		FColors_color __verse_0x7B1B98E3_Orange; // 0xA00(0x18)
		FColors_color __verse_0x31DF128E_OrangeRed; // 0xA18(0x18)
		FColors_color __verse_0xAFEE3326_Orchid; // 0xA30(0x18)
		FColors_color __verse_0xA90612F2_PaleGoldenrod; // 0xA48(0x18)
		FColors_color __verse_0x6494F519_PaleGreen; // 0xA60(0x18)
		FColors_color __verse_0xD7CBB395_PaleTurquoise; // 0xA78(0x18)
		FColors_color __verse_0xBC04EB9C_PaleVioletred; // 0xA90(0x18)
		FColors_color __verse_0x1267A5CE_PapayaWhip; // 0xAA8(0x18)
		FColors_color __verse_0x5B815063_PeachPuff; // 0xAC0(0x18)
		FColors_color __verse_0x6A5E8726_Peru; // 0xAD8(0x18)
		FColors_color __verse_0x23175FB8_Pink; // 0xAF0(0x18)
		FColors_color __verse_0x92124624_Plum; // 0xB08(0x18)
		FColors_color __verse_0x315A9690_PowderBlue; // 0xB20(0x18)
		FColors_color __verse_0xC4610EE9_Purple; // 0xB38(0x18)
		FColors_color __verse_0x77CCDA87_Red; // 0xB50(0x18)
		FColors_color __verse_0xFB01846B_RosyBrown; // 0xB68(0x18)
		FColors_color __verse_0xA95C80D8_RoyalBlue; // 0xB80(0x18)
		FColors_color __verse_0xFCC2BB8C_SaddleBrown; // 0xB98(0x18)
		FColors_color __verse_0x552CA712_Salmon; // 0xBB0(0x18)
		FColors_color __verse_0xE1C22521_SandyBrown; // 0xBC8(0x18)
		FColors_color __verse_0x36A1DDC2_SeaGreen; // 0xBE0(0x18)
		FColors_color __verse_0x58B624CB_SeaShell; // 0xBF8(0x18)
		FColors_color __verse_0x013650B1_Sienna; // 0xC10(0x18)
		FColors_color __verse_0xFA47F979_Silver; // 0xC28(0x18)
		FColors_color __verse_0x1EAB27FD_SkyBlue; // 0xC40(0x18)
		FColors_color __verse_0x0AD0EBFD_SlateBlue; // 0xC58(0x18)
		FColors_color __verse_0x08E4A580_SlateGray; // 0xC70(0x18)
		FColors_color __verse_0xF2EAEF04_SlateGrey; // 0xC88(0x18)
		FColors_color __verse_0xE7A26A33_Snow; // 0xCA0(0x18)
		FColors_color __verse_0x2CD5AEB9_SpringGreen; // 0xCB8(0x18)
		FColors_color __verse_0x2D898303_SteelBlue; // 0xCD0(0x18)
		FColors_color __verse_0x09871083_Tan; // 0xCE8(0x18)
		FColors_color __verse_0x303C932D_Teal; // 0xD00(0x18)
		FColors_color __verse_0x303F6677_Thistle; // 0xD18(0x18)
		FColors_color __verse_0x4DC64808_Tomato; // 0xD30(0x18)
		FColors_color __verse_0x6D6D11FF_Turquoise; // 0xD48(0x18)
		FColors_color __verse_0x3152567B_Violet; // 0xD60(0x18)
		FColors_color __verse_0x13A81039_Wheat; // 0xD78(0x18)
		FColors_color __verse_0x27EAE4E0_White; // 0xD90(0x18)
		FColors_color __verse_0xBE90A762_WhiteSmoke; // 0xDA8(0x18)
		FColors_color __verse_0xC763C8E1_Yellow; // 0xDC0(0x18)
		FColors_color __verse_0xF10B434A_YellowGreen; // 0xDD8(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseColors/_Verse/VNI/VerseColors.Colors_NamedColors");
			return ret;
		}

		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseParameterCollections.ParameterCollections_parameter_collection
	// Inherited from UVerseParameterCollection -> UObject
	// Size: 0x0 (0x78 - 0x78)
	class UParameterCollections_parameter_collection : public UVerseParameterCollection	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseParameterCollections.ParameterCollections_parameter_collection");
			return ret;
		}

		void _L_2fVerse_2eorg_2fParameterCollections_2fparameter__collection_N_ROnPropertyChangedFromVerse_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D34EBB0(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_7 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssets : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets");
			return ret;
		}

		void _L_2fVerse_2eorg_2fAssets_N_RMakeAsset_L_NAssetType_M_N_Kchar_20where_20AssetType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F74(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset
	// Inherited from UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x8 (0x88 - 0x80)
	class UAssets_asset : public UVerseAssetPtr	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x80(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_asset");
			return ret;
		}

		bool _L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F5C(relative to base address)
		void _L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F54(relative to base address)
		void _L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F4C(relative to base address)
		URestricted_sticky_event _L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F44(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_blueprint
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation_blueprint : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_blueprint");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_instance
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation_instance : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_instance");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_sequence
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation_sequence : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_sequence");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_rig_asset
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_rig_asset : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_rig_asset");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_float
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_float : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_float");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_integer
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_integer : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_integer");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_logic
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_logic : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_logic");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_rotation
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_rotation : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_rotation");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_transform
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_transform : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_transform");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector2
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_vector2 : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector2");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector3
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_vector3 : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector3");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_client_asset
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_client_asset : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_client_asset");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_action
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_enhanced_input_action : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_action");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_context
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_enhanced_input_context : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_context");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_font
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_font : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_font");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_level
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_level : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_level");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_material
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssets_material : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_material");
			return ret;
		}

		UMaterialInterface _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetMaterialInterface(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UAssets_material_asset _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetAsset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_material_asset
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_material_asset : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_material_asset");
			return ret;
		}

		UMaterialInterface _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetMaterialInterface(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F64(relative to base address)
		UAssets_material_asset _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetAsset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_mesh
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_mesh : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_mesh");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_parameter_collection_UE5_definition
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_parameter_collection_UE5_definition : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_parameter_collection_UE5_definition");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_material
	// Inherited from UParameterCollections_parameter_collection -> UVerseParameterCollection -> UObject
	// Size: 0x20 (0x98 - 0x78)
	class UAssets_parameterized_material : public UParameterCollections_parameter_collection	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x78(0x8) UNKNOWN PROPERTY
		UObject* __verse_0xF2313B1F_Material; // 0x80(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x88(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_material");
			return ret;
		}

		UMaterialInterface _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetMaterialInterface(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D378F6C(relative to base address)
		UAssets_material_asset _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetAsset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_parameter_collection
	// Inherited from UParameterCollections_parameter_collection -> UVerseParameterCollection -> UObject
	// Size: 0x70 (0xE8 - 0x78)
	class UAssets_parameterized_parameter_collection : public UParameterCollections_parameter_collection	
	{
	public:
		UAssets_parameter_collection_UE5_definition* __verse_0x83A1751E_UE5Class; // 0x78(0x8)
		unsigned char UnknownData00_7[0x68]; // 0x80(0x68) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_parameter_collection");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_particle_system
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_particle_system : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_particle_system");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_skeletal_mesh
	// Inherited from UAssets_mesh -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_skeletal_mesh : public UAssets_mesh	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_skeletal_mesh");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_sound
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_sound : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_sound");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_texture_base
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_texture_base : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_texture_base");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_texture
	// Inherited from UAssets_texture_base -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_texture : public UAssets_texture_base	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_texture");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VersePrint/_Verse/VNI/VersePrint._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Rootdup_8 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VersePrint/_Verse/VNI/VersePrint._Root");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_N_RPrint_L_N_Kchar_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable, Memory Exec: 0x7FF74D109FC0(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_N_RPrint_L_Nmessage_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_R(Ftuple_Lmessage_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable, Memory Exec: 0x7FF74D109FC8(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Curves_editable_curve
	// Inherited from UCurveFloat -> UCurveBase -> UObject
	// Size: 0x0 (0xB8 - 0xB8)
	class UCurves_editable_curve : public UCurveFloat	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Curves_editable_curve");
			return ret;
		}

		double _L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D11E3C4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics
	// Inherited from UObject
	// Size: 0x38 (0x60 - 0x28)
	class UDiagnostics : public UObject	
	{
	public:
		FColors_color __verse_0x57D963B0_DefaultDebugDrawColor; // 0x28(0x18)
		Diagnostics_debug_draw_duration_policy __verse_0xBB769F64_DefaultDebugDrawDurationPolicy; // 0x40(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x41(0x7) UNKNOWN PROPERTY
		double __verse_0x455A65A8_DefaultDebugDrawDuration; // 0x48(0x8)
		double __verse_0xD30692C9_DefaultDebugDrawSize; // 0x50(0x8)
		double __verse_0xA45DC86B_DefaultDebugDrawThickness; // 0x58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics");
			return ret;
		}

		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UDiagnostics_debug_draw : public UObject	
	{
	public:
		UClass* __verse_0xFAE6EE9E_Channel; // 0x28(0x8)
		unsigned char UnknownData00_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RShowChannel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E424(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RHideChannel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E41C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawSphere_L_Nvector3_M_N_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E414(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawPoint_L_Nvector3_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E40C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawLine_L_Nvector3_M_Nvector3_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E404(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawCylinder_L_Nvector3_M_Nvector3_M_N_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_N_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3FC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawCone_L_Nvector3_M_Nvector3_M_N_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_N_QNumSides_Nint_20_3d_20_2e_2e_2e_M_N_QAngleWidthRadians_Nfloat_20_3d_20_2e_2e_2e_M_N_QAngleHeightRadians_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QNumSides_Nint_20_3d_20_2e_2e_2e_M_QAngleWidthRadians_Nfloat_20_3d_20_2e_2e_2e_M_QAngleHeightRadians_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3F4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawCapsule_L_Nvector3_M_Nrotation_M_N_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_N_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mrotation_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3EC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawBox_L_Nvector3_M_Nrotation_M_N_QExtent_Nvector3_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mrotation_M_QExtent_Nvector3_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3E4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawArrow_L_Nvector3_M_Nvector3_M_N_QArrowSize_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QArrowSize_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3DC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RClearChannel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3CC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RClear(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E3D4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw_channel
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDiagnostics_debug_draw_channel : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw_channel");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UDiagnostics_log : public UObject	
	{
	public:
		UClass* __verse_0xFAE6EE9E_Channel; // 0x28(0x8)
		Diagnostics_log_level __verse_0x540F3253_DefaultLevel; // 0x30(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E42C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E434(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log_channel
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDiagnostics_log_channel : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log_channel");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Testing_test_reporter
	// Inherited from UObject
	// Size: 0x68 (0x90 - 0x28)
	class UTesting_test_reporter : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		Diagnostics_log_level __verse_0x540F3253_DefaultLevel; // 0x38(0x1)
		unsigned char UnknownData01_7[0x57]; // 0x39(0x57) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Testing_test_reporter");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E474(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestSkipped_L_N_Kchar_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E46C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestResult_L_N_Kchar_M_Ntest__result_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E464(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestPassed_L_N_Kchar_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E45C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestFailed_L_N_Kchar_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E454(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RPrintSummary_L_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E44C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RLog_L_N_Kchar_M_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D11E444(relative to base address)
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RGetSummaryStrings_L_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D11E43C(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Network
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEpicGamesRestricted_Network : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Network");
			return ret;
		}

		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEpicGamesRestricted_Spline : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline");
			return ret;
		}

		FEpicGamesRestricted_Spline_spline_query_result EpicGamesRestricted_Spline_spline_query_result$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEpicGamesRestricted_Spline_spline_query_result EpicGamesRestricted_Spline_spline_query_result$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component
	// Inherited from USplineComponentBase -> UEntityActorComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UEpicGamesRestricted_Spline_spline_component : public USplineComponentBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtTime_L_Nfloat_M_Nlogic_R(Ftuple_Lfloat_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D644424(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtDistanceAlongSpline_L_Nfloat_M_Nlogic_R(Ftuple_Lfloat_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D64441C(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetSplineLength(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D644414(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetInputKeyAtDistanceAlongSpline_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D64440C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindDistanceAlongSplineAtInputKey_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D644404(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindClosestInputKeyToWorldPosition_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6443FC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Rootdup_9 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity._Root");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eGetSimulationEntity_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6508C0(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.Component
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UComponent : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		UEntity* __verse_0xECA943DB_Entity; // 0x30(0x8)
		Utick_events* __verse_0x0381BCE3_TickEvents; // 0x28(0x8)
		unsigned char UnknownData01_7[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.Component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RSetTickEvents_L_Naccessor_M_Ntick__events_R(Ftuple_Laccessor_Mtick__events_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650868(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		UConcurrency_task OnSimulate(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FCC7A8(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650848(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FCC7B0(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7495685EC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsSimulating(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650840(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650838(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650830(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsDisposed(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650828(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		Utick_events _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RGetTickEvents_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650820(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6508C8(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.Entity
	// Inherited from UBaseEntity -> UObject
	// Size: 0x18 (0x60 - 0x48)
	class UEntity : public UBaseEntity	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x48(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.Entity");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RRemoveFromParent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6508A0(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RIsDisposed(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650898(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetParent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650890(relative to base address)
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetEntities(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650888(relative to base address)
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetComponents_L_NComponentType_20where_20ComponentType_R(UClass* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D650880(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6508D0(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAddEntities_L_N_Kentity_R(TArray<UEntity*> __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650878(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAddComponents_L_N_Kcomponent_R(TArray<UComponent*> __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650870(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.entity_prefab
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class Uentity_prefab : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.entity_prefab");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.replication_component
	// Inherited from UComponent -> UObject
	// Size: 0x28 (0x70 - 0x48)
	class Ureplication_component : public UComponent	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x48(0x20) UNKNOWN PROPERTY
		bool __verse_0xC6DF029C_AlwaysRelevant : 1; // 0x68:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x69(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.replication_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FD26B4(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.simulation_entity
	// Inherited from UEntity -> UBaseEntity -> UObject
	// Size: 0x0 (0x60 - 0x60)
	class Usimulation_entity : public UEntity	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.simulation_entity");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.task_component$OnSimulate
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x9 (0xC1 - 0xB8)
	class Utask_component$OnSimulate : public UConcurrency_task	
	{
	public:
		UComponent* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.task_component$OnSimulate");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.tick_events
	// Inherited from UObject
	// Size: 0x30 (0x58 - 0x28)
	class Utick_events : public UObject	
	{
	public:
		Uexecution_subscribable* __verse_0x8A2FD5A2_PrePhysics; // 0x28(0x8)
		Uexecution_subscribable* __verse_0x64E0C2D3_StartPhysics; // 0x30(0x8)
		Uexecution_subscribable* __verse_0x2CC1E195_DuringPhysics; // 0x38(0x8)
		Uexecution_subscribable* __verse_0xA3739C71_EndPhysics; // 0x40(0x8)
		Uexecution_subscribable* __verse_0xF70848B2_PostPhysics; // 0x48(0x8)
		Uexecution_subscribable* __verse_0xDA501C13_EndFrame; // 0x50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.tick_events");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.transform_component
	// Inherited from UComponent -> UObject
	// Size: 0xD8 (0x120 - 0x48)
	class Utransform_component : public UComponent	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x48(0x8) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x61C3007D_Transform; // 0x50(0x60)
		FSpatialMath_transform __verse_0xEA0A1CBC_InitialRelativeTransform; // 0xB0(0x60)
		unsigned char UnknownData01_7[0x10]; // 0x110(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.transform_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_RSetTransform_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6508B8(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_ROnRep__Transform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6508B0(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_RGetTransform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6508A8(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Entity.typed_element_component
	// Inherited from UComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class Utyped_element_component : public UComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.typed_element_component");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_10 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component
	// Inherited from UComponent -> UObject
	// Size: 0x208 (0x250 - 0x48)
	class UEntityTestSuite_lambda_test_component : public UComponent	
	{
	public:
		UVerse_event* __verse_0x657D7B30_NopEvent; // 0x48(0x8)
		unsigned char UnknownData00_7[0x200]; // 0x50(0x200) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7504E3580(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateCancelledInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA864(relative to base address)
		UConcurrency_task OnSimulate(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650848(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA614(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component
	// Inherited from UComponent -> UObject
	// Size: 0x208 (0x250 - 0x48)
	class UEntityTestSuite_lambda_test_componentdup_11 : public UComponent	
	{
	public:
		UVerse_event* __verse_0x657D7B30_NopEvent; // 0x48(0x8)
		unsigned char UnknownData00_7[0x200]; // 0x50(0x200) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7504E3580(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateCancelledInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA864(relative to base address)
		UConcurrency_task OnSimulate(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650848(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA614(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_test_component
	// Inherited from UComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UEntityTestSuite_test_component : public UComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_test_component");
			return ret;
		}

		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component$OnSimulate
	// Inherited from UConcurrency_task -> UObject
	// Size: 0xD9 (0x191 - 0xB8)
	class Utask_EntityTestSuite_lambda_test_component$OnSimulate : public UConcurrency_task	
	{
	public:
		UEntityTestSuite_lambda_test_component* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0xC1(0x1)
		unsigned char UnknownData00_6[0x16]; // 0xC2(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0xD8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY
		UVerse_event* __verse_0x00000000_; // 0xE0(0x8)
		UConcurrency_task* _AsyncTask; // 0xE8(0x8)
		unsigned char UnknownData02_6[0x10]; // 0xF0(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x100(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x101(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x108(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x110(0x1)
		unsigned char UnknownData04_6[0x17]; // 0x111(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x128(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0x129(0x1)
		unsigned char UnknownData05_6[0x16]; // 0x12A(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x140(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x141(0x7) UNKNOWN PROPERTY
		UVerse_event* __verse_0x00000000_; // 0x148(0x8)
		UConcurrency_task* _AsyncTask; // 0x150(0x8)
		unsigned char UnknownData07_6[0x10]; // 0x158(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x168(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x169(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x170(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x178(0x1)
		unsigned char UnknownData09_6[0x17]; // 0x179(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x190(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component$OnSimulate");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component_2$OnSimulate
	// Inherited from UConcurrency_task -> UObject
	// Size: 0xD9 (0x191 - 0xB8)
	class Utask_EntityTestSuite_lambda_test_component_2$OnSimulate : public UConcurrency_task	
	{
	public:
		UEntityTestSuite_lambda_test_component* _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0xC1(0x1)
		unsigned char UnknownData00_6[0x16]; // 0xC2(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0xD8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY
		UVerse_event* __verse_0x00000000_; // 0xE0(0x8)
		UConcurrency_task* _AsyncTask; // 0xE8(0x8)
		unsigned char UnknownData02_6[0x10]; // 0xF0(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x100(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x101(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x108(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x110(0x1)
		unsigned char UnknownData04_6[0x17]; // 0x111(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x128(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0x129(0x1)
		unsigned char UnknownData05_6[0x16]; // 0x12A(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x140(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x141(0x7) UNKNOWN PROPERTY
		UVerse_event* __verse_0x00000000_; // 0x148(0x8)
		UConcurrency_task* _AsyncTask; // 0x150(0x8)
		unsigned char UnknownData07_6[0x10]; // 0x158(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x168(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x169(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x170(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x178(0x1)
		unsigned char UnknownData09_6[0x17]; // 0x179(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x190(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component_2$OnSimulate");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/ExecutionTestSuite.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_12 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/ExecutionTestSuite.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phase_user
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UExecutionTestSuite_test_phase_user : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		int64_t __verse_0xC0B43457_Counter; // 0x38(0x8)
		double __verse_0x742B3E02_Time; // 0x40(0x8)
		Uexecution_subscription* __verse_0x9327ADAA_Connection2; // 0x30(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x38(0x10) UNKNOWN PROPERTY
		int64_t __verse_0x5C605981_Counter2; // 0x48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phase_user");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R(UExecutionTestSuite_test_phase_user* __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R(UExecutionTestSuite_test_phase_user* __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime0_L_Nany_R_Nvoid(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_R(Uexecution_subscribable* __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7504E38A8(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phases
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UExecutionTestSuite_test_phases : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x28(0x18) UNKNOWN PROPERTY
		int64_t __verse_0xC0B43457_Counter; // 0x40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phases");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulationdup_13 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation");
			return ret;
		}

		UConcurrency_task Sleep_L_Nfloat_R(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		USimulation_localizable_agent _L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R(USimulation_agent* __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695480(relative to base address)
		USimulation_session _L_2fVerse_2eorg_2fSimulation_N_RGetSession(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695478(relative to base address)
		void _L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695470(relative to base address)
		void _L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R(Ftuple_Lint_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695460(relative to base address)
		void _L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R(Ftuple_Lplayer__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695468(relative to base address)
		void _L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R(Ftuple_Lplayer__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695458(relative to base address)
		void _L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R(Ftuple_Lint_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695450(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_agent
	// Inherited from UVerseAgent -> UVersePersistentVarWeakMapKey -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class USimulation_agent : public UVerseAgent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_agent");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_localizable_agent
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class USimulation_localizable_agent : public UVerse_localizable_value	
	{
	public:
		USimulation_agent* __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_localizable_agent");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player
	// Inherited from USimulation_agent -> UVerseAgent -> UVersePersistentVarWeakMapKey -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class USimulation_player : public USimulation_agent	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player");
			return ret;
		}

		void _L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695438(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_array_helper
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulation_player_array_helper : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_array_helper");
			return ret;
		}

		int64_t _L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695440(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_component
	// Inherited from UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0xD0 - 0xD0)
	class USimulation_player_component : public UEntityActorPlayerComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_component");
			return ret;
		}

		USimulation_player _L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D695448(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_multicast_delegate
	// Inherited from UVerseEngine_multicast_delegate -> UVerseEngine_multicast_delegate_base -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class USimulation_player_multicast_delegate : public UVerseEngine_multicast_delegate	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_multicast_delegate");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_session
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulation_session : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_session");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_team
	// Inherited from UVerseTeam -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulation_team : public UVerseTeam	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_team");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.task_Simulation$Sleep_L_Nfloat_R
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x8 (0xC0 - 0xB8)
	class Utask_Simulation$Sleep_L_Nfloat_R : public UConcurrency_task	
	{
	public:
		double __verse_0xB2CDDD72_Argument; // 0xB8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.task_Simulation$Sleep_L_Nfloat_R");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF74D695430(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_14 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UUI : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI");
			return ret;
		}

		FUI_canvas_slot _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_N_QSize_Nvector2_20_3d_20_2e_2e_2e_M_N_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_N_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R(Ftuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6B34(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R(USimulation_player* __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6B2C(relative to base address)
		FUI_stack_box_slot UI_stack_box_slot$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_stack_box_slot UI_stack_box_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_overlay_slot UI_overlay_slot$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_overlay_slot UI_overlay_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_canvas_slot UI_canvas_slot$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_canvas_slot UI_canvas_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_button_slot UI_button_slot$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_button_slot UI_button_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_margin UI_margin$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_margin UI_margin$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_anchors UI_anchors$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_anchors UI_anchors$Factory(); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_widget_message UI_widget_message$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_widget_message UI_widget_message$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_player_ui_slot UI_player_ui_slot$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUI_player_ui_slot UI_player_ui_slot$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_player_ui
	// Inherited from UVersePlayerUIEntityComponent -> UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0xD8 - 0xD8)
	class UUI_player_ui : public UVersePlayerUIEntityComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_player_ui");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R(UUI_widget* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A3C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R(UUI_widget* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A34(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R(Ftuple_Lwidget_Mplayer__ui__slot_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A2C(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_umg_widget_class_asset
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UUI_umg_widget_class_asset : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_umg_widget_class_asset");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_widget
	// Inherited from UVerseWidgetNativeBase -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UUI_widget : public UVerseWidgetNativeBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_widget");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R(UI_widget_visibility __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6B24(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R(bool __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6B1C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6B14(relative to base address)
		UI_widget_visibility _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6B0C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6B04(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6AFC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_button
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x38 (0x70 - 0x38)
	class UUI_button : public UUI_widget	
	{
	public:
		FUI_button_slot __verse_0x9693E4CD_Slot; // 0x38(0x30)
		UVerseEngine_subscribable_event* __verse_0x6B2BB37E_OnClickInternal; // 0x68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_button");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_RSetWidget_L_Nbutton__slot_R(FUI_button_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A69AC(relative to base address)
		UObject _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_ROnClick(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_canvas
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x10 (0x48 - 0x38)
	class UUI_canvas : public UUI_widget	
	{
	public:
		TArray<FUI_canvas_slot> __verse_0x5AE077E0_Slots; // 0x38(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_canvas");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R(UUI_widget* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A69BC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R(FUI_canvas_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A69B4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_color_block
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x30 (0x68 - 0x38)
	class UUI_color_block : public UUI_widget	
	{
	public:
		FColors_color __verse_0xA0FC371C_DefaultColor; // 0x38(0x18)
		double __verse_0x5DA10C15_DefaultOpacity; // 0x50(0x8)
		FSpatialMath_vector2 __verse_0x4DD253BC_DefaultDesiredSize; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_color_block");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A69EC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetDesiredSize_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A69E4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A69DC(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetOpacity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69D4(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetDesiredSize(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69CC(relative to base address)
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetColor(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69C4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_material_block
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x30 (0x68 - 0x38)
	class UUI_material_block : public UUI_widget	
	{
	public:
		UObject* __verse_0x800C064C_DefaultImage; // 0x38(0x8)
		FColors_color __verse_0xC0C585F9_DefaultTint; // 0x40(0x18)
		FSpatialMath_vector2 __verse_0x4DD253BC_DefaultDesiredSize; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_material_block");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A14(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R(UObject* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A0C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A04(relative to base address)
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69C4(relative to base address)
		UObject _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69FC(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69F4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_overlay
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x10 (0x48 - 0x38)
	class UUI_overlay : public UUI_widget	
	{
	public:
		TArray<FUI_overlay_slot> __verse_0x5AE077E0_Slots; // 0x38(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_overlay");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RRemoveWidget_L_Nwidget_R(UUI_widget* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A24(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RAddWidget_L_Noverlay__slot_R(FUI_overlay_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A1C(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_stack_box
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x18 (0x50 - 0x38)
	class UUI_stack_box : public UUI_widget	
	{
	public:
		TArray<FUI_stack_box_slot> __verse_0x5AE077E0_Slots; // 0x38(0x10)
		UI_orientation __verse_0x4DFAB8C8_Orientation; // 0x48(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_stack_box");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RRemoveWidget_L_Nwidget_R(UUI_widget* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A4C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RAddWidget_L_Nstack__box__slot_R(FUI_stack_box_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A44(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_text_base
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x30 (0x68 - 0x38)
	class UUI_text_base : public UUI_widget	
	{
	public:
		UVerse_message* __verse_0xEDB05B46_DefaultText; // 0x38(0x8)
		FColors_color __verse_0x5DC97209_DefaultTextColor; // 0x40(0x18)
		double __verse_0x1EA9AC7C_DefaultTextOpacity; // 0x58(0x8)
		UI_text_justification __verse_0x616A37A2_DefaultJustification; // 0x60(0x1)
		UI_text_overflow_policy __verse_0x5C09BE1D_DefaultOverflowPolicy; // 0x61(0x1)
		unsigned char UnknownData00_7[0x6]; // 0x62(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_text_base");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A94(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A8C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetText_L_Nmessage_R(UVerse_message* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A9C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetOverflowPolicy_L_Ntext__overflow__policy_R(UI_text_overflow_policy __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A84(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetJustification_L_Ntext__justification_R(UI_text_justification __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A7C(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextOpacity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6A6C(relative to base address)
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextColor(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6A64(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetText(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6A74(relative to base address)
		UI_text_overflow_policy _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetOverflowPolicy(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6A5C(relative to base address)
		UI_text_justification _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetJustification(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6A54(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal
	// Inherited from UUI_text_base -> UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class UUI_text_block_internal : public UUI_text_base	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_texture_block
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x38 (0x70 - 0x38)
	class UUI_texture_block : public UUI_widget	
	{
	public:
		UAssets_texture* __verse_0x800C064C_DefaultImage; // 0x38(0x8)
		FColors_color __verse_0xC0C585F9_DefaultTint; // 0x40(0x18)
		FSpatialMath_vector2 __verse_0x4DD253BC_DefaultDesiredSize; // 0x58(0x10)
		UI_image_tiling __verse_0xAF9B7624_DefaultHorizontalTiling; // 0x68(0x1)
		UI_image_tiling __verse_0xF679588B_DefaultVerticalTiling; // 0x69(0x1)
		unsigned char UnknownData00_7[0x6]; // 0x6A(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_texture_block");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTint_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A14(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTiling_L_Nimage__tiling_M_Nimage__tiling_R(Ftuple_Limage__tiling_Mimage__tiling_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6AB4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetImage_L_Ntexture_R(UAssets_texture* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6AAC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetDesiredSize_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6A04(relative to base address)
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTint(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69C4(relative to base address)
		Ftuple_Limage__tiling_Mimage__tiling_R _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTiling(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6AA4(relative to base address)
		UAssets_texture _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetImage(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69FC(relative to base address)
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetDesiredSize(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A69F4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_umg_widget
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x8 (0x40 - 0x38)
	class UUI_umg_widget : public UUI_widget	
	{
	public:
		UUI_umg_widget_class_asset* __verse_0x26CD6686_Asset; // 0x38(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_umg_widget");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetViewmodel___L_NViewmodelType_M_N_Kchar_M_NViewmodelType_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_Many_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6AF4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetViewmodelOptional___L_NViewmodelType_M_N_Kchar_M_NViewmodelType_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_Many_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6AEC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetNamedSlot___L_N_Kchar_M_Nwidget_R(Ftuple_L_Kchar_Mwidget_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6AE4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetNamedSlotOptional___L_N_Kchar_M_N_Qwidget_R(Ftuple_L_Kchar_M_Qwidget_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6A6ADC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetViewmodel___L_NViewmodelType_M_N_Kchar_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6AD4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetViewmodelOptional___L_NViewmodelType_M_N_Kchar_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6ACC(relative to base address)
		UUI_widget _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetNamedSlot___L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6AC4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetNamedSlotOptional___L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6A6ABC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_15 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/Component._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Rootdup_16 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component._Root");
			return ret;
		}

		Ffloat_range float_range$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		Ffloat_range float_range$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		Fhit_result hit_result$OverrideFactory(TMap<__verse_0xFB48ED96_$InitOverrideMap, bool> __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		Fhit_result hit_result$Factory(); // Flags: Static|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.basic_camera_component
	// Inherited from UComponent -> UObject
	// Size: 0x28 (0x70 - 0x48)
	class Ubasic_camera_component : public UComponent	
	{
	public:
		double __verse_0xE317D65E_FieldOfView; // 0x48(0x8)
		unsigned char UnknownData00_7[0x20]; // 0x50(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.basic_camera_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RUpdateFieldOfView(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA604(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RSetFieldOfView_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_ROnRep__FieldOfView(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RGetFieldOfView(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.damageable_component
	// Inherited from UComponent -> UObject
	// Size: 0x20 (0x68 - 0x48)
	class Udamageable_component : public UComponent	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x48(0x18) UNKNOWN PROPERTY
		UObject* __verse_0x2DEDA279_DamagedEvent; // 0x60(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.damageable_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdamageable__component_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA61C(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.light_component
	// Inherited from UComponent -> UObject
	// Size: 0x70 (0xB8 - 0x48)
	class Ulight_component : public UComponent	
	{
	public:
		bool __verse_0x370AFB5F_CastShadows : 1; // 0x48:0(0x1)
		unsigned char UnknownBit00 : 1; // 0x48:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit01 : 1; // 0x48:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit02 : 1; // 0x48:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit03 : 1; // 0x48:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x48:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0x48:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x48:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x8E6057EF_CastVolumetricShadow : 1; // 0x49:0(0x1)
		unsigned char UnknownBit07 : 1; // 0x49:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x49:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x49:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x49:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x49:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0x49:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit13 : 1; // 0x49:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x1635313F_CastDeepShadows : 1; // 0x4A:0(0x1)
		unsigned char UnknownBit14 : 1; // 0x4A:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0x4A:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x4A:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x4A:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x4A:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit19 : 1; // 0x4A:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit20 : 1; // 0x4A:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x41208E8E_AffectReflection : 1; // 0x4B:0(0x1)
		unsigned char UnknownBit21 : 1; // 0x4B:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit22 : 1; // 0x4B:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit23 : 1; // 0x4B:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit24 : 1; // 0x4B:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit25 : 1; // 0x4B:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit26 : 1; // 0x4B:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit27 : 1; // 0x4B:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xF603D50E_AffectGlobalIllumination : 1; // 0x4C:0(0x1)
		unsigned char UnknownData28_5[0x3]; // 0x4D(0x3) UNKNOWN PROPERTY
		double __verse_0x06B3E864_Intensity; // 0x50(0x8)
		FColors_color __verse_0x65678AC7_Color; // 0x58(0x18)
		bool __verse_0x00FBC2A9__CastShadows : 1; // 0x70:0(0x1)
		unsigned char UnknownBit29 : 1; // 0x70:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit30 : 1; // 0x70:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit31 : 1; // 0x70:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit32 : 1; // 0x70:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit33 : 1; // 0x70:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit34 : 1; // 0x70:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit35 : 1; // 0x70:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xA19307B9__CastVolumetricShadow : 1; // 0x71:0(0x1)
		unsigned char UnknownBit36 : 1; // 0x71:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit37 : 1; // 0x71:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit38 : 1; // 0x71:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit39 : 1; // 0x71:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit40 : 1; // 0x71:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit41 : 1; // 0x71:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit42 : 1; // 0x71:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xC5440B7D__CastDeepShadows : 1; // 0x72:0(0x1)
		unsigned char UnknownBit43 : 1; // 0x72:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit44 : 1; // 0x72:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit45 : 1; // 0x72:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit46 : 1; // 0x72:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit47 : 1; // 0x72:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit48 : 1; // 0x72:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit49 : 1; // 0x72:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x94CA2752__AffectReflection : 1; // 0x73:0(0x1)
		unsigned char UnknownBit50 : 1; // 0x73:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit51 : 1; // 0x73:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit52 : 1; // 0x73:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit53 : 1; // 0x73:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit54 : 1; // 0x73:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit55 : 1; // 0x73:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit56 : 1; // 0x73:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xEE7CC240__AffectGlobalIllumination : 1; // 0x74:0(0x1)
		unsigned char UnknownData57_5[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		double __verse_0x4E4E65F6__Intensity; // 0x78(0x8)
		FColors_color __verse_0x89B83CD1__Color; // 0x80(0x18)
		unsigned char UnknownData58_7[0x20]; // 0x98(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6DC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_Ncolor_R(Ftuple_Laccessor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6D4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_N_Kchar_M_Nfloat_R(Ftuple_Laccessor_M_Kchar_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6CC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6C4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6BC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6B4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6AC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Intensity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6A4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Color(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA69C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastVolumetricShadow(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA694(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastShadows(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA68C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastDeepShadows(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA684(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectReflection(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA67C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectGlobalIllumination(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA674(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA66C(relative to base address)
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA664(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_M_N_Kchar_R(Ftuple_Laccessor_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA65C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA654(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA64C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA644(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA63C(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.directional_light_component
	// Inherited from Ulight_component -> UComponent -> UObject
	// Size: 0x10 (0xC8 - 0xB8)
	class Udirectional_light_component : public Ulight_component	
	{
	public:
		double __verse_0x7D2E69E8_ShadowOpacity; // 0xB8(0x8)
		double __verse_0xECB66941__ShadowOpacity; // 0xC0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.directional_light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RSetShadowOpacity_L_Naccessor_M_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(Ftuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA634(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_ROnRep____ShadowOpacity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA62C(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RGetShadowOpacity_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA624(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.local_hud_component
	// Inherited from UComponent -> UObject
	// Size: 0x28 (0x70 - 0x48)
	class Ulocal_hud_component : public UComponent	
	{
	public:
		UUI_canvas* __verse_0x89A21F20_Canvas; // 0x48(0x8)
		FUI_player_ui_slot __verse_0xF1214EFE_UISlot; // 0x50(0x10)
		TArray<USimulation_player*> __verse_0x76952CF9_ShowingPlayerUI; // 0x60(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.local_hud_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RShow_L_Nplayer_R(USimulation_player* __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R(USimulation_player* __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.mesh_component
	// Inherited from UComponent -> UObject
	// Size: 0x88 (0xD0 - 0x48)
	class Umesh_component : public UComponent	
	{
	public:
		UAssets_mesh* __verse_0x71AD33A7_Mesh; // 0x48(0x8)
		unsigned char UnknownData00_6[0x50]; // 0x50(0x50) UNKNOWN PROPERTY
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0xA0:0(0x1)
		unsigned char UnknownBit01 : 1; // 0xA0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit02 : 1; // 0xA0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit03 : 1; // 0xA0:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0xA0:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0xA0:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0xA0:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0xA0:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x5CDFC2A5_Enabled : 1; // 0xA1:0(0x1)
		unsigned char UnknownData08_7[0x2E]; // 0xA2(0x2E) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.mesh_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Mesh(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6F4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Material(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6EC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Enabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA6E4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA90C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8EC(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8CC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.parent_constraint_component
	// Inherited from UComponent -> UObject
	// Size: 0xD8 (0x120 - 0x48)
	class Uparent_constraint_component : public UComponent	
	{
	public:
		bool __verse_0x1AEA3A6F_AutoAttachToOwner : 1; // 0x48:0(0x1)
		unsigned char UnknownData00_7[0xD7]; // 0x49(0xD7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.parent_constraint_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA724(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RSetRelativeTransform_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA72C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RGetRelativeTransform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA71C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RGetAttachedTransform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA714(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RDetachFrom(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA70C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RAttachTo_L_Nentity_R(UEntity* __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA704(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RAttachTo_L_Nentity_M_Ntransform_R(Ftuple_Lentity_Mtransform_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA6FC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.particle_system_component
	// Inherited from UComponent -> UObject
	// Size: 0xD8 (0x120 - 0x48)
	class Uparticle_system_component : public UComponent	
	{
	public:
		unsigned char UnknownData00_3[0x28]; // 0x48(0x28) UNKNOWN PROPERTY
		bool __verse_0xC40E3E14_AutoEnable : 1; // 0x70:0(0x1)
		UAssets_particle_system* __verse_0x1CB585BF_ParticleSystem; // 0x48(0x8)
		unsigned char UnknownData01_6[0x28]; // 0x50(0x28) UNKNOWN PROPERTY
		int64_t __verse_0xB6DCA931_EnableCounter; // 0x78(0x8)
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0x80:0(0x1)
		unsigned char UnknownBit02 : 1; // 0x80:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit03 : 1; // 0x80:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x80:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0x80:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x80:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x80:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x80:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x3B072BB9_PreviewInEditor : 1; // 0x81:0(0x1)
		unsigned char UnknownData09_5[0x6]; // 0x82(0x6) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0x68030817_BeamStart; // 0x88(0x18)
		FSpatialMath_vector3 __verse_0x86F3B4EC_BeamStartTangent; // 0xA0(0x18)
		FSpatialMath_vector3 __verse_0x9C23C07D_BeamEnd; // 0xB8(0x18)
		FSpatialMath_vector3 __verse_0xBF08B3B8_BeamEndTangent; // 0xD0(0x18)
		double __verse_0x46028BF2_BeamWidth; // 0xE8(0x8)
		unsigned char UnknownData10_7[0x30]; // 0xF0(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.particle_system_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamWidth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA78C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStartTangent_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA77C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStart_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA784(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEndTangent_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA76C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEnd_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA774(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ParticleSystem(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA764(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__EnableCounter(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA75C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamWidth(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA754(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStartTangent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA744(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStart(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA74C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEndTangent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA734(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEnd(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA73C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8F4(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8D4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.physics_component
	// Inherited from UComponent -> UObject
	// Size: 0x68 (0xB0 - 0x48)
	class Uphysics_component : public UComponent	
	{
	public:
		unsigned char UnknownData00_3[0x31]; // 0x48(0x31) UNKNOWN PROPERTY
		bool __verse_0x5CDFC2A5_Enabled : 1; // 0x79:0(0x1)
		unsigned char UnknownData01_5[0x2E]; // 0x7A(0x2E) UNKNOWN PROPERTY
		UObject* __verse_0x4BFA8E15_HitEvent; // 0xA8(0x8)
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0x78:0(0x1)
		unsigned char UnknownData02_7[0x37]; // 0x79(0x37) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.physics_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__component_N_ROnRep__Enabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA794(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA914(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8FC(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8DC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.point_light_component_base
	// Inherited from Ulight_component -> UComponent -> UObject
	// Size: 0x30 (0xE8 - 0xB8)
	class Upoint_light_component_base : public Ulight_component	
	{
	public:
		double __verse_0xBAB0877B_AttenuationRadius; // 0xB8(0x8)
		double __verse_0x12542E15_SourceRadius; // 0xC0(0x8)
		double __verse_0xAA17A810_SourceLength; // 0xC8(0x8)
		double __verse_0x3835D83E__AttenuationRadius; // 0xD0(0x8)
		double __verse_0x7E578E96__SourceRadius; // 0xD8(0x8)
		double __verse_0xC6140893__SourceLength; // 0xE0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.point_light_component_base");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceRadius_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA7DC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceLength_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA7D4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetAttenuationRadius_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA7CC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____SourceRadius(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA7C4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____SourceLength(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA7BC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____AttenuationRadius(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA7B4(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceRadius_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7AC(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceLength_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7A4(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetAttenuationRadius_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA79C(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.point_light_component
	// Inherited from Upoint_light_component_base -> Ulight_component -> UComponent -> UObject
	// Size: 0x0 (0xE8 - 0xE8)
	class Upoint_light_component : public Upoint_light_component_base	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.point_light_component");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.rect_light_component
	// Inherited from Ulight_component -> UComponent -> UObject
	// Size: 0x50 (0x108 - 0xB8)
	class Urect_light_component : public Ulight_component	
	{
	public:
		double __verse_0xBAB0877B_AttenuationRadius; // 0xB8(0x8)
		double __verse_0x9F64F627_SourceWidth; // 0xC0(0x8)
		double __verse_0xC3BD8CB5_SourceHeight; // 0xC8(0x8)
		double __verse_0x23D81FBD_BarnDoorAngle; // 0xD0(0x8)
		double __verse_0xDC62E582_BarnDoorLength; // 0xD8(0x8)
		double __verse_0x3835D83E__AttenuationRadius; // 0xE0(0x8)
		double __verse_0xA895CFD1__SourceWidth; // 0xE8(0x8)
		double __verse_0xAFBE2C36__SourceHeight; // 0xF0(0x8)
		double __verse_0xB2401F14__BarnDoorAngle; // 0xF8(0x8)
		double __verse_0x191613DB__BarnDoorLength; // 0x100(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.rect_light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetSourceWidth_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA84C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetSourceHeight_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA844(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetBarnDoorLength_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA83C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetBarnDoorAngle_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA834(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetAttenuationRadius_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA82C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____SourceWidth(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA824(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____SourceHeight(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA81C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____BarnDoorLength(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA814(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____BarnDoorAngle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA80C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____AttenuationRadius(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA804(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetSourceWidth_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7FC(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetSourceHeight_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7F4(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetBarnDoorLength_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7EC(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetBarnDoorAngle_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7E4(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetAttenuationRadius_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7A4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.sound_component
	// Inherited from UComponent -> UObject
	// Size: 0x68 (0xB0 - 0x48)
	class Usound_component : public UComponent	
	{
	public:
		UAssets_sound* __verse_0xF013250F_Sound; // 0x48(0x8)
		unsigned char UnknownData00_6[0x20]; // 0x50(0x20) UNKNOWN PROPERTY
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0x70:0(0x1)
		unsigned char UnknownData01_5[0x7]; // 0x71(0x7) UNKNOWN PROPERTY
		int64_t __verse_0x38C2642B_StartCounter; // 0x78(0x8)
		unsigned char UnknownData02_7[0x30]; // 0x80(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.sound_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_RStop(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA86C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_RPlay(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA864(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650860(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_ROnRep__StartCounter(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA85C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_ROnRep__Sound(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA854(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.spot_light_component
	// Inherited from Upoint_light_component_base -> Ulight_component -> UComponent -> UObject
	// Size: 0x20 (0x108 - 0xE8)
	class Uspot_light_component : public Upoint_light_component_base	
	{
	public:
		double __verse_0x5C223359_InnerConeAngle; // 0xE8(0x8)
		double __verse_0x9D05865C_OuterConeAngle; // 0xF0(0x8)
		double __verse_0x9956C500__InnerConeAngle; // 0xF8(0x8)
		double __verse_0x58717005__OuterConeAngle; // 0x100(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.spot_light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RSetOuterConeAngle_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA88C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RSetInnerConeAngle_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA884(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_ROnRep____OuterConeAngle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA87C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_ROnRep____InnerConeAngle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA874(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RGetOuterConeAngle_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7EC(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RGetInnerConeAngle_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA7E4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/Component.text_display_component
	// Inherited from UComponent -> UObject
	// Size: 0x78 (0xC0 - 0x48)
	class Utext_display_component : public UComponent	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x48(0x20) UNKNOWN PROPERTY
		bool __verse_0x5CDFC2A5_Enabled : 1; // 0x68:0(0x1)
		unsigned char UnknownData01_5[0x17]; // 0x69(0x17) UNKNOWN PROPERTY
		UAssets_font* __verse_0x70A2AEEA_Font; // 0x80(0x8)
		FColors_color __verse_0x65678AC7_Color; // 0x88(0x18)
		Ffloat_range __verse_0x515E2844_VisibleDistance; // 0xA0(0x10)
		double __verse_0xE725FDA9_FadeInTime; // 0xB0(0x8)
		double __verse_0x85320394_FadeOutTime; // 0xB8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.text_display_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__VisibleDistance(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8C4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Text(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8BC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Font(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8B4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__FadeOutTime(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8AC(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__FadeInTime(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8A4(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Enabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA89C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Color(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA894(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650858(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650850(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D650848(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA614(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA60C(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74D6BA91C(relative to base address)
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA904(relative to base address)
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D6BA8E4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EntityFramework/_Verse/VNI/EntityLevel.level_entity
	// Inherited from UEntity -> UBaseEntity -> UObject
	// Size: 0x0 (0x60 - 0x60)
	class Ulevel_entity : public UEntity	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityLevel.level_entity");
			return ret;
		}

		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_17 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesEngine.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.EpicGames_Input_verse_ue_input_component
	// Inherited from UVerseUEInputComponentBase -> UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x108 (0x548 - 0x440)
	class UEpicGames_Input_verse_ue_input_component : public UVerseUEInputComponentBase	
	{
	public:
		unsigned char UnknownData00_1[0x108]; // 0x440(0x108) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesEngine.EpicGames_Input_verse_ue_input_component");
			return ret;
		}

		UConcurrency_task WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R(UConcurrency_task* __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E9994(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R(Ftuple_L_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E998C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R(Ftuple_L_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E9984(relative to base address)
		double _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7503E997C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E9974(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E996C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E9964(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E995C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R(Ftuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E9954(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E994C(relative to base address)
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(Ftuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503E9944(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.task_EpicGames_Input_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x28 (0xE0 - 0xB8)
	class Utask_EpicGames_Input_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R : public UConcurrency_task	
	{
	public:
		UEpicGames_Input_verse_ue_input_component* _Self; // 0xB8(0x8)
		Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument; // 0xC0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesEngine.task_EpicGames_Input_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms, Memory Exec: 0x7FF7503E993C(relative to base address)
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssetsdup_18 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets");
			return ret;
		}

		UObject _L_2fUnrealEngine_2ecom_2fAssets_N_RSpawnParticleSystem_L_Nparticle__system_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7503ECFB4(relative to base address)
		UObject _L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySoundAtLocation_L_Nsound_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lsound_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7503ECFA4(relative to base address)
		UObject _L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySound_L_Nsound_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lsound_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7503ECFAC(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_play_sound_subscription
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAssets_play_sound_subscription : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_play_sound_subscription");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503ECFBC(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_spawn_particle_system_subscription
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAssets_spawn_particle_system_subscription : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_spawn_particle_system_subscription");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF7503ECFC4(relative to base address)
		void $InitInstance(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $Block(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void $InitCDO(); // Flags: None, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /VerseExperimental/_Verse/VNI/VerseExperimental.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_19 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseExperimental/_Verse/VNI/VerseExperimental.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseExperimental : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental");
			return ret;
		}

		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2f_U_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Nfloat_M_Ntime__span_R(Ftuple_Lfloat_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool _L_2fVerse_2eorg_2fVerseExperimental_N_RValidateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E38(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RValidate_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RUtcNow(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E30(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E28(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E20(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E18(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E08(relative to base address)
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E10(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeNegate_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469E00(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeMultiply_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469DF8(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeDivide_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469DF0(relative to base address)
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469DE8(relative to base address)
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750469DE0(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
