#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Animation
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Struct /Game/Animation/Game/MainPlayer/Facial/FaceGameplay/Gameplay_FaceSystem_StateMachine_AnimBP.Gameplay_FaceSystem_StateMachine_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x164F (0x1650 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_133 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		int32_t __IntProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		int32_t __IntProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		int32_t __IntProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		int32_t __IntProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		int32_t __IntProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		int32_t __IntProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		int32_t __IntProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		int32_t __IntProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		int32_t __IntProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		int32_t __IntProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		int32_t __IntProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		int32_t __IntProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		int32_t __IntProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		int32_t __IntProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		int32_t __IntProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		int32_t __IntProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		int32_t __IntProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		FName __NameProperty; // 0xB8(0x4)
		int32_t __IntProperty; // 0xBC(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0xC0(0x18)
		bool __BoolProperty; // 0xD8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xDC(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xE0(0x2C)
		float __FloatProperty; // 0x10C(0x4)
		bool __BoolProperty; // 0x110(0x1)
		EAnimSyncMethod __EnumProperty; // 0x111(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x112(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x113(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x114(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x118(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x198(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x5A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x5D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x6F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x7B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x7E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x8D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xAB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xAE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xB10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xB40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xB70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xBA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xBD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1110(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x12C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x12F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x14A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x15C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x15F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1620(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Facial/FaceGameplay/Gameplay_FaceSystem_StateMachine_AnimBP.Gameplay_FaceSystem_StateMachine_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x13 (0x14 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_134 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
	};


	// Struct /Game/Animation/Libraries/RBANParamsStruct.RBANParamsStruct
	// Size: 0xB40 (0xB40 - 0x0)
	struct FRBANParamsStruct	
	{
	public:
		FRBANSettingStruct Skydive_GoingUp_56_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x90)
		FRBANSettingStruct Skydive_FloatingDown_57_2CBF3D3F421785F8994502931454A81F; // 0x90(0x90)
		FRBANSettingStruct Skydive_DivingDown_58_EC7BEC4D406A8A98E60D7B9374C5E457; // 0x120(0x90)
		FRBANSettingStruct Skydive_Parachuting_60_A88C4A0A407F497561D31287CB20250F; // 0x1B0(0x90)
		FRBANSettingStruct OnGround_Standing_59_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x240(0x90)
		FRBANSettingStruct OnGround_Moving_65_807A66B64D7B3B2FCF080B833B8A6254; // 0x2D0(0x90)
		FRBANSettingStruct OnGround_Crouch_Moving_61_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x360(0x90)
		FRBANSettingStruct EmoteOrMelee_62_CFCF66B5492987CBD638EC98EB34D572; // 0x3F0(0x90)
		FRBANSettingStruct Swimming_64_33CE87CE4D4F712B1384E29115845962; // 0x480(0x90)
		FRBANSettingStruct Front_End_63_C7A4562A48E9BC9B4CD34D963CFC6490; // 0x510(0x90)
		FRBANSettingStruct DBNO_68_2D70D4004D0E9B117F6CE9A09C362B74; // 0x5A0(0x90)
		FRBANSettingStruct DBNO_Carried_67_99829B99495FCFE3488A9A86B549ECE5; // 0x630(0x90)
		FRBANSettingStruct OnGround_Falling_66_CDAA0F4D476157E4137548BDCE8776F2; // 0x6C0(0x90)
		FRBANSettingStruct Ziplining_75_BCCDB7E1431A4C174F1040ABC81FD8A8; // 0x750(0x90)
		FRBANSettingStruct Skydive_Surfing_74_408E65FF484AA54111E1ED8A69D8240D; // 0x7E0(0x90)
		FRBANSettingStruct Riding_Standing_69_952A2A43408C37C44E4CBFAE3F3001B0; // 0x870(0x90)
		FRBANSettingStruct Riding_Moving_72_EE7A01794460B9753E5076A5A3B3080A; // 0x900(0x90)
		FRBANSettingStruct Riding_Moving_Targeting_73_2F57FD9E477C515D70B3DA9D75453357; // 0x990(0x90)
		FRBANSettingStruct Tactical_Sprint_70_5B2273A1499D34BDEC52E6A8E3F274D4; // 0xA20(0x90)
		FRBANSettingStruct Rail_Grinding_71_DEEB00A04DB992DF5EEB40BD6518EA4E; // 0xAB0(0x90)
	};


	// Struct /Game/Animation/Libraries/WindGustParamsStruct.WindGustParamsStruct
	// Size: 0x960 (0x960 - 0x0)
	struct FWindGustParamsStruct	
	{
	public:
		FWindGustSettingStruct Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x78)
		FWindGustSettingStruct Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F; // 0x78(0x78)
		FWindGustSettingStruct Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457; // 0xF0(0x78)
		FWindGustSettingStruct Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F; // 0x168(0x78)
		FWindGustSettingStruct OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x1E0(0x78)
		FWindGustSettingStruct OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254; // 0x258(0x78)
		FWindGustSettingStruct OnGround_Crouch_Moving_34_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x2D0(0x78)
		FWindGustSettingStruct EmoteOrMelee_35_CFCF66B5492987CBD638EC98EB34D572; // 0x348(0x78)
		FWindGustSettingStruct Swimming_36_33CE87CE4D4F712B1384E29115845962; // 0x3C0(0x78)
		FWindGustSettingStruct Front_End_37_C7A4562A48E9BC9B4CD34D963CFC6490; // 0x438(0x78)
		FWindGustSettingStruct DBNO_41_0C046BF1406AB4B752DB3A99949FE3A3; // 0x4B0(0x78)
		FWindGustSettingStruct DBNO_Carried_42_3E9FADC247359FEE88C7B4A3453449E6; // 0x528(0x78)
		FWindGustSettingStruct OnGround_Falling_46_2CC5CD2149D12B7C53D91E8D6AA90C03; // 0x5A0(0x78)
		FWindGustSettingStruct Ziplining_47_B8BBEA804F8C515EA80FE7897BB99CF6; // 0x618(0x78)
		FWindGustSettingStruct Skydive_Surfing_50_2B64886E4E6F0E8CFC180E81FDF37F62; // 0x690(0x78)
		FWindGustSettingStruct Riding_Standing_55_206A781845EAC0A66D2BBC8981041DBD; // 0x708(0x78)
		FWindGustSettingStruct Riding_Moving_56_963FD3424B0D070C81120599A5AED02A; // 0x780(0x78)
		FWindGustSettingStruct Riding_Moving_Targeting_59_93868B48485365007E3BD8BD8A527B39; // 0x7F8(0x78)
		FWindGustSettingStruct Tactical_Sprint_58_7E4BD4244308EE1199AA48ACF8871E68; // 0x870(0x78)
		FWindGustSettingStruct Rail_Grinding_62_FF88FD5F4A9AB308E2F095B9F0657D82; // 0x8E8(0x78)
	};


	// Struct /Game/Animation/Libraries/ClothParamsStruct.ClothParamsStruct
	// Size: 0x780 (0x780 - 0x0)
	struct FClothParamsStruct	
	{
	public:
		FClothSettingStruct Skydive_GoingUp_12_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x60)
		FClothSettingStruct Skydive_FloatingDown_10_2CBF3D3F421785F8994502931454A81F; // 0x60(0x60)
		FClothSettingStruct Skydive_DivingDown_11_EC7BEC4D406A8A98E60D7B9374C5E457; // 0xC0(0x60)
		FClothSettingStruct Skydive_Parachuting_13_A88C4A0A407F497561D31287CB20250F; // 0x120(0x60)
		FClothSettingStruct OnGround_Standing_15_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x180(0x60)
		FClothSettingStruct OnGround_Moving_16_807A66B64D7B3B2FCF080B833B8A6254; // 0x1E0(0x60)
		FClothSettingStruct OnGround_Crouch_Moving_27_CE0B8BFB4E3417C0F790F7AE38DD7735; // 0x240(0x60)
		FClothSettingStruct EmoteOrMelee_25_CFCF66B5492987CBD638EC98EB34D572; // 0x2A0(0x60)
		FClothSettingStruct Swimming_3_33CE87CE4D4F712B1384E29115845962; // 0x300(0x60)
		FClothSettingStruct Front_End_20_C7A4562A48E9BC9B4CD34D963CFC6490; // 0x360(0x60)
		FClothSettingStruct DBNO_30_2D70D4004D0E9B117F6CE9A09C362B74; // 0x3C0(0x60)
		FClothSettingStruct DBNO_Carried_32_99829B99495FCFE3488A9A86B549ECE5; // 0x420(0x60)
		FClothSettingStruct OnGround_Falling_36_CDAA0F4D476157E4137548BDCE8776F2; // 0x480(0x60)
		FClothSettingStruct Ziplining_39_BCCDB7E1431A4C174F1040ABC81FD8A8; // 0x4E0(0x60)
		FClothSettingStruct Skydive_Surfing_42_408E65FF484AA54111E1ED8A69D8240D; // 0x540(0x60)
		FClothSettingStruct Riding_Standing_46_952A2A43408C37C44E4CBFAE3F3001B0; // 0x5A0(0x60)
		FClothSettingStruct Riding_Moving_47_EE7A01794460B9753E5076A5A3B3080A; // 0x600(0x60)
		FClothSettingStruct Riding_Moving_Targeting_52_2F57FD9E477C515D70B3DA9D75453357; // 0x660(0x60)
		FClothSettingStruct Tactical_Sprint_51_5B2273A1499D34BDEC52E6A8E3F274D4; // 0x6C0(0x60)
		FClothSettingStruct Rail_Grinding_55_DEEB00A04DB992DF5EEB40BD6518EA4E; // 0x720(0x60)
	};


	// Struct /Game/Animation/Libraries/RBANSettingStruct.RBANSettingStruct
	// Size: 0x90 (0x90 - 0x0)
	struct FRBANSettingStruct	
	{
	public:
		FVector ComponentLinearAccScale_28_9CBE863E417FC965C07809A2FE55ADFD; // 0x0(0x18)
		FVector ComponentLinearVelScale_31_6A3DFE4A481AD4D7CB18D79F95CC88E8; // 0x18(0x18)
		FSimSpaceSettings SimSpaceSettings_34_FE68F666411FF9F29BA84CB4BE726A52; // 0x30(0x60)
	};


	// Struct /Game/Animation/Libraries/ClothSettingStruct.ClothSettingStruct
	// Size: 0x5C (0x5C - 0x0)
	struct FClothSettingStruct	
	{
	public:
		FVector LinearVelocityScale_7_9CBE863E417FC965C07809A2FE55ADFD; // 0x0(0x18)
		float AngularVelocityScale_6_6A3DFE4A481AD4D7CB18D79F95CC88E8; // 0x18(0x4)
		float FictitiousAngularScale_10_C5F4D16F48D0BEDC3F0FA38B2648511B; // 0x1C(0x4)
		FVector GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E; // 0x20(0x18)
		FVector2D DragCoefficient_23_FE68F666411FF9F29BA84CB4BE726A52; // 0x38(0x10)
		FVector2D LiftCoefficient_24_BB285D994A5B3AFF167F4793D7ECA837; // 0x48(0x10)
		FName JointName_27_C74F3B2245EA319DE82A629FF3C17CCA; // 0x58(0x4)
	};


	// Struct /Game/Animation/Libraries/WindGustLocalSettingStruct.WindGustLocalSettingStruct
	// Size: 0x14 (0x14 - 0x0)
	struct FWindGustLocalSettingStruct	
	{
	public:
		float ElapsedTime_48_9A24DA0842E21D5736699499F1DE1171; // 0x0(0x4)
		float TimeBetweenGusts_54_E1D59EA94088FB83508636942434066D; // 0x4(0x4)
		float GustStrength_55_7788D1D04920E9BC2F96FCBDDCA7C33A; // 0x8(0x4)
		float GustDuration_56_E42A0C8341E10ACAC2016FA7F726B406; // 0xC(0x4)
		float FinalGustStrengthLocal_57_BD76FBFF47687A7C38D40EAD653D5618; // 0x10(0x4)
	};


	// Struct /Game/Animation/Libraries/ClothCoreSettingStruct.ClothCoreSettingStruct
	// Size: 0x80 (0x80 - 0x0)
	struct FClothCoreSettingStruct	
	{
	public:
		FVector2D EdgeStiffness_28_9A24DA0842E21D5736699499F1DE1171; // 0x0(0x10)
		FVector2D BendingStiffness_29_6CD0864B4078D8378C061197E9B1B094; // 0x10(0x10)
		FVector2D AreaStiffness_30_0D981B4E4039D5A0C6A4C78D6F09D510; // 0x20(0x10)
		FVector2D TetherStiffness_24_A5C4B017498D3154D76CECAB9AE7BDF2; // 0x30(0x10)
		float CollisionThickness_14_DACF320B4C03C6BD248A8E9B7B867FC7; // 0x40(0x4)
		float FrictionCoefficient_15_E5761CE84E8E52EEBD663B9DC3A0906F; // 0x44(0x4)
		float SelfCollisionThickness_16_98974B1C4B5ABE4EA1CFF7A791319392; // 0x48(0x4)
		float DampingCoefficient_17_A343D5A54D704F5B249C8E907DA80101; // 0x4C(0x4)
		float LocalDampingCoefficient_33_993AFAEA430EEBF424A7D0B8BB57CFB5; // 0x50(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		FVector2D AnimDriveStiffness_27_E54C28B348B4C35A1D0817AFA9FF0423; // 0x58(0x10)
		FVector2D AnimDriveDamping_26_F9EDBF5240E75A4905AFA1A8240922C8; // 0x68(0x10)
		int32_t NumberIterations_21_8E04A8E94B2040C7DBF93194733AC36A; // 0x78(0x4)
		int32_t NumberSubsteps_23_5108D5FA40140A1AAD38459100B14261; // 0x7C(0x4)
	};


	// Struct /Game/Animation/Libraries/WindGustSettingStruct.WindGustSettingStruct
	// Size: 0x78 (0x78 - 0x0)
	struct FWindGustSettingStruct	
	{
	public:
		float MinTimeBetweenGusts_25_6CD0864B4078D8378C061197E9B1B094; // 0x0(0x4)
		float MaxTimeBetweenGusts_28_0D981B4E4039D5A0C6A4C78D6F09D510; // 0x4(0x4)
		float MinGustStrength_26_A5C4B017498D3154D76CECAB9AE7BDF2; // 0x8(0x4)
		float MaxGustStrength_29_DACF320B4C03C6BD248A8E9B7B867FC7; // 0xC(0x4)
		float MinGustDuration_27_E5761CE84E8E52EEBD663B9DC3A0906F; // 0x10(0x4)
		float MaxGustDuration_30_98974B1C4B5ABE4EA1CFF7A791319392; // 0x14(0x4)
		float WindTurbulenceScalarA_48_A343D5A54D704F5B249C8E907DA80101; // 0x18(0x4)
		float WindTurbulenceScalarB_47_E54C28B348B4C35A1D0817AFA9FF0423; // 0x1C(0x4)
		float MinUpInterpSpeed_36_8E04A8E94B2040C7DBF93194733AC36A; // 0x20(0x4)
		float MaxUpInterpSpeed_37_5108D5FA40140A1AAD38459100B14261; // 0x24(0x4)
		float MinDownInterpSpeed_40_C3AD555846C2AEB9625C4E93B6758BB8; // 0x28(0x4)
		float MaxDownInterpSpeed_41_394B2B66448D9D21249A288C7DEC98F1; // 0x2C(0x4)
		FVector WindFrequency_51_9F209DFA4F7AB96CE220578516F0B4CF; // 0x30(0x18)
		FVector WindAmplitude_54_E174BDEC415CE55F6A1475B799695475; // 0x48(0x18)
		FVector WindOffset_55_91DD775940222EE47FDA3BA8695E8FE9; // 0x60(0x18)
	};


	// Struct /Game/Animation/Libraries/GravityOverrideParamsStruct.GravityOverrideParamsStruct
	// Size: 0x7B8 (0x7B8 - 0x0)
	struct FGravityOverrideParamsStruct	
	{
	public:
		FGravityOverrideSettingStruct Skydive_GoingUp_28_C026BDA74BFBABA6672DFE8FFDAAFC1B; // 0x0(0x68)
		FGravityOverrideSettingStruct Skydive_FloatingDown_29_2CBF3D3F421785F8994502931454A81F; // 0x68(0x68)
		FGravityOverrideSettingStruct Skydive_DivingDown_30_EC7BEC4D406A8A98E60D7B9374C5E457; // 0xD0(0x68)
		FGravityOverrideSettingStruct Skydive_Parachuting_31_A88C4A0A407F497561D31287CB20250F; // 0x138(0x68)
		FGravityOverrideSettingStruct OnGround_Standing_32_267DB1464D0D3A29D99E94ADFCB4AFEC; // 0x1A0(0x68)
		FGravityOverrideSettingStruct OnGround_Moving_33_807A66B64D7B3B2FCF080B833B8A6254; // 0x208(0x68)
		FGravityOverrideSettingStruct EmoteOrMelee_34_CFCF66B5492987CBD638EC98EB34D572; // 0x270(0x68)
		FGravityOverrideSettingStruct Swimming_35_33CE87CE4D4F712B1384E29115845962; // 0x2D8(0x68)
		FGravityOverrideSettingStruct Front_End_36_C7A4562A48E9BC9B4CD34D963CFC6490; // 0x340(0x68)
		FGravityOverrideSettingStruct DBNO_40_83703B55467F014D644D02B56709A2E6; // 0x3A8(0x68)
		FGravityOverrideSettingStruct DBNO_Carried_41_2C3D52AF4B7EB85DBA7C108948E58B3A; // 0x410(0x68)
		FGravityOverrideSettingStruct OnGround_Falling_45_DC16623B41084152717ACBAF5DCE8A91; // 0x478(0x68)
		FGravityOverrideSettingStruct Ziplining_46_0F05199D45821770F22E0B957551FEB7; // 0x4E0(0x68)
		FGravityOverrideSettingStruct Skydive_Surfing_49_5869AA5846BEE7C351769C951D56A34F; // 0x548(0x68)
		FGravityOverrideSettingStruct Riding_Standing_54_C62E341C48CF5BA85ACB799EE3C7653E; // 0x5B0(0x68)
		FGravityOverrideSettingStruct Riding_Moving_55_86CD46C94E5B465A175A6B939DB193BD; // 0x618(0x68)
		FGravityOverrideSettingStruct Riding_Moving_Targeting_58_38650D3547535FB293E61CBCF1B753BF; // 0x680(0x68)
		FGravityOverrideSettingStruct Tactical_Sprint_57_7B4700A94AF4B34179554C8EC4EB52E0; // 0x6E8(0x68)
		FGravityOverrideSettingStruct Rail_Grinding_61_97CB95534C5559BAF29FE49C016359FA; // 0x750(0x68)
	};


	// Struct /Game/Animation/Libraries/GravityOverrideSettingStruct.GravityOverrideSettingStruct
	// Size: 0x64 (0x64 - 0x0)
	struct FGravityOverrideSettingStruct	
	{
	public:
		FVector WindFrequency_28_9CBE863E417FC965C07809A2FE55ADFD; // 0x0(0x18)
		FVector WindAmplitude_31_6A3DFE4A481AD4D7CB18D79F95CC88E8; // 0x18(0x18)
		FVector WindOffset_32_C5F4D16F48D0BEDC3F0FA38B2648511B; // 0x30(0x18)
		FVector GravityOverride_15_9C3CF2B14934A1AC917C4C99F03AFC6E; // 0x48(0x18)
		FName JointName_27_C74F3B2245EA319DE82A629FF3C17CCA; // 0x60(0x4)
	};


	// Struct /Valet/Animation/Player/ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x53 (0x54 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_135 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		bool __BoolProperty; // 0x8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
		float __FloatProperty; // 0x18(0x4)
		bool __BoolProperty; // 0x1C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x1D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x20(0x4)
		bool __BoolProperty; // 0x24(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x25(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x28(0x4)
		bool __BoolProperty; // 0x2C(0x1)
		bool __BoolProperty; // 0x2D(0x1)
		bool __BoolProperty; // 0x2E(0x1)
		bool __BoolProperty; // 0x2F(0x1)
		bool __BoolProperty; // 0x30(0x1)
		bool __BoolProperty; // 0x31(0x1)
		bool __BoolProperty; // 0x32(0x1)
		bool __BoolProperty; // 0x33(0x1)
		bool __BoolProperty; // 0x34(0x1)
		bool __BoolProperty; // 0x35(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x36(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x38(0x4)
		bool __BoolProperty; // 0x3C(0x1)
		bool __BoolProperty; // 0x3D(0x1)
		unsigned char UnknownData05_6[0x2]; // 0x3E(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x40(0x4)
		bool __BoolProperty; // 0x44(0x1)
		bool __BoolProperty; // 0x45(0x1)
		unsigned char UnknownData06_6[0x2]; // 0x46(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x48(0x4)
		bool __BoolProperty; // 0x4C(0x1)
		bool __BoolProperty; // 0x4D(0x1)
		unsigned char UnknownData07_6[0x2]; // 0x4E(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x50(0x4)
	};


	// Struct /Valet/Animation/Player/ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1F97 (0x1F98 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_136 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x28(0x10)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		int32_t __IntProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		int32_t __IntProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		int32_t __IntProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		int32_t __IntProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		int32_t __IntProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		int32_t __IntProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		int32_t __IntProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		int32_t __IntProperty; // 0x7C(0x4)
		FName __NameProperty; // 0x80(0x4)
		int32_t __IntProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		int32_t __IntProperty; // 0x8C(0x4)
		FName __NameProperty; // 0x90(0x4)
		int32_t __IntProperty; // 0x94(0x4)
		UBlendProfile* __BlendProfile; // 0x98(0x8)
		UCurveFloat* __CurveFloat; // 0xA0(0x8)
		EAlphaBlendOption __EnumProperty; // 0xA8(0x1)
		EBlendListTransitionType __EnumProperty; // 0xA9(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xAA(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xB0(0x10)
		FInputScaleBiasClampConstants __StructProperty; // 0xC0(0x2C)
		bool __BoolProperty; // 0xEC(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xED(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xF0(0x4)
		float __FloatProperty; // 0xF4(0x4)
		bool __BoolProperty; // 0xF8(0x1)
		EAnimSyncMethod __EnumProperty; // 0xF9(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xFA(0x1)
		unsigned char UnknownData04_6[0x1]; // 0xFB(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0xFC(0x4)
		FName __NameProperty; // 0x100(0x4)
		int32_t __IntProperty; // 0x104(0x4)
		FName __NameProperty; // 0x108(0x4)
		FName __NameProperty; // 0x10C(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x110(0x18)
		FName __NameProperty; // 0x128(0x4)
		FName __NameProperty; // 0x12C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x130(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1B0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ResetRoot; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x8B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x8E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x9A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x9D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xA38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0xA68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xAC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xAF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xB28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xBB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xC18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xCA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xCD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0xD08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xD38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xD68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xD98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xDC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xDF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1008(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1038(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1068(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1098(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1158(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1188(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1218(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x14B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x15D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1608(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1638(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1668(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1698(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x16C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x16F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1728(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1758(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1788(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x17B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x17E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1818(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1848(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1878(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x18A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x18D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1908(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1938(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1968(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1998(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x19C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x19F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1A28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1A58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1AB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1AE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1B78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1BA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1BD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1C08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1C38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1C68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1C98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1CC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1CF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1D88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1DE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1E18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1E48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1E78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1EA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1ED8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1F08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1F38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1F68(0x30)
	};


	// Struct /Valet/Animation/Player/ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x37 (0x38 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_137 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		bool __BoolProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x10(0x4)
		bool __BoolProperty; // 0x14(0x1)
		bool __BoolProperty; // 0x15(0x1)
		bool __BoolProperty; // 0x16(0x1)
		bool __BoolProperty; // 0x17(0x1)
		UAnimSequenceBase* __AnimSequenceBase; // 0x18(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x20(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x28(0x8)
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
	};


	// Struct /Valet/Animation/Player/ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x15AF (0x15B0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_138 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		int32_t __IntProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		int32_t __IntProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		int32_t __IntProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		int32_t __IntProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		int32_t __IntProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		int32_t __IntProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		int32_t __IntProperty; // 0x50(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x58(0x10)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x70(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x71(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x74(0x4)
		TArray<float> __ArrayProperty; // 0x78(0x10)
		FName __NameProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		int32_t __IntProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		int32_t __IntProperty; // 0x98(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x9C(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x9D(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		UBlendProfile* __BlendProfile; // 0xA8(0x8)
		UCurveFloat* __CurveFloat; // 0xB0(0x8)
		EAlphaBlendOption __EnumProperty; // 0xB8(0x1)
		EBlendListTransitionType __EnumProperty; // 0xB9(0x1)
		unsigned char UnknownData04_6[0x6]; // 0xBA(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0xD0(0x1)
		unsigned char UnknownData05_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0xD4(0x4)
		bool __BoolProperty; // 0xD8(0x1)
		unsigned char UnknownData06_6[0x3]; // 0xD9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xDC(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xE0(0x2C)
		float __FloatProperty; // 0x10C(0x4)
		bool __BoolProperty; // 0x110(0x1)
		EAnimSyncMethod __EnumProperty; // 0x111(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x112(0x1)
		unsigned char UnknownData07_6[0x5]; // 0x113(0x5) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x118(0x18)
		FName __NameProperty; // 0x130(0x4)
		FName __NameProperty; // 0x134(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x138(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1B8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xAD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xCE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xD10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xD40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xD70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xDD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xE00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xE60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xEC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xF50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xF80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xFB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1010(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1040(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1070(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x10A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1100(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x12B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x12E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x13A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x13D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x1490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x14C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x14F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1580(0x30)
	};


	// Struct /GrindRail/Animation/GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x32A7 (0x32A8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_139 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		int32_t __IntProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		TArray<float> __ArrayProperty; // 0x40(0x10)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		UBlendProfile* __BlendProfile; // 0x60(0x8)
		UCurveFloat* __CurveFloat; // 0x68(0x8)
		EAlphaBlendOption __EnumProperty; // 0x70(0x1)
		EBlendListTransitionType __EnumProperty; // 0x71(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x72(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x78(0x10)
		FName __NameProperty; // 0x88(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x8C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x8D(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		FName __NameProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		FName __NameProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		int32_t __IntProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		int32_t __IntProperty; // 0xB4(0x4)
		FName __NameProperty; // 0xB8(0x4)
		int32_t __IntProperty; // 0xBC(0x4)
		FName __NameProperty; // 0xC0(0x4)
		FName __NameProperty; // 0xC4(0x4)
		FName __NameProperty; // 0xC8(0x4)
		int32_t __IntProperty; // 0xCC(0x4)
		FName __NameProperty; // 0xD0(0x4)
		FName __NameProperty; // 0xD4(0x4)
		FName __NameProperty; // 0xD8(0x4)
		FName __NameProperty; // 0xDC(0x4)
		int32_t __IntProperty; // 0xE0(0x4)
		FName __NameProperty; // 0xE4(0x4)
		FName __NameProperty; // 0xE8(0x4)
		FName __NameProperty; // 0xEC(0x4)
		int32_t __IntProperty; // 0xF0(0x4)
		FName __NameProperty; // 0xF4(0x4)
		FName __NameProperty; // 0xF8(0x4)
		FName __NameProperty; // 0xFC(0x4)
		int32_t __IntProperty; // 0x100(0x4)
		FName __NameProperty; // 0x104(0x4)
		int32_t __IntProperty; // 0x108(0x4)
		FName __NameProperty; // 0x10C(0x4)
		int32_t __IntProperty; // 0x110(0x4)
		FName __NameProperty; // 0x114(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x118(0x2C)
		FName __NameProperty; // 0x144(0x4)
		int32_t __IntProperty; // 0x148(0x4)
		FName __NameProperty; // 0x14C(0x4)
		int32_t __IntProperty; // 0x150(0x4)
		FName __NameProperty; // 0x154(0x4)
		FName __NameProperty; // 0x158(0x4)
		int32_t __IntProperty; // 0x15C(0x4)
		FName __NameProperty; // 0x160(0x4)
		FName __NameProperty; // 0x164(0x4)
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		bool __BoolProperty; // 0x170(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x171(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x174(0x4)
		float __FloatProperty; // 0x178(0x4)
		bool __BoolProperty; // 0x17C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x17D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x17E(0x1)
		unsigned char UnknownData04_6[0x1]; // 0x17F(0x1) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x180(0x18)
		FName __NameProperty; // 0x198(0x4)
		FName __NameProperty; // 0x19C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1A0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x220(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x238(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x268(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x270(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x608(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x638(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x668(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x698(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x728(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x758(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x788(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x818(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x848(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x878(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x8D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x908(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x938(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x968(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x998(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x9F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xA58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xA88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0xAB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xAE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xBA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xBD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0xC08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xCF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xD28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0xD58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xD88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xDE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0xE48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xEA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xED8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xF08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xF38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xF68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xF98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xFC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xFF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1028(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1058(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1088(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1118(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x12C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x12F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x13B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x13E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x14A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x14D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ResetRoot; // 0x1508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x15F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x16B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x16E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x17A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x17D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x19B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x19E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1AA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1AD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1CB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1CE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1DA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1E08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1E68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1E98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1EC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1EF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1F28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1F58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1F88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1FB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1FE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x20A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x20D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x21C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x21F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x22B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x22E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x23A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x23D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x24C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x24F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x25B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x25E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x26A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x26D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x27C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x27F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x28B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x28E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x29A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x29D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2A08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2A38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2A68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2A98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2AC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2AF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2B28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2B58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2B88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2BB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2BE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2C18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2C48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2C78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2CA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2CD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2D08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2D38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2D68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2D98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2DC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2DF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess FortAnimGraphNode_GrindRailSlopeWarping; // 0x2E28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x2E58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x2E88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x2EB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2EE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2F18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2F48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x2F78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x2FA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x2FD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3008(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3038(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3068(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3098(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x30C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x30F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3158(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3188(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x31B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x31E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x3218(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3278(0x30)
	};


	// Struct /GrindRail/Animation/GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x57 (0x58 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_140 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		bool __BoolProperty; // 0x14(0x1)
		bool __BoolProperty; // 0x15(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x16(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x18(0x4)
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
		float __FloatProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
	};


	// Struct /Game/Animation/Game/MainPlayer/Gadgets/Mustache/Mustache_SkBP.Mustache_SkBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2BF (0x2C0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_141 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		bool __BoolProperty; // 0x10(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x14(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x18(0x2C)
		float __FloatProperty; // 0x44(0x4)
		bool __BoolProperty; // 0x48(0x1)
		EAnimSyncMethod __EnumProperty; // 0x49(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x4A(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x4B(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		int32_t __IntProperty; // 0x58(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x60(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x78(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xF8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x110(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x290(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/Shotgun/ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x767 (0x768 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_142 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		bool __BoolProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x10(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x14(0x2C)
		float __FloatProperty; // 0x40(0x4)
		bool __BoolProperty; // 0x44(0x1)
		EAnimSyncMethod __EnumProperty; // 0x45(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x46(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x47(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		FName __NameProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x90(0x18)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xB0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x130(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2C8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2F8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x300(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x330(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x338(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x368(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x370(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3A0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x738(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/LMG/LMG_Anim_BP.LMG_Anim_BP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x17F (0x180 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_143 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SubInstance; // 0x150(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Reacts/Healing/MiniShield/MiniShieldPotion_Prop_AnimBP.MiniShieldPotion_Prop_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x167 (0x168 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_144 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0x20(0x1)
		bool __BoolProperty; // 0x21(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x22(0x2) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0x30(0x8)
		bool __BoolProperty; // 0x38(0x1)
		EAnimSyncMethod __EnumProperty; // 0x39(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x3A(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x3B(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x3C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x40(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xC0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x138(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Reacts/Healing/Bandages/Prop/WrapBandages_Prop_AnimBP.WrapBandages_Prop_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2AF (0x2B0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_145 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		bool __BoolProperty; // 0x8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xC(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x10(0x2C)
		float __FloatProperty; // 0x3C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x40(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x41(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x42(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x44(0x4)
		UBlendProfile* __BlendProfile; // 0x48(0x8)
		UCurveFloat* __CurveFloat; // 0x50(0x8)
		bool __BoolProperty; // 0x58(0x1)
		EAlphaBlendOption __EnumProperty; // 0x59(0x1)
		EBlendListTransitionType __EnumProperty; // 0x5A(0x1)
		unsigned char UnknownData03_6[0x5]; // 0x5B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x60(0x10)
		TArray<int32_t> __ArrayProperty; // 0x70(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x80(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x98(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x118(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x280(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Reacts/Healing/Bandages/Prop/WrapBandages_Prop_AnimBP.WrapBandages_Prop_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1 (0x2 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_146 : public FAnimBlueprintMutableData	
	{
	public:
		char __ByteProperty; // 0x1(0x1)
	};


	// Struct /Game/Animation/Game/MainPlayer/Reacts/Healing/Medkit/ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2AF (0x2B0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_147 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		bool __BoolProperty; // 0x8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xC(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x10(0x2C)
		float __FloatProperty; // 0x3C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x40(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x41(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x42(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x44(0x4)
		UBlendProfile* __BlendProfile; // 0x48(0x8)
		UCurveFloat* __CurveFloat; // 0x50(0x8)
		bool __BoolProperty; // 0x58(0x1)
		EAlphaBlendOption __EnumProperty; // 0x59(0x1)
		EBlendListTransitionType __EnumProperty; // 0x5A(0x1)
		unsigned char UnknownData03_6[0x5]; // 0x5B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x60(0x10)
		TArray<int32_t> __ArrayProperty; // 0x70(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x80(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x98(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x118(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x280(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Reacts/Healing/Medkit/ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1 (0x2 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_148 : public FAnimBlueprintMutableData	
	{
	public:
		char __ByteProperty; // 0x1(0x1)
	};


	// Struct /Game/Animation/Game/MainPlayer/Reacts/Healing/HalfShield/HalfShieldPotion_Prop_AnimBP.HalfShieldPotion_Prop_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x187 (0x188 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_149 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		bool __BoolProperty; // 0x20(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x24(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x28(0x2C)
		float __FloatProperty; // 0x54(0x4)
		bool __BoolProperty; // 0x58(0x1)
		EAnimSyncMethod __EnumProperty; // 0x59(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x5A(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x5B(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x5C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x60(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xE0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x158(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/FuturisticRevolver/Pistol_Revolver_SideAction_AnimBP1.Pistol_Revolver_SideAction_AnimBP1_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x617 (0x618 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_150 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		int32_t __IntProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		int32_t __IntProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		int32_t __IntProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		int32_t __IntProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		int32_t __IntProperty; // 0x34(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x38(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		int32_t __IntProperty; // 0x44(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x48(0x18)
		bool __BoolProperty; // 0x60(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x64(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x68(0x2C)
		float __FloatProperty; // 0x94(0x4)
		bool __BoolProperty; // 0x98(0x1)
		EAnimSyncMethod __EnumProperty; // 0x99(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x9A(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x9B(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x9C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xA0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x5E8(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/Bullpup/SK_Assault_Bullpup_01_Skeleton_AnimBlueprint.SK_Assault_Bullpup_01_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x14F (0x150 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_151 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x120(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/PDW/BP_PDW.BP_PDW_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x14F (0x150 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_152 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x120(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/Shotgun_LeverAction/Shotgun_leverAction_AnimBP.Shotgun_leverAction_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x14F (0x150 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_153 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x120(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/BoltActionSniperRifle/BP_BoltActionSniperRifleNoScope.BP_BoltActionSniperRifleNoScope_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x187 (0x188 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_154 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		float __FloatProperty; // 0x20(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x24(0x2C)
		float __FloatProperty; // 0x50(0x4)
		bool __BoolProperty; // 0x54(0x1)
		EAnimSyncMethod __EnumProperty; // 0x55(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x56(0x1)
		unsigned char UnknownData01_6[0x1]; // 0x57(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x58(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x60(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xE0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x158(0x30)
	};


	// Struct /Game/Animation/Game/MainPlayer/Combat/Guns/StormTrackerSniper/BP_StormTrackerSniper.BP_StormTrackerSniper_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x187 (0x188 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_155 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		bool __BoolProperty; // 0x20(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x24(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x28(0x2C)
		float __FloatProperty; // 0x54(0x4)
		bool __BoolProperty; // 0x58(0x1)
		EAnimSyncMethod __EnumProperty; // 0x59(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x5A(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x5B(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x5C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x60(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xE0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x158(0x30)
	};


	// Struct /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x8C (0x8D - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_156 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x10(0x10)
		bool __BoolProperty; // 0x20(0x1)
		bool __BoolProperty; // 0x21(0x1)
		bool __BoolProperty; // 0x22(0x1)
		bool __BoolProperty; // 0x23(0x1)
		bool __BoolProperty; // 0x24(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x25(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		bool __BoolProperty; // 0x30(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
		bool __BoolProperty; // 0x44(0x1)
		bool __BoolProperty; // 0x45(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x46(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x48(0x4)
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		bool __BoolProperty; // 0x60(0x1)
		bool __BoolProperty; // 0x61(0x1)
		bool __BoolProperty; // 0x62(0x1)
		bool __BoolProperty; // 0x63(0x1)
		bool __BoolProperty; // 0x64(0x1)
		bool __BoolProperty; // 0x65(0x1)
		unsigned char UnknownData05_6[0x2]; // 0x66(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x68(0x4)
		float __FloatProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		bool __BoolProperty; // 0x74(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x78(0x4)
		float __FloatProperty; // 0x7C(0x4)
		bool __BoolProperty; // 0x80(0x1)
		bool __BoolProperty; // 0x81(0x1)
		unsigned char UnknownData07_6[0x2]; // 0x82(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x84(0x4)
		float __FloatProperty; // 0x88(0x4)
		bool __BoolProperty; // 0x8C(0x1)
	};


	// Struct /RidingContent/Animation/HardSaddle/Boar/BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2EF7 (0x2EF8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_157 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x10(0x8)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		int32_t __IntProperty; // 0x30(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x38(0x10)
		FName __NameProperty; // 0x48(0x4)
		int32_t __IntProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		int32_t __IntProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		int32_t __IntProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		FName __NameProperty; // 0x80(0x4)
		int32_t __IntProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		EBlendListTransitionType __EnumProperty; // 0x8C(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x8D(0x3) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x90(0x10)
		TArray<float> __ArrayProperty; // 0xA0(0x10)
		FName __NameProperty; // 0xB0(0x4)
		int32_t __IntProperty; // 0xB4(0x4)
		FName __NameProperty; // 0xB8(0x4)
		int32_t __IntProperty; // 0xBC(0x4)
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		EAnimSyncMethod __EnumProperty; // 0xD0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xD4(0x4)
		FName __NameProperty; // 0xD8(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xDC(0x2C)
		FName __NameProperty; // 0x108(0x4)
		int32_t __IntProperty; // 0x10C(0x4)
		FName __NameProperty; // 0x110(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x114(0x1)
		bool __BoolProperty; // 0x115(0x1)
		unsigned char UnknownData05_6[0x2]; // 0x116(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x118(0x4)
		float __FloatProperty; // 0x11C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x120(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x121(0x1)
		unsigned char UnknownData06_6[0x6]; // 0x122(0x6) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x128(0x8)
		UCurveFloat* __CurveFloat; // 0x130(0x8)
		bool __BoolProperty; // 0x138(0x1)
		EAlphaBlendOption __EnumProperty; // 0x139(0x1)
		EBlendListTransitionType __EnumProperty; // 0x13A(0x1)
		unsigned char UnknownData07_6[0x5]; // 0x13B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x140(0x10)
		FName __NameProperty; // 0x150(0x4)
		FName __NameProperty; // 0x154(0x4)
		int32_t __IntProperty; // 0x158(0x4)
		FName __NameProperty; // 0x15C(0x4)
		FName __NameProperty; // 0x160(0x4)
		FName __NameProperty; // 0x164(0x4)
		FName __NameProperty; // 0x168(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x16C(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x170(0x18)
		FName __NameProperty; // 0x188(0x4)
		FName __NameProperty; // 0x18C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x190(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x210(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xAF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xCA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xD08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xD98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xDF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1008(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1038(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1068(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1098(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1158(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1188(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1218(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x12A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x15A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x15D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1608(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1638(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1668(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1698(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x16C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x16F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x1728(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1758(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1788(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1818(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1848(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1878(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x18A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1908(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1938(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1968(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1998(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x19C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x19F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1A28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1A58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1A88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x1AB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1AE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1CC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1CF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1DB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1DE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1E18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1E48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1EA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1ED8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1F08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1F38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1F68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1FC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1FF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2028(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2058(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2088(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x20B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x20E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2118(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x21A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x21D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x22C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x22F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x23B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x23E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x24A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x24D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x25C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x25F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x26B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x26E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x27A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x27D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x28C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x28F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x2988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x29B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x29E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2A18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2A48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x2A78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2AA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2AD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x2B08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2B38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2B68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2B98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2BC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x2BF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2C28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2C58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2C88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2CB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2CE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2D18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2D48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2D78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2DA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2DD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2E08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2E38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2E68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2E98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2EC8(0x30)
	};


	// Struct /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1B (0x1C - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_158 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		bool __BoolProperty; // 0xC(0x1)
		bool __BoolProperty; // 0xD(0x1)
		bool __BoolProperty; // 0xE(0x1)
		unsigned char UnknownData01_6[0x1]; // 0xF(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x10(0x4)
		bool __BoolProperty; // 0x14(0x1)
		bool __BoolProperty; // 0x15(0x1)
		bool __BoolProperty; // 0x16(0x1)
		bool __BoolProperty; // 0x17(0x1)
		float __FloatProperty; // 0x18(0x4)
	};


	// Struct /RidingContent/Animation/Proto/RidingPlayerLayerAnimBP.RidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0xAC7 (0xAC8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_159 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xC(0x2C)
		UBlendProfile* __BlendProfile; // 0x38(0x8)
		UCurveFloat* __CurveFloat; // 0x40(0x8)
		EAlphaBlendOption __EnumProperty; // 0x48(0x1)
		EBlendListTransitionType __EnumProperty; // 0x49(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x4A(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x50(0x10)
		bool __BoolProperty; // 0x60(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x64(0x4)
		float __FloatProperty; // 0x68(0x4)
		bool __BoolProperty; // 0x6C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x6D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x6E(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x6F(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x80(0x18)
		FName __NameProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xA0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x8B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x8E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x9A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x9D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xA08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xA38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xA68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xA98(0x30)
	};


	// Struct /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0xA7 (0xA8 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_160 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x10(0x10)
		bool __BoolProperty; // 0x20(0x1)
		bool __BoolProperty; // 0x21(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x22(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		bool __BoolProperty; // 0x2C(0x1)
		bool __BoolProperty; // 0x2D(0x1)
		bool __BoolProperty; // 0x2E(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x2F(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		bool __BoolProperty; // 0x38(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3C(0x4)
		bool __BoolProperty; // 0x40(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x41(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x44(0x4)
		bool __BoolProperty; // 0x48(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x49(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		float __FloatProperty; // 0x60(0x4)
		float __FloatProperty; // 0x64(0x4)
		bool __BoolProperty; // 0x68(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		bool __BoolProperty; // 0x74(0x1)
		bool __BoolProperty; // 0x75(0x1)
		bool __BoolProperty; // 0x76(0x1)
		bool __BoolProperty; // 0x77(0x1)
		bool __BoolProperty; // 0x78(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x79(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x7C(0x4)
		bool __BoolProperty; // 0x80(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x81(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x84(0x4)
		float __FloatProperty; // 0x88(0x4)
		float __FloatProperty; // 0x8C(0x4)
		float __FloatProperty; // 0x90(0x4)
		bool __BoolProperty; // 0x94(0x1)
		bool __BoolProperty; // 0x95(0x1)
		unsigned char UnknownData10_6[0x2]; // 0x96(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x98(0x4)
		float __FloatProperty; // 0x9C(0x4)
		bool __BoolProperty; // 0xA0(0x1)
		unsigned char UnknownData11_6[0x3]; // 0xA1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xA4(0x4)
	};


	// Struct /RidingContent/Animation/HardSaddle/Wolf/WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2E67 (0x2E68 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_161 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x10(0x8)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		int32_t __IntProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		int32_t __IntProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		int32_t __IntProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		int32_t __IntProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		int32_t __IntProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		TArray<float> __ArrayProperty; // 0x78(0x10)
		EBlendListTransitionType __EnumProperty; // 0x88(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x89(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x90(0x10)
		FName __NameProperty; // 0xA0(0x4)
		int32_t __IntProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		int32_t __IntProperty; // 0xAC(0x4)
		TArray<float> __ArrayProperty; // 0xB0(0x10)
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		EAnimSyncMethod __EnumProperty; // 0xD0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xD4(0x4)
		FName __NameProperty; // 0xD8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xDC(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0xE0(0x8)
		UCurveFloat* __CurveFloat; // 0xE8(0x8)
		EAlphaBlendOption __EnumProperty; // 0xF0(0x1)
		EBlendListTransitionType __EnumProperty; // 0xF1(0x1)
		unsigned char UnknownData05_6[0x6]; // 0xF2(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xF8(0x10)
		FName __NameProperty; // 0x108(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x10C(0x2C)
		FName __NameProperty; // 0x138(0x4)
		int32_t __IntProperty; // 0x13C(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x140(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x141(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x144(0x4)
		FName __NameProperty; // 0x148(0x4)
		int32_t __IntProperty; // 0x14C(0x4)
		bool __BoolProperty; // 0x150(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x151(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x154(0x4)
		float __FloatProperty; // 0x158(0x4)
		bool __BoolProperty; // 0x15C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x15D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x15E(0x1)
		unsigned char UnknownData08_6[0x1]; // 0x15F(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x160(0x4)
		FName __NameProperty; // 0x164(0x4)
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x170(0x18)
		FName __NameProperty; // 0x188(0x4)
		FName __NameProperty; // 0x18C(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x190(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x210(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xC18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xC48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xCD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xD38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1008(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1038(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1068(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1098(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1158(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1188(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1218(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x12A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x12D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x13C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x14B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x15D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1608(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1638(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1668(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x1698(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x16C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x16F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1728(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1758(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1788(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x17B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x17E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1818(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1848(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1878(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x18D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1908(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1938(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1968(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1998(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x19C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x19F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1A28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1AB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1AE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1BD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1CC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1CF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1E18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1E48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1EA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1ED8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1F08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1F38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1F68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1F98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1FC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1FF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2028(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2058(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2088(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x20B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x20E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2118(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x21A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x21D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x22C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x22F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x23B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x23E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x24A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x24D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x25C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x25F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x26B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x26E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x27A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x27D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x28C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x28F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x29B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x29E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2A18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2A48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2A78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2AA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2AD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2B08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2B38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2B68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2B98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2BC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x2BF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2C28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2C58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x2C88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x2CB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2CE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2D78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2DA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2DD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2E08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2E38(0x30)
	};

}
