#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Anim
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class /ScoutDrone/Anim/ScoutDrone_AnimBP.ScoutDrone_AnimBP_C
	// Inherited from UFortScoutDroneAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x3580 (0x3C20 - 0x6A0)
	class UScoutDrone_AnimBP_C : public UFortScoutDroneAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x6A0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6A8(0x44)
		unsigned char UnknownData00_6[0x4]; // 0x6EC(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x6F0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x6F8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x700(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x720(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x748(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x770(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x798(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x808(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x918(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x938(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x9A8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9F0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xAB8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xB80(0x70)
		FAnimNode_Root AnimGraphNode_Root; // 0xBF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC10(0xB0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xCC0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xD88(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xDF8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xEC0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xF08(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xFD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xFF8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1020(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1068(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1088(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1098(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x10B8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1180(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x11F0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x12B8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1380(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x13F0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x14B8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1528(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15F0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1638(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1700(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1728(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1750(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1778(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x17A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x17C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x17F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1818(0x28)
		FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x1840(0x78)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x18B8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x18D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1920(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1940(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1988(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x19A8(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19B8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x19D8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1AA0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1B10(0xC8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BD8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1BF8(0xB0)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1CA8(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1DD0(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1EF8(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1F18(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F38(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2020(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2048(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2070(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2098(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2110(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2138(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2160(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2188(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x21B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x21D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2200(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2228(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2250(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2278(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22C8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x22F0(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2318(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23E0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2428(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2448(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2490(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x24B0(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x24D8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24F8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2540(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2560(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x25A8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x25C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2610(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2658(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x26A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26E8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2730(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2750(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x27C0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2888(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2950(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2978(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29C0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29E0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2A28(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2A48(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2B10(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2B58(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B78(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2BA0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2BE8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2C08(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2C50(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2C70(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2D38(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2DA8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2E70(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E90(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2EB8(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2EE0(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FA8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2FD0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3018(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3038(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3080(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x30A0(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3168(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3188(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x31B0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x31D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3218(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3238(0xC8)
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x3300(0x420)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x3720(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3768(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3818(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x38E0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x39A8(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3A20(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3AE8(0x70)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3B58(0x78)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x3BD0(0x48)
		UFortScoutDroneMovementComponent* FortScoutDroneMovementComponent_p; // 0x3C18(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Anim/ScoutDrone_AnimBP.ScoutDrone_AnimBP_C");
			return ret;
		}

		void CachedPose(FPoseLink& CachedPose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FullBodyAdditiveGroup(FPoseLink InPoseFullbodyAdditive, FPoseLink& FullBodyAdditiveGroup); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PostProcessing(FPoseLink InPosePostProcessing, FPoseLink& PostProcessing); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckDivingConditions(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VariousFanSpeed(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ForceSpeedBoostVelocity(bool isSpeedBoosting); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IntegrateFanVelocityL(double Acceleration, double Velocity, double Rotation, double DeltaTime, double& OutVelocity, double& OutRotation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintInitializeAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_IdleEnter(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ScoutDrone_AnimBP(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};

}
