#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Engine
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class Engine.Actor
	// Inherited from UObject
	// Size: 0x268 (0x290 - 0x28)
	class AActor : public UObject	
	{
	public:
		FActorTickFunction PrimaryActorTick; // 0x28(0x30)
		bool bNetTemporary : 1; // 0x58:0(0x1)
		unsigned char UnknownBit00 : 1; // 0x58:1(0x1) UNKNOWN PROPERTY
		bool bOnlyRelevantToOwner : 1; // 0x58:2(0x1)
		bool bAlwaysRelevant : 1; // 0x58:3(0x1)
		bool bReplicateMovement : 1; // 0x58:4(0x1)
		bool bCallPreReplication : 1; // 0x58:5(0x1)
		bool bCallPreReplicationForReplay : 1; // 0x58:6(0x1)
		bool bHidden : 1; // 0x58:7(0x1)
		bool bTearOff : 1; // 0x59:0(0x1)
		bool bForceNetAddressable : 1; // 0x59:1(0x1)
		bool bExchangedRoles : 1; // 0x59:2(0x1)
		bool bNetLoadOnClient : 1; // 0x59:3(0x1)
		bool bNetUseOwnerRelevancy : 1; // 0x59:4(0x1)
		bool bRelevantForNetworkReplays : 1; // 0x59:5(0x1)
		bool bRelevantForLevelBounds : 1; // 0x59:6(0x1)
		bool bReplayRewindable : 1; // 0x59:7(0x1)
		bool bAllowTickBeforeBeginPlay : 1; // 0x5A:0(0x1)
		bool bAutoDestroyWhenFinished : 1; // 0x5A:1(0x1)
		bool bCanBeDamaged : 1; // 0x5A:2(0x1)
		bool bBlockInput : 1; // 0x5A:3(0x1)
		bool bCollideWhenPlacing : 1; // 0x5A:4(0x1)
		bool bFindCameraComponentWhenViewTarget : 1; // 0x5A:5(0x1)
		bool bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5A:6(0x1)
		bool bIgnoresOriginShifting : 1; // 0x5A:7(0x1)
		bool bEnableAutoLODGeneration : 1; // 0x5B:0(0x1)
		bool bIsEditorOnlyActor : 1; // 0x5B:1(0x1)
		unsigned char UnknownBit01 : 1; // 0x5B:2(0x1) UNKNOWN PROPERTY
		bool bReplicates : 1; // 0x5B:3(0x1)
		bool bCanBeInCluster : 1; // 0x5B:4(0x1)
		bool bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5B:5(0x1)
		unsigned char UnknownBit02 : 1; // 0x5B:6(0x1) UNKNOWN PROPERTY
		bool bReplicateUsingRegisteredSubObjectList : 1; // 0x5B:7(0x1)
		unsigned char UnknownBit03 : 1; // 0x5C:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x5C:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0x5C:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x5C:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x5C:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x5C:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x5C:6(0x1) UNKNOWN PROPERTY
		bool bActorEnableCollision : 1; // 0x5C:7(0x1)
		bool bActorIsBeingDestroyed : 1; // 0x5D:0(0x1)
		unsigned char UnknownBit10 : 1; // 0x5D:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x5D:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0x5D:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit13 : 1; // 0x5D:4(0x1) UNKNOWN PROPERTY
		bool bAsyncPhysicsTickEnabled : 1; // 0x5D:5(0x1)
		EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5E(0x1)
		EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5F(0x1)
		TEnumAsByte<ENetRole> RemoteRole; // 0x60(0x1)
		unsigned char UnknownData14_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float InitialLifeSpan; // 0x64(0x4)
		float CustomTimeDilation; // 0x68(0x4)
		int32_t RayTracingGroupId; // 0x6C(0x4)
		FRepAttachment AttachmentReplication; // 0x70(0x60)
		FRepMovement ReplicatedMovement; // 0xD0(0x70)
		AActor* Owner; // 0x140(0x8)
		FName NetDriverName; // 0x148(0x4)
		TEnumAsByte<ENetRole> Role; // 0x14C(0x1)
		TEnumAsByte<ENetDormancy> NetDormancy; // 0x14D(0x1)
		ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14E(0x1)
		TEnumAsByte<EAutoReceiveInput> AutoReceiveInput; // 0x14F(0x1)
		int32_t InputPriority; // 0x150(0x4)
		unsigned char UnknownData15_6[0x4]; // 0x154(0x4) UNKNOWN PROPERTY
		UInputComponent* InputComponent; // 0x158(0x8)
		int32_t NetTag; // 0x160(0x4)
		float NetCullDistanceSquared; // 0x164(0x4)
		float NetUpdateFrequency; // 0x168(0x4)
		float MinNetUpdateFrequency; // 0x16C(0x4)
		float NetPriority; // 0x170(0x4)
		EPhysicsReplicationMode PhysicsReplicationMode; // 0x174(0x1)
		unsigned char UnknownData16_6[0xB]; // 0x175(0xB) UNKNOWN PROPERTY
		APawn* Instigator; // 0x180(0x8)
		TArray<AActor*> Children; // 0x188(0x10)
		USceneComponent* RootComponent; // 0x198(0x8)
		unsigned char UnknownData17_6[0x8]; // 0x1A0(0x8) UNKNOWN PROPERTY
		TArray<FName> Layers; // 0x1A8(0x10)
		TWeakObjectPtr<UChildActorComponent*> ParentComponent; // 0x1B8(0x8)
		unsigned char UnknownData18_6[0x10]; // 0x1C0(0x10) UNKNOWN PROPERTY
		TArray<FName> Tags; // 0x1D0(0x10)
		FMulticastSparseDelegate OnTakeAnyDamage; // 0x1E0(0x1)
		FMulticastSparseDelegate OnTakePointDamage; // 0x1E1(0x1)
		FMulticastSparseDelegate OnTakeRadialDamage; // 0x1E2(0x1)
		FMulticastSparseDelegate OnActorBeginOverlap; // 0x1E3(0x1)
		FMulticastSparseDelegate OnActorEndOverlap; // 0x1E4(0x1)
		FMulticastSparseDelegate OnBeginCursorOver; // 0x1E5(0x1)
		FMulticastSparseDelegate OnEndCursorOver; // 0x1E6(0x1)
		FMulticastSparseDelegate OnClicked; // 0x1E7(0x1)
		FMulticastSparseDelegate OnReleased; // 0x1E8(0x1)
		FMulticastSparseDelegate OnInputTouchBegin; // 0x1E9(0x1)
		FMulticastSparseDelegate OnInputTouchEnd; // 0x1EA(0x1)
		FMulticastSparseDelegate OnInputTouchEnter; // 0x1EB(0x1)
		FMulticastSparseDelegate OnInputTouchLeave; // 0x1EC(0x1)
		FMulticastSparseDelegate OnActorHit; // 0x1ED(0x1)
		FMulticastSparseDelegate OnDestroyed; // 0x1EE(0x1)
		FMulticastSparseDelegate OnEndPlay; // 0x1EF(0x1)
		unsigned char UnknownData19_6[0x80]; // 0x1F0(0x80) UNKNOWN PROPERTY
		TArray<UActorComponent*> InstanceComponents; // 0x270(0x10)
		TArray<UActorComponent*> BlueprintCreatedComponents; // 0x280(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Actor");
			return ret;
		}

		bool WasRecentlyRendered(float Tolerance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C5318(relative to base address)
		void UserConstructionScript(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TearOff(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C349660(relative to base address)
		void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C5218(relative to base address)
		void SetTickableWhenPaused(bool bTickableWhenPaused); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C5294(relative to base address)
		void SetReplicates(bool bInReplicates); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C5198(relative to base address)
		void SetReplicateMovement(bool bInReplicateMovement); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C5114(relative to base address)
		void SetRayTracingGroupId(int32_t InRaytracingGroupId); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C508C(relative to base address)
		void SetPhysicsReplicationMode(EPhysicsReplicationMode ReplicationMode); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C500C(relative to base address)
		void SetOwner(AActor* NewOwner); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4F88(relative to base address)
		void SetNetUpdateFrequency(float Frequency); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4F08(relative to base address)
		void SetNetDormancy(TEnumAsByte<ENetDormancy> NewDormancy); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4E88(relative to base address)
		void SetNetCullDistanceSquared(float DistanceSq); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4E08(relative to base address)
		void SetMinNetUpdateFrequency(float MinFrequency); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4D88(relative to base address)
		void SetLifeSpan(float InLifespan); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7490C2E9C(relative to base address)
		void SetAutoDestroyWhenFinished(bool bVal); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4CC0(relative to base address)
		void SetActorTickInterval(float TickInterval); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4C40(relative to base address)
		void SetActorTickEnabled(bool bEnabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748BE22C8(relative to base address)
		void SetActorScale3D(FVector NewScale3D); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7491CD2CC(relative to base address)
		void SetActorRelativeScale3D(FVector NewRelativeScale); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C4B20(relative to base address)
		void SetActorHiddenInGame(bool bNewHidden); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748A91DB4(relative to base address)
		void SetActorEnableCollision(bool bNewActorEnableCollision); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7493225AC(relative to base address)
		void RemoveTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4A9C(relative to base address)
		void RemoveTickPrerequisiteActor(AActor* PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4A18(relative to base address)
		void ReceiveTick(float DeltaSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveRadialDamage(float DamageReceived, UDamageType* DamageType, FVector Origin, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceivePointDamage(float Damage, UDamageType* DamageType, FVector HitLocation, FVector HitNormal, UPrimitiveComponent* HitComponent, FName BoneName, FVector ShotFromDirection, AController* InstigatedBy, AActor* DamageCauser, FHitResult& HitInfo); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: RequiredAPI|Event|Public|HasOutParms|HasDefaults|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDestroyed(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveAnyDamage(float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorOnReleased(FKey ButtonReleased); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorOnClicked(FKey ButtonPressed); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorEndOverlap(AActor* OtherActor); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorEndCursorOver(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorBeginOverlap(AActor* OtherActor); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveActorBeginCursorOver(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C4854(relative to base address)
		void OnRep_ReplicateMovement(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF746F37328(relative to base address)
		void OnRep_ReplicatedMovement(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF7474A9F44(relative to base address)
		void OnRep_Owner(); // Flags: RequiredAPI|Native|Protected, Memory Exec: 0x7FF748333524(relative to base address)
		void OnRep_Instigator(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF747A5CDF4(relative to base address)
		void OnRep_AttachmentReplication(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF747E989FC(relative to base address)
		void MakeNoise(float Loudness, APawn* NoiseInstigator, FVector NoiseLocation, float MaxRange, FName Tag); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C4538(relative to base address)
		bool K2_TeleportTo(FVector DestLocation, FRotator DestRotation); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF749694748(relative to base address)
		bool K2_SetActorTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7493ED004(relative to base address)
		bool K2_SetActorRotation(FRotator NewRotation, bool bTeleportPhysics); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748EDED84(relative to base address)
		void K2_SetActorRelativeTransform(FTransform& NewRelativeTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C42A8(relative to base address)
		void K2_SetActorRelativeRotation(FRotator NewRelativeRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C3F00(relative to base address)
		void K2_SetActorRelativeLocation(FVector NewRelativeLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C3B58(relative to base address)
		bool K2_SetActorLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C36C8(relative to base address)
		bool K2_SetActorLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C3300(relative to base address)
		void K2_OnReset(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndViewTarget(APlayerController* PC); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnBecomeViewTarget(APlayerController* PC); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		USceneComponent K2_GetRootComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748BF1F80(relative to base address)
		TArray K2_GetComponentsByClass(UClass* ComponentClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74881B8A8(relative to base address)
		FRotator K2_GetActorRotation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CBA6B8(relative to base address)
		FVector K2_GetActorLocation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748A8ADB8(relative to base address)
		void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C31F8(relative to base address)
		void K2_DestroyActor(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7487DB18C(relative to base address)
		bool K2_AttachToComponent(USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7490CC06C(relative to base address)
		bool K2_AttachToActor(AActor* ParentActor, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749458938(relative to base address)
		void K2_AttachRootComponentToActor(AActor* InParentActor, FName InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C308C(relative to base address)
		void K2_AttachRootComponentTo(USceneComponent* InParent, FName InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C2F40(relative to base address)
		void K2_AddActorWorldTransformKeepScale(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C2CB0(relative to base address)
		void K2_AddActorWorldTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C2A20(relative to base address)
		void K2_AddActorWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C2678(relative to base address)
		void K2_AddActorWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C22D0(relative to base address)
		void K2_AddActorLocalTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C2040(relative to base address)
		void K2_AddActorLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C1C98(relative to base address)
		void K2_AddActorLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3C18F0(relative to base address)
		bool IsOverlappingActor(AActor* Other); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1860(relative to base address)
		bool IsChildActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C183C(relative to base address)
		bool IsActorTickEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1824(relative to base address)
		bool IsActorBeingDestroyed(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C180C(relative to base address)
		bool HasAuthority(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748B61E00(relative to base address)
		float GetVerticalDistanceTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C16C8(relative to base address)
		FVector GetVelocity(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748DBD41C(relative to base address)
		FTransform GetTransform(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749140E60(relative to base address)
		bool GetTickableWhenPaused(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C16B0(relative to base address)
		float GetSquaredHorizontalDistanceTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1568(relative to base address)
		float GetSquaredDistanceTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C14D8(relative to base address)
		float GetResimulationThreshold(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C14AC(relative to base address)
		TEnumAsByte GetRemoteRole(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1498(relative to base address)
		int32_t GetRayTracingGroupId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1474(relative to base address)
		EPhysicsReplicationMode GetPhysicsReplicationMode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C145C(relative to base address)
		UChildActorComponent GetParentComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1438(relative to base address)
		AActor GetParentActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1414(relative to base address)
		AActor GetOwner(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748C99C0C(relative to base address)
		void GetOverlappingComponents(TArray<UPrimitiveComponent*>& OverlappingComponents); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1378(relative to base address)
		void GetOverlappingActors(TArray<AActor*>& OverlappingActors, UClass* ClassFilter); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74930BE90(relative to base address)
		float GetNetUpdateFrequency(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C294A00(relative to base address)
		float GetNetCullDistanceSquared(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1320(relative to base address)
		float GetMinNetUpdateFrequency(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1308(relative to base address)
		TEnumAsByte GetLocalRole(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74920E2D0(relative to base address)
		float GetLifeSpan(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C12DC(relative to base address)
		FTransform GetLevelTransform(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C1280(relative to base address)
		ULevel GetLevel(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C125C(relative to base address)
		AController GetInstigatorController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748C49788(relative to base address)
		APawn GetInstigator(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74896C694(relative to base address)
		FVector GetInputVectorAxisValue(FKey InputAxisKey); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C108C(relative to base address)
		float GetInputAxisValue(FName InputAxisName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C0FFC(relative to base address)
		float GetInputAxisKeyValue(FKey InputAxisKey); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C0E3C(relative to base address)
		float GetHorizontalDotProductTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C0AD0(relative to base address)
		float GetHorizontalDistanceTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C0984(relative to base address)
		float GetGameTimeSinceCreation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C095C(relative to base address)
		float GetDotProductTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C05F8(relative to base address)
		float GetDistanceTo(AActor* OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF746ED521C(relative to base address)
		TArray GetComponentsByTag(UClass* ComponentClass, FName Tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74881B7A4(relative to base address)
		TArray GetComponentsByInterface(UClass* Interface); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C0538(relative to base address)
		UActorComponent GetComponentByClass(UClass* ComponentClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748891240(relative to base address)
		FName GetAttachParentSocketName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C040C(relative to base address)
		AActor GetAttachParentActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748BC9EFC(relative to base address)
		void GetAttachedActors(TArray<AActor*>& OutActors, bool bResetArray, bool bRecursivelyIncludeAttachedActors); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7492B6E1C(relative to base address)
		void GetAllChildActors(TArray<AActor*>& ChildActors, bool bIncludeDescendants); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C02D8(relative to base address)
		FVector GetActorUpVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74916B848(relative to base address)
		float GetActorTimeDilation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C02B0(relative to base address)
		float GetActorTickInterval(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748BA07FC(relative to base address)
		FVector GetActorScale3D(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7493A8A7C(relative to base address)
		FVector GetActorRightVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74916B6CC(relative to base address)
		FVector GetActorRelativeScale3D(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C027C(relative to base address)
		FVector GetActorForwardVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74908D720(relative to base address)
		void GetActorEyesViewPoint(FVector& OutLocation, FRotator& OutRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C0154(relative to base address)
		bool GetActorEnableCollision(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3C013C(relative to base address)
		void GetActorBounds(bool bOnlyCollidingComponents, FVector& Origin, FVector& BoxExtent, bool bIncludeFromChildActors); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748F37A14(relative to base address)
		void ForceNetUpdate(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748BF4CD8(relative to base address)
		void FlushNetDormancy(); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C0128(relative to base address)
		void FinishAddComponent(UActorComponent* Component, bool bManualAttachment, FTransform& RelativeTransform); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3BFEE8(relative to base address)
		UActorComponent FindComponentByTag(UClass* ComponentClass, FName Tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3BFE0C(relative to base address)
		void EnableInput(APlayerController* PlayerController); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C2D2BC4(relative to base address)
		void DisableInput(APlayerController* PlayerController); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3BFD88(relative to base address)
		void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3BFC54(relative to base address)
		void CreateInputComponent(UClass* InputComponentToCreate); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3BFBB8(relative to base address)
		bool CanTriggerResimulation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3BFB9C(relative to base address)
		void AddTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3BFB18(relative to base address)
		void AddTickPrerequisiteActor(AActor* PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3BFA94(relative to base address)
		UActorComponent AddComponentByClass(UClass* Class, bool bManualAttachment, FTransform& RelativeTransform, bool bDeferredFinish); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF747CAD65C(relative to base address)
		UActorComponent AddComponent(FName TemplateName, bool bManualAttachment, FTransform& RelativeTransform, UObject* ComponentTemplateContext, bool bDeferredFinish); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF747CAD264(relative to base address)
		bool ActorHasTag(FName Tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7493EC278(relative to base address)
	};


	// Class Engine.HUD
	// Inherited from AActor -> UObject
	// Size: 0xF0 (0x380 - 0x290)
	class AHUD : public AActor	
	{
	public:
		APlayerController* PlayerOwner; // 0x290(0x8)
		bool bLostFocusPaused : 1; // 0x298:0(0x1)
		bool bShowHUD : 1; // 0x298:1(0x1)
		bool bShowDebugInfo : 1; // 0x298:2(0x1)
		unsigned char UnknownData00_5[0x3]; // 0x299(0x3) UNKNOWN PROPERTY
		int32_t CurrentTargetIndex; // 0x29C(0x4)
		bool bShowHitBoxDebugInfo : 1; // 0x2A0:0(0x1)
		bool bShowOverlays : 1; // 0x2A0:1(0x1)
		bool bEnableDebugTextShadow : 1; // 0x2A0:2(0x1)
		unsigned char UnknownData01_5[0x7]; // 0x2A1(0x7) UNKNOWN PROPERTY
		TArray<AActor*> PostRenderedActors; // 0x2A8(0x10)
		unsigned char UnknownData02_6[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		TArray<FName> DebugDisplay; // 0x2C0(0x10)
		TArray<FName> ToggledDebugCategories; // 0x2D0(0x10)
		UCanvas* Canvas; // 0x2E0(0x8)
		UCanvas* DebugCanvas; // 0x2E8(0x8)
		TArray<FDebugTextInfo> DebugTextList; // 0x2F0(0x10)
		UClass* ShowDebugTargetDesiredClass; // 0x300(0x8)
		AActor* ShowDebugTargetActor; // 0x308(0x8)
		unsigned char UnknownData03_7[0x70]; // 0x310(0x70) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.HUD");
			return ret;
		}

		void ShowHUD(); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF748BA0AC4(relative to base address)
		void ShowDebugToggleSubCategory(FName category); // Flags: Final|RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C5F1524(relative to base address)
		void ShowDebugForReticleTargetToggle(UClass* DesiredClass); // Flags: Final|RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C5F1484(relative to base address)
		void ShowDebug(FName DebugType); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C394954(relative to base address)
		void RemoveDebugText(AActor* SrcActor, bool bLeaveDurationText); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C5F13BC(relative to base address)
		void RemoveAllDebugStrings(); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C5F1338(relative to base address)
		void ReceiveHitBoxRelease(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHitBoxEndCursorOver(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHitBoxClick(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHitBoxBeginCursorOver(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVector Project(FVector Location, bool bClampToZeroPlane); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5F112C(relative to base address)
		void PreviousDebugTarget(); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF749B193F0(relative to base address)
		void NextDebugTarget(); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF748629A08(relative to base address)
		void GetTextSize(FString Text, float& OutWidth, float& OutHeight, UFont* Font, float Scale); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5F06D4(relative to base address)
		APlayerController GetOwningPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C0DFEA8(relative to base address)
		APawn GetOwningPawn(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5F0338(relative to base address)
		void GetActorsInSelectionRectangle(UClass* ClassFilter, FVector2D& FirstPoint, FVector2D& SecondPoint, TArray<AActor*>& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C5EFB84(relative to base address)
		void DrawTextureSimple(UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5EF794(relative to base address)
		void DrawTexture(UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, FLinearColor TintColor, TEnumAsByte<EBlendMode> BlendMode, float Scale, bool bScalePosition, float Rotation, FVector2D RotPivot); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5EEED8(relative to base address)
		void DrawText(FString Text, FLinearColor TextColor, float ScreenX, float ScreenY, UFont* Font, float Scale, bool bScalePosition); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5EE99C(relative to base address)
		void DrawRect(FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5EE590(relative to base address)
		void DrawMaterialTriangle(UMaterialInterface* Material, FVector2D V0_Pos, FVector2D V1_Pos, FVector2D V2_Pos, FVector2D V0_UV, FVector2D V1_UV, FVector2D V2_UV, FLinearColor V0_Color, FLinearColor V1_Color, FLinearColor V2_Color); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5EDD78(relative to base address)
		void DrawMaterialSimple(UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5EDA70(relative to base address)
		void DrawMaterial(UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, FVector2D RotPivot); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5ED4DC(relative to base address)
		void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, FLinearColor LineColor, float LineThickness); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5ED210(relative to base address)
		void Deproject(float ScreenX, float ScreenY, FVector& WorldPosition, FVector& WorldDirection); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5ED034(relative to base address)
		void AddHitBox(FVector2D Position, FVector2D Size, FName InName, bool bConsumesInput, int32_t Priority); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5ECC20(relative to base address)
		void AddDebugText(FString DebugText, AActor* SrcActor, float duration, FVector Offset, FVector DesiredOffset, FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, UFont* InFont, float FontScale, bool bDrawShadow); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient, Memory Exec: 0x7FF74C5EC160(relative to base address)
	};


	// Class Engine.ActorComponent
	// Inherited from UObject
	// Size: 0x78 (0xA0 - 0x28)
	class UActorComponent : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FActorComponentTickFunction PrimaryComponentTick; // 0x30(0x30)
		TArray<FName> ComponentTags; // 0x60(0x10)
		TArray<UAssetUserData*> AssetUserData; // 0x70(0x10)
		unsigned char UnknownData01_6[0x4]; // 0x80(0x4) UNKNOWN PROPERTY
		int32_t UCSSerializationIndex; // 0x84(0x4)
		unsigned char UnknownBit02 : 1; // 0x88:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit03 : 1; // 0x88:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x88:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0x88:3(0x1) UNKNOWN PROPERTY
		bool bNetAddressable : 1; // 0x88:4(0x1)
		bool bReplicateUsingRegisteredSubObjectList : 1; // 0x88:5(0x1)
		bool bReplicates : 1; // 0x88:6(0x1)
		unsigned char UnknownData06_3[0x1]; // 0x89(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x8A:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x8A:1(0x1) UNKNOWN PROPERTY
		bool bAutoActivate : 1; // 0x8A:2(0x1)
		bool bIsActive : 1; // 0x8A:3(0x1)
		bool bEditableWhenInherited : 1; // 0x8A:4(0x1)
		unsigned char UnknownBit09 : 1; // 0x8A:5(0x1) UNKNOWN PROPERTY
		bool bCanEverAffectNavigation : 1; // 0x8A:6(0x1)
		unsigned char UnknownBit10 : 1; // 0x8A:7(0x1) UNKNOWN PROPERTY
		bool bIsEditorOnly : 1; // 0x8B:0(0x1)
		unsigned char UnknownData11_5[0x1]; // 0x8C(0x1) UNKNOWN PROPERTY
		EComponentCreationMethod CreationMethod; // 0x8D(0x1)
		FMulticastSparseDelegate OnComponentActivated; // 0x8E(0x1)
		FMulticastSparseDelegate OnComponentDeactivated; // 0x8F(0x1)
		unsigned char UnknownData12_7[0x10]; // 0x90(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActorComponent");
			return ret;
		}

		void ToggleActive(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748333524(relative to base address)
		void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7496FCC14(relative to base address)
		void SetTickableWhenPaused(bool bTickableWhenPaused); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A3C2C(relative to base address)
		void SetIsReplicated(bool ShouldReplicate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A33B0(relative to base address)
		void SetComponentTickIntervalAndCooldown(float TickInterval); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A332C(relative to base address)
		void SetComponentTickInterval(float TickInterval); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A32AC(relative to base address)
		void SetComponentTickEnabled(bool bEnabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7494048C8(relative to base address)
		void SetAutoActivate(bool bNewAutoActivate); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749559078(relative to base address)
		void SetActive(bool bNewActive, bool bReset); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7473D5740(relative to base address)
		void RemoveTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A2D18(relative to base address)
		void RemoveTickPrerequisiteActor(AActor* PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A2C94(relative to base address)
		void ReceiveTick(float DeltaSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_IsActive(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF746F37328(relative to base address)
		void K2_DestroyComponent(UObject* Object); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748A1E450(relative to base address)
		bool IsComponentTickEnabled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C45C1B8(relative to base address)
		bool IsBeingDestroyed(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4A2460(relative to base address)
		bool IsActive(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749172D90(relative to base address)
		AActor GetOwner(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7488CD12C(relative to base address)
		float GetComponentTickInterval(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7495769CC(relative to base address)
		void Deactivate(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF747B0DC80(relative to base address)
		bool ComponentHasTag(FName Tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7491B4B74(relative to base address)
		void AddTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A13B0(relative to base address)
		void AddTickPrerequisiteActor(AActor* PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4A132C(relative to base address)
		void Activate(bool bReset); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF747A94694(relative to base address)
	};


	// Class Engine.Info
	// Inherited from AActor -> UObject
	// Size: 0x0 (0x290 - 0x290)
	class AInfo : public AActor	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Info");
			return ret;
		}
	};


	// Class Engine.PlayerState
	// Inherited from AInfo -> AActor -> UObject
	// Size: 0xB8 (0x348 - 0x290)
	class APlayerState : public AInfo	
	{
	public:
		float Score; // 0x290(0x4)
		int32_t PlayerId; // 0x294(0x4)
		char CompressedPing; // 0x298(0x1)
		unsigned char UnknownData00_6[0x1]; // 0x299(0x1) UNKNOWN PROPERTY
		bool bShouldUpdateReplicatedPing : 1; // 0x29A:0(0x1)
		bool bIsSpectator : 1; // 0x29A:1(0x1)
		bool bOnlySpectator : 1; // 0x29A:2(0x1)
		bool bIsABot : 1; // 0x29A:3(0x1)
		unsigned char UnknownBit01 : 1; // 0x29A:4(0x1) UNKNOWN PROPERTY
		bool bIsInactive : 1; // 0x29A:5(0x1)
		bool bFromPreviousLevel : 1; // 0x29A:6(0x1)
		unsigned char UnknownData02_5[0x1]; // 0x29B(0x1) UNKNOWN PROPERTY
		int32_t StartTime; // 0x29C(0x4)
		UClass* EngineMessageClass; // 0x2A0(0x8)
		unsigned char UnknownData03_6[0x8]; // 0x2A8(0x8) UNKNOWN PROPERTY
		FString SavedNetworkAddress; // 0x2B0(0x10)
		FUniqueNetIdRepl UniqueID; // 0x2C0(0x30)
		unsigned char UnknownData04_6[0x8]; // 0x2F0(0x8) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnPawnSet; // 0x2F8(0x10)
		APawn* PawnPrivate; // 0x308(0x8)
		unsigned char UnknownData05_6[0x18]; // 0x310(0x18) UNKNOWN PROPERTY
		FString PlayerNamePrivate; // 0x328(0x10)
		unsigned char UnknownData06_7[0x10]; // 0x338(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlayerState");
			return ret;
		}

		void ReceiveOverrideWith(APlayerState* OldPlayerState); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveCopyProperties(APlayerState* NewPlayerState); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_UniqueId(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF747E38800(relative to base address)
		void OnRep_Score(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF748BA0AC4(relative to base address)
		void OnRep_PlayerName(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF747E38E94(relative to base address)
		void OnRep_PlayerId(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF749066BE0(relative to base address)
		void OnRep_bIsInactive(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF74C388930(relative to base address)
		void OnPawnPrivateDestroyed(AActor* InActor); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF748C3C230(relative to base address)
		bool IsSpectator(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B2270(relative to base address)
		bool IsOnlyASpectator(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B2254(relative to base address)
		bool IsABot(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B207C(relative to base address)
		float GetScore(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1D18(relative to base address)
		FString GetPlayerName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749366F08(relative to base address)
		int32_t GetPlayerId(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1D00(relative to base address)
		APlayerController GetPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1CDC(relative to base address)
		float GetPingInMilliseconds(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1C90(relative to base address)
		APawn GetPawn(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7495ED30C(relative to base address)
		char GetCompressedPing(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0534(relative to base address)
		FUniqueNetIdRepl BP_GetUniqueId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7AC82C(relative to base address)
	};


	// Class Engine.Controller
	// Inherited from AActor -> UObject
	// Size: 0x98 (0x328 - 0x290)
	class AController : public AActor	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x290(0x8) UNKNOWN PROPERTY
		APlayerState* PlayerState; // 0x298(0x8)
		unsigned char UnknownData01_6[0x8]; // 0x2A0(0x8) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x2A8(0x10)
		FMulticastInlineDelegate OnPossessedPawnChanged; // 0x2B8(0x10)
		FName StateName; // 0x2C8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x2CC(0x4) UNKNOWN PROPERTY
		APawn* Pawn; // 0x2D0(0x8)
		unsigned char UnknownData03_6[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		ACharacter* Character; // 0x2E0(0x8)
		USceneComponent* TransformComponent; // 0x2E8(0x8)
		unsigned char UnknownData04_6[0x18]; // 0x2F0(0x18) UNKNOWN PROPERTY
		FRotator ControlRotation; // 0x308(0x18)
		bool bAttachToPawn : 1; // 0x320:0(0x1)
		unsigned char UnknownData05_7[0x7]; // 0x321(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Controller");
			return ret;
		}

		void UnPossess(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C525D3C(relative to base address)
		void StopMovement(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74939D540(relative to base address)
		void SetInitialLocationAndRotation(FVector& NewLocation, FRotator& NewRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C522868(relative to base address)
		void SetIgnoreMoveInput(bool bNewMoveInput); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5227E4(relative to base address)
		void SetIgnoreLookInput(bool bNewLookInput); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C522760(relative to base address)
		void SetControlRotation(FRotator& NewRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C52132C(relative to base address)
		void ResetIgnoreMoveInput(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748BD1AB4(relative to base address)
		void ResetIgnoreLookInput(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF747B2BDA4(relative to base address)
		void ResetIgnoreInputFlags(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C520E08(relative to base address)
		void ReceiveUnPossess(APawn* UnpossessedPawn); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceivePossess(APawn* PossessedPawn); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveInstigatedAnyDamage(float Damage, UDamageType* DamageType, AActor* DamagedActor, AActor* DamageCauser); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Possess(APawn* InPawn); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C520C24(relative to base address)
		void OnRep_PlayerState(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF74851EA54(relative to base address)
		void OnRep_Pawn(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF74851EF54(relative to base address)
		bool LineOfSightTo(AActor* Other, FVector ViewPoint, bool bAlternateChecks); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C520834(relative to base address)
		APawn K2_GetPawn(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749B404A0(relative to base address)
		bool IsPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5207A0(relative to base address)
		bool IsMoveInputIgnored(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C520778(relative to base address)
		bool IsLookInputIgnored(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C520750(relative to base address)
		bool IsLocalPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749C98AEC(relative to base address)
		bool IsLocalController(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749C64878(relative to base address)
		AActor GetViewTarget(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748887A40(relative to base address)
		void GetPlayerViewPoint(FVector& Location, FRotator& Rotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C51E08C(relative to base address)
		FRotator GetDesiredRotation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C51CD54(relative to base address)
		FRotator GetControlRotation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C51CB40(relative to base address)
		void ClientSetRotation(FRotator NewRotation, bool bResetCamera); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient|NetValidate, Memory Exec: 0x7FF74C51A8C8(relative to base address)
		void ClientSetLocation(FVector NewLocation, FRotator NewRotation); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient|NetValidate, Memory Exec: 0x7FF74C51A678(relative to base address)
	};


	// Class Engine.PlayerController
	// Inherited from AController -> AActor -> UObject
	// Size: 0x520 (0x848 - 0x328)
	class APlayerController : public AController	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x328(0x8) UNKNOWN PROPERTY
		UPlayer* Player; // 0x330(0x8)
		APawn* AcknowledgedPawn; // 0x338(0x8)
		AHUD* MyHUD; // 0x340(0x8)
		APlayerCameraManager* PlayerCameraManager; // 0x348(0x8)
		UClass* PlayerCameraManagerClass; // 0x350(0x8)
		bool bAutoManageActiveCameraTarget; // 0x358(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x359(0x7) UNKNOWN PROPERTY
		FRotator TargetViewRotation; // 0x360(0x18)
		unsigned char UnknownData02_6[0x18]; // 0x378(0x18) UNKNOWN PROPERTY
		float SmoothTargetViewRotationSpeed; // 0x390(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x394(0x4) UNKNOWN PROPERTY
		TArray<AActor*> HiddenActors; // 0x398(0x10)
		TArray<TWeakObjectPtr> HiddenPrimitiveComponents; // 0x3A8(0x10)
		unsigned char UnknownData04_6[0x4]; // 0x3B8(0x4) UNKNOWN PROPERTY
		float LastSpectatorStateSynchTime; // 0x3BC(0x4)
		FVector LastSpectatorSyncLocation; // 0x3C0(0x18)
		FRotator LastSpectatorSyncRotation; // 0x3D8(0x18)
		int32_t ClientCap; // 0x3F0(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x3F4(0x4) UNKNOWN PROPERTY
		UCheatManager* CheatManager; // 0x3F8(0x8)
		UClass* CheatClass; // 0x400(0x8)
		UPlayerInput* PlayerInput; // 0x408(0x8)
		TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x410(0x10)
		unsigned char UnknownData06_6[0x80]; // 0x420(0x80) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x4A0:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x4A0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x4A0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x4A0:3(0x1) UNKNOWN PROPERTY
		bool bPlayerIsWaiting : 1; // 0x4A0:4(0x1)
		unsigned char UnknownData11_5[0x3]; // 0x4A1(0x3) UNKNOWN PROPERTY
		char NetPlayerIndex; // 0x4A4(0x1)
		unsigned char UnknownData12_6[0x5B]; // 0x4A5(0x5B) UNKNOWN PROPERTY
		UNetConnection* PendingSwapConnection; // 0x500(0x8)
		UNetConnection* NetConnection; // 0x508(0x8)
		unsigned char UnknownData13_6[0x18]; // 0x510(0x18) UNKNOWN PROPERTY
		float InputYawScale; // 0x528(0x4)
		float InputPitchScale; // 0x52C(0x4)
		float InputRollScale; // 0x530(0x4)
		bool bShowMouseCursor : 1; // 0x534:0(0x1)
		bool bEnableClickEvents : 1; // 0x534:1(0x1)
		bool bEnableTouchEvents : 1; // 0x534:2(0x1)
		bool bEnableMouseOverEvents : 1; // 0x534:3(0x1)
		bool bEnableTouchOverEvents : 1; // 0x534:4(0x1)
		bool bForceFeedbackEnabled : 1; // 0x534:5(0x1)
		bool bEnableMotionControls : 1; // 0x534:6(0x1)
		bool bEnableStreamingSource : 1; // 0x534:7(0x1)
		bool bStreamingSourceShouldActivate : 1; // 0x535:0(0x1)
		bool bStreamingSourceShouldBlockOnSlowStreaming : 1; // 0x535:1(0x1)
		unsigned char UnknownData14_5[0x2]; // 0x536(0x2) UNKNOWN PROPERTY
		EStreamingSourcePriority StreamingSourcePriority; // 0x538(0x1)
		unsigned char UnknownData15_6[0x3]; // 0x539(0x3) UNKNOWN PROPERTY
		FColor StreamingSourceDebugColor; // 0x53C(0x4)
		TArray<FStreamingSourceShape> StreamingSourceShapes; // 0x540(0x10)
		float ForceFeedbackScale; // 0x550(0x4)
		unsigned char UnknownData16_6[0x4]; // 0x554(0x4) UNKNOWN PROPERTY
		TArray<FKey> ClickEventKeys; // 0x558(0x10)
		TEnumAsByte<EMouseCursor> DefaultMouseCursor; // 0x568(0x1)
		TEnumAsByte<EMouseCursor> CurrentMouseCursor; // 0x569(0x1)
		TEnumAsByte<ECollisionChannel> DefaultClickTraceChannel; // 0x56A(0x1)
		TEnumAsByte<ECollisionChannel> CurrentClickTraceChannel; // 0x56B(0x1)
		float HitResultTraceDistance; // 0x56C(0x4)
		uint16_t SeamlessTravelCount; // 0x570(0x2)
		uint16_t LastCompletedSeamlessTravelCount; // 0x572(0x2)
		unsigned char UnknownData17_6[0x84]; // 0x574(0x84) UNKNOWN PROPERTY
		UInputComponent* InactiveStateInputComponent; // 0x5F8(0x8)
		unsigned char UnknownBit18 : 1; // 0x600:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit19 : 1; // 0x600:1(0x1) UNKNOWN PROPERTY
		bool bShouldPerformFullTickWhenPaused : 1; // 0x600:2(0x1)
		unsigned char UnknownData20_5[0x17]; // 0x601(0x17) UNKNOWN PROPERTY
		UTouchInterface* CurrentTouchInterface; // 0x618(0x8)
		UClass* OverridePlayerInputClass; // 0x620(0x8)
		unsigned char UnknownData21_6[0x78]; // 0x628(0x78) UNKNOWN PROPERTY
		ASpectatorPawn* SpectatorPawn; // 0x6A0(0x8)
		unsigned char UnknownData22_6[0x4]; // 0x6A8(0x4) UNKNOWN PROPERTY
		bool bIsLocalPlayerController; // 0x6AC(0x1)
		unsigned char UnknownData23_6[0x3]; // 0x6AD(0x3) UNKNOWN PROPERTY
		FVector SpawnLocation; // 0x6B0(0x18)
		unsigned char UnknownData24_7[0x180]; // 0x6C8(0x180) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlayerController");
			return ret;
		}

		bool WasInputKeyJustReleased(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B5634(relative to base address)
		bool WasInputKeyJustPressed(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B5478(relative to base address)
		void ToggleSpeaking(bool bInSpeaking); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B53F4(relative to base address)
		void TestServerLevelVisibilityChange(FName PackageName, FName Filename); // Flags: Final|RequiredAPI|Exec|Native|Private, Memory Exec: 0x7FF74C7B5350(relative to base address)
		void SwitchLevel(FString URL); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B52BC(relative to base address)
		bool StreamingSourceShouldBlockOnSlowStreaming(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B5294(relative to base address)
		bool StreamingSourceShouldActivate(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B526C(relative to base address)
		void StopHapticEffect(EControllerHand Hand); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B51EC(relative to base address)
		void StartFire(char FireModeNum); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B5168(relative to base address)
		void SetVirtualJoystickVisibility(bool bVisible); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B50E4(relative to base address)
		void SetViewTargetWithBlend(AActor* NewViewTarget, float BlendTime, TEnumAsByte<EViewTargetBlendFunction> BlendFunc, float BlendExp, bool bLockOutgoing); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4F5C(relative to base address)
		void SetName(FString S); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B4EC8(relative to base address)
		void SetMouseLocation(int32_t X, int32_t Y); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4E08(relative to base address)
		void SetMouseCursorWidget(TEnumAsByte<EMouseCursor> Cursor, UUserWidget* CursorWidget); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4D04(relative to base address)
		void SetMotionControlsEnabled(bool bEnabled); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4C84(relative to base address)
		void SetHapticsByValue(float Frequency, float Amplitude, EControllerHand Hand); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4B88(relative to base address)
		void SetDisableHaptics(bool bNewDisabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4B04(relative to base address)
		void SetDeprecatedInputYawScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4A84(relative to base address)
		void SetDeprecatedInputRollScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4A04(relative to base address)
		void SetDeprecatedInputPitchScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B4984(relative to base address)
		void SetControllerLightColor(FColor Color); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C7B4878(relative to base address)
		void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B46CC(relative to base address)
		void SetAudioListenerOverride(USceneComponent* AttachToComponent, FVector Location, FRotator Rotation); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C7B4498(relative to base address)
		void SetAudioListenerAttenuationOverride(USceneComponent* AttachToComponent, FVector AttenuationLocationOVerride); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C7B4334(relative to base address)
		void ServerViewSelf(FViewTargetTransitionParams TransitionParams); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B41E0(relative to base address)
		void ServerViewPrevPlayer(); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B4194(relative to base address)
		void ServerViewNextPlayer(); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B4148(relative to base address)
		void ServerVerifyViewTarget(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B40FC(relative to base address)
		void ServerUpdateMultipleLevelsVisibility(TArray<FUpdateLevelVisibilityLevelInfo> LevelVisibilities); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B4004(relative to base address)
		void ServerUpdateLevelVisibility(FUpdateLevelVisibilityLevelInfo LevelVisibility); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF748189A58(relative to base address)
		void ServerUpdateCamera(FVector_NetQuantize CamLoc, int32_t CamPitchAndYaw); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B3DDC(relative to base address)
		void ServerUnmutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B3C3C(relative to base address)
		void ServerUnblockPlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B3A9C(relative to base address)
		void ServerToggleAILogging(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B3A50(relative to base address)
		void ServerShortTimeout(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF7498450EC(relative to base address)
		void ServerSetSpectatorWaiting(bool bWaiting); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B39A0(relative to base address)
		void ServerSetSpectatorLocation(FVector NewLoc, FRotator NewRot); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|HasDefaults|NetValidate, Memory Exec: 0x7FF74C7B3750(relative to base address)
		void ServerSendLatestAsyncPhysicsTimestamp(FAsyncPhysicsTimestamp Timestamp); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer, Memory Exec: 0x7FF74C7B3634(relative to base address)
		void ServerRestartPlayer(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B35E8(relative to base address)
		void ServerRecvClientInputFrame(int32_t RecvClientInputFrame, TArray<char> Data); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer, Memory Exec: 0x7FF74C7B3510(relative to base address)
		void ServerPause(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B34C4(relative to base address)
		void ServerNotifyLoadedWorld(FName WorldPackageName); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B3408(relative to base address)
		void ServerMutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B3268(relative to base address)
		void ServerExecRPC(FString Msg); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B31B0(relative to base address)
		void ServerExec(FString Msg); // Flags: Final|RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B3138(relative to base address)
		void ServerCheckClientPossessionReliable(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B30EC(relative to base address)
		void ServerCheckClientPossession(); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B30A0(relative to base address)
		void ServerChangeName(FString S); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B2FE8(relative to base address)
		void ServerCamera(FName NewMode); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B2F4C(relative to base address)
		void ServerBlockPlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B2DAC(relative to base address)
		void ServerAcknowledgePossession(APawn* P); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate, Memory Exec: 0x7FF74C7B2D0C(relative to base address)
		void SendToConsole(FString Command); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B2C78(relative to base address)
		void RestartLevel(); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF749253B5C(relative to base address)
		void ResetControllerLightColor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B2C64(relative to base address)
		bool ProjectWorldLocationToScreen(FVector WorldLocation, FVector2D& ScreenLocation, bool bPlayerViewportRelative); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B299C(relative to base address)
		void PlayHapticEffect(UHapticFeedbackEffect_Base* HapticEffect, EControllerHand Hand, float Scale, bool bLoop); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B285C(relative to base address)
		void PlayDynamicForceFeedback(float Intensity, float duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, TEnumAsByte<EDynamicForceFeedbackAction> Action, FLatentActionInfo LatentInfo); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B257C(relative to base address)
		void Pause(); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B2564(relative to base address)
		void OnServerStartedVisualLogger(bool bIsLogging); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7B24E0(relative to base address)
		void LocalTravel(FString URL); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B244C(relative to base address)
		void K2_ClientPlayForceFeedback(UForceFeedbackEffect* ForceFeedbackEffect, FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7B22B4(relative to base address)
		bool IsStreamingSourceEnabled(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B228C(relative to base address)
		bool IsInputKeyDown(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B2098(relative to base address)
		void GetViewportSize(int32_t& SizeX, int32_t& SizeY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1F20(relative to base address)
		void GetStreamingSourceShapes(TArray<FStreamingSourceShape>& OutShapes); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1E80(relative to base address)
		EStreamingSourcePriority GetStreamingSourcePriority(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1E58(relative to base address)
		void GetStreamingSourceLocationAndRotation(FVector& OutLocation, FRotator& OutRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1D30(relative to base address)
		ASpectatorPawn GetSpectatorPawn(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7493F160C(relative to base address)
		FPlatformUserId GetPlatformUserId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1CB0(relative to base address)
		UClass GetOverridePlayerInputClass(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1C08(relative to base address)
		bool GetMousePosition(float& LocationX, float& LocationY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1B20(relative to base address)
		FVector GetInputVectorKeyState(FKey Key); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1950(relative to base address)
		void GetInputTouchState(TEnumAsByte<ETouchIndex> FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B17E0(relative to base address)
		void GetInputMouseDelta(float& DeltaX, float& DeltaY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1708(relative to base address)
		void GetInputMotionState(FVector& Tilt, FVector& RotationRate, FVector& Gravity, FVector& Acceleration); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B1498(relative to base address)
		float GetInputKeyTimeDown(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B12D8(relative to base address)
		void GetInputAnalogStickState(TEnumAsByte<EControllerAnalogStick> WhichStick, float& StickX, float& StickY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B11B8(relative to base address)
		float GetInputAnalogKeyState(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0FF8(relative to base address)
		AHUD GetHUD(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7496FE348(relative to base address)
		bool GetHitResultUnderFingerForObjects(TEnumAsByte<ETouchIndex> FingerIndex, TArray<TEnumAsByte>& ObjectTypes, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0DF0(relative to base address)
		bool GetHitResultUnderFingerByChannel(TEnumAsByte<ETouchIndex> FingerIndex, TEnumAsByte<ETraceTypeQuery> TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0C40(relative to base address)
		bool GetHitResultUnderFinger(TEnumAsByte<ETouchIndex> FingerIndex, TEnumAsByte<ECollisionChannel> TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0A90(relative to base address)
		bool GetHitResultUnderCursorForObjects(TArray<TEnumAsByte>& ObjectTypes, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B08D0(relative to base address)
		bool GetHitResultUnderCursorByChannel(TEnumAsByte<ETraceTypeQuery> TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0768(relative to base address)
		bool GetHitResultUnderCursor(TEnumAsByte<ECollisionChannel> TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0600(relative to base address)
		FVector GetFocalLocation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B05C4(relative to base address)
		float GetDeprecatedInputYawScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B059C(relative to base address)
		float GetDeprecatedInputRollScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B0574(relative to base address)
		float GetDeprecatedInputPitchScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7B054C(relative to base address)
		void FOV(float NewFOV); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7B0498(relative to base address)
		void EnableCheats(); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7AFFC4(relative to base address)
		bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, FVector& WorldLocation, FVector& WorldDirection); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7AFDE8(relative to base address)
		bool DeprojectMousePositionToWorld(FVector& WorldLocation, FVector& WorldDirection); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C7AFC84(relative to base address)
		void ConsoleKey(FKey Key); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7AFAD0(relative to base address)
		void ClientWasKicked(FText KickReason); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AFA3C(relative to base address)
		void ClientVoiceHandshakeComplete(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF749C98494(relative to base address)
		void ClientUpdateMultipleLevelsStreamingStatus(TArray<FUpdateLevelStreamingLevelStatus> LevelStatuses); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AF9A8(relative to base address)
		void ClientUpdateLevelStreamingStatus(FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32_t LODIndex, FNetLevelVisibilityTransactionId TransactionId, bool bNewShouldBlockOnUnload); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AF698(relative to base address)
		void ClientUnmutePlayers(TArray<FUniqueNetIdRepl> PlayerIds); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AF5E4(relative to base address)
		void ClientUnmutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AF480(relative to base address)
		void ClientTravelInternal(FString URL, TEnumAsByte<ETravelType> TravelType, bool bSeamless, FGuid MapPackageGuid); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient, Memory Exec: 0x7FF74C7AF28C(relative to base address)
		void ClientTravel(FString URL, TEnumAsByte<ETravelType> TravelType, bool bSeamless, FGuid MapPackageGuid); // Flags: Final|RequiredAPI|Native|Public|HasDefaults, Memory Exec: 0x7FF74C7AF09C(relative to base address)
		void ClientTeamMessage(APlayerState* SenderPlayerState, FString S, FName Type, float MsgLifeTime); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AEF44(relative to base address)
		void ClientStopForceFeedback(UForceFeedbackEffect* ForceFeedbackEffect, FName Tag); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable, Memory Exec: 0x7FF7485D1DD4(relative to base address)
		void ClientStopCameraShakesFromSource(UCameraShakeSourceComponent* SourceComponent, bool bImmediately); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AEE7C(relative to base address)
		void ClientStopCameraShake(UClass* Shake, bool bImmediately); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable, Memory Exec: 0x7FF74C7AED98(relative to base address)
		void ClientStartOnlineSession(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AED80(relative to base address)
		void ClientStartCameraShakeFromSource(UClass* Shake, UCameraShakeSourceComponent* SourceComponent); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AECA4(relative to base address)
		void ClientStartCameraShake(UClass* Shake, float Scale, ECameraShakePlaySpace Playspace, FRotator UserPlaySpaceRot); // Flags: RequiredAPI|Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable, Memory Exec: 0x7FF7486B1F08(relative to base address)
		void ClientSpawnGenericCameraLensEffect(UClass* LensEffectEmitterClass); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient|BlueprintCallable, Memory Exec: 0x7FF74C7AEC08(relative to base address)
		void ClientSpawnCameraLensEffect(UClass* LensEffectEmitterClass); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient, Memory Exec: 0x7FF74C7AEB6C(relative to base address)
		void ClientSetViewTarget(AActor* A, FViewTargetTransitionParams TransitionParams); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE8E0(relative to base address)
		void ClientSetupNetworkPhysicsTimestamp(FAsyncPhysicsTimestamp Timestamp); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AEA50(relative to base address)
		void ClientSetSpectatorWaiting(bool bWaiting); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE85C(relative to base address)
		void ClientSetHUD(UClass* NewHUDClass); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable, Memory Exec: 0x7FF749AC461C(relative to base address)
		void ClientSetForceMipLevelsToBeResident(UMaterialInterface* Material, float ForceDuration, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE760(relative to base address)
		void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE608(relative to base address)
		void ClientSetCameraMode(FName NewCamMode); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE584(relative to base address)
		void ClientSetCameraFade(bool bEnableFading, FColor FadeColor, FVector2D FadeAlpha, float FadeTime, bool bFadeAudio, bool bHoldWhenFinished); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient, Memory Exec: 0x7FF74C7AE120(relative to base address)
		void ClientSetBlockOnAsyncLoading(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE108(relative to base address)
		void ClientReturnToMainMenuWithTextReason(FText ReturnReason); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AE074(relative to base address)
		void ClientRetryClientRestart(APawn* NewPawn); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADFF0(relative to base address)
		void ClientRestart(APawn* NewPawn); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADF6C(relative to base address)
		void ClientReset(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADF54(relative to base address)
		void ClientRepObjRef(UObject* Object); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADED0(relative to base address)
		void ClientRecvServerAckFrameDebug(char NumBuffered, float TargetNumBufferedCmds); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADE08(relative to base address)
		void ClientRecvServerAckFrame(int32_t LastProcessedInputFrame, int32_t RecvServerFrameNumber, int8_t TimeDilation); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADC88(relative to base address)
		void ClientReceiveLocalizedMessage(UClass* Message, int32_t SWITCH, APlayerState* RelatedPlayerState, APlayerState* RelatedPlayerState, UObject* OptionalObject); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ADAC4(relative to base address)
		void ClientPrestreamTextures(AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD980(relative to base address)
		void ClientPrepareMapChange(FName LevelName, bool bFirst, bool bLast); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD880(relative to base address)
		void ClientPlaySoundAtLocation(USoundBase* Sound, FVector Location, float VolumeMultiplier, float PitchMultiplier); // Flags: RequiredAPI|Net|Native|Event|Public|HasDefaults|NetClient, Memory Exec: 0x7FF74C7AD5A0(relative to base address)
		void ClientPlaySound(USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD4A4(relative to base address)
		void ClientPlayForceFeedback_Internal(UForceFeedbackEffect* ForceFeedbackEffect, FForceFeedbackParameters Params); // Flags: Final|RequiredAPI|Net|Native|Event|Private|NetClient, Memory Exec: 0x7FF7485D1FC8(relative to base address)
		void ClientMutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD340(relative to base address)
		void ClientMessage(FString S, FName Type, float MsgLifeTime); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD224(relative to base address)
		void ClientIgnoreMoveInput(bool bIgnore); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD1A0(relative to base address)
		void ClientIgnoreLookInput(bool bIgnore); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD11C(relative to base address)
		void ClientGotoState(FName NewState); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD098(relative to base address)
		void ClientGameEnded(AActor* EndGameFocus, bool bIsWinner); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C39C51C(relative to base address)
		void ClientForceGarbageCollection(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD080(relative to base address)
		void ClientFlushLevelStreaming(); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD040(relative to base address)
		void ClientEndOnlineSession(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7AD028(relative to base address)
		void ClientEnableNetworkVoice(bool bEnable); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF749544124(relative to base address)
		void ClientCorrectionAsyncPhysicsTimestamp(FAsyncPhysicsTimestamp Timestamp); // Flags: Final|RequiredAPI|Net|Native|Event|Private|NetClient, Memory Exec: 0x7FF74C7ACF0C(relative to base address)
		void ClientCommitMapChange(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ACEF4(relative to base address)
		void ClientClearCameraLensEffects(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable, Memory Exec: 0x7FF74C7ACEDC(relative to base address)
		void ClientCapBandwidth(int32_t Cap); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF749A90608(relative to base address)
		void ClientCancelPendingMapChange(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74736AB18(relative to base address)
		void ClientAddTextureStreamingLoc(FVector InLoc, float duration, bool bOverrideLocation); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient, Memory Exec: 0x7FF74C7ACC54(relative to base address)
		void ClientAckUpdateLevelVisibility(FName PackageName, FNetLevelVisibilityTransactionId TransactionId, bool bClientAckCanMakeVisible); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient, Memory Exec: 0x7FF74C7ACA50(relative to base address)
		void ClientAckTimeDilation(float TimeDilation, int32_t ServerStep); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient, Memory Exec: 0x7FF74C7AC988(relative to base address)
		void ClearAudioListenerOverride(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC960(relative to base address)
		void ClearAudioListenerAttenuationOverride(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC938(relative to base address)
		bool CanRestartPlayer(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC910(relative to base address)
		void Camera(FName NewMode); // Flags: RequiredAPI|Exec|Native|Public, Memory Exec: 0x7FF74C7AC88C(relative to base address)
		void AddYawInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC7A8(relative to base address)
		void AddRollInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC724(relative to base address)
		void AddPitchInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC6A0(relative to base address)
		void ActivateTouchInterface(UTouchInterface* NewTouchInterface); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C7AC598(relative to base address)
	};


	// Class Engine.Subsystem
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class USubsystem : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Subsystem");
			return ret;
		}
	};


	// Class Engine.WorldSubsystem
	// Inherited from USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UWorldSubsystem : public USubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.WorldSubsystem");
			return ret;
		}
	};


	// Class Engine.NavigationObjectBase
	// Inherited from AActor -> UObject
	// Size: 0x28 (0x2B8 - 0x290)
	class ANavigationObjectBase : public AActor	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x290(0x8) UNKNOWN PROPERTY
		UCapsuleComponent* CapsuleComponent; // 0x298(0x8)
		UBillboardComponent* GoodSprite; // 0x2A0(0x8)
		UBillboardComponent* BadSprite; // 0x2A8(0x8)
		bool bIsPIEPlayerStart : 1; // 0x2B0:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x2B1(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.NavigationObjectBase");
			return ret;
		}
	};


	// Class Engine.PlayerStart
	// Inherited from ANavigationObjectBase -> AActor -> UObject
	// Size: 0x8 (0x2C0 - 0x2B8)
	class APlayerStart : public ANavigationObjectBase	
	{
	public:
		FName PlayerStartTag; // 0x2B8(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x2BC(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlayerStart");
			return ret;
		}
	};


	// Class Engine.Pawn
	// Inherited from AActor -> UObject
	// Size: 0x80 (0x310 - 0x290)
	class APawn : public AActor	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x290(0x8) UNKNOWN PROPERTY
		bool bUseControllerRotationPitch : 1; // 0x298:0(0x1)
		bool bUseControllerRotationYaw : 1; // 0x298:1(0x1)
		bool bUseControllerRotationRoll : 1; // 0x298:2(0x1)
		bool bCanAffectNavigationGeneration : 1; // 0x298:3(0x1)
		unsigned char UnknownBit01 : 1; // 0x298:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit02 : 1; // 0x298:5(0x1) UNKNOWN PROPERTY
		bool bIsLocalViewTarget : 1; // 0x298:6(0x1)
		unsigned char UnknownData03_5[0x3]; // 0x299(0x3) UNKNOWN PROPERTY
		float BaseEyeHeight; // 0x29C(0x4)
		TEnumAsByte<EAutoReceiveInput> AutoPossessPlayer; // 0x2A0(0x1)
		EAutoPossessAI AutoPossessAI; // 0x2A1(0x1)
		char RemoteViewPitch; // 0x2A2(0x1)
		unsigned char UnknownData04_6[0x5]; // 0x2A3(0x5) UNKNOWN PROPERTY
		UClass* AIControllerClass; // 0x2A8(0x8)
		APlayerState* PlayerState; // 0x2B0(0x8)
		AController* LastHitBy; // 0x2B8(0x8)
		AController* Controller; // 0x2C0(0x8)
		AController* PreviousController; // 0x2C8(0x8)
		unsigned char UnknownData05_6[0x4]; // 0x2D0(0x4) UNKNOWN PROPERTY
		FMulticastSparseDelegate ReceiveControllerChangedDelegate; // 0x2D4(0x1)
		FMulticastSparseDelegate ReceiveRestartedDelegate; // 0x2D5(0x1)
		unsigned char UnknownData06_6[0x2]; // 0x2D6(0x2) UNKNOWN PROPERTY
		FVector ControlInputVector; // 0x2D8(0x18)
		FVector LastControlInputVector; // 0x2F0(0x18)
		UClass* OverrideInputComponentClass; // 0x308(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Pawn");
			return ret;
		}

		void SpawnDefaultController(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7489E627C(relative to base address)
		void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C76174C(relative to base address)
		void ReceiveUnpossessed(AController* OldController); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveRestarted(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceivePossessed(AController* NewController); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveControllerChanged(AController* OldController, AController* NewController); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PawnMakeNoise(float Loudness, FVector NoiseLocation, bool bUseNoiseMakerLocation, AActor* NoiseMaker); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C75F618(relative to base address)
		void OnRep_PlayerState(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF7475A8C1C(relative to base address)
		void OnRep_Controller(); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF74C75F5A0(relative to base address)
		bool IsPlayerControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748B1E3E0(relative to base address)
		bool IsPawnControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75F530(relative to base address)
		bool IsMoveInputIgnored(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75F508(relative to base address)
		bool IsLocallyViewed(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748B02A74(relative to base address)
		bool IsLocallyControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748C15F6C(relative to base address)
		bool IsControlled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75F4B0(relative to base address)
		bool IsBotControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75F3F8(relative to base address)
		FPlatformUserId GetPlatformUserId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75EDBC(relative to base address)
		FVector GetPendingMovementInputVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75ED94(relative to base address)
		UClass GetOverrideInputComponentClass(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75EC74(relative to base address)
		FVector GetNavAgentLocation(); // Flags: Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75E940(relative to base address)
		UPawnMovementComponent GetMovementComponent(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748985DB4(relative to base address)
		AActor GetMovementBaseActor(APawn* Pawn); // Flags: Final|RequiredAPI|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C75E8C0(relative to base address)
		APlayerController GetLocalViewingPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748A94B08(relative to base address)
		FVector GetLastMovementInputVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75D4FC(relative to base address)
		FRotator GetControlRotation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75D380(relative to base address)
		AController GetController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7489C078C(relative to base address)
		FRotator GetBaseAimRotation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C75D1D0(relative to base address)
		void DetachFromControllerPendingDestroy(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748BD1AB4(relative to base address)
		FVector ConsumeMovementInputVector(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C75B548(relative to base address)
		void AddMovementInput(FVector WorldDirection, float ScaleValue, bool bForce); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C75B2A8(relative to base address)
		void AddControllerYawInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C75B224(relative to base address)
		void AddControllerRollInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C75B1A0(relative to base address)
		void AddControllerPitchInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C75B11C(relative to base address)
	};


	// Class Engine.BlueprintFunctionLibrary
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBlueprintFunctionLibrary : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintFunctionLibrary");
			return ret;
		}
	};


	// Class Engine.SceneComponent
	// Inherited from UActorComponent -> UObject
	// Size: 0x180 (0x220 - 0xA0)
	class USceneComponent : public UActorComponent	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0xA0(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr<APhysicsVolume*> PhysicsVolume; // 0xA8(0x8)
		USceneComponent* AttachParent; // 0xB0(0x8)
		FName AttachSocketName; // 0xB8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xBC(0x4) UNKNOWN PROPERTY
		TArray<USceneComponent*> AttachChildren; // 0xC0(0x10)
		TArray<USceneComponent*> ClientAttachedChildren; // 0xD0(0x10)
		unsigned char UnknownData02_6[0x40]; // 0xE0(0x40) UNKNOWN PROPERTY
		FVector RelativeLocation; // 0x120(0x18)
		FRotator RelativeRotation; // 0x138(0x18)
		FVector RelativeScale3D; // 0x150(0x18)
		FVector ComponentVelocity; // 0x168(0x18)
		bool bComponentToWorldUpdated : 1; // 0x180:0(0x1)
		unsigned char UnknownBit03 : 1; // 0x180:1(0x1) UNKNOWN PROPERTY
		bool bAbsoluteLocation : 1; // 0x180:2(0x1)
		bool bAbsoluteRotation : 1; // 0x180:3(0x1)
		bool bAbsoluteScale : 1; // 0x180:4(0x1)
		bool bVisible : 1; // 0x180:5(0x1)
		bool bShouldBeAttached : 1; // 0x180:6(0x1)
		bool bShouldSnapLocationWhenAttached : 1; // 0x180:7(0x1)
		bool bShouldSnapRotationWhenAttached : 1; // 0x181:0(0x1)
		bool bShouldSnapScaleWhenAttached : 1; // 0x181:1(0x1)
		bool bShouldUpdatePhysicsVolume : 1; // 0x181:2(0x1)
		bool bHiddenInGame : 1; // 0x181:3(0x1)
		bool bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x181:4(0x1)
		bool bUseAttachParentBound : 1; // 0x181:5(0x1)
		bool bComputeFastLocalBounds : 1; // 0x181:6(0x1)
		bool bComputeBoundsOnceForGame : 1; // 0x181:7(0x1)
		bool bComputedBoundsOnceForGame : 1; // 0x182:0(0x1)
		bool bIsNotRenderAttachmentRoot : 1; // 0x182:1(0x1)
		TEnumAsByte<EComponentMobility> Mobility; // 0x183(0x1)
		TEnumAsByte<EDetailMode> DetailMode; // 0x184(0x1)
		FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x185(0x1)
		unsigned char UnknownData04_7[0x9A]; // 0x186(0x9A) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SceneComponent");
			return ret;
		}

		void ToggleVisibility(bool bPropagateToChildren); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A170(relative to base address)
		void SetWorldScale3D(FVector NewScale); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF747B27950(relative to base address)
		void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7471957B8(relative to base address)
		void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A0F0(relative to base address)
		void SetRelativeScale3D(FVector NewScale3D); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748E54C2C(relative to base address)
		void SetMobility(TEnumAsByte<EComponentMobility> NewMobility); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A06C(relative to base address)
		void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74898C3F8(relative to base address)
		void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749071BE4(relative to base address)
		void ResetRelativeTransform(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A058(relative to base address)
		void OnRep_Visibility(bool OldValue); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF74C399E6C(relative to base address)
		void OnRep_Transform(); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF74913F708(relative to base address)
		void OnRep_AttachSocketName(); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF74C399E40(relative to base address)
		void OnRep_AttachParent(); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF7492DA7BC(relative to base address)
		void OnRep_AttachChildren(); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF748D47C70(relative to base address)
		void K2_SetWorldTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748D66364(relative to base address)
		void K2_SetWorldRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF747B1FC3C(relative to base address)
		void K2_SetWorldLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF7493538EC(relative to base address)
		void K2_SetWorldLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748A27E9C(relative to base address)
		void K2_SetRelativeTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748ACCE64(relative to base address)
		void K2_SetRelativeRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF747195B50(relative to base address)
		void K2_SetRelativeLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3999CC(relative to base address)
		void K2_SetRelativeLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748CD9DC8(relative to base address)
		FTransform K2_GetComponentToWorld(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748C4D840(relative to base address)
		FVector K2_GetComponentScale(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3999A4(relative to base address)
		FRotator K2_GetComponentRotation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748E26BC8(relative to base address)
		FVector K2_GetComponentLocation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748BD5128(relative to base address)
		void K2_DetachFromComponent(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule, bool bCallModify); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748BF4F88(relative to base address)
		bool K2_AttachToComponent(USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74771B5FC(relative to base address)
		bool K2_AttachTo(USceneComponent* InParent, FName InSocketName, TEnumAsByte<EAttachLocation> AttachType, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C399864(relative to base address)
		void K2_AddWorldTransformKeepScale(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3995D4(relative to base address)
		void K2_AddWorldTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C399344(relative to base address)
		void K2_AddWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C398F9C(relative to base address)
		void K2_AddWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C398BF4(relative to base address)
		void K2_AddRelativeRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C39884C(relative to base address)
		void K2_AddRelativeLocation(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3984A4(relative to base address)
		void K2_AddLocalTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C398214(relative to base address)
		void K2_AddLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C397E6C(relative to base address)
		void K2_AddLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C397AC4(relative to base address)
		bool IsVisible(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749749248(relative to base address)
		bool IsSimulatingPhysics(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397A30(relative to base address)
		bool IsAnySimulatingPhysics(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397A08(relative to base address)
		FVector GetUpVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3979D4(relative to base address)
		FTransform GetSocketTransform(FName InSocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7488C0170(relative to base address)
		FRotator GetSocketRotation(FName InSocketName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749B44F60(relative to base address)
		FQuat GetSocketQuaternion(FName InSocketName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397930(relative to base address)
		FVector GetSocketLocation(FName InSocketName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748B1F4BC(relative to base address)
		bool GetShouldUpdatePhysicsVolume(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397914(relative to base address)
		FVector GetRightVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3978E0(relative to base address)
		FTransform GetRelativeTransform(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397864(relative to base address)
		APhysicsVolume GetPhysicsVolume(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397840(relative to base address)
		void GetParentComponents(TArray<USceneComponent*>& Parents); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3977A4(relative to base address)
		int32_t GetNumChildrenComponents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749336438(relative to base address)
		FVector GetForwardVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749892230(relative to base address)
		FVector GetComponentVelocity(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397768(relative to base address)
		void GetChildrenComponents(bool bIncludeAllDescendants, TArray<USceneComponent*>& Children); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF747CB84B0(relative to base address)
		USceneComponent GetChildComponent(int32_t ChildIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3976DC(relative to base address)
		FName GetAttachSocketName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3976C4(relative to base address)
		USceneComponent GetAttachParent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7491595E0(relative to base address)
		TArray GetAllSocketNames(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C397684(relative to base address)
		bool DoesSocketExist(FName InSocketName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7492AB038(relative to base address)
		void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3975BC(relative to base address)
	};


	// Class Engine.PrimitiveComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x2B0 (0x4D0 - 0x220)
	class UPrimitiveComponent : public USceneComponent	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x220(0x18) UNKNOWN PROPERTY
		float MinDrawDistance; // 0x238(0x4)
		float LDMaxDrawDistance; // 0x23C(0x4)
		float CachedMaxDrawDistance; // 0x240(0x4)
		TEnumAsByte<ESceneDepthPriorityGroup> DepthPriorityGroup; // 0x244(0x1)
		TEnumAsByte<ESceneDepthPriorityGroup> ViewOwnerDepthPriorityGroup; // 0x245(0x1)
		TEnumAsByte<EIndirectLightingCacheQuality> IndirectLightingCacheQuality; // 0x246(0x1)
		ELightmapType LightmapType; // 0x247(0x1)
		EHLODBatchingPolicy HLODBatchingPolicy; // 0x248(0x1)
		EShadowCacheInvalidationBehavior ShadowCacheInvalidationBehavior; // 0x249(0x1)
		bool bEnableAutoLODGeneration : 1; // 0x24A:0(0x1)
		bool bIsActorTextureStreamingBuiltData : 1; // 0x24A:1(0x1)
		bool bIsValidTextureStreamingBuiltData : 1; // 0x24A:2(0x1)
		bool bNeverDistanceCull : 1; // 0x24A:3(0x1)
		unsigned char UnknownBit01 : 1; // 0x24A:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit02 : 1; // 0x24A:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit03 : 1; // 0x24A:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x24A:7(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0x24B:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x24B:1(0x1) UNKNOWN PROPERTY
		bool bAlwaysCreatePhysicsState : 1; // 0x24B:2(0x1)
		bool bGenerateOverlapEvents : 1; // 0x24B:3(0x1)
		bool bMultiBodyOverlap : 1; // 0x24B:4(0x1)
		bool bTraceComplexOnMove : 1; // 0x24B:5(0x1)
		bool bReturnMaterialOnMove : 1; // 0x24B:6(0x1)
		bool bUseViewOwnerDepthPriorityGroup : 1; // 0x24B:7(0x1)
		bool bAllowCullDistanceVolume : 1; // 0x24C:0(0x1)
		bool bVisibleInReflectionCaptures : 1; // 0x24C:1(0x1)
		bool bVisibleInRealTimeSkyCaptures : 1; // 0x24C:2(0x1)
		bool bVisibleInRayTracing : 1; // 0x24C:3(0x1)
		bool bRenderInMainPass : 1; // 0x24C:4(0x1)
		bool bRenderInDepthPass : 1; // 0x24C:5(0x1)
		bool bReceivesDecals : 1; // 0x24C:6(0x1)
		bool bHoldout : 1; // 0x24C:7(0x1)
		bool bOwnerNoSee : 1; // 0x24D:0(0x1)
		bool bOnlyOwnerSee : 1; // 0x24D:1(0x1)
		bool bTreatAsBackgroundForOcclusion : 1; // 0x24D:2(0x1)
		bool bUseAsOccluder : 1; // 0x24D:3(0x1)
		bool bSelectable : 1; // 0x24D:4(0x1)
		bool bWantsEditorEffects : 1; // 0x24D:5(0x1)
		bool bForceMipStreaming : 1; // 0x24D:6(0x1)
		bool bHasPerInstanceHitProxies : 1; // 0x24D:7(0x1)
		bool CastShadow : 1; // 0x24E:0(0x1)
		bool bEmissiveLightSource : 1; // 0x24E:1(0x1)
		bool bAffectDynamicIndirectLighting : 1; // 0x24E:2(0x1)
		bool bAffectIndirectLightingWhileHidden : 1; // 0x24E:3(0x1)
		bool bAffectDistanceFieldLighting : 1; // 0x24E:4(0x1)
		bool bCastDynamicShadow : 1; // 0x24E:5(0x1)
		bool bCastStaticShadow : 1; // 0x24E:6(0x1)
		bool bCastVolumetricTranslucentShadow : 1; // 0x24E:7(0x1)
		bool bCastContactShadow : 1; // 0x24F:0(0x1)
		bool bSelfShadowOnly : 1; // 0x24F:1(0x1)
		bool bCastFarShadow : 1; // 0x24F:2(0x1)
		bool bCastInsetShadow : 1; // 0x24F:3(0x1)
		bool bCastCinematicShadow : 1; // 0x24F:4(0x1)
		bool bCastHiddenShadow : 1; // 0x24F:5(0x1)
		bool bCastShadowAsTwoSided : 1; // 0x24F:6(0x1)
		bool bLightAsIfStatic : 1; // 0x24F:7(0x1)
		bool bLightAttachmentsAsGroup : 1; // 0x250:0(0x1)
		bool bExcludeFromLightAttachmentGroup : 1; // 0x250:1(0x1)
		bool bReceiveMobileCSMShadows : 1; // 0x250:2(0x1)
		bool bSingleSampleShadowFromStationaryLights : 1; // 0x250:3(0x1)
		bool bIgnoreRadialImpulse : 1; // 0x250:4(0x1)
		bool bIgnoreRadialForce : 1; // 0x250:5(0x1)
		bool bApplyImpulseOnDamage : 1; // 0x250:6(0x1)
		bool bReplicatePhysicsToAutonomousProxy : 1; // 0x250:7(0x1)
		bool bFillCollisionUnderneathForNavmesh : 1; // 0x251:0(0x1)
		bool AlwaysLoadOnClient : 1; // 0x251:1(0x1)
		bool AlwaysLoadOnServer : 1; // 0x251:2(0x1)
		bool bUseEditorCompositing : 1; // 0x251:3(0x1)
		bool bIsBeingMovedByEditor : 1; // 0x251:4(0x1)
		bool bRenderCustomDepth : 1; // 0x251:5(0x1)
		bool bVisibleInSceneCaptureOnly : 1; // 0x251:6(0x1)
		bool bHiddenInSceneCapture : 1; // 0x251:7(0x1)
		bool bRayTracingFarField : 1; // 0x252:0(0x1)
		bool bIsFirstPerson : 1; // 0x252:1(0x1)
		unsigned char UnknownBit07 : 1; // 0x252:2(0x1) UNKNOWN PROPERTY
		bool bHasNoStreamableTextures : 1; // 0x252:3(0x1)
		bool bStaticWhenNotMoveable : 1; // 0x252:4(0x1)
		unsigned char UnknownData08_5[0x1]; // 0x253(0x1) UNKNOWN PROPERTY
		TEnumAsByte<EHasCustomNavigableGeometry> bHasCustomNavigableGeometry; // 0x254(0x1)
		unsigned char UnknownData09_6[0x1]; // 0x255(0x1) UNKNOWN PROPERTY
		TEnumAsByte<ECanBeCharacterBase> CanCharacterStepUpOn; // 0x256(0x1)
		FLightingChannels LightingChannels; // 0x257(0x1)
		unsigned char UnknownData10_6[0x18]; // 0x258(0x18) UNKNOWN PROPERTY
		int32_t RayTracingGroupId; // 0x270(0x4)
		int32_t VisibilityId; // 0x274(0x4)
		int32_t CustomDepthStencilValue; // 0x278(0x4)
		ERayTracingGroupCullingPriority RayTracingGroupCullingPriority; // 0x27C(0x1)
		ERendererStencilMask CustomDepthStencilWriteMask; // 0x27D(0x1)
		char ExcludeFromHLODLevels; // 0x27E(0x1)
		unsigned char UnknownData11_6[0x1]; // 0x27F(0x1) UNKNOWN PROPERTY
		FCustomPrimitiveData CustomPrimitiveData; // 0x280(0x10)
		FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x290(0x10)
		unsigned char UnknownData12_6[0x8]; // 0x2A0(0x8) UNKNOWN PROPERTY
		int32_t TranslucencySortPriority; // 0x2A8(0x4)
		float TranslucencySortDistanceOffset; // 0x2AC(0x4)
		TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2B0(0x10)
		int8_t VirtualTextureLodBias; // 0x2C0(0x1)
		int8_t VirtualTextureCullMips; // 0x2C1(0x1)
		int8_t VirtualTextureMinCoverage; // 0x2C2(0x1)
		ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2C3(0x1)
		unsigned char UnknownData13_6[0x8]; // 0x2C4(0x8) UNKNOWN PROPERTY
		float BoundsScale; // 0x2CC(0x4)
		unsigned char UnknownData14_6[0x30]; // 0x2D0(0x30) UNKNOWN PROPERTY
		TArray<AActor*> MoveIgnoreActors; // 0x300(0x10)
		TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x310(0x10)
		unsigned char UnknownData15_6[0x10]; // 0x320(0x10) UNKNOWN PROPERTY
		FBodyInstance BodyInstance; // 0x330(0x170)
		FMulticastSparseDelegate OnComponentHit; // 0x4A0(0x1)
		FMulticastSparseDelegate OnComponentBeginOverlap; // 0x4A1(0x1)
		FMulticastSparseDelegate OnComponentEndOverlap; // 0x4A2(0x1)
		FMulticastSparseDelegate OnComponentWake; // 0x4A3(0x1)
		FMulticastSparseDelegate OnComponentSleep; // 0x4A4(0x1)
		unsigned char UnknownData16_6[0x1]; // 0x4A5(0x1) UNKNOWN PROPERTY
		FMulticastSparseDelegate OnComponentPhysicsStateChanged; // 0x4A6(0x1)
		FMulticastSparseDelegate OnBeginCursorOver; // 0x4A7(0x1)
		FMulticastSparseDelegate OnEndCursorOver; // 0x4A8(0x1)
		FMulticastSparseDelegate OnClicked; // 0x4A9(0x1)
		FMulticastSparseDelegate OnReleased; // 0x4AA(0x1)
		FMulticastSparseDelegate OnInputTouchBegin; // 0x4AB(0x1)
		FMulticastSparseDelegate OnInputTouchEnd; // 0x4AC(0x1)
		FMulticastSparseDelegate OnInputTouchEnter; // 0x4AD(0x1)
		FMulticastSparseDelegate OnInputTouchLeave; // 0x4AE(0x1)
		unsigned char UnknownData17_6[0x11]; // 0x4AF(0x11) UNKNOWN PROPERTY
		UPrimitiveComponent* LODParentPrimitive; // 0x4C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PrimitiveComponent");
			return ret;
		}

		bool WasRecentlyRendered(float Tolerance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3949D8(relative to base address)
		void WakeRigidBody(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C394954(relative to base address)
		void WakeAllRigidBodies(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7491831D8(relative to base address)
		void SetWalkableSlopeOverride(FWalkableSlopeOverride& NewOverride); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3948B8(relative to base address)
		void SetVisibleInSceneCaptureOnly(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C394838(relative to base address)
		void SetVisibleInRayTracing(bool bNewVisibleInRayTracing); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3947B8(relative to base address)
		void SetVectorParameterForDefaultCustomPrimitiveData(FName ParameterName, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C394644(relative to base address)
		void SetVectorParameterForCustomPrimitiveData(FName ParameterName, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3944D0(relative to base address)
		void SetUseMACD(bool InUseMACD, FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C394408(relative to base address)
		void SetUseCCD(bool InUseCCD, FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C394340(relative to base address)
		void SetUpdateKinematicFromSimulation(bool bUpdateKinematicFromSimulation); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38ABD8(relative to base address)
		void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748E54598(relative to base address)
		void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7491FCEC8(relative to base address)
		void SetStaticWhenNotMoveable(bool bInStaticWhenNotMoveable); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3942C0(relative to base address)
		void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C394220(relative to base address)
		void SetSimulatePhysics(bool bSimulate); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39419C(relative to base address)
		void SetScalarParameterForDefaultCustomPrimitiveData(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3940D8(relative to base address)
		void SetScalarParameterForCustomPrimitiveData(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7492E2650(relative to base address)
		void SetRenderInMainPass(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C394058(relative to base address)
		void SetRenderInDepthPass(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C393FB8(relative to base address)
		void SetRenderCustomDepth(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF747B2A17C(relative to base address)
		void SetReceivesDecals(bool bNewReceivesDecals); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7488E3C7C(relative to base address)
		void SetPhysMaterialOverride(UPhysicalMaterial* NewPhysMaterial); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39349C(relative to base address)
		void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C393E28(relative to base address)
		void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, FName BoneName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C393D14(relative to base address)
		void SetPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C393A6C(relative to base address)
		void SetPhysicsAngularVelocityInRadians(FVector NewAngVel, bool bAddToCurrent, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3937C4(relative to base address)
		void SetPhysicsAngularVelocityInDegrees(FVector NewAngVel, bool bAddToCurrent, FName BoneName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C393520(relative to base address)
		void SetOwnerNoSee(bool bNewOwnerNoSee); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39341C(relative to base address)
		void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39339C(relative to base address)
		void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C393318(relative to base address)
		void SetMaxDepenetrationVelocity(FName BoneName, float InMaxDepenetrationVelocity); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C393250(relative to base address)
		void SetMaterialByName(FName MaterialSlotName, UMaterialInterface* Material); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C393188(relative to base address)
		void SetMaterial(int32_t ElementIndex, UMaterialInterface* Material); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748D66608(relative to base address)
		void SetMassScale(FName BoneName, float InMassScale); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3930C0(relative to base address)
		void SetMassOverrideInKg(FName BoneName, float MassInKg, bool bOverrideMass); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392FC4(relative to base address)
		void SetLinearDamping(float InDamping); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392F40(relative to base address)
		void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392E34(relative to base address)
		void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392D30(relative to base address)
		void SetIsFirstPerson(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392C90(relative to base address)
		void SetIgnoreBoundsForEditorFocus(bool bIgnore); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392C08(relative to base address)
		void SetHoldout(bool bNewHoldout); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392B88(relative to base address)
		void SetHiddenInSceneCapture(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392AE8(relative to base address)
		void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74940CA50(relative to base address)
		void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392984(relative to base address)
		void SetExcludeForSpecificHLODLevels(TArray<int32_t>& InExcludeForSpecificHLODLevels); // Flags: Final|RequiredAPI|Native|Private|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3928BC(relative to base address)
		void SetExcludedFromHLODLevel(EHLODLevelExclusion HLODLevel, bool bExcluded); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392A24(relative to base address)
		void SetEnableGravity(bool bGravityEnabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392838(relative to base address)
		void SetEmissiveLightSource(bool NewEmissiveLightSource); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392798(relative to base address)
		void SetDefaultCustomPrimitiveDataVector4(int32_t DataIndex, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C392624(relative to base address)
		void SetDefaultCustomPrimitiveDataVector3(int32_t DataIndex, FVector Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF746EA8C64(relative to base address)
		void SetDefaultCustomPrimitiveDataVector2(int32_t DataIndex, FVector2D Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3924D0(relative to base address)
		void SetDefaultCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF746EA91A0(relative to base address)
		void SetCustomPrimitiveDataVector4(int32_t DataIndex, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748D3C99C(relative to base address)
		void SetCustomPrimitiveDataVector3(int32_t DataIndex, FVector Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748DD3F0C(relative to base address)
		void SetCustomPrimitiveDataVector2(int32_t DataIndex, FVector2D Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C39237C(relative to base address)
		void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748A1EE8C(relative to base address)
		void SetCustomDepthStencilWriteMask(ERendererStencilMask WriteMaskBit); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3922F0(relative to base address)
		void SetCustomDepthStencilValue(int32_t Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF747B2A0FC(relative to base address)
		void SetCullDistance(float NewCullDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF746EDB120(relative to base address)
		void SetConstraintMode(TEnumAsByte<EDOFMode> ConstraintMode); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39226C(relative to base address)
		void SetCollisionResponseToChannel(TEnumAsByte<ECollisionChannel> Channel, TEnumAsByte<ECollisionResponse> NewResponse); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7492DEF88(relative to base address)
		void SetCollisionResponseToAllChannels(TEnumAsByte<ECollisionResponse> NewResponse); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3921E8(relative to base address)
		void SetCollisionProfileName(FName InCollisionProfileName, bool bUpdateOverlaps); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C392120(relative to base address)
		void SetCollisionObjectType(TEnumAsByte<ECollisionChannel> Channel); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39209C(relative to base address)
		void SetCollisionEnabled(TEnumAsByte<ECollisionEnabled> NewType); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748C19228(relative to base address)
		void SetCenterOfMass(FVector CenterOfMassOffset, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C391EB4(relative to base address)
		void SetCastShadow(bool NewCastShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748A9330C(relative to base address)
		void SetCastInsetShadow(bool bInCastInsetShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C391E34(relative to base address)
		void SetCastHiddenShadow(bool NewCastHiddenShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C391DB4(relative to base address)
		void SetCastContactShadow(bool bInCastContactShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C391D34(relative to base address)
		void SetBoundsScale(float NewBoundsScale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74969A1B0(relative to base address)
		void SetAngularDamping(float InDamping); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C391CB0(relative to base address)
		void SetAllUseMACD(bool InUseMACD); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C391C2C(relative to base address)
		void SetAllUseCCD(bool InUseCCD); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C391BA8(relative to base address)
		void SetAllPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3919BC(relative to base address)
		void SetAllPhysicsAngularVelocityInRadians(FVector& NewAngVel, bool bAddToCurrent); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C391864(relative to base address)
		void SetAllPhysicsAngularVelocityInDegrees(FVector& NewAngVel, bool bAddToCurrent); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C391710(relative to base address)
		void SetAllMassScale(float InMassScale); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39168C(relative to base address)
		void SetAffectIndirectLightingWhileHidden(bool bNewAffectIndirectLightingWhileHidden); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3915EC(relative to base address)
		void SetAffectDynamicIndirectLighting(bool bNewAffectDynamicIndirectLighting); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39156C(relative to base address)
		void SetAffectDistanceFieldLighting(bool NewAffectDistanceFieldLighting); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3914EC(relative to base address)
		FVector ScaleByMomentOfInertia(FVector InputVector, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3912DC(relative to base address)
		void PutRigidBodyToSleep(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39125C(relative to base address)
		bool K2_SphereTraceComponent(FVector TraceStart, FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C390AC8(relative to base address)
		bool K2_SphereOverlapComponent(FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3903F4(relative to base address)
		bool K2_LineTraceComponent(FVector TraceStart, FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF748A5CBD8(relative to base address)
		bool K2_IsQueryCollisionEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3903B0(relative to base address)
		bool K2_IsPhysicsCollisionEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C390380(relative to base address)
		bool K2_IsCollisionEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C390354(relative to base address)
		bool K2_BoxOverlapComponent(FVector InBoxCentre, FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38FC64(relative to base address)
		bool IsOverlappingComponent(UPrimitiveComponent* OtherComp); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38FAC8(relative to base address)
		bool IsOverlappingActor(AActor* Other); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38F9F0(relative to base address)
		bool IsMaterialSlotNameValid(FName MaterialSlotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38F95C(relative to base address)
		bool IsGravityEnabled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38F934(relative to base address)
		bool IsExcludedFromHLODLevel(EHLODLevelExclusion HLODLevel); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38F8A0(relative to base address)
		bool IsAnyRigidBodyAwake(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C38F878(relative to base address)
		void InvalidateLumenSurfaceCache(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38F84C(relative to base address)
		void IgnoreComponentWhenMoving(UPrimitiveComponent* Component, bool bShouldIgnore); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38F6C0(relative to base address)
		void IgnoreActorWhenMoving(AActor* Actor, bool bShouldIgnore); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38F5F8(relative to base address)
		FWalkableSlopeOverride GetWalkableSlopeOverride(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38F5D0(relative to base address)
		bool GetUpdateKinematicFromSimulation(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748840868(relative to base address)
		bool GetStaticWhenNotMoveable(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38F5B4(relative to base address)
		FVector GetPhysicsLinearVelocityAtPoint(FVector Point, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38E8B4(relative to base address)
		FVector GetPhysicsLinearVelocity(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38E814(relative to base address)
		FVector GetPhysicsAngularVelocityInRadians(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E774(relative to base address)
		FVector GetPhysicsAngularVelocityInDegrees(FName BoneName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E6D4(relative to base address)
		void GetOverlappingComponents(TArray<UPrimitiveComponent*>& OutOverlappingComponents); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E638(relative to base address)
		void GetOverlappingActors(TArray<AActor*>& OverlappingActors, UClass* ClassFilter); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749214230(relative to base address)
		int32_t GetNumMaterials(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748A1816C(relative to base address)
		float GetMaxDepenetrationVelocity(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38E5A4(relative to base address)
		TArray GetMaterialSlotNames(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E560(relative to base address)
		int32_t GetMaterialIndex(FName MaterialSlotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74931B4D0(relative to base address)
		UMaterialInterface GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E450(relative to base address)
		UMaterialInterface GetMaterialByName(FName MaterialSlotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E3BC(relative to base address)
		UMaterialInterface GetMaterial(int32_t ElementIndex); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7488542F0(relative to base address)
		float GetMassScale(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E328(relative to base address)
		float GetMass(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E2FC(relative to base address)
		float GetLinearDamping(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E2D0(relative to base address)
		FVector GetInertiaTensor(FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E228(relative to base address)
		bool GetIgnoreBoundsForEditorFocus(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E200(relative to base address)
		bool GetGenerateOverlapEvents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E1E4(relative to base address)
		TArray GetExcludeForSpecificHLODLevels(); // Flags: Final|RequiredAPI|Native|Private|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E134(relative to base address)
		int32_t GetCustomPrimitiveDataIndexForVectorParameter(FName ParameterName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38E06C(relative to base address)
		int32_t GetCustomPrimitiveDataIndexForScalarParameter(FName ParameterName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DFE0(relative to base address)
		TEnumAsByte GetCollisionResponseToChannel(TEnumAsByte<ECollisionChannel> Channel); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DF4C(relative to base address)
		FName GetCollisionProfileName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DF20(relative to base address)
		TEnumAsByte GetCollisionObjectType(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DEF8(relative to base address)
		TEnumAsByte GetCollisionEnabled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DED0(relative to base address)
		float GetClosestPointOnCollision(FVector& Point, FVector& OutPointOnBody, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7481F6D90(relative to base address)
		FVector GetCenterOfMass(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DE30(relative to base address)
		FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(FName BoneName, bool bGetWelded, int32_t Index); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DD1C(relative to base address)
		float GetAngularDamping(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38DCF0(relative to base address)
		UMaterialInstanceDynamic CreateDynamicMaterialInstance(int32_t ElementIndex, UMaterialInterface* SourceMaterial, FName OptionalName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74851A094(relative to base address)
		UMaterialInstanceDynamic CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, UMaterialInterface* Parent); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38DBB4(relative to base address)
		UMaterialInstanceDynamic CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38DB20(relative to base address)
		TArray CopyArrayOfMoveIgnoreComponents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38DAE0(relative to base address)
		TArray CopyArrayOfMoveIgnoreActors(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38DAA0(relative to base address)
		void ClearMoveIgnoreComponents(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38DA6C(relative to base address)
		void ClearMoveIgnoreActors(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C38DA58(relative to base address)
		bool CanCharacterStepUp(APawn* Pawn); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38D9C4(relative to base address)
		bool AllowHLODLevelsExclusion(); // Flags: Final|Native|Private|Const, Memory Exec: 0x7FF74C38D978(relative to base address)
		void AddVelocityChangeImpulseAtLocation(FVector Impulse, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38D6B8(relative to base address)
		void AddTorqueInRadians(FVector Torque, FName BoneName, bool bAccelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38D418(relative to base address)
		void AddTorqueInDegrees(FVector Torque, FName BoneName, bool bAccelChange); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38D17C(relative to base address)
		void AddRadialImpulse(FVector Origin, float Radius, float Strength, TEnumAsByte<ERadialImpulseFalloff> Falloff, bool bVelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38CD64(relative to base address)
		void AddRadialForce(FVector Origin, float Radius, float Strength, TEnumAsByte<ERadialImpulseFalloff> Falloff, bool bAccelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38C94C(relative to base address)
		void AddImpulseAtLocation(FVector Impulse, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38C68C(relative to base address)
		void AddImpulse(FVector Impulse, FName BoneName, bool bVelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38C3EC(relative to base address)
		void AddForceAtLocationLocal(FVector Force, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38C12C(relative to base address)
		void AddForceAtLocation(FVector Force, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38BE6C(relative to base address)
		void AddForce(FVector Force, FName BoneName, bool bAccelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38BBCC(relative to base address)
		void AddAngularImpulseInRadians(FVector Impulse, FName BoneName, bool bVelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38B92C(relative to base address)
		void AddAngularImpulseInDegrees(FVector Impulse, FName BoneName, bool bVelChange); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C38B690(relative to base address)
	};


	// Class Engine.MeshComponent
	// Inherited from UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x38 (0x500 - 0x4C8)
	class UMeshComponent : public UPrimitiveComponent	
	{
	public:
		TArray<UMaterialInterface*> OverrideMaterials; // 0x4C8(0x10)
		UMaterialInterface* OverlayMaterial; // 0x4D8(0x8)
		float OverlayMaterialMaxDrawDistance; // 0x4E0(0x4)
		bool bEnableMaterialParameterCaching : 1; // 0x4E4:0(0x1)
		unsigned char UnknownData00_7[0x13]; // 0x4E5(0x13) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MeshComponent");
			return ret;
		}

		void SetVectorParameterValueOnMaterials(FName ParameterName, FVector ParameterValue); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF747A0C584(relative to base address)
		void SetScalarParameterValueOnMaterials(FName ParameterName, float ParameterValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748708540(relative to base address)
		void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4EBFE0(relative to base address)
		void SetOverlayMaterial(UMaterialInterface* NewOverlayMaterial); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4EBF60(relative to base address)
		void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4E941C(relative to base address)
		bool PrestreamMeshLODs(float Seconds); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4E9384(relative to base address)
		float GetOverlayMaterialMaxDrawDistance(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4E7F28(relative to base address)
		UMaterialInterface GetOverlayMaterial(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749BC6B40(relative to base address)
		TArray GetMaterials(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74897C3D0(relative to base address)
	};


	// Class Engine.StaticMeshComponent
	// Inherited from UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x98 (0x590 - 0x4F8)
	class UStaticMeshComponent : public UMeshComponent	
	{
	public:
		int32_t ForcedLodModel; // 0x4F8(0x4)
		int32_t MinLOD; // 0x4FC(0x4)
		int32_t SubDivisionStepSize; // 0x500(0x4)
		FColor WireframeColorOverride; // 0x504(0x4)
		UStaticMesh* StaticMesh; // 0x508(0x8)
		int32_t WorldPositionOffsetDisableDistance; // 0x510(0x4)
		bool bForceNaniteForMasked : 1; // 0x514:0(0x1)
		bool bDisallowNanite : 1; // 0x514:1(0x1)
		bool bForceDisableNanite : 1; // 0x514:2(0x1)
		bool bEvaluateWorldPositionOffset : 1; // 0x514:3(0x1)
		bool bWorldPositionOffsetWritesVelocity : 1; // 0x514:4(0x1)
		bool bEvaluateWorldPositionOffsetInRayTracing : 1; // 0x514:5(0x1)
		unsigned char UnknownBit00 : 1; // 0x514:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit01 : 1; // 0x514:7(0x1) UNKNOWN PROPERTY
		bool bOverrideWireframeColor : 1; // 0x515:0(0x1)
		bool bOverrideMinLOD : 1; // 0x515:1(0x1)
		bool bOverrideNavigationExport : 1; // 0x515:2(0x1)
		bool bForceNavigationObstacle : 1; // 0x515:3(0x1)
		bool bDisallowMeshPaintPerInstance : 1; // 0x515:4(0x1)
		bool bMeshPaintTexture : 1; // 0x515:5(0x1)
		bool bIgnoreInstanceForTextureStreaming : 1; // 0x515:6(0x1)
		bool bOverrideLightMapRes : 1; // 0x515:7(0x1)
		bool bCastDistanceFieldIndirectShadow : 1; // 0x516:0(0x1)
		bool bOverrideDistanceFieldSelfShadowBias : 1; // 0x516:1(0x1)
		bool bUseSubDivisions : 1; // 0x516:2(0x1)
		bool bUseDefaultCollision : 1; // 0x516:3(0x1)
		bool bSortTriangles : 1; // 0x516:4(0x1)
		bool bReverseCulling : 1; // 0x516:5(0x1)
		unsigned char UnknownData02_5[0x1]; // 0x517(0x1) UNKNOWN PROPERTY
		UTexture* MeshPaintTexture; // 0x518(0x8)
		UTexture* MeshPaintTextureOverride; // 0x520(0x8)
		int32_t OverriddenLightMapRes; // 0x528(0x4)
		float DistanceFieldIndirectShadowMinVisibility; // 0x52C(0x4)
		float DistanceFieldSelfShadowBias; // 0x530(0x4)
		float StreamingDistanceMultiplier; // 0x534(0x4)
		float NanitePixelProgrammableDistance; // 0x538(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x53C(0x4) UNKNOWN PROPERTY
		TArray<FStaticMeshComponentLODInfo> LODData; // 0x540(0x10)
		TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x550(0x10)
		FLightmassPrimitiveSettings LightmassSettings; // 0x560(0x18)
		unsigned char UnknownData04_7[0x18]; // 0x578(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.StaticMeshComponent");
			return ret;
		}

		void UpdateInitialEvaluateWorldPositionOffset(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C525D50(relative to base address)
		void SetWorldPositionOffsetDisableDistance(int32_t NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C525BCC(relative to base address)
		bool SetStaticMesh(UStaticMesh* NewMesh); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748EDF72C(relative to base address)
		void SetReverseCulling(bool ReverseCulling); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5237C4(relative to base address)
		void SetForcedLodModel(int32_t NewForcedLodModel); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5222A0(relative to base address)
		void SetForceDisableNanite(bool bInForceDisableNanite); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5221F0(relative to base address)
		void SetEvaluateWorldPositionOffsetInRayTracing(bool NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C522170(relative to base address)
		void SetEvaluateWorldPositionOffset(bool NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749717970(relative to base address)
		void SetDistanceFieldSelfShadowBias(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C521730(relative to base address)
		void OnRep_StaticMesh(UStaticMesh* OldStaticMesh); // Flags: Final|RequiredAPI|Native|Public, Memory Exec: 0x7FF74C520A5C(relative to base address)
		void GetLocalBounds(FVector& Min, FVector& Max); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C51D8A4(relative to base address)
		bool GetInitialEvaluateWorldPositionOffset(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C51D600(relative to base address)
	};


	// Class Engine.InstancedStaticMeshComponent
	// Inherited from UStaticMeshComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x350 (0x8E0 - 0x590)
	class UInstancedStaticMeshComponent : public UStaticMeshComponent	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x590(0x8) UNKNOWN PROPERTY
		TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x598(0x10)
		TArray<FMatrix> PerInstancePrevTransform; // 0x5A8(0x10)
		FBox NavigationBounds; // 0x5B8(0x38)
		FTransform PreviousComponentTransform; // 0x5F0(0x60)
		int32_t NumCustomDataFloats; // 0x650(0x4)
		int32_t InstancingRandomSeed; // 0x654(0x4)
		TArray<float> PerInstanceSMCustomData; // 0x658(0x10)
		TArray<FInstancedStaticMeshRandomSeed> AdditionalRandomSeeds; // 0x668(0x10)
		float InstanceLODDistanceScale; // 0x678(0x4)
		int32_t InstanceStartCullDistance; // 0x67C(0x4)
		int32_t InstanceEndCullDistance; // 0x680(0x4)
		bool bUseGpuLodSelection : 1; // 0x684:0(0x1)
		bool bInheritPerInstanceData : 1; // 0x684:1(0x1)
		bool bDisableCollision : 1; // 0x684:2(0x1)
		unsigned char UnknownData01_5[0x3]; // 0x685(0x3) UNKNOWN PROPERTY
		TArray<int32_t> InstanceReorderTable; // 0x688(0x10)
		unsigned char UnknownData02_6[0xB0]; // 0x698(0xB0) UNKNOWN PROPERTY
		int32_t NumPendingLightmaps; // 0x748(0x4)
		unsigned char UnknownData03_6[0x184]; // 0x74C(0x184) UNKNOWN PROPERTY
		TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x8D0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.InstancedStaticMeshComponent");
			return ret;
		}

		bool UpdateInstanceTransform(int32_t InstanceIndex, FTransform& NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C37A86C(relative to base address)
		void SetNumCustomDataFloats(int32_t InNumCustomDataFloats); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C379E94(relative to base address)
		void SetLODDistanceScale(float InLODDistanceScale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C379CEC(relative to base address)
		bool SetCustomDataValue(int32_t InstanceIndex, int32_t CustomDataIndex, float CustomDataValue, bool bMarkRenderStateDirty); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7476F94A8(relative to base address)
		void SetCullDistances(int32_t StartCullDistance, int32_t EndCullDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C378CE8(relative to base address)
		bool RemoveInstances(TArray<int32_t>& InstancesToRemove); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3779C8(relative to base address)
		bool RemoveInstance(int32_t InstanceIndex); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C377934(relative to base address)
		bool IsValidInstance(int32_t InstanceIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C376BF8(relative to base address)
		float GetLODDistanceScale(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C376890(relative to base address)
		bool GetInstanceTransform(int32_t InstanceIndex, FTransform& OutInstanceTransform, bool bWorldSpace); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C37633C(relative to base address)
		TArray GetInstancesOverlappingSphere(FVector& Center, float Radius, bool bSphereInWorldSpace); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C37668C(relative to base address)
		TArray GetInstancesOverlappingBox(FBox& Box, bool bBoxInWorldSpace); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3764FC(relative to base address)
		int32_t GetInstanceCount(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C376324(relative to base address)
		void GetCullDistances(int32_t& OutStartCullDistance, int32_t& OutEndCullDistance); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C376194(relative to base address)
		void ClearInstances(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749253B5C(relative to base address)
		bool BatchUpdateInstancesTransforms(int32_t StartInstanceIndex, TArray<FTransform>& NewInstancesTransforms, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C375508(relative to base address)
		bool BatchUpdateInstancesTransform(int32_t StartInstanceIndex, int32_t NumInstances, FTransform& NewInstancesTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3751E8(relative to base address)
		int32_t AddInstanceWorldSpace(FTransform& WorldTransform); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C3750E0(relative to base address)
		TArray AddInstances(TArray<FTransform>& InstanceTransforms, bool bShouldReturnIndices, bool bWorldSpace, bool bUpdateNavigation); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF747FB013C(relative to base address)
		int32_t AddInstance(FTransform& InstanceTransform, bool bWorldSpace); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C374F58(relative to base address)
	};


	// Class Engine.HierarchicalInstancedStaticMeshComponent
	// Inherited from UInstancedStaticMeshComponent -> UStaticMeshComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x1A0 (0xA80 - 0x8E0)
	class UHierarchicalInstancedStaticMeshComponent : public UInstancedStaticMeshComponent	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x8E0(0x10) UNKNOWN PROPERTY
		bool bUseTranslatedInstanceSpace : 1; // 0x8F0:0(0x1)
		unsigned char UnknownData01_5[0x7]; // 0x8F1(0x7) UNKNOWN PROPERTY
		FVector TranslatedInstanceSpaceOrigin; // 0x8F8(0x18)
		TArray<int32_t> SortedInstances; // 0x910(0x10)
		int32_t NumBuiltInstances; // 0x920(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x924(0x4) UNKNOWN PROPERTY
		FBox BuiltInstanceBounds; // 0x928(0x38)
		FBox UnbuiltInstanceBounds; // 0x960(0x38)
		TArray<FBox> UnbuiltInstanceBoundsList; // 0x998(0x10)
		bool bEnableDensityScaling : 1; // 0x9A8:0(0x1)
		unsigned char UnknownData03_5[0x7]; // 0x9A9(0x7) UNKNOWN PROPERTY
		int32_t OcclusionLayerNumNodes; // 0x9B0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x9B4(0x4) UNKNOWN PROPERTY
		FBoxSphereBounds CacheMeshExtendedBounds; // 0x9B8(0x38)
		int32_t InstanceCountToRender; // 0x9F0(0x4)
		unsigned char UnknownData05_7[0x84]; // 0x9F4(0x84) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.HierarchicalInstancedStaticMeshComponent");
			return ret;
		}
	};


	// Class Engine.PartitionActor
	// Inherited from AActor -> UObject
	// Size: 0x0 (0x290 - 0x290)
	class APartitionActor : public AActor	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PartitionActor");
			return ret;
		}
	};


	// Class Engine.ISMPartitionActor
	// Inherited from APartitionActor -> AActor -> UObject
	// Size: 0x10 (0x2A0 - 0x290)
	class AISMPartitionActor : public APartitionActor	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x290(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ISMPartitionActor");
			return ret;
		}
	};


	// Class Engine.StaticMeshActor
	// Inherited from AActor -> UObject
	// Size: 0x10 (0x2A0 - 0x290)
	class AStaticMeshActor : public AActor	
	{
	public:
		UStaticMeshComponent* StaticMeshComponent; // 0x290(0x8)
		bool bStaticMeshReplicateMovement; // 0x298(0x1)
		EPhysicsReplicationMode StaticMeshPhysicsReplicationMode; // 0x299(0x1)
		ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x29A(0x1)
		unsigned char UnknownData00_7[0x5]; // 0x29B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.StaticMeshActor");
			return ret;
		}

		void SetMobility(TEnumAsByte<EComponentMobility> InMobility); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C8924DC(relative to base address)
	};


	// Class Engine.Brush
	// Inherited from AActor -> UObject
	// Size: 0x38 (0x2C8 - 0x290)
	class ABrush : public AActor	
	{
	public:
		TEnumAsByte<EBrushType> BrushType; // 0x290(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x291(0x3) UNKNOWN PROPERTY
		FColor BrushColor; // 0x294(0x4)
		int32_t PolyFlags; // 0x298(0x4)
		bool bColored : 1; // 0x29C:0(0x1)
		bool bSolidWhenSelected : 1; // 0x29C:1(0x1)
		bool bPlaceableFromClassBrowser : 1; // 0x29C:2(0x1)
		bool bNotForClientOrServer : 1; // 0x29C:3(0x1)
		unsigned char UnknownData01_5[0x3]; // 0x29D(0x3) UNKNOWN PROPERTY
		UModel* Brush; // 0x2A0(0x8)
		UBrushComponent* BrushComponent; // 0x2A8(0x8)
		bool bInManipulation : 1; // 0x2B0:0(0x1)
		unsigned char UnknownData02_5[0x7]; // 0x2B1(0x7) UNKNOWN PROPERTY
		TArray<FGeomSelection> SavedSelections; // 0x2B8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Brush");
			return ret;
		}
	};


	// Class Engine.Volume
	// Inherited from ABrush -> AActor -> UObject
	// Size: 0x0 (0x2C8 - 0x2C8)
	class AVolume : public ABrush	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Volume");
			return ret;
		}
	};


	// Class Engine.StreamableRenderAsset
	// Inherited from UObject
	// Size: 0xA0 (0xC8 - 0x28)
	class UStreamableRenderAsset : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x28(0x18) UNKNOWN PROPERTY
		double ForceMipLevelsToBeResidentTimestamp; // 0x40(0x8)
		int32_t NumCinematicMipLevels; // 0x48(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
		FPerQualityLevelInt NoRefStreamingLODBias; // 0x50(0x68)
		int32_t StreamingIndex; // 0xB8(0x4)
		bool NeverStream : 1; // 0xBC:0(0x1)
		bool bGlobalForceMipLevelsToBeResident : 1; // 0xBC:1(0x1)
		bool bHasStreamingUpdatePending : 1; // 0xBC:2(0x1)
		bool bForceMiplevelsToBeResident : 1; // 0xBC:3(0x1)
		bool bIgnoreStreamingMipBias : 1; // 0xBC:4(0x1)
		bool bUseCinematicMipLevels : 1; // 0xBC:5(0x1)
		unsigned char UnknownData02_7[0xB]; // 0xBD(0xB) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.StreamableRenderAsset");
			return ret;
		}

		void SetForceMipLevelsToBeResident(float Seconds, int32_t CinematicLODGroupMask); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C892418(relative to base address)
	};


	// Class Engine.MaterialInterface
	// Inherited from UObject
	// Size: 0x90 (0xB8 - 0x28)
	class UMaterialInterface : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		USubsurfaceProfile* SubsurfaceProfile; // 0x38(0x8)
		TArray<USpecularProfile*> SpecularProfiles; // 0x40(0x10)
		UNeuralProfile* NeuralProfile; // 0x50(0x8)
		unsigned char UnknownData01_6[0x20]; // 0x58(0x20) UNKNOWN PROPERTY
		FLightmassMaterialInterfaceSettings LightmassSettings; // 0x78(0x10)
		TArray<FMaterialTextureInfo> TextureStreamingData; // 0x88(0x10)
		TArray<UAssetUserData*> AssetUserData; // 0x98(0x10)
		unsigned char UnknownData02_6[0x4]; // 0xA8(0x4) UNKNOWN PROPERTY
		bool bIncludedInBaseGame : 1; // 0xAC:0(0x1)
		unsigned char UnknownData03_7[0xB]; // 0xAD(0xB) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialInterface");
			return ret;
		}

		void SetForceMipLevelsToBeResident(bool OverrideForceMiplevelsToBeResident, bool bForceMiplevelsToBeResidentValue, float ForceDuration, int32_t CinematicTextureGroups, bool bFastResponse); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C382C4C(relative to base address)
		UPhysicalMaterialMask GetPhysicalMaterialMask(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C382C24(relative to base address)
		UPhysicalMaterial GetPhysicalMaterialFromMap(int32_t Index); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C382B90(relative to base address)
		UPhysicalMaterial GetPhysicalMaterial(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C382B68(relative to base address)
		FMaterialParameterInfo GetParameterInfo(TEnumAsByte<EMaterialParameterAssociation> Association, FName ParameterName, UMaterialFunctionInterface* LayerFunction); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C382964(relative to base address)
		UMaterialInterface GetNaniteOverideMaterial(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749859734(relative to base address)
		TEnumAsByte GetBlendMode(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C38293C(relative to base address)
		UMaterial GetBaseMaterial(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7495426F4(relative to base address)
	};


	// Class Engine.MaterialInstance
	// Inherited from UMaterialInterface -> UObject
	// Size: 0x1F0 (0x2A8 - 0xB8)
	class UMaterialInstance : public UMaterialInterface	
	{
	public:
		UPhysicalMaterial* PhysMaterial; // 0xB8(0x8)
		UPhysicalMaterial* PhysicalMaterialMap; // 0xC0(0x40)
		UMaterialInterface* Parent; // 0x100(0x8)
		FMaterialOverrideNanite NaniteOverrideMaterial; // 0x108(0x30)
		bool bHasStaticPermutationResource : 1; // 0x138:0(0x1)
		bool bOverrideSubsurfaceProfile : 1; // 0x138:1(0x1)
		bool bOverrideBlendableLocation : 1; // 0x138:2(0x1)
		bool bOverrideBlendablePriority : 1; // 0x138:3(0x1)
		unsigned char UnknownData00_5[0x2]; // 0x139(0x2) UNKNOWN PROPERTY
		TEnumAsByte<EBlendableLocation> BlendableLocationOverride; // 0x13B(0x1)
		int32_t BlendablePriorityOverride; // 0x13C(0x4)
		unsigned char UnknownData01_6[0x20]; // 0x140(0x20) UNKNOWN PROPERTY
		TArray<FScalarParameterValue> ScalarParameterValues; // 0x160(0x10)
		TArray<FVectorParameterValue> VectorParameterValues; // 0x170(0x10)
		TArray<FDoubleVectorParameterValue> DoubleVectorParameterValues; // 0x180(0x10)
		TArray<FTextureParameterValue> TextureParameterValues; // 0x190(0x10)
		TArray<FTextureCollectionParameterValue> TextureCollectionParameterValues; // 0x1A0(0x10)
		TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0x1B0(0x10)
		TArray<FSparseVolumeTextureParameterValue> SparseVolumeTextureParameterValues; // 0x1C0(0x10)
		TArray<FFontParameterValue> FontParameterValues; // 0x1D0(0x10)
		TArray<FUserSceneTextureOverride> UserSceneTextureOverrides; // 0x1E0(0x10)
		FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x1F0(0x20)
		unsigned char UnknownData02_6[0x8]; // 0x210(0x8) UNKNOWN PROPERTY
		FStaticParameterSetRuntimeData StaticParametersRuntime; // 0x218(0x60)
		unsigned char UnknownData03_7[0x30]; // 0x278(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialInstance");
			return ret;
		}
	};


	// Class Engine.MaterialInstanceConstant
	// Inherited from UMaterialInstance -> UMaterialInterface -> UObject
	// Size: 0x8 (0x2B0 - 0x2A8)
	class UMaterialInstanceConstant : public UMaterialInstance	
	{
	public:
		UPhysicalMaterialMask* PhysMaterialMask; // 0x2A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialInstanceConstant");
			return ret;
		}

		FLinearColor K2_GetVectorParameterValue(FName ParameterName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C6AE47C(relative to base address)
		UTexture K2_GetTextureParameterValue(FName ParameterName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C6AE304(relative to base address)
		float K2_GetScalarParameterValue(FName ParameterName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C6AE1D0(relative to base address)
	};


	// Class Engine.MaterialExpression
	// Inherited from UObject
	// Size: 0x88 (0xB0 - 0x28)
	class UMaterialExpression : public UObject	
	{
	public:
		int32_t MaterialExpressionEditorX; // 0x28(0x4)
		int32_t MaterialExpressionEditorY; // 0x2C(0x4)
		UEdGraphNode* GraphNode; // 0x30(0x8)
		UMaterialExpression* SubgraphExpression; // 0x38(0x8)
		unsigned char UnknownData00_6[0x10]; // 0x40(0x10) UNKNOWN PROPERTY
		FGuid MaterialExpressionGuid; // 0x50(0x10)
		UMaterial* Material; // 0x60(0x8)
		UMaterialFunction* Function; // 0x68(0x8)
		FString Desc; // 0x70(0x10)
		unsigned char UnknownData01_6[0x4]; // 0x80(0x4) UNKNOWN PROPERTY
		bool bRealtimePreview : 1; // 0x84:0(0x1)
		bool bNeedToUpdatePreview : 1; // 0x84:1(0x1)
		unsigned char UnknownData02_3[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		bool bIsParameterExpression : 1; // 0x88:0(0x1)
		unsigned char UnknownData03_3[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		bool bCommentBubbleVisible : 1; // 0x8C:0(0x1)
		bool bShowOutputNameOnPin : 1; // 0x8C:1(0x1)
		bool bShowMaskColorsOnPin : 1; // 0x8C:2(0x1)
		bool bHidePreviewWindow : 1; // 0x8C:3(0x1)
		bool bCollapsed : 1; // 0x8C:4(0x1)
		bool bShaderInputData : 1; // 0x8C:5(0x1)
		bool bShowInputs : 1; // 0x8C:6(0x1)
		bool bShowOutputs : 1; // 0x8C:7(0x1)
		unsigned char UnknownData04_5[0x3]; // 0x8D(0x3) UNKNOWN PROPERTY
		TArray<FText> MenuCategories; // 0x90(0x10)
		TArray<FExpressionOutput> Outputs; // 0xA0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialExpression");
			return ret;
		}
	};


	// Class Engine.MaterialExpressionCustomOutput
	// Inherited from UMaterialExpression -> UObject
	// Size: 0x0 (0xB0 - 0xB0)
	class UMaterialExpressionCustomOutput : public UMaterialExpression	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialExpressionCustomOutput");
			return ret;
		}
	};


	// Class Engine.HLODBuilder
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UHLODBuilder : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.HLODBuilder");
			return ret;
		}
	};


	// Class Engine.TickableWorldSubsystem
	// Inherited from UWorldSubsystem -> USubsystem -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UTickableWorldSubsystem : public UWorldSubsystem	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TickableWorldSubsystem");
			return ret;
		}
	};


	// Class Engine.AssetUserData
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssetUserData : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AssetUserData");
			return ret;
		}
	};


	// Class Engine.TextureMipDataProviderFactory
	// Inherited from UAssetUserData -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTextureMipDataProviderFactory : public UAssetUserData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TextureMipDataProviderFactory");
			return ret;
		}
	};


	// Class Engine.TextureAllMipDataProviderFactory
	// Inherited from UTextureMipDataProviderFactory -> UAssetUserData -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTextureAllMipDataProviderFactory : public UTextureMipDataProviderFactory	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TextureAllMipDataProviderFactory");
			return ret;
		}
	};


	// Class Engine.DynamicSubsystem
	// Inherited from USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UDynamicSubsystem : public USubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DynamicSubsystem");
			return ret;
		}
	};


	// Class Engine.EngineSubsystem
	// Inherited from UDynamicSubsystem -> USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UEngineSubsystem : public UDynamicSubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EngineSubsystem");
			return ret;
		}
	};


	// Class Engine.EngineCustomTimeStep
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEngineCustomTimeStep : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EngineCustomTimeStep");
			return ret;
		}
	};


	// Class Engine.TimecodeProvider
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UTimecodeProvider : public UObject	
	{
	public:
		float FrameDelay; // 0x28(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TimecodeProvider");
			return ret;
		}

		Ftimecode GetTimecode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5A4018(relative to base address)
		ETimecodeProviderSynchronizationState GetSynchronizationState(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39ED58(relative to base address)
		FQualifiedFrameTime GetQualifiedFrameTime(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5A3CBC(relative to base address)
		FFrameRate GetFrameRate(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5A2E14(relative to base address)
		Ftimecode GetDelayedTimecode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5A2D20(relative to base address)
		FQualifiedFrameTime GetDelayedQualifiedFrameTime(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5A2CF0(relative to base address)
		bool FetchTimecode(FQualifiedFrameTime& OutFrameTime); // Flags: Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C5A1FA0(relative to base address)
		void FetchAndUpdate(); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C349660(relative to base address)
	};


	// Class Engine.EdGraphNode
	// Inherited from UObject
	// Size: 0x70 (0x98 - 0x28)
	class UEdGraphNode : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38(0x10)
		int32_t NodePosX; // 0x48(0x4)
		int32_t NodePosY; // 0x4C(0x4)
		int32_t NodeWidth; // 0x50(0x4)
		int32_t NodeHeight; // 0x54(0x4)
		TEnumAsByte<ENodeAdvancedPins> AdvancedPinDisplay; // 0x58(0x1)
		ENodeEnabledState EnabledState; // 0x59(0x1)
		unsigned char UnknownData01_6[0x1]; // 0x5A(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit02 : 1; // 0x5B:0(0x1) UNKNOWN PROPERTY
		bool bDisplayAsDisabled : 1; // 0x5B:1(0x1)
		bool bUserSetEnabledState : 1; // 0x5B:2(0x1)
		bool bIsIntermediateNode : 1; // 0x5B:3(0x1)
		bool bHasCompilerMessage : 1; // 0x5B:4(0x1)
		unsigned char UnknownData03_5[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		FString NodeComment; // 0x60(0x10)
		int32_t ErrorType; // 0x70(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		FString ErrorMsg; // 0x78(0x10)
		FGuid NodeGUID; // 0x88(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EdGraphNode");
			return ret;
		}
	};


	// Class Engine.EdGraph
	// Inherited from UObject
	// Size: 0x38 (0x60 - 0x28)
	class UEdGraph : public UObject	
	{
	public:
		UClass* Schema; // 0x28(0x8)
		TArray<UEdGraphNode*> Nodes; // 0x30(0x10)
		bool bEditable : 1; // 0x40:0(0x1)
		bool bAllowDeletion : 1; // 0x40:1(0x1)
		bool bAllowRenaming : 1; // 0x40:2(0x1)
		unsigned char UnknownData00_7[0x1F]; // 0x41(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EdGraph");
			return ret;
		}
	};


	// Class Engine.DebugDrawComponent
	// Inherited from UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x58 (0x520 - 0x4C8)
	class UDebugDrawComponent : public UPrimitiveComponent	
	{
	public:
		unsigned char UnknownData00_1[0x50]; // 0x4C8(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DebugDrawComponent");
			return ret;
		}
	};


	// Class Engine.AnimNotify
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UAnimNotify : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimNotify");
			return ret;
		}

		bool Received_Notify(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FString GetNotifyName(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF74C4092C8(relative to base address)
		float GetDefaultTriggerWeightThreshold(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF74C40917C(relative to base address)
	};


	// Class Engine.AnimNotifyState
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAnimNotifyState : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimNotifyState");
			return ret;
		}

		bool Received_NotifyTick(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation, float FrameDeltaTime, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool Received_NotifyEnd(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool Received_NotifyBegin(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation, float TotalDuration, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FString GetNotifyName(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF74C4092C8(relative to base address)
		float GetDefaultTriggerWeightThreshold(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF74C40917C(relative to base address)
	};


	// Class Engine.SkinnedMeshComponent
	// Inherited from UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x368 (0x860 - 0x4F8)
	class USkinnedMeshComponent : public UMeshComponent	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x4F8(0x8) UNKNOWN PROPERTY
		USkeletalMesh* SkeletalMesh; // 0x500(0x8)
		USkinnedAsset* SkinnedAsset; // 0x508(0x8)
		TWeakObjectPtr<USkinnedMeshComponent*> LeaderPoseComponent; // 0x510(0x8)
		TArray<ESkinCacheUsage> SkinCacheUsage; // 0x518(0x10)
		bool bSetMeshDeformer; // 0x528(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x529(0x7) UNKNOWN PROPERTY
		UMeshDeformer* MeshDeformer; // 0x530(0x8)
		UMeshDeformerInstanceSettings* MeshDeformerInstanceSettings; // 0x538(0x8)
		FMeshDeformerInstanceSet MeshDeformerInstances; // 0x540(0x20)
		unsigned char UnknownData02_6[0x180]; // 0x560(0x180) UNKNOWN PROPERTY
		UPhysicsAsset* PhysicsAssetOverride; // 0x6E0(0x8)
		int32_t ForcedLodModel; // 0x6E8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x6EC(0x4) UNKNOWN PROPERTY
		int32_t MinLodModel; // 0x6F0(0x4)
		unsigned char UnknownData04_6[0x8]; // 0x6F4(0x8) UNKNOWN PROPERTY
		float StreamingDistanceMultiplier; // 0x6FC(0x4)
		unsigned char UnknownData05_6[0x8]; // 0x700(0x8) UNKNOWN PROPERTY
		TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x708(0x10)
		unsigned char UnknownData06_6[0x24]; // 0x718(0x24) UNKNOWN PROPERTY
		EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x73C(0x1)
		unsigned char UnknownData07_6[0x1]; // 0x73D(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x73E:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x73E:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x73E:2(0x1) UNKNOWN PROPERTY
		bool bOverrideMinLOD : 1; // 0x73E:3(0x1)
		bool bUseBoundsFromLeaderPoseComponent : 1; // 0x73E:4(0x1)
		bool bIncludeComponentLocationIntoBounds : 1; // 0x73E:5(0x1)
		bool bForceWireframe : 1; // 0x73E:6(0x1)
		bool bDisableMorphTarget : 1; // 0x73E:7(0x1)
		bool bHideSkin : 1; // 0x73F:0(0x1)
		bool bPerBoneMotionBlur : 1; // 0x73F:1(0x1)
		bool bComponentUseFixedSkelBounds : 1; // 0x73F:2(0x1)
		bool bConsiderAllBodiesForBounds : 1; // 0x73F:3(0x1)
		bool bSyncAttachParentLOD : 1; // 0x73F:4(0x1)
		bool bCanHighlightSelectedSections : 1; // 0x73F:5(0x1)
		bool bRecentlyRendered : 1; // 0x73F:6(0x1)
		bool bCastCapsuleDirectShadow : 1; // 0x73F:7(0x1)
		bool bCastCapsuleIndirectShadow : 1; // 0x740:0(0x1)
		bool bCPUSkinning : 1; // 0x740:1(0x1)
		bool bEnableUpdateRateOptimizations : 1; // 0x740:2(0x1)
		bool bDisplayDebugUpdateRateOptimizations : 1; // 0x740:3(0x1)
		bool bRenderStatic : 1; // 0x740:4(0x1)
		bool bIgnoreLeaderPoseComponentLOD : 1; // 0x740:5(0x1)
		unsigned char UnknownBit11 : 1; // 0x740:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0x740:7(0x1) UNKNOWN PROPERTY
		bool bCachedLocalBoundsUpToDate : 1; // 0x741:0(0x1)
		bool bCachedWorldSpaceBoundsUpToDate : 1; // 0x741:1(0x1)
		unsigned char UnknownBit13 : 1; // 0x741:2(0x1) UNKNOWN PROPERTY
		bool bForceMeshObjectUpdate : 1; // 0x741:3(0x1)
		unsigned char UnknownBit14 : 1; // 0x741:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0x741:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x741:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x741:7(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x742:0(0x1) UNKNOWN PROPERTY
		bool bFollowerShouldTickPose : 1; // 0x742:1(0x1)
		unsigned char UnknownData19_5[0x1]; // 0x743(0x1) UNKNOWN PROPERTY
		float CapsuleIndirectShadowMinVisibility; // 0x744(0x4)
		unsigned char UnknownData20_6[0x40]; // 0x748(0x40) UNKNOWN PROPERTY
		FBoxSphereBounds CachedWorldOrLocalSpaceBounds; // 0x788(0x38)
		FMatrix CachedWorldToLocalTransform; // 0x7C0(0x80)
		unsigned char UnknownData21_7[0x20]; // 0x840(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SkinnedMeshComponent");
			return ret;
		}

		void UnsetMeshDeformer(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39D3D8(relative to base address)
		void UnloadSkinWeightProfile(FName InProfileName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39D358(relative to base address)
		void UnHideBoneByName(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7495EAB9C(relative to base address)
		void TransformToBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39CFCC(relative to base address)
		void TransformFromBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C39CC40(relative to base address)
		void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39CAF8(relative to base address)
		void ShowAllMaterialSections(int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39CA78(relative to base address)
		void SetVertexOffsetUsage(int32_t LODIndex, int32_t Usage); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C954(relative to base address)
		void SetVertexColorOverride_LinearColor(int32_t LODIndex, TArray<FLinearColor>& VertexColors); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C39C870(relative to base address)
		bool SetSkinWeightProfile(FName InProfileName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C7E4(relative to base address)
		void SetSkinWeightOverride(int32_t LODIndex, TArray<FSkelMeshSkinWeightInfo>& SkinWeights); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C39C700(relative to base address)
		void SetSkinnedAssetAndUpdate(USkinnedAsset* NewMesh, bool bReinitPose); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7493354BC(relative to base address)
		void SetRenderStatic(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749477A98(relative to base address)
		void SetPreSkinningOffsets(int32_t LODIndex, TArray<FVector> Offsets); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C5E8(relative to base address)
		void SetPostSkinningOffsets(int32_t LODIndex, TArray<FVector> Offsets); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C5E8(relative to base address)
		void SetPhysicsAsset(UPhysicsAsset* NewPhysicsAsset, bool bForceReInit); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C51C(relative to base address)
		void SetMinLOD(int32_t InNewMinLOD); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C290(relative to base address)
		void SetMeshDeformer(UMeshDeformer* InMeshDeformer); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39C20C(relative to base address)
		void SetLeaderPoseComponent(USkinnedMeshComponent* NewLeaderBoneComponent, bool bForceUpdate, bool bInFollowerShouldTickPose); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39BFE8(relative to base address)
		void SetForcedLOD(int32_t InNewForcedLOD); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39BE68(relative to base address)
		void SetCastCapsuleIndirectShadow(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39BC54(relative to base address)
		void SetCastCapsuleDirectShadow(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39BBB4(relative to base address)
		void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748AC1738(relative to base address)
		void OverrideMinLOD(int32_t InNewMinLOD); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39BB20(relative to base address)
		bool IsUsingSkinWeightProfile(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39BAFC(relative to base address)
		bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39BA3C(relative to base address)
		bool IsBoneHiddenByName(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39B9B0(relative to base address)
		void HideBoneByName(FName BoneName, TEnumAsByte<EPhysBodyOp> PhysBodyOption); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7493F8D90(relative to base address)
		int32_t GetVertexOffsetUsage(int32_t LODIndex); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B688(relative to base address)
		bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B568(relative to base address)
		FName GetSocketBoneName(FName InSocketName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B444(relative to base address)
		USkinnedAsset GetSkinnedAsset(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B420(relative to base address)
		USkeletalMesh GetSkeletalMesh_DEPRECATED(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749BC6AE4(relative to base address)
		FTransform GetRefPoseTransform(int32_t BoneIndex); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B350(relative to base address)
		FVector GetRefPosePosition(int32_t BoneIndex); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B2B0(relative to base address)
		int32_t GetPredictedLODLevel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B298(relative to base address)
		FName GetParentBone(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B214(relative to base address)
		int32_t GetNumLODs(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B1F0(relative to base address)
		int32_t GetNumBones(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B1CC(relative to base address)
		UMeshDeformerInstance GetMeshDeformerInstance(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B188(relative to base address)
		int32_t GetForcedLOD(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B170(relative to base address)
		FTransform GetDeltaTransformFromRefPose(FName BoneName, FName BaseName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74771C884(relative to base address)
		FName GetCurrentSkinWeightProfileName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39B0EC(relative to base address)
		FTransform GetBoneTransform(FName InBoneName, TEnumAsByte<ERelativeTransformSpace> TransformSpace); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39AFD8(relative to base address)
		FName GetBoneName(int32_t BoneIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39AF54(relative to base address)
		int32_t GetBoneIndex(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39ADD0(relative to base address)
		FName FindClosestBone_K2(FVector TestLocation, FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39AA50(relative to base address)
		void ClearVertexColorOverride(int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A9B4(relative to base address)
		void ClearSkinWeightProfile(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A9A0(relative to base address)
		void ClearSkinWeightOverride(int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39A904(relative to base address)
		bool BoneIsChildOf(FName BoneName, FName ParentBoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39A844(relative to base address)
	};


	// Class Engine.SkeletalMeshComponent
	// Inherited from USkinnedMeshComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x6A0 (0xF00 - 0x860)
	class USkeletalMeshComponent : public USkinnedMeshComponent	
	{
	public:
		UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0x860(0x8)
		UClass* AnimClass; // 0x868(0x8)
		UAnimInstance* AnimScriptInstance; // 0x870(0x8)
		UAnimInstance* PostProcessAnimInstance; // 0x878(0x8)
		FSingleAnimationPlayData AnimationData; // 0x880(0x18)
		unsigned char UnknownData00_6[0x10]; // 0x898(0x10) UNKNOWN PROPERTY
		FVector RootBoneTranslation; // 0x8A8(0x18)
		FVector LineCheckBoundsScale; // 0x8C0(0x18)
		unsigned char UnknownData01_6[0x20]; // 0x8D8(0x20) UNKNOWN PROPERTY
		TArray<UAnimInstance*> LinkedInstances; // 0x8F8(0x10)
		unsigned char UnknownData02_6[0x10]; // 0x908(0x10) UNKNOWN PROPERTY
		TArray<FTransform> CachedBoneSpaceTransforms; // 0x918(0x10)
		TArray<FTransform> CachedComponentSpaceTransforms; // 0x928(0x10)
		unsigned char UnknownData03_6[0xA0]; // 0x938(0xA0) UNKNOWN PROPERTY
		float GlobalAnimRateScale; // 0x9D8(0x4)
		TEnumAsByte<EKinematicBonesUpdateToPhysics> KinematicBonesUpdateType; // 0x9DC(0x1)
		TEnumAsByte<EPhysicsTransformUpdateMode> PhysicsTransformUpdateMode; // 0x9DD(0x1)
		unsigned char UnknownData04_6[0x1]; // 0x9DE(0x1) UNKNOWN PROPERTY
		TEnumAsByte<EAnimationMode> AnimationMode; // 0x9DF(0x1)
		unsigned char UnknownData05_6[0x1]; // 0x9E0(0x1) UNKNOWN PROPERTY
		bool bDisablePostProcessBlueprint : 1; // 0x9E1:0(0x1)
		unsigned char UnknownBit06 : 1; // 0x9E1:1(0x1) UNKNOWN PROPERTY
		bool bUpdateOverlapsOnAnimationFinalize : 1; // 0x9E1:2(0x1)
		unsigned char UnknownBit07 : 1; // 0x9E1:3(0x1) UNKNOWN PROPERTY
		bool bHasValidBodies : 1; // 0x9E1:4(0x1)
		bool bBlendPhysics : 1; // 0x9E1:5(0x1)
		bool bEnablePhysicsOnDedicatedServer : 1; // 0x9E1:6(0x1)
		bool bUpdateMeshWhenKinematic : 1; // 0x9E1:7(0x1)
		bool bUpdateJointsFromAnimation : 1; // 0x9E2:0(0x1)
		bool bAllowClothActors : 1; // 0x9E2:1(0x1)
		bool bDisableClothSimulation : 1; // 0x9E2:2(0x1)
		unsigned char UnknownData08_3[0x5]; // 0x9E3(0x5) UNKNOWN PROPERTY
		bool bDisableRigidBodyAnimNode : 1; // 0x9E8:0(0x1)
		bool bAllowAnimCurveEvaluation : 1; // 0x9E8:1(0x1)
		unsigned char UnknownBit09 : 1; // 0x9E8:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x9E8:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x9E8:4(0x1) UNKNOWN PROPERTY
		bool bCollideWithEnvironment : 1; // 0x9E8:5(0x1)
		bool bCollideWithAttachedChildren : 1; // 0x9E8:6(0x1)
		bool bForceCollisionUpdate : 1; // 0x9E8:7(0x1)
		unsigned char UnknownData12_5[0x3]; // 0x9E9(0x3) UNKNOWN PROPERTY
		float ClothVelocityScale; // 0x9EC(0x4)
		bool bResetAfterTeleport : 1; // 0x9F0:0(0x1)
		unsigned char UnknownBit13 : 1; // 0x9F0:1(0x1) UNKNOWN PROPERTY
		bool bDeferKinematicBoneUpdate : 1; // 0x9F0:2(0x1)
		bool bNoSkeletonUpdate : 1; // 0x9F0:3(0x1)
		bool bPauseAnims : 1; // 0x9F0:4(0x1)
		bool bUseRefPoseOnInitAnim : 1; // 0x9F0:5(0x1)
		bool bEnablePerPolyCollision : 1; // 0x9F0:6(0x1)
		bool bForceRefpose : 1; // 0x9F0:7(0x1)
		bool bOnlyAllowAutonomousTickPose : 1; // 0x9F1:0(0x1)
		bool bIsAutonomousTickPose : 1; // 0x9F1:1(0x1)
		bool bOldForceRefPose : 1; // 0x9F1:2(0x1)
		bool bShowPrePhysBones : 1; // 0x9F1:3(0x1)
		bool bRequiredBonesUpToDate : 1; // 0x9F1:4(0x1)
		bool bAnimTreeInitialised : 1; // 0x9F1:5(0x1)
		bool bEnableLineCheckWithBounds : 1; // 0x9F1:6(0x1)
		bool bPropagateCurvesToFollowers : 1; // 0x9F1:7(0x1)
		bool bSkipKinematicUpdateWhenInterpolating : 1; // 0x9F2:0(0x1)
		bool bSkipBoundsUpdateWhenInterpolating : 1; // 0x9F2:1(0x1)
		unsigned char UnknownBit14 : 1; // 0x9F2:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0x9F2:3(0x1) UNKNOWN PROPERTY
		bool bNeedsQueuedAnimEventsDispatched : 1; // 0x9F2:4(0x1)
		unsigned char UnknownData16_5[0x1]; // 0x9F3(0x1) UNKNOWN PROPERTY
		uint16_t CachedAnimCurveUidVersion; // 0x9F4(0x2)
		unsigned char UnknownData17_6[0x2]; // 0x9F6(0x2) UNKNOWN PROPERTY
		float ClothBlendWeight; // 0x9F8(0x4)
		bool bWaitForParallelClothTask; // 0x9FC(0x1)
		bool bFilteredAnimCurvesIsAllowList; // 0x9FD(0x1)
		uint16_t CachedMeshCurveMetaDataVersion; // 0x9FE(0x2)
		TArray<FName> FilteredAnimCurves; // 0xA00(0x10)
		UBodySetup* BodySetup; // 0xA10(0x8)
		unsigned char UnknownData18_6[0x4]; // 0xA18(0x4) UNKNOWN PROPERTY
		float ClothMaxDistanceScale; // 0xA1C(0x4)
		FMulticastInlineDelegate OnConstraintBroken; // 0xA20(0x10)
		FMulticastInlineDelegate OnPlasticDeformation; // 0xA30(0x10)
		UClass* ClothingSimulationFactory; // 0xA40(0x8)
		unsigned char UnknownData19_6[0xF8]; // 0xA48(0xF8) UNKNOWN PROPERTY
		float TeleportDistanceThreshold; // 0xB40(0x4)
		float TeleportRotationThreshold; // 0xB44(0x4)
		unsigned char UnknownData20_6[0x98]; // 0xB48(0x98) UNKNOWN PROPERTY
		UClothingSimulationInteractor* ClothingInteractor; // 0xBE0(0x8)
		unsigned char UnknownData21_6[0xB8]; // 0xBE8(0xB8) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnAnimInitialized; // 0xCA0(0x10)
		unsigned char UnknownData22_6[0x240]; // 0xCB0(0x240) UNKNOWN PROPERTY
		uint32_t LastPoseTickFrame; // 0xEF0(0x4)
		unsigned char UnknownData23_7[0x4]; // 0xEF4(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SkeletalMeshComponent");
			return ret;
		}

		void UnlinkAnimClassLayers(UClass* InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503D88(relative to base address)
		void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503CE0(relative to base address)
		void ToggleDisablePostProcessBlueprint(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503CCC(relative to base address)
		void TermBodiesBelow(FName ParentBoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503C4C(relative to base address)
		void SuspendClothingSimulation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503C34(relative to base address)
		void Stop(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503C20(relative to base address)
		void SnapshotPose(FPoseSnapshot& Snapshot); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C503B58(relative to base address)
		void SetUpdateClothInEditor(bool NewUpdateState); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C079284(relative to base address)
		void SetUpdateAnimationInEditor(bool NewUpdateState); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C079284(relative to base address)
		void SetTeleportRotationThreshold(float Threshold); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503784(relative to base address)
		void SetTeleportDistanceThreshold(float Threshold); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5036F8(relative to base address)
		void SetSkeletalMeshAsset(USkeletalMesh* NewMesh); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C50351C(relative to base address)
		void SetPosition(float InPos, bool bFireNotifies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5033B0(relative to base address)
		void SetPlayRate(float Rate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74887D150(relative to base address)
		void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503330(relative to base address)
		void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, FName BoneName, bool bIncludeSelf); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503230(relative to base address)
		void SetMorphTarget(FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503138(relative to base address)
		void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C503024(relative to base address)
		void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, FName BoneName, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502EF8(relative to base address)
		void SetEnableBodyGravity(bool bEnableGravity, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502E14(relative to base address)
		void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502D94(relative to base address)
		void SetDisableAnimCurves(bool bInDisableAnimCurves); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502D14(relative to base address)
		void SetConstraintProfileForAll(FName ProfileName, bool bDefaultIfNotFound); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502BD4(relative to base address)
		void SetConstraintProfile(FName JointName, FName ProfileName, bool bDefaultIfNotFound); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502ADC(relative to base address)
		void SetClothMaxDistanceScale(float Scale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502A5C(relative to base address)
		void SetBodySimulatePhysics(FName& InBoneName, bool bSimulate); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C50287C(relative to base address)
		void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5027B4(relative to base address)
		void SetAnimClass(UClass* NewClass); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5024E8(relative to base address)
		void SetAnimationMode(TEnumAsByte<EAnimationMode> InAnimationMode, bool bForceInitAnimScriptInstance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5025EC(relative to base address)
		void SetAnimation(UAnimationAsset* NewAnimToPlay); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C50256C(relative to base address)
		void SetAngularLimits(FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5023AC(relative to base address)
		void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502134(relative to base address)
		void SetAllowedAnimCurvesEvaluation(TArray<FName>& List, bool bAllow); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C5021F8(relative to base address)
		void SetAllowClothActors(bool bInAllow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5020A8(relative to base address)
		void SetAllowAnimCurveEvaluation(bool bInAllow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C502028(relative to base address)
		void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501F1C(relative to base address)
		void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501E10(relative to base address)
		void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501CD0(relative to base address)
		void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501C50(relative to base address)
		void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501B88(relative to base address)
		void SetAllBodiesBelowSimulatePhysics(FName& InBoneName, bool bNewSimulate, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C501990(relative to base address)
		void SetAllBodiesBelowPhysicsDisabled(FName& InBoneName, bool bDisabled, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C5017D0(relative to base address)
		void SetAllBodiesBelowPhysicsBlendWeight(FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C5015A4(relative to base address)
		void SetAllBodiesBelowLinearVelocity(FName& InBoneName, FVector& LinearVelocity, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C501400(relative to base address)
		void ResumeClothingSimulation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5013E4(relative to base address)
		void ResetClothTeleportMode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5013CC(relative to base address)
		void ResetAnimInstanceDynamics(ETeleportType InTeleportType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C50134C(relative to base address)
		void ResetAllowedAnimCurveEvaluation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501338(relative to base address)
		void ResetAllBodiesSimulatePhysics(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501324(relative to base address)
		void RecreateClothingActors(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C501020(relative to base address)
		void PlayAnimation(UAnimationAsset* NewAnimToPlay, bool bLooping); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74887D03C(relative to base address)
		void Play(bool bLooping); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C500FA0(relative to base address)
		void OverrideAnimationData(UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C500E08(relative to base address)
		void LinkAnimGraphByTag(FName InTag, UClass* InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C500D20(relative to base address)
		void LinkAnimClassLayers(UClass* InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7497DE780(relative to base address)
		bool K2_GetClosestPointOnPhysicsAsset(FVector& WorldPosition, FVector& ClosestWorldPosition, FVector& Normal, FName& BoneName, float& Distance); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C500AAC(relative to base address)
		bool IsPlaying(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C500A88(relative to base address)
		bool IsClothingSimulationSuspended(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C500A6C(relative to base address)
		bool IsBodyGravityEnabled(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C5009CC(relative to base address)
		bool HasValidAnimationInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C500630(relative to base address)
		bool GetTransformAttribute_Ref(FName& BoneName, FName& AttributeName, FTransform& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C5003C0(relative to base address)
		bool GetTransformAttribute(FName& BoneName, FName& AttributeName, FTransform DefaultValue, FTransform& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C4FFFC0(relative to base address)
		float GetTeleportRotationThreshold(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FFFA8(relative to base address)
		float GetTeleportDistanceThreshold(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FFF90(relative to base address)
		bool GetStringAttribute_Ref(FName& BoneName, FName& AttributeName, FString& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FFD8C(relative to base address)
		bool GetStringAttribute(FName& BoneName, FName& AttributeName, FString DefaultValue, FString& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FFB10(relative to base address)
		USkeletalMesh GetSkeletalMeshAsset(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748BB9ECC(relative to base address)
		FVector GetSkeletalCenterOfMass(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FFAD8(relative to base address)
		UAnimInstance GetPostProcessInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FFAA4(relative to base address)
		float GetPosition(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FFA7C(relative to base address)
		float GetPlayRate(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FFA54(relative to base address)
		float GetMorphTarget(FName MorphTargetName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749274010(relative to base address)
		UAnimInstance GetLinkedAnimLayerInstanceByGroup(FName InGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FF9B8(relative to base address)
		UAnimInstance GetLinkedAnimLayerInstanceByClass(UClass* InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FF914(relative to base address)
		void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray<UAnimInstance*>& OutLinkedInstances); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FF828(relative to base address)
		UAnimInstance GetLinkedAnimGraphInstanceByTag(FName InTag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FF79C(relative to base address)
		bool GetIntegerAttribute_Ref(FName& BoneName, FName& AttributeName, int32_t& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FF598(relative to base address)
		bool GetIntegerAttribute(FName& BoneName, FName& AttributeName, int32_t DefaultValue, int32_t& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FF35C(relative to base address)
		bool GetFloatAttribute_Ref(FName& BoneName, FName& AttributeName, float& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FF194(relative to base address)
		bool GetFloatAttribute(FName& BoneName, FName& AttributeName, float DefaultValue, float& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FEF94(relative to base address)
		bool GetDisablePostProcessBlueprint(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FEF78(relative to base address)
		bool GetDisableAnimCurves(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FEF58(relative to base address)
		void GetCurrentJointAngles(FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FEDEC(relative to base address)
		void GetConstraintsFromBody(FName BodyName, bool bParentConstraints, bool bChildConstraints, bool bIncludesTerminated, TArray<FConstraintInstanceAccessor>& OutConstraints); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FEC20(relative to base address)
		void GetConstraints(bool bIncludesTerminated, TArray<FConstraintInstanceAccessor>& OutConstraints); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FEB2C(relative to base address)
		FConstraintInstanceAccessor GetConstraintByName(FName ConstraintName, bool bIncludesTerminated); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FEA58(relative to base address)
		float GetClothMaxDistanceScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FEA40(relative to base address)
		UClothingSimulationInteractor GetClothingSimulationInteractor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749BC9F00(relative to base address)
		float GetBoneMass(FName BoneName, bool bScaleMass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FE97C(relative to base address)
		FVector GetBoneLinearVelocity(FName& InBoneName); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C4FE894(relative to base address)
		UAnimInstance GetAnimInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748D1C640(relative to base address)
		UClass GetAnimClass(); // Flags: Final|RequiredAPI|Native|Public, Memory Exec: 0x7FF74C4FE858(relative to base address)
		TEnumAsByte GetAnimationMode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FE87C(relative to base address)
		bool GetAllowRigidBodyAnimNode(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FE820(relative to base address)
		bool GetAllowedAnimCurveEvaluate(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FE83C(relative to base address)
		bool GetAllowClothActors(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C4FE804(relative to base address)
		void ForceClothNextUpdateTeleportAndReset(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FE7EC(relative to base address)
		void ForceClothNextUpdateTeleport(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FE7D4(relative to base address)
		FName FindConstraintBoneName(int32_t ConstraintIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FE730(relative to base address)
		void ClearMorphTargets(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FE708(relative to base address)
		void BreakConstraint(FVector Impulse, FVector HitLocation, FName InBoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C4FE41C(relative to base address)
		void BindClothToLeaderPoseComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FE408(relative to base address)
		void AllowAnimCurveEvaluation(FName NameOfCurve, bool bAllow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4FE30C(relative to base address)
		void AddImpulseToAllBodiesBelow(FVector Impulse, FName BoneName, bool bVelChange, bool bIncludeSelf); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C4FDFA8(relative to base address)
		void AddForceToAllBodiesBelow(FVector Force, FName BoneName, bool bAccelChange, bool bIncludeSelf); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74C4FDC44(relative to base address)
		void AccumulateAllBodiesBelowPhysicsBlendWeight(FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C4FDAAC(relative to base address)
	};


	// Class Engine.AnimInstance
	// Inherited from UObject
	// Size: 0x398 (0x3C0 - 0x28)
	class UAnimInstance : public UObject	
	{
	public:
		USkeleton* CurrentSkeleton; // 0x28(0x8)
		TEnumAsByte<ERootMotionMode> RootMotionMode; // 0x30(0x1)
		bool bUseMultiThreadedAnimationUpdate : 1; // 0x31:0(0x1)
		bool bUsingCopyPoseFromMesh : 1; // 0x31:1(0x1)
		unsigned char UnknownBit00 : 1; // 0x31:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit01 : 1; // 0x31:3(0x1) UNKNOWN PROPERTY
		bool bReceiveNotifiesFromLinkedInstances : 1; // 0x31:4(0x1)
		bool bPropagateNotifiesToLinkedInstances : 1; // 0x31:5(0x1)
		bool bUseMainInstanceMontageEvaluationData : 1; // 0x31:6(0x1)
		unsigned char UnknownData02_3[0x1]; // 0x32(0x1) UNKNOWN PROPERTY
		bool bQueueMontageEvents : 1; // 0x33:0(0x1)
		unsigned char UnknownData03_5[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnMontageBlendingOut; // 0x38(0x10)
		FMulticastInlineDelegate OnMontageBlendedIn; // 0x48(0x10)
		FMulticastInlineDelegate OnMontageStarted; // 0x58(0x10)
		FMulticastInlineDelegate OnMontageEnded; // 0x68(0x10)
		FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x78(0x10)
		unsigned char UnknownData04_6[0xB0]; // 0x88(0xB0) UNKNOWN PROPERTY
		TMap<FName, FInertializationRequest> SlotGroupInertializationRequestDataMap; // 0x138(0x50)
		unsigned char UnknownData05_6[0x38]; // 0x188(0x38) UNKNOWN PROPERTY
		FAnimNotifyQueue NotifyQueue; // 0x1C0(0x70)
		TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x230(0x10)
		TArray<FAnimNotifyEventReference> ActiveAnimNotifyEventReference; // 0x240(0x10)
		unsigned char UnknownData06_7[0x168]; // 0x250(0x168) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimInstance");
			return ret;
		}

		bool WasAnimNotifyTriggeredInStateMachine(int32_t MachineIndex, UClass* AnimNotifyType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F5AC8(relative to base address)
		bool WasAnimNotifyTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, UClass* AnimNotifyType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F5978(relative to base address)
		bool WasAnimNotifyTriggeredInAnyState(UClass* AnimNotifyType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F58C4(relative to base address)
		bool WasAnimNotifyStateActiveInStateMachine(int32_t MachineIndex, UClass* AnimNotifyStateType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F57C4(relative to base address)
		bool WasAnimNotifyStateActiveInSourceState(int32_t MachineIndex, int32_t StateIndex, UClass* AnimNotifyStateType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F5674(relative to base address)
		bool WasAnimNotifyStateActiveInAnyState(UClass* AnimNotifyStateType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F55D0(relative to base address)
		bool WasAnimNotifyNameTriggeredInStateMachine(int32_t MachineIndex, FName NotifyName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F54EC(relative to base address)
		bool WasAnimNotifyNameTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, FName NotifyName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F53C0(relative to base address)
		bool WasAnimNotifyNameTriggeredInAnyState(FName NotifyName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F5318(relative to base address)
		void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F5260(relative to base address)
		void UnlinkAnimClassLayers(UClass* InClass); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F51C4(relative to base address)
		APawn TryGetPawnOwner(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748E00E28(relative to base address)
		void StopSlotAnimation(float InBlendOutTime, FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F502C(relative to base address)
		void SnapshotPose(FPoseSnapshot& Snapshot); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F4F60(relative to base address)
		void SetUseMainInstanceMontageEvaluationData(bool bSet); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4ED8(relative to base address)
		void SetRootMotionMode(TEnumAsByte<ERootMotionMode> Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3C5218(relative to base address)
		void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4E50(relative to base address)
		void SetPropagateNotifiesToLinkedInstances(bool bSet); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4DC8(relative to base address)
		void SetMorphTarget(FName MorphTargetName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4D04(relative to base address)
		void SavePoseSnapshot(FName SnapshotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4C80(relative to base address)
		void ResetDynamics(ETeleportType InTeleportType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74951D9E4(relative to base address)
		bool RequestTransitionEvent(FName EventName, double RequestTimeout, ETransitionRequestQueueMode QueueMode, ETransitionRequestOverwriteMode OverwriteMode); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4B40(relative to base address)
		void RequestSlotGroupInertialization(FName InSlotGroupName, float duration, UBlendProfile* BlendProfile); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F4A48(relative to base address)
		void RemovePoseSnapshot(FName SnapshotName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F498C(relative to base address)
		bool QueryTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, FName EventName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F4894(relative to base address)
		bool QueryAndMarkTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, FName EventName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F479C(relative to base address)
		UAnimMontage PlaySlotAnimationAsDynamicMontage_WithBlendSettings(UAnimSequenceBase* Asset, FName SlotNodeName, FMontageBlendSettings& BlendInSettings, FMontageBlendSettings& BlendOutSettings, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F42BC(relative to base address)
		UAnimMontage PlaySlotAnimationAsDynamicMontage_WithBlendArgs(UAnimSequenceBase* Asset, FName SlotNodeName, FAlphaBlendArgs& BlendIn, FAlphaBlendArgs& BlendOut, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F3E2C(relative to base address)
		UAnimMontage PlaySlotAnimationAsDynamicMontage(UAnimSequenceBase* Asset, FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F3BD8(relative to base address)
		void MontageSync_StopFollowing(UAnimMontage* MontageFollower); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F25C0(relative to base address)
		void MontageSync_Follow(UAnimMontage* MontageFollower, UAnimInstance* OtherAnimInstance, UAnimMontage* MontageLeader); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F248C(relative to base address)
		void Montage_StopWithBlendSettings(FMontageBlendSettings& BlendOutSettings, UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F3A60(relative to base address)
		void Montage_StopWithBlendOut(FAlphaBlendArgs& BlendOut, UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F38F4(relative to base address)
		void Montage_StopGroupByName(float InBlendOutTime, FName GroupName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F3830(relative to base address)
		void Montage_Stop(float InBlendOutTime, UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7494830EC(relative to base address)
		void Montage_SetPosition(UAnimMontage* Montage, float NewPosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F376C(relative to base address)
		void Montage_SetPlayRate(UAnimMontage* Montage, float NewPlayRate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F36A8(relative to base address)
		void Montage_SetNextSection(FName SectionNameToChange, FName NextSection, UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F35B0(relative to base address)
		void Montage_Resume(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F34DC(relative to base address)
		float Montage_PlayWithBlendSettings(UAnimMontage* MontageToPlay, FMontageBlendSettings& BlendInSettings, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F30D0(relative to base address)
		float Montage_PlayWithBlendIn(UAnimMontage* MontageToPlay, FAlphaBlendArgs& BlendIn, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C3F2CCC(relative to base address)
		float Montage_Play(UAnimMontage* MontageToPlay, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F2B44(relative to base address)
		void Montage_Pause(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F2A88(relative to base address)
		void Montage_JumpToSectionsEnd(FName SectionName, UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F2950(relative to base address)
		void Montage_JumpToSection(FName SectionName, UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F288C(relative to base address)
		bool Montage_IsPlaying(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748FE87D4(relative to base address)
		bool Montage_IsActive(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749427B90(relative to base address)
		float Montage_GetPosition(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749B24504(relative to base address)
		float Montage_GetPlayRate(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F27FC(relative to base address)
		bool Montage_GetIsStopped(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F2768(relative to base address)
		float Montage_GetEffectivePlayRate(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F26D8(relative to base address)
		FName Montage_GetCurrentSection(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF747E3CD50(relative to base address)
		float Montage_GetBlendTime(UAnimMontage* Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F2648(relative to base address)
		void LockAIResources(bool bLockMovement, bool LockAILogic); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F23D4(relative to base address)
		void LinkAnimGraphByTag(FName InTag, UClass* InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F22FC(relative to base address)
		void LinkAnimClassLayers(UClass* InClass); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F2260(relative to base address)
		bool IsUsingMainInstanceMontageEvaluationData(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F2118(relative to base address)
		bool IsSyncGroupBetweenMarkers(FName InSyncGroupName, FName PreviousMarker, FName NextMarker, bool bRespectMarkerOrder); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1FDC(relative to base address)
		bool IsSlotActive(FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1E40(relative to base address)
		bool IsPlayingSlotAnimation(UAnimSequenceBase* Asset, FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1D78(relative to base address)
		bool IsAnyMontagePlaying(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749FA399C(relative to base address)
		bool HasMarkerBeenHitThisFrame(FName SyncGroup, FName MarkerName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1C94(relative to base address)
		bool GetTimeToClosestMarker(FName SyncGroup, FName MarkerName, float& OutMarkerTime); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1B90(relative to base address)
		FMarkerSyncAnimPosition GetSyncGroupPosition(FName InSyncGroupName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1AF0(relative to base address)
		float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F19A8(relative to base address)
		float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF7482110BC(relative to base address)
		float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F18E4(relative to base address)
		float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F1820(relative to base address)
		float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F175C(relative to base address)
		bool GetReceiveNotifiesFromLinkedInstances(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1740(relative to base address)
		bool GetPropagateNotifiesToLinkedInstances(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1724(relative to base address)
		USkeletalMeshComponent GetOwningComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7486CEC98(relative to base address)
		AActor GetOwningActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748AE9050(relative to base address)
		void GetLinkedAnimLayerInstancesByGroup(FName InGroup, TArray<UAnimInstance*>& OutLinkedInstances); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1640(relative to base address)
		UAnimInstance GetLinkedAnimLayerInstanceByGroupAndClass(FName InGroup, UClass* InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F1568(relative to base address)
		UAnimInstance GetLinkedAnimLayerInstanceByGroup(FName InGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F14DC(relative to base address)
		UAnimInstance GetLinkedAnimLayerInstanceByClass(UClass* InClass, bool bCheckForChildClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7494A2E70(relative to base address)
		void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray<UAnimInstance*>& OutLinkedInstances); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F13F8(relative to base address)
		UAnimInstance GetLinkedAnimGraphInstanceByTag(FName InTag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F136C(relative to base address)
		float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F12A8(relative to base address)
		float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F11E4(relative to base address)
		float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F1120(relative to base address)
		float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F105C(relative to base address)
		float GetInstanceMachineWeight(int32_t MachineIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0FCC(relative to base address)
		float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0F3C(relative to base address)
		float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0EAC(relative to base address)
		float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0E1C(relative to base address)
		float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0D8C(relative to base address)
		float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0CFC(relative to base address)
		float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0C6C(relative to base address)
		float GetDeltaSeconds(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F0BF8(relative to base address)
		bool GetCurveValueWithDefault(FName CurveName, float DefaultValue, float& OutValue); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0AD8(relative to base address)
		float GetCurveValue(FName CurveName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748DB1110(relative to base address)
		FName GetCurrentStateName(int32_t MachineIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C3F0A54(relative to base address)
		UAnimMontage GetCurrentActiveMontage(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74904CE54(relative to base address)
		void GetAllCurveNames(TArray<FName>& OutNames); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F0900(relative to base address)
		void GetActiveCurveNames(EAnimCurveType CurveType, TArray<FName>& OutNames); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F07E0(relative to base address)
		bool DynamicMontage_IsPlayingFrom(UAnimSequenceBase* Animation); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F0650(relative to base address)
		void ClearTransitionEvents(FName EventName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F0204(relative to base address)
		void ClearMorphTargets(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F01F0(relative to base address)
		void ClearAllTransitionEvents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3F01DC(relative to base address)
		float CalculateDirection(FVector& Velocity, FRotator& BaseRotation); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F00B4(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintPostEvaluateAnimation(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintLinkedAnimationLayersInitialized(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintInitializeAnimation(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintBeginPlay(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		float Blueprint_GetSlotMontageLocalWeight(FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F0024(relative to base address)
		UAnimInstance Blueprint_GetMainAnimInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3F0008(relative to base address)
	};


	// Class Engine.BlueprintAsyncActionBase
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UBlueprintAsyncActionBase : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintAsyncActionBase");
			return ret;
		}

		void Activate(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF746F37328(relative to base address)
	};


	// Class Engine.BlueprintCore
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UBlueprintCore : public UObject	
	{
	public:
		UClass* SkeletonGeneratedClass; // 0x28(0x8)
		UClass* GeneratedClass; // 0x30(0x8)
		bool bLegacyNeedToPurgeSkelRefs; // 0x38(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		FGuid BlueprintGuid; // 0x3C(0x10)
		unsigned char UnknownData01_7[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintCore");
			return ret;
		}
	};


	// Class Engine.Blueprint
	// Inherited from UBlueprintCore -> UObject
	// Size: 0x58 (0xA8 - 0x50)
	class UBlueprint : public UBlueprintCore	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x50(0x8) UNKNOWN PROPERTY
		UClass* ParentClass; // 0x58(0x8)
		TEnumAsByte<EBlueprintType> BlueprintType; // 0x60(0x1)
		bool bRecompileOnLoad : 1; // 0x61:0(0x1)
		bool bHasBeenRegenerated : 1; // 0x61:1(0x1)
		bool bIsRegeneratingOnLoad : 1; // 0x61:2(0x1)
		unsigned char UnknownData01_5[0x2]; // 0x62(0x2) UNKNOWN PROPERTY
		int32_t BlueprintSystemVersion; // 0x64(0x4)
		USimpleConstructionScript* SimpleConstructionScript; // 0x68(0x8)
		TArray<UActorComponent*> ComponentTemplates; // 0x70(0x10)
		TArray<UTimelineTemplate*> Timelines; // 0x80(0x10)
		TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x90(0x10)
		UInheritableComponentHandler* InheritableComponentHandler; // 0xA0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Blueprint");
			return ret;
		}
	};


	// Class Engine.DynamicBlueprintBinding
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDynamicBlueprintBinding : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DynamicBlueprintBinding");
			return ret;
		}
	};


	// Class Engine.BlueprintGeneratedClass
	// Inherited from UClass -> UStruct -> UField -> UObject
	// Size: 0x160 (0x360 - 0x200)
	class UBlueprintGeneratedClass : public UClass	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x200(0x8) UNKNOWN PROPERTY
		int32_t NumReplicatedProperties; // 0x208(0x4)
		bool bHasCookedComponentInstancingData : 1; // 0x20C:0(0x1)
		unsigned char UnknownData01_5[0x3]; // 0x20D(0x3) UNKNOWN PROPERTY
		TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x210(0x10)
		TArray<UActorComponent*> ComponentTemplates; // 0x220(0x10)
		TArray<UTimelineTemplate*> Timelines; // 0x230(0x10)
		TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x240(0x10)
		TArray<FFieldNotificationId> FieldNotifies; // 0x250(0x10)
		unsigned char UnknownData02_6[0x8]; // 0x260(0x8) UNKNOWN PROPERTY
		USimpleConstructionScript* SimpleConstructionScript; // 0x268(0x8)
		UInheritableComponentHandler* InheritableComponentHandler; // 0x270(0x8)
		unsigned char UnknownData03_6[0x8]; // 0x278(0x8) UNKNOWN PROPERTY
		UFunction* UberGraphFunction; // 0x280(0x8)
		TMap<FName, FGuid> CookedPropertyGuids; // 0x288(0x50)
		TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2D8(0x50)
		unsigned char UnknownData04_7[0x38]; // 0x328(0x38) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintGeneratedClass");
			return ret;
		}
	};


	// Class Engine.CameraActor
	// Inherited from AActor -> UObject
	// Size: 0x720 (0x9B0 - 0x290)
	class ACameraActor : public AActor	
	{
	public:
		TEnumAsByte<EAutoReceiveInput> AutoActivateForPlayer; // 0x290(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x291(0x7) UNKNOWN PROPERTY
		UCameraComponent* CameraComponent; // 0x298(0x8)
		USceneComponent* SceneComponent; // 0x2A0(0x8)
		bool bConstrainAspectRatio : 1; // 0x2A8:0(0x1)
		unsigned char UnknownData01_5[0x3]; // 0x2A9(0x3) UNKNOWN PROPERTY
		float AspectRatio; // 0x2AC(0x4)
		float FOVAngle; // 0x2B0(0x4)
		float PostProcessBlendWeight; // 0x2B4(0x4)
		unsigned char UnknownData02_6[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		FPostProcessSettings PostProcessSettings; // 0x2C0(0x6F0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.CameraActor");
			return ret;
		}

		int32_t GetAutoActivatePlayerIndex(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C45BC90(relative to base address)
	};


	// Class Engine.CameraComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x7B0 (0x9D0 - 0x220)
	class UCameraComponent : public USceneComponent	
	{
	public:
		float FieldOfView; // 0x220(0x4)
		float FirstPersonFieldOfView; // 0x224(0x4)
		float FirstPersonScale; // 0x228(0x4)
		float OrthoWidth; // 0x22C(0x4)
		bool bAutoCalculateOrthoPlanes; // 0x230(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x231(0x3) UNKNOWN PROPERTY
		float AutoPlaneShift; // 0x234(0x4)
		float OrthoNearClipPlane; // 0x238(0x4)
		float OrthoFarClipPlane; // 0x23C(0x4)
		bool bUpdateOrthoPlanes; // 0x240(0x1)
		bool bUseCameraHeightAsViewTarget; // 0x241(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x242(0x2) UNKNOWN PROPERTY
		float AspectRatio; // 0x244(0x4)
		TEnumAsByte<EAspectRatioAxisConstraint> AspectRatioAxisConstraint; // 0x248(0x1)
		bool bConstrainAspectRatio : 1; // 0x249:0(0x1)
		bool bOverrideAspectRatioAxisConstraint : 1; // 0x249:1(0x1)
		bool bUseFieldOfViewForLOD : 1; // 0x249:2(0x1)
		bool bLockToHmd : 1; // 0x249:3(0x1)
		bool bUsePawnControlRotation : 1; // 0x249:4(0x1)
		bool bEnableFirstPersonFieldOfView : 1; // 0x249:5(0x1)
		bool bEnableFirstPersonScale : 1; // 0x249:6(0x1)
		TEnumAsByte<ECameraProjectionMode> ProjectionMode; // 0x24A(0x1)
		unsigned char UnknownData02_6[0x65]; // 0x24B(0x65) UNKNOWN PROPERTY
		float PostProcessBlendWeight; // 0x2B0(0x4)
		unsigned char UnknownData03_6[0x2C]; // 0x2B4(0x2C) UNKNOWN PROPERTY
		FPostProcessSettings PostProcessSettings; // 0x2E0(0x6F0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.CameraComponent");
			return ret;
		}

		void SetUseFieldOfViewForLOD(bool bInUseFieldOfViewForLOD); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461B8C(relative to base address)
		void SetUseCameraHeightAsViewTarget(bool bInUseCameraHeightAsViewTarget); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461B0C(relative to base address)
		void SetUpdateOrthoPlanes(bool bInUpdateOrthoPlanes); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461A8C(relative to base address)
		void SetProjectionMode(TEnumAsByte<ECameraProjectionMode> InProjectionMode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461484(relative to base address)
		void SetPostProcessBlendWeight(float InPostProcessBlendWeight); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461384(relative to base address)
		void SetOrthoWidth(float InOrthoWidth); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461304(relative to base address)
		void SetOrthoNearClipPlane(float InOrthoNearClipPlane); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461284(relative to base address)
		void SetOrthoFarClipPlane(float InOrthoFarClipPlane); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C461204(relative to base address)
		void SetFirstPersonScale(float InFirstPersonScale); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C460BA4(relative to base address)
		void SetFirstPersonFieldOfView(float InFirstPersonFieldOfView); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C460B20(relative to base address)
		void SetFieldOfView(float InFieldOfView); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C2FD384(relative to base address)
		void SetEnableFirstPersonScale(bool bInEnableFirstPersonScale); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4609F4(relative to base address)
		void SetEnableFirstPersonFieldOfView(bool bInEnableFirstPersonFieldOfView); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C460968(relative to base address)
		void SetConstraintAspectRatio(bool bInConstrainAspectRatio); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4608E0(relative to base address)
		void SetAutoPlaneShift(float InAutoPlaneShift); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C460860(relative to base address)
		void SetAutoCalculateOrthoPlanes(bool bAutoCalculate); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4607E0(relative to base address)
		void SetAspectRatioAxisConstraint(TEnumAsByte<EAspectRatioAxisConstraint> InAspectRatioAxisConstraint); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C460764(relative to base address)
		void SetAspectRatio(float InAspectRatio); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4606E4(relative to base address)
		void RemoveBlendable(TScriptInterface<Class> InBlendableObject); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C45D4B0(relative to base address)
		void OnCameraMeshHiddenChanged(); // Flags: Final|RequiredAPI|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74921B8F8(relative to base address)
		void GetCameraView(float DeltaTime, FMinimalViewInfo& DesiredView); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74C45BD10(relative to base address)
		void AddOrUpdateBlendable(TScriptInterface<Class> InBlendableObject, float InWeight); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C4590C8(relative to base address)
	};


	// Class Engine.AudioEngineSubsystem
	// Inherited from UDynamicSubsystem -> USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UAudioEngineSubsystem : public UDynamicSubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AudioEngineSubsystem");
			return ret;
		}
	};


	// Class Engine.SoundBase
	// Inherited from UObject
	// Size: 0x140 (0x168 - 0x28)
	class USoundBase : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		USoundClass* SoundClassObject; // 0x30(0x8)
		bool bDebug : 1; // 0x38:0(0x1)
		bool bOverrideConcurrency : 1; // 0x38:1(0x1)
		bool bEnableBusSends : 1; // 0x38:2(0x1)
		bool bEnableBaseSubmix : 1; // 0x38:3(0x1)
		bool bEnableSubmixSends : 1; // 0x38:4(0x1)
		bool bHasDelayNode : 1; // 0x38:5(0x1)
		bool bHasConcatenatorNode : 1; // 0x38:6(0x1)
		bool bBypassVolumeScaleForPriority : 1; // 0x38:7(0x1)
		EVirtualizationMode VirtualizationMode; // 0x39(0x1)
		unsigned char UnknownData01_6[0x56]; // 0x3A(0x56) UNKNOWN PROPERTY
		TSet<USoundConcurrency*> ConcurrencySet; // 0x90(0x50)
		FSoundConcurrencySettings ConcurrencyOverrides; // 0xE0(0x20)
		float duration; // 0x100(0x4)
		float MaxDistance; // 0x104(0x4)
		float TotalSamples; // 0x108(0x4)
		float Priority; // 0x10C(0x4)
		USoundAttenuation* AttenuationSettings; // 0x110(0x8)
		USoundSubmixBase* SoundSubmixObject; // 0x118(0x8)
		TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x120(0x10)
		USoundEffectSourcePresetChain* SourceEffectChain; // 0x130(0x8)
		TArray<FSoundSourceBusSendInfo> BusSends; // 0x138(0x10)
		TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x148(0x10)
		TArray<UAssetUserData*> AssetUserData; // 0x158(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundBase");
			return ret;
		}

		bool IsAttenuationSettingsEditable(); // Flags: Native|Public|Const, Memory Exec: 0x7FF74C870558(relative to base address)
	};


	// Class Engine.SoundWave
	// Inherited from USoundBase -> UObject
	// Size: 0x288 (0x3F0 - 0x168)
	class USoundWave : public USoundBase	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x168(0x10) UNKNOWN PROPERTY
		int32_t CompressionQuality; // 0x178(0x4)
		int32_t StreamingPriority; // 0x17C(0x4)
		ESoundwaveSampleRateSettings SampleRateQuality; // 0x180(0x1)
		unsigned char UnknownData01_6[0x1]; // 0x181(0x1) UNKNOWN PROPERTY
		TEnumAsByte<ESoundGroup> SoundGroup; // 0x182(0x1)
		bool bLooping : 1; // 0x183:0(0x1)
		bool bStreaming : 1; // 0x183:1(0x1)
		bool bSeekableStreaming : 1; // 0x183:2(0x1)
		bool bUseBinkAudio : 1; // 0x183:3(0x1)
		ESoundAssetCompressionType SoundAssetCompressionType; // 0x184(0x1)
		unsigned char UnknownData02_6[0x13]; // 0x185(0x13) UNKNOWN PROPERTY
		FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x198(0x168)
		TArray<float> FrequenciesToAnalyze; // 0x300(0x10)
		TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x310(0x10)
		TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x320(0x10)
		unsigned char UnknownData03_6[0x1C]; // 0x330(0x1C) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x34C:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit05 : 1; // 0x34C:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x34C:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x34C:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x34C:4(0x1) UNKNOWN PROPERTY
		bool bMature : 1; // 0x34C:5(0x1)
		bool bManualWordWrap : 1; // 0x34C:6(0x1)
		bool bSingleLine : 1; // 0x34C:7(0x1)
		bool bIsAmbisonics : 1; // 0x34D:0(0x1)
		ESoundWaveLoadingBehavior LoadingBehavior; // 0x34E(0x1)
		unsigned char UnknownData09_6[0x1]; // 0x34F(0x1) UNKNOWN PROPERTY
		FString SpokenText; // 0x350(0x10)
		float SubtitlePriority; // 0x360(0x4)
		float Volume; // 0x364(0x4)
		float pitch; // 0x368(0x4)
		int32_t NumChannels; // 0x36C(0x4)
		int32_t SampleRate; // 0x370(0x4)
		unsigned char UnknownData10_6[0xC]; // 0x374(0xC) UNKNOWN PROPERTY
		TArray<FSubtitleCue> Subtitles; // 0x380(0x10)
		UCurveTable* Curves; // 0x390(0x8)
		UCurveTable* InternalCurves; // 0x398(0x8)
		unsigned char UnknownData11_7[0x50]; // 0x3A0(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundWave");
			return ret;
		}

		void SetSoundAssetCompressionType(ESoundAssetCompressionType InSoundAssetCompressionType, bool bMarkDirty); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C39F5F0(relative to base address)
		ESoundAssetCompressionType GetSoundAssetCompressionType(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39EE2C(relative to base address)
		TArray GetLoopRegions(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39ECFC(relative to base address)
		TArray GetCuePoints(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C39E8F4(relative to base address)
	};


	// Class Engine.SoundWaveProcedural
	// Inherited from USoundWave -> USoundBase -> UObject
	// Size: 0x50 (0x440 - 0x3F0)
	class USoundWaveProcedural : public USoundWave	
	{
	public:
		unsigned char UnknownData00_1[0x50]; // 0x3F0(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundWaveProcedural");
			return ret;
		}
	};


	// Class Engine.SoundEffectPreset
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class USoundEffectPreset : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundEffectPreset");
			return ret;
		}
	};


	// Class Engine.SoundEffectSubmixPreset
	// Inherited from USoundEffectPreset -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class USoundEffectSubmixPreset : public USoundEffectPreset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundEffectSubmixPreset");
			return ret;
		}
	};


	// Class Engine.Texture
	// Inherited from UStreamableRenderAsset -> UObject
	// Size: 0x68 (0x130 - 0xC8)
	class UTexture : public UStreamableRenderAsset	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0xC8(0x10) UNKNOWN PROPERTY
		FGuid LightingGuid; // 0xD8(0x10)
		int32_t LevelIndex; // 0xE8(0x4)
		int32_t LODBias; // 0xEC(0x4)
		TEnumAsByte<TextureCompressionSettings> CompressionSettings; // 0xF0(0x1)
		TEnumAsByte<TextureFilter> Filter; // 0xF1(0x1)
		ETextureMipLoadOptions MipLoadOptions; // 0xF2(0x1)
		TEnumAsByte<TextureCookPlatformTilingSettings> CookPlatformTilingSettings; // 0xF3(0x1)
		bool bOodlePreserveExtremes; // 0xF4(0x1)
		TEnumAsByte<TextureGroup> LODGroup; // 0xF5(0x1)
		unsigned char UnknownData01_6[0x2]; // 0xF6(0x2) UNKNOWN PROPERTY
		FPerPlatformFloat Downscale; // 0xF8(0x4)
		ETextureDownscaleOptions DownscaleOptions; // 0xFC(0x1)
		ETextureAvailability Availability; // 0xFD(0x1)
		bool SRGB : 1; // 0xFE:0(0x1)
		bool bNoTiling : 1; // 0xFE:1(0x1)
		bool VirtualTextureStreaming : 1; // 0xFE:2(0x1)
		bool CompressionYCoCg : 1; // 0xFE:3(0x1)
		bool bNotOfflineProcessed : 1; // 0xFE:4(0x1)
		bool bAsyncResourceReleaseHasBeenStarted : 1; // 0xFE:5(0x1)
		unsigned char UnknownData02_5[0x1]; // 0xFF(0x1) UNKNOWN PROPERTY
		TArray<UAssetUserData*> AssetUserData; // 0x100(0x10)
		unsigned char UnknownData03_7[0x20]; // 0x110(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Texture");
			return ret;
		}

		bool ComputeTextureSourceChannelMinMax(FLinearColor& OutColorMin, FLinearColor& OutColorMax); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|Const, Memory Exec: 0x7FF74C89EC1C(relative to base address)
		void Blueprint_GetTextureSourceDiskAndMemorySize(int64_t& OutDiskSize, int64_t& OutMemorySize); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|Const, Memory Exec: 0x7FF74C89EB44(relative to base address)
		int64_t Blueprint_GetMemorySize(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C89EAD8(relative to base address)
		bool AreDownscalePropertiesEditable(); // Flags: Native|Public|Const, Memory Exec: 0x7FF74C5A4E20(relative to base address)
	};


	// Class Engine.ActiveSoundUpdateInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UActiveSoundUpdateInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActiveSoundUpdateInterface");
			return ret;
		}
	};


	// Class Engine.Channel
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UChannel : public UObject	
	{
	public:
		UNetConnection* Connection; // 0x28(0x8)
		unsigned char UnknownData00_7[0x38]; // 0x30(0x38) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Channel");
			return ret;
		}
	};


	// Class Engine.ActorChannel
	// Inherited from UChannel -> UObject
	// Size: 0x230 (0x298 - 0x68)
	class UActorChannel : public UChannel	
	{
	public:
		AActor* Actor; // 0x68(0x8)
		unsigned char UnknownData00_6[0xF0]; // 0x70(0xF0) UNKNOWN PROPERTY
		TArray<UObject*> CreateSubObjects; // 0x160(0x10)
		unsigned char UnknownData01_7[0x128]; // 0x170(0x128) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActorChannel");
			return ret;
		}
	};


	// Class Engine.ActorInstanceManagerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UActorInstanceManagerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActorInstanceManagerInterface");
			return ret;
		}
	};


	// Class Engine.AnimationAssetExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimationAssetExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimationAssetExtensions");
			return ret;
		}
	};


	// Class Engine.AnimBlueprintClassSubsystem_PropertyAccess
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimBlueprintClassSubsystem_PropertyAccess : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimBlueprintClassSubsystem_PropertyAccess");
			return ret;
		}
	};


	// Class Engine.Interface_AnimCurveMetaData
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UInterface_AnimCurveMetaData : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Interface_AnimCurveMetaData");
			return ret;
		}
	};


	// Class Engine.AnimCurveMetaData
	// Inherited from UAssetUserData -> UObject
	// Size: 0x78 (0xA0 - 0x28)
	class UAnimCurveMetaData : public UAssetUserData	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		TMap<FName, FCurveMetaData> CurveMetaData; // 0x30(0x50)
		unsigned char UnknownData01_7[0x20]; // 0x80(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimCurveMetaData");
			return ret;
		}
	};


	// Class Engine.AnimationDataModelNotifiesExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimationDataModelNotifiesExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimationDataModelNotifiesExtensions");
			return ret;
		}
	};


	// Class Engine.AnimLayerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimLayerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimLayerInterface");
			return ret;
		}
	};


	// Class Engine.AnimationAsset
	// Inherited from UObject
	// Size: 0x58 (0x80 - 0x28)
	class UAnimationAsset : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		USkeleton* Skeleton; // 0x38(0x8)
		unsigned char UnknownData01_6[0x20]; // 0x40(0x20) UNKNOWN PROPERTY
		TArray<UAnimMetaData*> MetaData; // 0x60(0x10)
		TArray<UAssetUserData*> AssetUserData; // 0x70(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimationAsset");
			return ret;
		}

		float GetPlayLength(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3D5014(relative to base address)
		UAnimMetaData FindMetaDataByClass(UClass* MetaDataClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3D4EEC(relative to base address)
	};


	// Class Engine.AnimSequenceBase
	// Inherited from UAnimationAsset -> UObject
	// Size: 0x30 (0xB0 - 0x80)
	class UAnimSequenceBase : public UAnimationAsset	
	{
	public:
		TArray<FAnimNotifyEvent> Notifies; // 0x80(0x10)
		float SequenceLength; // 0x90(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x94(0x4) UNKNOWN PROPERTY
		FRawCurveTracks RawCurveData; // 0x98(0x10)
		float RateScale; // 0xA8(0x4)
		bool bLoop; // 0xAC(0x1)
		unsigned char UnknownData01_7[0x3]; // 0xAD(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimSequenceBase");
			return ret;
		}
	};


	// Class Engine.RawAnimSequenceTrackExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class URawAnimSequenceTrackExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.RawAnimSequenceTrackExtensions");
			return ret;
		}

		TArray GetScaleKeys(FRawAnimSequenceTrack& Track); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C36B290(relative to base address)
		TArray GetRotationalKeys(FRawAnimSequenceTrack& Track); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C36B1A0(relative to base address)
		TArray GetPositionalKeys(FRawAnimSequenceTrack& Track); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C36B0B0(relative to base address)
	};


	// Class Engine.AssetExportTask
	// Inherited from UObject
	// Size: 0x50 (0x78 - 0x28)
	class UAssetExportTask : public UObject	
	{
	public:
		UObject* Object; // 0x28(0x8)
		UExporter* Exporter; // 0x30(0x8)
		FString Filename; // 0x38(0x10)
		bool bSelected; // 0x48(0x1)
		bool bReplaceIdentical; // 0x49(0x1)
		bool bPrompt; // 0x4A(0x1)
		bool bAutomated; // 0x4B(0x1)
		bool bUseFileArchive; // 0x4C(0x1)
		bool bWriteEmptyFiles; // 0x4D(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x4E(0x2) UNKNOWN PROPERTY
		TArray<UObject*> IgnoreObjectList; // 0x50(0x10)
		UObject* Options; // 0x60(0x8)
		TArray<FString> Errors; // 0x68(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AssetExportTask");
			return ret;
		}
	};


	// Class Engine.AssetManagerSettings
	// Inherited from UDeveloperSettings -> UObject
	// Size: 0xC8 (0xF8 - 0x30)
	class UAssetManagerSettings : public UDeveloperSettings	
	{
	public:
		TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x30(0x10)
		TArray<FDirectoryPath> DirectoriesToExclude; // 0x40(0x10)
		TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x50(0x10)
		TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x60(0x10)
		bool bOnlyCookProductionAssets; // 0x70(0x1)
		bool bShouldManagerDetermineTypeAndName; // 0x71(0x1)
		bool bShouldGuessTypeAndNameInEditor; // 0x72(0x1)
		bool bShouldAcquireMissingChunksOnLoad; // 0x73(0x1)
		bool bShouldWarnAboutInvalidAssets; // 0x74(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x78(0x10)
		TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x88(0x10)
		TArray<FAssetManagerRedirect> AssetPathRedirects; // 0x98(0x10)
		TSet<FName> MetaDataTagsForAssetRegistry; // 0xA8(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AssetManagerSettings");
			return ret;
		}
	};


	// Class Engine.AsyncLoadingTests_Shared
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UAsyncLoadingTests_Shared : public UObject	
	{
	public:
		TWeakObjectPtr<UObject*> SoftReference; // 0x28(0x20)
		UObject* HardReference; // 0x48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AsyncLoadingTests_Shared");
			return ret;
		}
	};


	// Class Engine.AsyncPhysicsData
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAsyncPhysicsData : public UObject	
	{
	public:
		int32_t ServerFrame; // 0x28(0x4)
		int32_t ReplicationRedundancy; // 0x2C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AsyncPhysicsData");
			return ret;
		}
	};


	// Class Engine.AudioPanelWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAudioPanelWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AudioPanelWidgetInterface");
			return ret;
		}

		FName GetIconBrushName(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText GetEditorName(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class Engine.AutoRTFMTestActor
	// Inherited from AActor -> UObject
	// Size: 0x8 (0x298 - 0x290)
	class AAutoRTFMTestActor : public AActor	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x290(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestActor");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestAnotherActor
	// Inherited from AActor -> UObject
	// Size: 0x8 (0x298 - 0x290)
	class AAutoRTFMTestAnotherActor : public AActor	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x290(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestAnotherActor");
			return ret;
		}
	};


	// Class Engine.BodySetup
	// Inherited from UBodySetupCore -> UObject
	// Size: 0x2C0 (0x2F0 - 0x30)
	class UBodySetup : public UBodySetupCore	
	{
	public:
		FKAggregateGeom AggGeom; // 0x30(0x80)
		bool bAlwaysFullAnimWeight : 1; // 0xB0:0(0x1)
		bool bConsiderForBounds : 1; // 0xB0:1(0x1)
		bool bMeshCollideAll : 1; // 0xB0:2(0x1)
		bool bDoubleSidedGeometry : 1; // 0xB0:3(0x1)
		bool bGenerateNonMirroredCollision : 1; // 0xB0:4(0x1)
		bool bSharedCookedData : 1; // 0xB0:5(0x1)
		bool bGenerateMirroredCollision : 1; // 0xB0:6(0x1)
		bool bSupportUVsAndFaceRemap : 1; // 0xB0:7(0x1)
		unsigned char UnknownBit00 : 1; // 0xB1:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit01 : 1; // 0xB1:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit02 : 1; // 0xB1:2(0x1) UNKNOWN PROPERTY
		bool bNeverNeedsCookedCollisionData : 1; // 0xB1:3(0x1)
		unsigned char UnknownData03_5[0x6]; // 0xB2(0x6) UNKNOWN PROPERTY
		UPhysicalMaterial* PhysMaterial; // 0xB8(0x8)
		FWalkableSlopeOverride WalkableSlopeOverride; // 0xC0(0x10)
		unsigned char UnknownData04_6[0x70]; // 0xD0(0x70) UNKNOWN PROPERTY
		FBodyInstance DefaultInstance; // 0x140(0x170)
		unsigned char UnknownData05_6[0x8]; // 0x2B0(0x8) UNKNOWN PROPERTY
		FVector BuildScale3D; // 0x2B8(0x18)
		unsigned char UnknownData06_7[0x20]; // 0x2D0(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BodySetup");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestBodySetup
	// Inherited from UBodySetup -> UBodySetupCore -> UObject
	// Size: 0x8 (0x2F8 - 0x2F0)
	class UAutoRTFMTestBodySetup : public UBodySetup	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x2F0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestBodySetup");
			return ret;
		}
	};


	// Class Engine.ChildActorComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x50 (0x270 - 0x220)
	class UChildActorComponent : public USceneComponent	
	{
	public:
		UClass* ChildActorClass; // 0x220(0x8)
		AActor* ChildActor; // 0x228(0x8)
		AActor* ChildActorTemplate; // 0x230(0x8)
		unsigned char UnknownData00_6[0x18]; // 0x238(0x18) UNKNOWN PROPERTY
		bool bChildActorIsTransient : 1; // 0x250:0(0x1)
		unsigned char UnknownData01_7[0x1F]; // 0x251(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChildActorComponent");
			return ret;
		}

		void SetChildActorClass(UClass* InClass); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF747E1D688(relative to base address)
		void OnRep_ChildActor(); // Flags: Final|Native|Private, Memory Exec: 0x7FF749BC6FB0(relative to base address)
		void OnChildActorDestroyed(AActor* Actor); // Flags: Final|RequiredAPI|Native|Private, Memory Exec: 0x7FF747E1E480(relative to base address)
	};


	// Class Engine.AutoRTFMTestChildActorComponent
	// Inherited from UChildActorComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x0 (0x270 - 0x270)
	class UAutoRTFMTestChildActorComponent : public UChildActorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestChildActorComponent");
			return ret;
		}
	};


	// Class Engine.Level
	// Inherited from UObject
	// Size: 0x2F0 (0x318 - 0x28)
	class ULevel : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x98]; // 0x28(0x98) UNKNOWN PROPERTY
		UWorld* OwningWorld; // 0xC0(0x8)
		UModel* Model; // 0xC8(0x8)
		TArray<UModelComponent*> ModelComponents; // 0xD0(0x10)
		ULevelActorContainer* ActorCluster; // 0xE0(0x8)
		int32_t NumTextureStreamingUnbuiltComponents; // 0xE8(0x4)
		int32_t NumTextureStreamingDirtyResources; // 0xEC(0x4)
		ALevelScriptActor* LevelScriptActor; // 0xF0(0x8)
		ANavigationObjectBase* NavListStart; // 0xF8(0x8)
		ANavigationObjectBase* NavListEnd; // 0x100(0x8)
		TArray<UNavigationDataChunk*> NavDataChunks; // 0x108(0x10)
		float LightmapTotalSize; // 0x118(0x4)
		float ShadowmapTotalSize; // 0x11C(0x4)
		TArray<FVector> StaticNavigableGeometry; // 0x120(0x10)
		TArray<FGuid> StreamingTextureGuids; // 0x130(0x10)
		TArray<FName> StreamingTextures; // 0x140(0x10)
		uint32_t PackedTextureStreamingQualityLevelFeatureLevel; // 0x150(0x4)
		unsigned char UnknownData01_6[0xBC]; // 0x154(0xBC) UNKNOWN PROPERTY
		FGuid LevelBuildDataId; // 0x210(0x10)
		UMapBuildDataRegistry* MapBuildData; // 0x220(0x8)
		FIntVector LightBuildLevelOffset; // 0x228(0xC)
		unsigned char UnknownData02_6[0xC]; // 0x234(0xC) UNKNOWN PROPERTY
		bool bIsLightingScenario : 1; // 0x240:0(0x1)
		unsigned char UnknownBit03 : 1; // 0x240:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit04 : 1; // 0x240:2(0x1) UNKNOWN PROPERTY
		bool bTextureStreamingRotationChanged : 1; // 0x240:3(0x1)
		bool bStaticComponentsRegisteredInStreamingManager : 1; // 0x240:4(0x1)
		bool bIsVisible : 1; // 0x240:5(0x1)
		unsigned char UnknownData05_3[0x1]; // 0x241(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x242:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x242:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x242:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x242:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x242:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x242:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0x242:6(0x1) UNKNOWN PROPERTY
		bool bIsPartitioned : 1; // 0x242:7(0x1)
		unsigned char UnknownData13_5[0x65]; // 0x243(0x65) UNKNOWN PROPERTY
		AWorldSettings* WorldSettings; // 0x2A8(0x8)
		AWorldDataLayers* WorldDataLayers; // 0x2B0(0x8)
		TWeakObjectPtr<UWorldPartitionRuntimeCell*> WorldPartitionRuntimeCell; // 0x2B8(0x20)
		unsigned char UnknownData14_6[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		TArray<UAssetUserData*> AssetUserData; // 0x2E0(0x10)
		unsigned char UnknownData15_6[0x10]; // 0x2F0(0x10) UNKNOWN PROPERTY
		TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x300(0x10)
		unsigned char UnknownData16_7[0x8]; // 0x310(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Level");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestLevel
	// Inherited from ULevel -> UObject
	// Size: 0x8 (0x320 - 0x318)
	class UAutoRTFMTestLevel : public ULevel	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x318(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestLevel");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestObject
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAutoRTFMTestObject : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestObject");
			return ret;
		}

		void OnComponentPhysicsStateChanged(UPrimitiveComponent* ChangedComponent, EComponentPhysicsStateChange StateChange); // Flags: Final|RequiredAPI|Native|Public, Memory Exec: 0x7FF74C36C7F0(relative to base address)
	};


	// Class Engine.AutoRTFMTestPrimitiveComponent
	// Inherited from UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x18 (0x4E0 - 0x4C8)
	class UAutoRTFMTestPrimitiveComponent : public UPrimitiveComponent	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x4C8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestPrimitiveComponent");
			return ret;
		}
	};


	// Class Engine.BlendableInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBlendableInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlendableInterface");
			return ret;
		}
	};


	// Class Engine.AnalysisProperties
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UAnalysisProperties : public UObject	
	{
	public:
		FString Function; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnalysisProperties");
			return ret;
		}
	};


	// Class Engine.BlendSpace
	// Inherited from UAnimationAsset -> UObject
	// Size: 0x140 (0x1C0 - 0x80)
	class UBlendSpace : public UAnimationAsset	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x80(0x8) UNKNOWN PROPERTY
		bool bContainsRotationOffsetMeshSpaceSamples; // 0x88(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		FInterpolationParameter InterpolationParam; // 0x8C(0x30)
		float TargetWeightInterpolationSpeedPerSec; // 0xBC(0x4)
		bool bTargetWeightInterpolationEaseInOut; // 0xC0(0x1)
		bool bAllowMeshSpaceBlending; // 0xC1(0x1)
		bool bLoop; // 0xC2(0x1)
		unsigned char UnknownData02_6[0x1]; // 0xC3(0x1) UNKNOWN PROPERTY
		float AnimLength; // 0xC4(0x4)
		TEnumAsByte<ENotifyTriggerMode> NotifyTriggerMode; // 0xC8(0x1)
		bool bInterpolateUsingGrid; // 0xC9(0x1)
		EPreferredTriangulationDirection PreferredTriangulationDirection; // 0xCA(0x1)
		EBlendSpacePerBoneBlendMode PerBoneBlendMode; // 0xCB(0x1)
		unsigned char UnknownData03_6[0x4]; // 0xCC(0x4) UNKNOWN PROPERTY
		TArray<FPerBoneInterpolation> ManualPerBoneOverrides; // 0xD0(0x10)
		FBlendSpaceBlendProfile PerBoneBlendProfile; // 0xE0(0x10)
		unsigned char UnknownData04_6[0x10]; // 0xF0(0x10) UNKNOWN PROPERTY
		int32_t SampleIndexWithMarkers; // 0x100(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x104(0x4) UNKNOWN PROPERTY
		TArray<FBlendSample> SampleData; // 0x108(0x10)
		TArray<FEditorElement> GridSamples; // 0x118(0x10)
		FBlendSpaceData BlendSpaceData; // 0x128(0x20)
		FBlendParameter BlendParameters; // 0x148(0x60)
		TEnumAsByte<EBlendSpaceAxis> AxisToScaleAnimation; // 0x1A8(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x1A9(0x7) UNKNOWN PROPERTY
		TArray<int32_t> DimensionIndices; // 0x1B0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlendSpace");
			return ret;
		}
	};


	// Class Engine.Breakpoint
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBreakpoint : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Breakpoint");
			return ret;
		}
	};


	// Class Engine.BlueprintExtension
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBlueprintExtension : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintExtension");
			return ret;
		}
	};


	// Class Engine.BookmarkBase
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBookmarkBase : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BookmarkBase");
			return ret;
		}
	};


	// Class Engine.BookMark2D
	// Inherited from UBookmarkBase -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UBookMark2D : public UBookmarkBase	
	{
	public:
		float Zoom2D; // 0x28(0x4)
		FIntPoint Location; // 0x2C(0x8)
		unsigned char UnknownData00_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BookMark2D");
			return ret;
		}
	};


	// Class Engine.ReflectionCapture
	// Inherited from AActor -> UObject
	// Size: 0x8 (0x298 - 0x290)
	class AReflectionCapture : public AActor	
	{
	public:
		UReflectionCaptureComponent* CaptureComponent; // 0x290(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ReflectionCapture");
			return ret;
		}
	};


	// Class Engine.BoxReflectionCapture
	// Inherited from AReflectionCapture -> AActor -> UObject
	// Size: 0x0 (0x298 - 0x298)
	class ABoxReflectionCapture : public AReflectionCapture	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BoxReflectionCapture");
			return ret;
		}
	};


	// Class Engine.ReflectionCaptureComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x70 (0x290 - 0x220)
	class UReflectionCaptureComponent : public USceneComponent	
	{
	public:
		UBillboardComponent* CaptureOffsetComponent; // 0x220(0x8)
		EReflectionSourceType ReflectionSourceType; // 0x228(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x229(0x7) UNKNOWN PROPERTY
		UTextureCube* Cubemap; // 0x230(0x8)
		float SourceCubemapAngle; // 0x238(0x4)
		float Brightness; // 0x23C(0x4)
		FVector CaptureOffset; // 0x240(0x18)
		FGuid MapBuildDataId; // 0x258(0x10)
		unsigned char UnknownData01_7[0x20]; // 0x268(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ReflectionCaptureComponent");
			return ret;
		}
	};


	// Class Engine.BoxReflectionCaptureComponent
	// Inherited from UReflectionCaptureComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x18 (0x2A0 - 0x288)
	class UBoxReflectionCaptureComponent : public UReflectionCaptureComponent	
	{
	public:
		float BoxTransitionDistance; // 0x288(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x28C(0x4) UNKNOWN PROPERTY
		UBoxComponent* PreviewInfluenceBox; // 0x290(0x8)
		UBoxComponent* PreviewCaptureBox; // 0x298(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BoxReflectionCaptureComponent");
			return ret;
		}
	};


	// Class Engine.BuiltInAttributesExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBuiltInAttributesExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BuiltInAttributesExtensions");
			return ret;
		}
	};


	// Class Engine.ChaosBlueprintLibrary
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UChaosBlueprintLibrary : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChaosBlueprintLibrary");
			return ret;
		}

		UChaosEventRelay GetEventRelayFromContext(UObject* ContextObject); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74C36C74C(relative to base address)
	};


	// Class Engine.ChaosEventRelay
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UChaosEventRelay : public UObject	
	{
	public:
		FMulticastInlineDelegate OnCollisionEvent; // 0x28(0x10)
		FMulticastInlineDelegate OnBreakEvent; // 0x38(0x10)
		FMulticastInlineDelegate OnRemovalEvent; // 0x48(0x10)
		FMulticastInlineDelegate OnCrumblingEvent; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChaosEventRelay");
			return ret;
		}
	};


	// Class Engine.Player
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UPlayer : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		APlayerController* PlayerController; // 0x30(0x8)
		int32_t CurrentNetSpeed; // 0x38(0x4)
		int32_t ConfiguredInternetSpeed; // 0x3C(0x4)
		int32_t ConfiguredLanSpeed; // 0x40(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x44(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Player");
			return ret;
		}
	};


	// Class Engine.NetConnection
	// Inherited from UPlayer -> UObject
	// Size: 0x1DC8 (0x1E10 - 0x48)
	class UNetConnection : public UPlayer	
	{
	public:
		TArray<UChildConnection*> Children; // 0x48(0x10)
		UNetDriver* Driver; // 0x58(0x8)
		UClass* PackageMapClass; // 0x60(0x8)
		UPackageMap* PackageMap; // 0x68(0x8)
		TArray<UChannel*> OpenChannels; // 0x70(0x10)
		TArray<AActor*> SentTemporaries; // 0x80(0x10)
		AActor* ViewTarget; // 0x90(0x8)
		AActor* OwningActor; // 0x98(0x8)
		int32_t MaxPacket; // 0xA0(0x4)
		bool InternalAck : 1; // 0xA4:0(0x1)
		unsigned char UnknownData00_5[0xBB]; // 0xA5(0xBB) UNKNOWN PROPERTY
		FUniqueNetIdRepl PlayerId; // 0x160(0x30)
		unsigned char UnknownData01_6[0x48]; // 0x190(0x48) UNKNOWN PROPERTY
		double LastReceiveTime; // 0x1D8(0x8)
		unsigned char UnknownData02_6[0x11E0]; // 0x1E0(0x11E0) UNKNOWN PROPERTY
		int32_t DefaultMaxChannelSize; // 0x13C0(0x4)
		unsigned char UnknownData03_6[0x334]; // 0x13C4(0x334) UNKNOWN PROPERTY
		TArray<UChannel*> ChannelsToTick; // 0x16F8(0x10)
		unsigned char UnknownData04_7[0x708]; // 0x1708(0x708) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.NetConnection");
			return ret;
		}
	};


	// Class Engine.ChildConnection
	// Inherited from UNetConnection -> UPlayer -> UObject
	// Size: 0x8 (0x1E18 - 0x1E10)
	class UChildConnection : public UNetConnection	
	{
	public:
		UNetConnection* Parent; // 0x1E10(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChildConnection");
			return ret;
		}
	};


	// Class Engine.PlatformInterfaceBase
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UPlatformInterfaceBase : public UObject	
	{
	public:
		TArray<FDelegateArray> AllDelegates; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlatformInterfaceBase");
			return ret;
		}
	};


	// Class Engine.CloudStorageBase
