#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: FortniteUI
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class FortniteUI.AccoladeProductData
	// Inherited from UDataAsset -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UAccoladeProductData : public UDataAsset	
	{
	public:
		TArray<FAthenaCollectionScreenContainerTabInfo> TabInfos; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AccoladeProductData");
			return ret;
		}
	};


	// Class FortniteUI.AllSelectSubsystem
	// Inherited from ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class UAllSelectSubsystem : public ULocalPlayerSubsystem	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AllSelectSubsystem");
			return ret;
		}
	};


	// Class FortniteUI.AthenaChallengeComponentWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B0 - 0x2B0)
	class UAthenaChallengeComponentWidget : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaChallengeComponentWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaChallengeListEntryContextInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaChallengeListEntryContextInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaChallengeListEntryContextInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortHUDElementWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x318 - 0x2D8)
	class UFortHUDElementWidget : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		FGameplayTag ElementTag; // 0x2E0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x2E4(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer HUDElementTag; // 0x2E8(0x20)
		ESlateVisibility HiddenVisibility; // 0x308(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x309(0x7) UNKNOWN PROPERTY
		UTutorialHighlight* TutorialHighlight; // 0x310(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHUDElementWidget");
			return ret;
		}

		void OnVisibilitySetEvent(ESlateVisibility InVisibility); // Flags: RequiredAPI|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPlayerControllerSet_BP(); // Flags: RequiredAPI|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool HasAnyTags(FGameplayTagContainer& InTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FFF00E4(relative to base address)
		void HandleOnHUDElementVisibilityChanged(FGameplayTagContainer& HiddenHUDElementTags); // Flags: RequiredAPI|Native|Protected|HasOutParms, Memory Exec: 0x7FF74FFEFCC8(relative to base address)
		void HandleGetHUDElementWidgetsForTags(FGameplayTagContainer& HUDElementTags, TArray<UFortHUDElementWidget*>& OutWidgets); // Flags: Final|Native|Public|HasOutParms, Memory Exec: 0x7FF74FFEF6C0(relative to base address)
		void AppendHUDElementTags(FGameplayTagContainer& AdditionalTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FFEDDFC(relative to base address)
	};


	// Class FortniteUI.FortMobileHUDElement
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x348 - 0x318)
	class UFortMobileHUDElement : public UFortHUDElementWidget	
	{
	public:
		FGameplayTag SizePropertyTag; // 0x318(0x4)
		unsigned char UnknownData00_6[0x14]; // 0x31C(0x14) UNKNOWN PROPERTY
		UImage* Image_Background; // 0x330(0x8)
		int32_t ForcedZOrder; // 0x338(0x4)
		bool bShouldFillParent; // 0x33C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x33D(0x3) UNKNOWN PROPERTY
		UScaleBox* ScaleBox_HUDWidgetScale; // 0x340(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDElement");
			return ret;
		}

		void OnHUDThemeChanged(EHUDLayoutToolTheme EHUDLayoutToolTheme); // Flags: RequiredAPI|Native|Public, Memory Exec: 0x7FF74FE5CDDC(relative to base address)
	};


	// Class FortniteUI.BacchusHUDElement
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x368 - 0x348)
	class UBacchusHUDElement : public UFortMobileHUDElement	
	{
	public:
		bool bHideWhenNotUsingTouch; // 0x348(0x1)
		bool bUpdatesWithHUDState; // 0x349(0x1)
		bool bAlwaysShow; // 0x34A(0x1)
		EBacchusHUDStateType OnInBuildMode; // 0x34B(0x1)
		EBacchusHUDStateType OnInCombatMode; // 0x34C(0x1)
		EBacchusHUDStateType OnInEditMode; // 0x34D(0x1)
		EBacchusHUDStateType OnInCreativeMode; // 0x34E(0x1)
		EBacchusHUDStateType OnInBattleLabMode; // 0x34F(0x1)
		EBacchusHUDStateType IsFreeFalling; // 0x350(0x1)
		EBacchusHUDStateType IsGliding; // 0x351(0x1)
		EBacchusHUDStateType CanOpenChute; // 0x352(0x1)
		EBacchusHUDStateType InLockedBus; // 0x353(0x1)
		EBacchusHUDStateType InUnlockedBus; // 0x354(0x1)
		EBacchusHUDStateType OnTargeting; // 0x355(0x1)
		EBacchusHUDStateType OnUsingScopeTargeting; // 0x356(0x1)
		EBacchusHUDStateType OnCanTarget; // 0x357(0x1)
		EBacchusHUDStateType OnCanUseScopeTargeting; // 0x358(0x1)
		EBacchusHUDStateType OnCrouching; // 0x359(0x1)
		EBacchusHUDStateType OnCanUseSecondaryAbility; // 0x35A(0x1)
		EBacchusHUDStateType OnDBNO; // 0x35B(0x1)
		EBacchusHUDStateType OnCarryingDBNO; // 0x35C(0x1)
		EBacchusHUDStateType OnCarryingHeldObject; // 0x35D(0x1)
		EBacchusHUDStateType OnImprovedDBNO; // 0x35E(0x1)
		EBacchusHUDStateType OnControllingRCPawn; // 0x35F(0x1)
		EBacchusHUDStateType OnInVehicle; // 0x360(0x1)
		EBacchusHUDStateType OnDrivingVehicle; // 0x361(0x1)
		EBacchusHUDStateType OnZiplining; // 0x362(0x1)
		unsigned char UnknownData00_7[0x5]; // 0x363(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusHUDElement");
			return ret;
		}

		void ShowHighlight(bool Show); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnHUDStateUpdate(FFortHUDState& NewState); // Flags: Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74FDF3E40(relative to base address)
		void HandleInputMethodChanged(ECommonInputType CurrentInputType); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FDF336C(relative to base address)
	};


	// Class FortniteUI.AthenaEquippedItemBase
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xC0 (0x428 - 0x368)
	class UAthenaEquippedItemBase : public UBacchusHUDElement	
	{
	public:
		EEquippedWeaponDisplay CurrentMode; // 0x368(0x1)
		unsigned char UnknownData00_6[0xB]; // 0x369(0xB) UNKNOWN PROPERTY
		int32_t AmountConsideredInfinite; // 0x374(0x4)
		FText DefaultOutOfAmmoText; // 0x378(0x10)
		UCommonVisibilitySwitcher* Switcher_Content; // 0x388(0x8)
		UPanelWidget* Panel_ResourceContent; // 0x390(0x8)
		UPanelWidget* Panel_AmmoContent; // 0x398(0x8)
		UPanelWidget* Panel_UtilityContent; // 0x3A0(0x8)
		UImage* Image_AmmoIcon; // 0x3A8(0x8)
		UImage* Image_ResourceIcon; // 0x3B0(0x8)
		UImage* Image_UtilitySplit; // 0x3B8(0x8)
		UImage* Image_RechargeableIcon; // 0x3C0(0x8)
		UImage* Image_UtilityIcon; // 0x3C8(0x8)
		UCommonTextBlock* Text_MagazineAmmoCount; // 0x3D0(0x8)
		UCommonTextBlock* Text_SurplusAmmoCount; // 0x3D8(0x8)
		UCommonTextBlock* Text_ResourceCount; // 0x3E0(0x8)
		UCommonTextBlock* Text_SurplusUtilityAmmoCount; // 0x3E8(0x8)
		UCommonTextBlock* Text_UtilityAmmoCount; // 0x3F0(0x8)
		UCommonTextBlock* Text_OutOfAmmo; // 0x3F8(0x8)
		UOverlay* Overlay_UtilityAmmoIcon; // 0x400(0x8)
		UScaleBox* RootScaleBox; // 0x408(0x8)
		ESlateVisibility WeaponEquipVisibility; // 0x410(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x411(0x7) UNKNOWN PROPERTY
		TArray<FGameplayAttribute> TrackedAttributes; // 0x418(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemBase");
			return ret;
		}

		void HandleWorldItemsChanged(); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB0B10(relative to base address)
		void HandleWeaponTargetingChanged(bool bIsTargeting); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB0A90(relative to base address)
		void HandleWeaponReloadStarted(float ReloadTime, EFortWeaponReloadType ReloadType); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB09CC(relative to base address)
		void HandleWeaponReloadCancelled(); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB09B8(relative to base address)
		void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB0878(relative to base address)
		void HandleWeaponEquipped(AFortWeapon* NewWeapon, AFortWeapon* PrevWeapon); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB07B4(relative to base address)
		void HandleViewTargetChanged(); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB07A0(relative to base address)
		void HandleSecondaryFireReleased(AFortWeapon* Weapon); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB0340(relative to base address)
		void HandleSecondaryFirePressed(AFortWeapon* Weapon); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB02C0(relative to base address)
		void HandleLocalAmmoChanged(int32_t LocalCount, int32_t LocalRemaining); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAF8A4(relative to base address)
		void HandleBuildingMaterialChanged(); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAF564(relative to base address)
		void BP_HandleWeaponTargetingChanged(bool bIsTargeting); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleWeaponReloadStarted(float ReloadTime, EFortWeaponReloadType ReloadType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleWeaponReloadCancelled(AFortWeapon* Weapon); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleWeaponModeChanged(EEquippedWeaponDisplay Mode); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleWeaponEquipped(AFortWeapon* NewWeapon, AFortWeapon* PrevWeapon); // Flags: Native|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF74FCAEF58(relative to base address)
		void BP_HandleSecondaryFireReleased(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleSecondaryFirePressed(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleResourceTypeChanged(UFortResourceItemDefinition* Item, int32_t ResourceCount); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleResourceCountChanged(int32_t ResourceCount); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleHideAmmo(bool bHideReserveAmmo, bool bHideMagazineAmmo); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleHasAmmoChanged(bool bHasAmmo); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleAmmoCountChanged(int32_t MagazineAmmoCount, int32_t SurplusAmmoCount, int32_t TotalRemaining); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleAmmoClipAttributeChanged(float Value); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaEquippedItemReticleWidgetBase
	// Inherited from UAthenaEquippedItemBase -> UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x470 - 0x428)
	class UAthenaEquippedItemReticleWidgetBase : public UAthenaEquippedItemBase	
	{
	public:
		int32_t MaximumAmmo; // 0x428(0x4)
		float CurrentAmmoPercentage; // 0x42C(0x4)
		float LowAmmoPercentage; // 0x430(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x434(0x4) UNKNOWN PROPERTY
		UMaterialInstanceDynamic* AmmoCounterMaterialInstanceDynamic; // 0x438(0x8)
		UCommonBorder* AmmoCounter; // 0x440(0x8)
		AFortWeapon* CurrentEquippedWeapon; // 0x448(0x8)
		bool bShouldHideReticleAmmoCounterWhileTargeting; // 0x450(0x1)
		bool bIsHoldingSecondaryFire; // 0x451(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x452(0x2) UNKNOWN PROPERTY
		float TimeToOutroAnim; // 0x454(0x4)
		FTimerHandle FadeOutTimerHandle; // 0x458(0x8)
		bool bIsAmmoVisible; // 0x460(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x461(0x7) UNKNOWN PROPERTY
		UWidgetAnimation* FadeoutAnimation; // 0x468(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemReticleWidgetBase");
			return ret;
		}

		void OnAmmoCountChanged(int32_t MagazineAmmoCount, int32_t MaximumMagazineAmmoCount, EFortWeaponReloadType ReloadType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FadeAmmoOut(float PlaybackSpeed); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FBE4(relative to base address)
		void FadeAmmoInOut(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FBD0(relative to base address)
		void FadeAmmoIn(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FBBC(relative to base address)
		void DefaultFadeAmmoOut(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FBA0(relative to base address)
	};


	// Class FortniteUI.AthenaEquippedItemInfoWidget
	// Inherited from UAthenaEquippedItemBase -> UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x178 (0x5A0 - 0x428)
	class UAthenaEquippedItemInfoWidget : public UAthenaEquippedItemBase	
	{
	public:
		unsigned char UnknownData00_1[0x178]; // 0x428(0x178) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemInfoWidget");
			return ret;
		}

		void OnExtensionWidgetAdded(EUIExtensionSlot ExtensionSlot, UUserWidget* ExtensionWidget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaEquippedItemWidgetBase
	// Inherited from UAthenaEquippedItemInfoWidget -> UAthenaEquippedItemBase -> UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x5D8 - 0x5A0)
	class UAthenaEquippedItemWidgetBase : public UAthenaEquippedItemInfoWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x5A0(0x8) UNKNOWN PROPERTY
		float OutroDelayTime; // 0x5A8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x5AC(0x4) UNKNOWN PROPERTY
		UVerticalBox* SwitchPopup; // 0x5B0(0x8)
		UCommonTextBlock* SwitchPopupText; // 0x5B8(0x8)
		UFortSimpleWidgetAnimationsPanel* SimpleAnimations; // 0x5C0(0x8)
		FName IntroAnimName; // 0x5C8(0x4)
		FName OutroAnimName; // 0x5CC(0x4)
		unsigned char UnknownData02_7[0x8]; // 0x5D0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaEquippedItemWidgetBase");
			return ret;
		}

		void OnPopUpOnSwitchDone(); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC4FE50(relative to base address)
	};


	// Class FortniteUI.AthenaFrontendFlowInterruptInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaFrontendFlowInterruptInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaFrontendFlowInterruptInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaFullScreenMapBrowsingControlsWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x448 - 0x3F0)
	class UAthenaFullScreenMapBrowsingControlsWidget : public UCommonActivatableWidget	
	{
	public:
		UPanelWidget* Panel_PanGroup; // 0x3F0(0x8)
		UPanelWidget* Panel_ZoomGroup; // 0x3F8(0x8)
		USizeBox* SizeBox_PlaceMarker; // 0x400(0x8)
		UCommonTextBlock* Text_PlaceMarker; // 0x408(0x8)
		UCommonActionWidget* Action_PlaceMarker; // 0x410(0x8)
		UCommonActionWidget* Action_RemoveMarker; // 0x418(0x8)
		USizeBox* SizeBox_TeleportToMarker; // 0x420(0x8)
		FText TextPlaceMarker; // 0x428(0x10)
		FText TextRemoveMarker; // 0x438(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaFullScreenMapBrowsingControlsWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaGoalsPageBaseCard
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x2F8 - 0x2B0)
	class UAthenaGoalsPageBaseCard : public UUserWidget	
	{
	public:
		UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeRemaining; // 0x2B0(0x8)
		UPanelWidget* Panel_TimeRemaining; // 0x2B8(0x8)
		FText TextExpired; // 0x2C0(0x10)
		unsigned char UnknownData00_7[0x28]; // 0x2D0(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaGoalsPageBaseCard");
			return ret;
		}

		void ShowNewBang(bool bEnabled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateIsSelectable(bool bCardIsSelectable); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateHeader(FBundleGoalCardDisplayData& GoalCardDisplayData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateBattlePassRequirement(bool bBattlePassRequired); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTimerSet(EAthenaChallengeTimerState TimerState); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool GetIsSelectable(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FDC1F7C(relative to base address)
		void BP_SetDisabled(bool bDisabled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_PostSetData(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelectionChanged(bool bSelected); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaGoalsPageGiftCard
	// Inherited from UAthenaGoalsPageBaseCard -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA8 (0x3A0 - 0x2F8)
	class UAthenaGoalsPageGiftCard : public UAthenaGoalsPageBaseCard	
	{
	public:
		FChallengeBundleGiftCardDisplayData DisplayData; // 0x2F8(0x98)
		TWeakObjectPtr<UFortChallengeBundleItem*> ChallengeBundle; // 0x390(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x398(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaGoalsPageGiftCard");
			return ret;
		}

		void Update(); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FC4FEF8(relative to base address)
		void PopulateRelogin(bool bInFrontend); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateHasAvailableQuestsForCompletion(int32_t AvailableQuestsAmount); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateAllQuestsAreCompletedButSomeNotClaimed(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateAllQuestsAreClaimedBundleIsNotCompleted(FTimespan& TimeRemainingForNextQuest); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopulateAllQuestsAreClaimedBundleIsCompleted(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaHUDFeedbackLine
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x3B0 - 0x318)
	class UAthenaHUDFeedbackLine : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x318(0x8) UNKNOWN PROPERTY
		UFortDynamicEntryBox* DynamicEntryBox_Keybinds; // 0x320(0x8)
		UCommonRichTextBlock* RichText_Feedback; // 0x328(0x8)
		unsigned char UnknownData01_7[0x80]; // 0x330(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDFeedbackLine");
			return ret;
		}

		void OnShowEnabledUpdated(bool bShowEnabled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaHUDFeedbackLineCooldown
	// Inherited from UAthenaHUDFeedbackLine -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x3C0 - 0x3B0)
	class UAthenaHUDFeedbackLineCooldown : public UAthenaHUDFeedbackLine	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x3B0(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDFeedbackLineCooldown");
			return ret;
		}

		void RegisterAbilityNotify(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC4FE64(relative to base address)
		void OnCooldownUpdated(float CooldownDuration, float CooldownRemaining, float CooldownPercentage); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCooldownTagChanged(FGameplayTag CooldownTag, int32_t Count); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC4FC88(relative to base address)
		void OnCooldownStarted(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCooldownFinished(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaHUDPickupItemWidgetBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2F0 - 0x2D8)
	class UAthenaHUDPickupItemWidgetBase : public UCommonUserWidget	
	{
	public:
		UAthenaItemDetailsHeaderBase* ItemDetailsHeader; // 0x2D8(0x8)
		TWeakObjectPtr<AFortPickup*> Pickup; // 0x2E0(0x8)
		TWeakObjectPtr<UFortItem*> PickupItem; // 0x2E8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDPickupItemWidgetBase");
			return ret;
		}

		void SetPickup(AFortPickup* NewPickup); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7487DAD74(relative to base address)
	};


	// Class FortniteUI.FortPrimaryContentInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortPrimaryContentInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPrimaryContentInterface");
			return ret;
		}

		FPrimaryContentSetup GetPrimaryContentSetup(); // Flags: Native|Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF7503CB070(relative to base address)
	};


	// Class FortniteUI.AthenaHUDPrimaryContentInterface
	// Inherited from UFortPrimaryContentInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaHUDPrimaryContentInterface : public UFortPrimaryContentInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDPrimaryContentInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaInventoryGroupBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x340 - 0x2D8)
	class UAthenaInventoryGroupBase : public UCommonUserWidget	
	{
	public:
		TWeakObjectPtr<UAthenaInventoryPanel*> ParentInventoryPanel; // 0x2D8(0x8)
		UFortItemTileView* ItemTileView; // 0x2E0(0x8)
		TArray<EFortItemType> FilteredItemTypes; // 0x2E8(0x10)
		int32_t DefaultNumEntries; // 0x2F8(0x4)
		EInventoryContentSortType InventoryContentSortType; // 0x2FC(0x1)
		unsigned char UnknownData00_7[0x43]; // 0x2FD(0x43) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaInventoryGroupBase");
			return ret;
		}
	};


	// Class FortniteUI.AthenaInventoryGroupResources
	// Inherited from UAthenaInventoryGroupBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x380 - 0x340)
	class UAthenaInventoryGroupResources : public UAthenaInventoryGroupBase	
	{
	public:
		FGameplayTagContainer CurrencyItemTags; // 0x340(0x20)
		FGameplayTagContainer IngredientItemTags; // 0x360(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaInventoryGroupResources");
			return ret;
		}
	};


	// Class FortniteUI.FortTabInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortTabInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTabInterface");
			return ret;
		}

		bool OnShouldCreateTab(bool& bOutShouldCreateTab, UObject* WorldContextObject); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaInventoryTabInterface
	// Inherited from UFortTabInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaInventoryTabInterface : public UFortTabInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaInventoryTabInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortItemDetailsHostPanel
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x3B8 - 0x2D8)
	class UFortItemDetailsHostPanel : public UCommonUserWidget	
	{
	public:
		FMulticastInlineDelegate OnItemChanged; // 0x2D8(0x10)
		TWeakObjectPtr<UFortItem*> ItemToDetail; // 0x2E8(0x8)
		unsigned char UnknownData00_6[0x10]; // 0x2F0(0x10) UNKNOWN PROPERTY
		TWeakObjectPtr<UFortItem*> ItemToCompareWith; // 0x300(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x308(0x10) UNKNOWN PROPERTY
		bool bShouldPreviewUpgradingItem; // 0x318(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x319(0x3) UNKNOWN PROPERTY
		int32_t UpgradeLevelDelta; // 0x31C(0x4)
		UScrollBox* ScrollBox; // 0x320(0x8)
		UNamedSlot* DetailsContainerSlotWidget; // 0x328(0x8)
		UCommonBorder* HighRarityBorder; // 0x330(0x8)
		TScriptInterface<Class> ItemViewContext; // 0x338(0x10)
		EFortItemInspectionMode CurrentInspectMode; // 0x348(0x1)
		unsigned char UnknownData03_6[0x27]; // 0x349(0x27) UNKNOWN PROPERTY
		int32_t QuantityOverride; // 0x370(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x374(0x4) UNKNOWN PROPERTY
		UFortTooltipLoadingWrapper* ItemToDetailLoadingWrapper; // 0x378(0x8)
		UFortTooltipLoadingWrapper* ItemToCompareLoadingWrapper; // 0x380(0x8)
		UCommonLoadGuard* ItemToDetailLoadGuard; // 0x388(0x8)
		UCommonLoadGuard* ItemToCompareLoadGuard; // 0x390(0x8)
		UCommonBorder* Border_Details; // 0x398(0x8)
		UImage* Image_RechargeableIcon; // 0x3A0(0x8)
		bool bAsyncLoadTooltipData; // 0x3A8(0x1)
		bool bIsUpdatingSuspended; // 0x3A9(0x1)
		unsigned char UnknownData05_7[0xE]; // 0x3AA(0xE) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemDetailsHostPanel");
			return ret;
		}

		void UpdateRechargeIcon(UFortItem* ItemToRepresent); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF7501BD6EC(relative to base address)
		void ShouldPreviewUpgradingItem(bool Value); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BD39C(relative to base address)
		void SetUpgradeLevelDelta(int32_t InDelta); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BD1B4(relative to base address)
		void SetScrollWidget(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BCB98(relative to base address)
		void SetQuantityOverride(int32_t QuantityOverride); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BC830(relative to base address)
		void SetItemViewContext(TScriptInterface<Class>& ItemViewContext); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7501BB7E8(relative to base address)
		void SetItemToDetail(UFortItem* ItemToDetail); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BB280(relative to base address)
		void SetItemToCompareWith(UFortItem* ItemToCompareWith); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BB100(relative to base address)
		void SetIsUpdatingSuspended(bool bValue); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BA6B8(relative to base address)
		void SetInspectMode(EFortItemInspectionMode InspectMode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7501BA5B8(relative to base address)
		void OnItemChangedDelegate__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleUpgradeLevelDeltaChangedBP(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleShouldPreviewUpgradingItemChangedBP(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleQuantityOverrideChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleItemToDetailTooltipAssetsLoading(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleItemToDetailTooltipAssetsLoaded(); // Flags: Final|Native|Private, Memory Exec: 0x7FF7476407DC(relative to base address)
		void HandleItemToDetailChangedBP(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleItemToCompareTooltipAssetsLoading(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleItemToCompareTooltipAssetsLoaded(); // Flags: Final|Native|Private, Memory Exec: 0x7FF7501B95B4(relative to base address)
		void HandleItemRefundComplete(bool bWasSuccessful, FString ConvertedItemInstanceId, TArray<FFortItemInstanceQuantityPair>& ItemsQuantities); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF7501B9368(relative to base address)
		void HandleItemRarityUpgradeComplete(bool bWasSuccessful, FString ConvertedItemInstanceId, TArray<FFortItemInstanceQuantityPair>& ItemsQuantities); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF7501B9368(relative to base address)
		void HandleItemEvolutionComplete(bool bWasSuccessful, FString ConvertedItemInstanceId, TArray<FFortItemInstanceQuantityPair>& ItemsQuantities); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF7501B9368(relative to base address)
		void HandleInspectModeChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleDifferentItemToDetailSet(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleDifferentItemToCompareSet(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaItemDetailsHeaderBase
	// Inherited from UFortItemDetailsHostPanel -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x148 (0x500 - 0x3B8)
	class UAthenaItemDetailsHeaderBase : public UFortItemDetailsHostPanel	
	{
	public:
		FFortRarityItemData RarityData; // 0x3B8(0x78)
		int32_t NoAmmoSwitcherIndex; // 0x430(0x4)
		bool bMinimalAmmoTooltip; // 0x434(0x1)
		bool bShowAmmoHeader; // 0x435(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x436(0x2) UNKNOWN PROPERTY
		UMaterialInstanceDynamic* RarityBorderMID; // 0x438(0x8)
		UMaterialInstanceDynamic* LevelBarMID; // 0x440(0x8)
		UWidgetSwitcher* CommonWidgetSwitcher_Stack; // 0x448(0x8)
		UCommonBorder* RarityBorder; // 0x450(0x8)
		UHorizontalBox* TagListBox; // 0x458(0x8)
		USpacer* IconSpacer; // 0x460(0x8)
		UCommonBorder* LevelBar; // 0x468(0x8)
		UWidgetSwitcher* RatingSwitcher; // 0x470(0x8)
		UFortTierIndicator* TierIndicator; // 0x478(0x8)
		UTextBlock* SlotsCount; // 0x480(0x8)
		UHorizontalBox* TertiaryRow; // 0x488(0x8)
		UFortItemCategoryIndicator* CategoryIndicatorTertiary; // 0x490(0x8)
		UTextBlock* AmmoLoadedText; // 0x498(0x8)
		UItemCostWidgetBase* ItemCostWidget; // 0x4A0(0x8)
		UFortLazyImage* Image_MinimalIconPreview; // 0x4A8(0x8)
		UTextBlock* Text_ItemNameShort; // 0x4B0(0x8)
		UTextBlock* Text_ItemNameShort_Amount; // 0x4B8(0x8)
		UHorizontalBox* CraftingIngredientBox; // 0x4C0(0x8)
		UItemCostWidgetBase* ItemCostWidgetShort; // 0x4C8(0x8)
		UTextBlock* Text_WeaponName; // 0x4D0(0x8)
		UImage* Image_RarityGlow; // 0x4D8(0x8)
		UTextBlock* Text_WeaponRarityValue; // 0x4E0(0x8)
		UHorizontalBox* HorizontalBox_Tertiary2; // 0x4E8(0x8)
		UFortItemCategoryIndicator* CategoryIndicatorTertiary; // 0x4F0(0x8)
		UTextBlock* AmmoLoadedText; // 0x4F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaItemDetailsHeaderBase");
			return ret;
		}

		void UpdateQuantityText(int32_t Count, bool bIsZeroDisplayed); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FF20(relative to base address)
		void UpdateItemForWidgets(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FF0C(relative to base address)
		UFortWeaponItemDefinition TryGetWeaponItemDefForItem(UFortItem* Item); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC4FE78(relative to base address)
		void SetItemCost(AActor* Actor); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaMapLegendEntryIcon
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E0 - 0x2D8)
	class UAthenaMapLegendEntryIcon : public UCommonUserWidget	
	{
	public:
		UFortLazyImage* FortLazyImage_LegendIcon; // 0x2D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapLegendEntryIcon");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMapLegendEntryWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2E8 - 0x2D8)
	class UAthenaMapLegendEntryWidget : public UCommonUserWidget	
	{
	public:
		UDynamicEntryBox* DynamicEntryBox_LegendIcons; // 0x2D8(0x8)
		UCommonTextBlock* Text_EntryName; // 0x2E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapLegendEntryWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMapLegendWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x410 - 0x3F0)
	class UAthenaMapLegendWidget : public UCommonActivatableWidget	
	{
	public:
		TArray<FAthenaMapLegendEntryData> MapLegendEntries; // 0x3F0(0x10)
		UPanelWidget* SizeBox_LegendPanel; // 0x400(0x8)
		UDynamicEntryBox* EntryBox_LegendEntries; // 0x408(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapLegendWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaMapScreenContainerTabInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaMapScreenContainerTabInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMapScreenContainerTabInterface");
			return ret;
		}

		void OnTabAddedToMapScreenContainer(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool OnShouldShowTabOnMapScreenForMinigame(bool& bOutShouldShowTabOnMapScreenForMinigame, AFortMinigame* Minigame); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool OnShouldDisplayBackActionInActionBar(bool& bOutShouldDisplayBackActionInActionBar); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool OnShouldCreateMapScreenTab(bool& bOutShouldCreateMapScreenTab, UObject* WorldContextObject); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool OnHandleMapBackAction(bool& bOutBackActionHandled); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool OnHandleMapActionKey(FKey& InKey, bool bKeyDown, bool& bOutMapActionHandled); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool OnBlockMapActionByKey(FKey& InKey, bool& bOutMapActionBlocked); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortUIStateWidgetBase
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x408 - 0x3F0)
	class UFortUIStateWidgetBase : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x3F0(0x10) UNKNOWN PROPERTY
		UCommonActivatableWidgetStack* WidgetStack_PrimaryContent; // 0x400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIStateWidgetBase");
			return ret;
		}
	};


	// Class FortniteUI.AthenaHUDBase
	// Inherited from UFortUIStateWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x230 (0x638 - 0x408)
	class UAthenaHUDBase : public UFortUIStateWidgetBase	
	{
	public:
		unsigned char UnknownData00_3[0x30]; // 0x408(0x30) UNKNOWN PROPERTY
		TArray<UUserWidget*> MinigameWidgets; // 0x438(0x10)
		UClass* KairosHUDLayerClass; // 0x448(0x8)
		TArray<FMutatorAddedWidgets> MutatorAddedWidgets; // 0x450(0x10)
		unsigned char UnknownData01_6[0xF0]; // 0x460(0xF0) UNKNOWN PROPERTY
		UAthenaMapScreenContainer* MapScreenContainer; // 0x550(0x8)
		UAthenaHUDMenu* AthenaHUDMenu; // 0x558(0x8)
		UCommonActivatableWidget* TitleBar; // 0x560(0x8)
		TSet<EUIExtensionSlot> RelevantExtensionSlots; // 0x568(0x50)
		TWeakObjectPtr<UClass*> NewEmotePicker; // 0x5B8(0x20)
		TWeakObjectPtr<UClass*> SquadComsPickerClass; // 0x5D8(0x20)
		TWeakObjectPtr<UClass*> WeaponWheelClass; // 0x5F8(0x20)
		TWeakObjectPtr<UClass*> QuickWeaponClass; // 0x618(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaHUDBase");
			return ret;
		}

		void SetZoneCompleted(bool bValue); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FCB1890(relative to base address)
		void OnHUDScaleChanged(float HUDScale); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExtensionWidgetRemoved(EUIExtensionSlot ExtensionSlot, UUserWidget* Widget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExtensionWidgetCreated(EUIExtensionSlot ExtensionSlot, UUserWidget* Widget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnClearUIExtensions(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleUpdateMinigameUIExtensions(AFortMinigame* Minigame); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB0720(relative to base address)
		void HandleRecoverFromPostGame(); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCB02A8(relative to base address)
		void HandlePickerOpenRequest(EFortPickerMode Mode, int32_t InitialOption, bool bIgnoreFirstAccept); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAFDDC(relative to base address)
		void HandleOnMutatorRemoved(AFortGameplayMutator* NewMutator); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAFC60(relative to base address)
		void HandleOnMutatorAdded(AFortGameplayMutator* NewMutator); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAFBE0(relative to base address)
		void HandleNewPanelFromMutator(UClass* PanelClass); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAFB4C(relative to base address)
		void HandleMinigamePlayModeChanged(AFortMinigame* Minigame, bool bIsInPlayMode); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAF9E8(relative to base address)
		void HandleMinigameHideHUD(bool bLoading); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAF968(relative to base address)
		void HandleCursorModeChanging(bool bCursorModeEnabled, FName ActionName); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FCAF760(relative to base address)
		void HandleCursorModeChanged(bool bCursorModeEnabled, FName ActionName, UUserWidget* CustomWidget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool GetZoneCompleted(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FCAF48C(relative to base address)
		void BindVolumeEvents(); // Flags: Native|Protected, Memory Exec: 0x7FF74F49E694(relative to base address)
	};


	// Class FortniteUI.AthenaMobileHUD
	// Inherited from UAthenaHUDBase -> UFortUIStateWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x658 - 0x638)
	class UAthenaMobileHUD : public UAthenaHUDBase	
	{
	public:
		TArray<FUIExtension> TournamentUIExtensions; // 0x638(0x10)
		TArray<FUIExtension> ArenaTournamentUIExtensions; // 0x648(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMobileHUD");
			return ret;
		}

		bool IsDynamicMobileHUDActive(); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC4FC64(relative to base address)
	};


	// Class FortniteUI.AthenaMosaicWidget
	// Inherited from UWidget -> UVisual -> UObject
	// Size: 0xB0 (0x208 - 0x158)
	class UAthenaMosaicWidget : public UWidget	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x158(0x10) UNKNOWN PROPERTY
		UDataTable* TilesDataTable; // 0x168(0x8)
		float MosaicScale; // 0x170(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x174(0x4) UNKNOWN PROPERTY
		UMaterialInterface* TilesMaterial; // 0x178(0x8)
		FName MatTileTextureParameterName; // 0x180(0x4)
		FName MatTileDiscoveredParameterName; // 0x184(0x4)
		unsigned char UnknownData02_6[0x10]; // 0x188(0x10) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnPostUpdateTilesDelegate; // 0x198(0x10)
		TArray<UMaterialInstanceDynamic*> TilesMaterials; // 0x1A8(0x10)
		TMap<FString, TWeakObjectPtr> CachedQuests; // 0x1B8(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMosaicWidget");
			return ret;
		}

		void OnPostUpdateTiles__DelegateSignature(bool bIsEntirelyCollected); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaMosaicWidgetContainer
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2B8 - 0x2B0)
	class UAthenaMosaicWidgetContainer : public UUserWidget	
	{
	public:
		UAthenaMosaicWidget* MosaicWidget; // 0x2B0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaMosaicWidgetContainer");
			return ret;
		}
	};


	// Class FortniteUI.AthenaNPCCustomMapWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2D8 - 0x2B0)
	class UAthenaNPCCustomMapWidget : public UUserWidget	
	{
	public:
		FGameplayTag NPCTag; // 0x2B0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x2B4(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr<UObject*> NPCIconOverride; // 0x2B8(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaNPCCustomMapWidget");
			return ret;
		}
	};


	// Class FortniteUI.AthenaNPCQuestRewardsPanel
	// Inherited from UAthenaNPCCustomMapWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2D8 - 0x2D8)
	class UAthenaNPCQuestRewardsPanel : public UAthenaNPCCustomMapWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaNPCQuestRewardsPanel");
			return ret;
		}

		void BP_Show(FText& NPCTitle, TWeakObjectPtr<UObject*>& NPCPicture, bool bIsLocked); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaNPCQuestServicesPanel
	// Inherited from UAthenaNPCCustomMapWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E0 - 0x2D8)
	class UAthenaNPCQuestServicesPanel : public UAthenaNPCCustomMapWidget	
	{
	public:
		UCollectionNPCServiceContainer* Services; // 0x2D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaNPCQuestServicesPanel");
			return ret;
		}

		void BP_Show(FText& NPCTitle, TWeakObjectPtr<UObject*>& NPCPicture); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaObjectiveTaskEntryBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x2D0 - 0x2B0)
	class UAthenaObjectiveTaskEntryBase : public UUserWidget	
	{
	public:
		UFortRichTextBlockKeybind* Text_ObjectiveDescriptionText; // 0x2B0(0x8)
		bool bCompleted; // 0x2B8(0x1)
		unsigned char UnknownData00_6[0xF]; // 0x2B9(0xF) UNKNOWN PROPERTY
		UUserWidget* ProgressWidget; // 0x2C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaObjectiveTaskEntryBase");
			return ret;
		}

		void OverridePrimaryColor(bool bShouldOverride, FLinearColor& DesiredColor); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnUpdateOptionalObjectiveProgress(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnObjectiveRewardSetWithNonstandardReward(int32_t RewardQuantity, UTexture2D* PreviewTexture); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnObjectiveRewardSet(int32_t RewardQuantity, EFortEarnedSubRewardType RewardType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNewlyCompleted(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnIsActiveSet(bool bNewIsActive); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaPlayerInfoBaseWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPlayerInfoBaseWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaPlayerNameInfoBase
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x208 (0x520 - 0x318)
	class UAthenaPlayerNameInfoBase : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData00_3[0x178]; // 0x318(0x178) UNKNOWN PROPERTY
		TWeakObjectPtr<AFortPlayerStateAthena*> WeakPlayerStateAthena; // 0x490(0x8)
		bool bIsLocalPlayer; // 0x498(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x499(0x3) UNKNOWN PROPERTY
		FSlateColor Color_PlayerNameAlive; // 0x49C(0x14)
		FSlateColor Color_PlayerNameDead; // 0x4B0(0x14)
		FSlateColor Color_PlayerNameDisconnected; // 0x4C4(0x14)
		UImage* Image_Marker; // 0x4D8(0x8)
		UImage* Image_MarkerMobile; // 0x4E0(0x8)
		UCommonTextBlock* CommonTextBlock_PlayerName; // 0x4E8(0x8)
		UCommonTextBlock* CommonTextBlock_PlayerNameMobile; // 0x4F0(0x8)
		UAthenaLevelEffects* LevelEffects; // 0x4F8(0x8)
		UAthenaLevelEffects* LevelEffectsMobile; // 0x500(0x8)
		UImage* Image_PlatformIcon; // 0x508(0x8)
		UFortVoiceChatStatusIconProxyAnim* SpeakerWidgetAnim; // 0x510(0x8)
		unsigned char UnknownData02_7[0x8]; // 0x518(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPlayerNameInfoBase");
			return ret;
		}

		void UpdateRankedProgress(FRankedProgressReplicatedData& RankedProgress); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPlayerState(AFortPlayerStateAthena* InPlayerState); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC51684(relative to base address)
		void ResetRankedProgress(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleTalkingVisualDisplayChanged(bool bTalkingVisualsActive); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandleSeasonLevelUIDisplayChanged(int32_t Level); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandlePlaylistExtensionWidgetCreated(UUserWidget* Widget, EUIExtensionSlot SlotType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandlePlayerNameReplicated(FString PlayerName); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaPOIProgressExtensionWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x178 (0x490 - 0x318)
	class UAthenaPOIProgressExtensionWidget : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData00_1[0x178]; // 0x318(0x178) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPOIProgressExtensionWidget");
			return ret;
		}

		void OnExtensionWidgetRemoved(UUserWidget* ExtensionWidget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExtensionWidgetAdded(UUserWidget* ExtensionWidget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.AthenaPostMatchScreenContainerTabInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaPostMatchScreenContainerTabInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaPostMatchScreenContainerTabInterface");
			return ret;
		}
	};


	// Class FortniteUI.AthenaQuestCategoryCompletedTracker
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2D8 - 0x2B0)
	class UAthenaQuestCategoryCompletedTracker : public UUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x2B0(0x8) UNKNOWN PROPERTY
		FText MoreInTimerCompletionText; // 0x2B8(0x10)
		bool bShowCompletionTextUpperCase; // 0x2C8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x2C9(0x7) UNKNOWN PROPERTY
		UAthenaChallengeDateTimeTextBlock* DateTimeText_MoreQuestsLater; // 0x2D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaQuestCategoryCompletedTracker");
			return ret;
		}

		bool GetIsProgressBarEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC51498(relative to base address)
	};


	// Class FortniteUI.AthenaReplayActionFeedRowProxyInstance
	// Inherited from UObject
	// Size: 0x158 (0x180 - 0x28)
	class UAthenaReplayActionFeedRowProxyInstance : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FReplayEliminationEventInfo RowData; // 0x30(0x150)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaReplayActionFeedRowProxyInstance");
			return ret;
		}
	};


	// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UAthenaReplayBrowserRowProxyInstance : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaReplayBrowserRowProxyInstance");
			return ret;
		}
	};


	// Class FortniteUI.AthenaSpecialEventEntryIcon
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2C8 - 0x2B0)
	class UAthenaSpecialEventEntryIcon : public UUserWidget	
	{
	public:
		UCommonTextBlock* Text_UrgentIcon; // 0x2B0(0x8)
		UImage* Image_UrgentIcon; // 0x2B8(0x8)
		UImage* Image_AlertBackground; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.AthenaSpecialEventEntryIcon");
			return ret;
		}

		bool LoadAndSetIcon(FUrgentQuestData& UrgentQuestData); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC515D4(relative to base address)
	};


	// Class FortniteUI.BacchusLocalPlayerInfoBase
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x380 - 0x368)
	class UBacchusLocalPlayerInfoBase : public UBacchusHUDElement	
	{
	public:
		UAthenaPlayerNameInfoBase* AthenaPlayerNameInfo; // 0x368(0x8)
		UAthenaPlayerViewModel* CachedPlayerViewModel; // 0x370(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x378(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusLocalPlayerInfoBase");
			return ret;
		}

		void HandleSquadMemberDisconnected(AFortPlayerStateAthena* Player); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.BacchusQuickbarViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UBacchusQuickbarViewModel : public UMVVMViewModelBase	
	{
	public:
		int32_t CombatQuickbarsCount; // 0x68(0x4)
		int32_t BackwardsCombatQuickbarsCount; // 0x6C(0x4)
		TArray<UBacchusQuickbar*> Quickbars; // 0x70(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusQuickbarViewModel");
			return ret;
		}
	};


	// Class FortniteUI.BacchusRadialDisplayBase
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x320 - 0x318)
	class UBacchusRadialDisplayBase : public UFortHUDElementWidget	
	{
	public:
		FGameplayTag TrackedCueTag; // 0x318(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x31C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BacchusRadialDisplayBase");
			return ret;
		}

		void OnUpdateRadialCounterEvent_Blueprint(float NewCounterFillPercent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleUIGameplayCue(FName CueName, TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF74FC514B0(relative to base address)
	};


	// Class FortniteUI.BasicInteractionWidgetBase
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x318 - 0x2D8)
	class UBasicInteractionWidgetBase : public UCommonUserWidget	
	{
	public:
		UCommonRichTextBlock* RichText_Description; // 0x2D8(0x8)
		UMultiInteractDisplayWidgetBase* MultiInteractDisplayWidget; // 0x2E0(0x8)
		UBorder* OuterBorder; // 0x2E8(0x8)
		UHorizontalBox* SubTextBox; // 0x2F0(0x8)
		UImage* SubDescriptionAlertImage; // 0x2F8(0x8)
		UCommonRichTextBlock* TextSubDescription; // 0x300(0x8)
		FText InitialDescription; // 0x308(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BasicInteractionWidgetBase");
			return ret;
		}

		void UpdateMultiInteractionCount(int32_t NewInteractionCount); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC51B20(relative to base address)
		void UpdateDescription(FText Description, FLinearColor DescriptionColor, FText SubDescription, FLinearColor SubDescriptionColor, int32_t InteractionCount); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC5172C(relative to base address)
	};


	// Class FortniteUI.BattlePassInputData
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBattlePassInputData : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassInputData");
			return ret;
		}
	};


	// Class FortniteUI.BattlePassEnabledInputData
	// Inherited from UBattlePassInputData -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UBattlePassEnabledInputData : public UBattlePassInputData	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassEnabledInputData");
			return ret;
		}

		void GetData(bool& InIsEnabled); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC51410(relative to base address)
	};


	// Class FortniteUI.BattlePassBulkBuyInputData
	// Inherited from UBattlePassInputData -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UBattlePassBulkBuyInputData : public UBattlePassInputData	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassBulkBuyInputData");
			return ret;
		}

		void GetData(bool& IsPageCompleted, int32_t& StartingPage, int32_t& EndingPage, int32_t& PurchaseCost); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC511CC(relative to base address)
	};


	// Class FortniteUI.BattlePassSubPageInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBattlePassSubPageInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.BattlePassSubPageInterface");
			return ret;
		}

		void OnEnterSubPage(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.CheckDismissableActivatableWidget
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UCheckDismissableActivatableWidget : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.CheckDismissableActivatableWidget");
			return ret;
		}
	};


	// Class FortniteUI.CreativeContentBrowserTab_CreationCondition
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UCreativeContentBrowserTab_CreationCondition : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.CreativeContentBrowserTab_CreationCondition");
			return ret;
		}
	};


	// Class FortniteUI.DonutChallengeIdleGame
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8B8 (0xB90 - 0x2D8)
	class UDonutChallengeIdleGame : public UCommonUserWidget	
	{
	public:
		FMulticastInlineDelegate OnNewHighScore; // 0x2D8(0x10)
		FMulticastInlineDelegate OnDistanceScoreChanged; // 0x2E8(0x10)
		FMulticastInlineDelegate OnSpeedScoreChanged; // 0x2F8(0x10)
		FMulticastInlineDelegate OnStyleScoreChanged; // 0x308(0x10)
		FMulticastInlineDelegate OnEndMatchScore; // 0x318(0x10)
		FMulticastInlineDelegate OnDayNightCycleChanged; // 0x328(0x10)
		unsigned char UnknownData00_6[0x140]; // 0x338(0x140) UNKNOWN PROPERTY
		FLinearColor BoundsColor; // 0x478(0x10)
		float DayNightCycleTime; // 0x488(0x4)
		float PlayerTopSpeed; // 0x48C(0x4)
		float BumpyRideSpeedReduction; // 0x490(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x494(0x4) UNKNOWN PROPERTY
		FVector2D MapSize; // 0x498(0x10)
		FVector2D PlayerCollisionOffset; // 0x4A8(0x10)
		FVector2D PlayerCollisionSize; // 0x4B8(0x10)
		float MapScale; // 0x4C8(0x4)
		float MaxNumLevels; // 0x4CC(0x4)
		float ObjectSpawnPlacementRadius; // 0x4D0(0x4)
		int32_t NumOfTreeSpawnAttempts; // 0x4D4(0x4)
		int32_t NumOfRockSpawnAttempts; // 0x4D8(0x4)
		int32_t NumOfBigRockSpawnAttempts; // 0x4DC(0x4)
		int32_t NumOfJumpPadSpawnAttempts; // 0x4E0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4E4(0x4) UNKNOWN PROPERTY
		UCurveFloat* Curve_BonusSpawn_Trees; // 0x4E8(0x8)
		UCurveFloat* Curve_BonusSpawn_SmallBumps; // 0x4F0(0x8)
		UCurveFloat* Curve_BonusSpawn_Bumps; // 0x4F8(0x8)
		UCurveFloat* Curve_BonusSpawn_JumpPads; // 0x500(0x8)
		FName Param_Player_Direction; // 0x508(0x4)
		FName Param_Player_FacingLeft; // 0x50C(0x4)
		FSlateBrush PlayerBrush; // 0x510(0xB0)
		FSlateBrush TreeBrush; // 0x5C0(0xB0)
		FSlateBrush RockBrush; // 0x670(0xB0)
		FSlateBrush BigRockBrush; // 0x720(0xB0)
		FSlateBrush JumpPadBrush; // 0x7D0(0xB0)
		FSlateBrush TorchBrush; // 0x880(0xB0)
		FSlateBrush MonsterBrush; // 0x930(0xB0)
		FSlateBrush ChimiBrush; // 0x9E0(0xB0)
		FSlateBrush ArmBrush; // 0xA90(0xB0)
		UWidgetAnimation* Anim_Jump; // 0xB40(0x8)
		UWidgetAnimation* Anim_MediumJump; // 0xB48(0x8)
		UWidgetAnimation* Anim_SuperJump; // 0xB50(0x8)
		UWidgetAnimation* Anim_BumpyRide; // 0xB58(0x8)
		UImage* Image_Player; // 0xB60(0x8)
		UImage* Image_MobileInput; // 0xB68(0x8)
		UImage* Image_MobileInput_Background; // 0xB70(0x8)
		UCommonButtonLegacy* Button_Jump; // 0xB78(0x8)
		UCommonButtonLegacy* Button_MobileJump; // 0xB80(0x8)
		unsigned char UnknownData03_7[0x8]; // 0xB88(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.DonutChallengeIdleGame");
			return ret;
		}

		void TryJump(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC51718(relative to base address)
		void StartGame(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC51704(relative to base address)
		void EndSuperJump(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC511B0(relative to base address)
		void EndJump(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC51198(relative to base address)
		void EndBumpyRide(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC51174(relative to base address)
		void DebugBPFloat(float InFloat); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPUpdateStyle(int32_t NewStyle); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPUpdateSpeed(int32_t NewSpeed); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPUpdateDistance(int32_t NewDistance); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPShowHighScore(int32_t inNewHighScore); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnSpeedUpdated(int32_t NewCurSpeed); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnNextLevelReached(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnMonsterNearChanged(bool bIsNearLevelMonster); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnJump(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnGameInitialized(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnFailedJumpPress(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnFacingDirectionChanged(bool bIsLeftFacing); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnCrash(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPOnCollision(TEnumAsByte<EFortDonutIdleGameObject> ObjectType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BPGameOver(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortActivatablePanel
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x560 - 0x528)
	class UFortActivatablePanel : public UCommonActivatablePanelLegacy	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x528(0x8) UNKNOWN PROPERTY
		bool bIsPushedOnToContentPanelStack; // 0x530(0x1)
		bool bIsAlreadyOnContentPanelStack; // 0x531(0x1)
		EInputPriority InputPriority; // 0x532(0x1)
		bool bIsClosableByPlayerInput; // 0x533(0x1)
		FPrimaryContentSetup PrimaryContentSetup; // 0x534(0x3)
		unsigned char UnknownData01_7[0x29]; // 0x537(0x29) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivatablePanel");
			return ret;
		}

		void RestoreScrollWidget(UWidget* FallbackWidget); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750354D04(relative to base address)
		void RestoreCenterWidget(UWidget* FallbackWidget); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750354C84(relative to base address)
		void AsyncPlaySound2D(UObject* WorldContextObject, TWeakObjectPtr<USoundBase*> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Flags: Final|BlueprintCosmetic|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FFC6CA0(relative to base address)
	};


	// Class FortniteUI.DonutIdleGameScreen
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x570 - 0x560)
	class UDonutIdleGameScreen : public UFortActivatablePanel	
	{
	public:
		UWidgetAnimation* Anim_Intro; // 0x560(0x8)
		UDonutChallengeIdleGame* Widget_GameLayer; // 0x568(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.DonutIdleGameScreen");
			return ret;
		}
	};


	// Class FortniteUI.EndOfMatchQuestEntryWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x318 - 0x2D8)
	class UEndOfMatchQuestEntryWidget : public UCommonUserWidget	
	{
	public:
		FMulticastInlineDelegate OnEndOfMatchQuestIntroFinishedDelegate; // 0x2D8(0x10)
		FMulticastInlineDelegate OnEndOfMatchQuestMoveDownFinishedDelegate; // 0x2E8(0x10)
		float MoveDownDuration; // 0x2F8(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x2FC(0x4) UNKNOWN PROPERTY
		UFortNotificationEntry_Quest* QuestNotification; // 0x300(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x308(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.EndOfMatchQuestEntryWidget");
			return ret;
		}

		void OnEndOfMatchQuestMoveDownFinished__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEndOfMatchQuestCreateFinished__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleNotificationDisplayed(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FD16E74(relative to base address)
		void HandleMoveDownFinished(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FD16E58(relative to base address)
	};


	// Class FortniteUI.EndOfMatchQuestEntryWidget_Auto
	// Inherited from UEndOfMatchQuestEntryWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x360 - 0x318)
	class UEndOfMatchQuestEntryWidget_Auto : public UEndOfMatchQuestEntryWidget	
	{
	public:
		FGameplayTagContainer InclusiveFilterTags; // 0x318(0x20)
		FGameplayTagContainer ExclusiveFilterTags; // 0x338(0x20)
		bool bShowFirstQuestFound; // 0x358(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x359(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.EndOfMatchQuestEntryWidget_Auto");
			return ret;
		}

		bool InitializeQuestNotification(UFortQuestItem* InQuestData); // Flags: Final|Native|Private|Const, Memory Exec: 0x7FF74FC532C8(relative to base address)
		bool FilterQuest(UFortQuestItem* InQuestData); // Flags: Final|Native|Private|Const, Memory Exec: 0x7FF74FC52C34(relative to base address)
	};


	// Class FortniteUI.EnhancedInputInjectable
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEnhancedInputInjectable : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.EnhancedInputInjectable");
			return ret;
		}
	};


	// Class FortniteUI.FortFireModeStreamingVideo
	// Inherited from UFortBaseStreamingVideo -> UEpicBaseStreamingVideo -> UObject
	// Size: 0x0 (0x1C0 - 0x1C0)
	class UFortFireModeStreamingVideo : public UFortBaseStreamingVideo	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFireModeStreamingVideo");
			return ret;
		}
	};


	// Class FortniteUI.FortActivityBrowserAttributionsModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x460 - 0x3F0)
	class UFortActivityBrowserAttributionsModal : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x3F0(0x10) UNKNOWN PROPERTY
		UCommonButtonBase* Button_Back; // 0x400(0x8)
		UCommonButtonBase* Button_CloseTouch; // 0x408(0x8)
		UCommonButtonBase* Button_OpenLink; // 0x410(0x8)
		UCommonRichTextBlock* RichText_Description; // 0x418(0x8)
		UScrollBox* ScrollBox_Details; // 0x420(0x8)
		UCommonTextBlock* Text_ActivityName; // 0x428(0x8)
		UCommonRichTextBlock* Text_ActivityOrigin; // 0x430(0x8)
		UCommonRichTextBlock* Text_LinkCode; // 0x438(0x8)
		float ScrollAmount; // 0x440(0x4)
		unsigned char UnknownData01_7[0x1C]; // 0x444(0x1C) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityBrowserAttributionsModal");
			return ret;
		}

		void OnCreditsModalInitialized(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAttributionsModalInitialized(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText GetLinkCodeTextFormat(FText& LinkCode); // Flags: Native|Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF74FC530C4(relative to base address)
		FText GetCreatorTextFormat(FText& CreatorName); // Flags: Native|Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF74FC53000(relative to base address)
		FText GetAttributionsTextFormat(FText& Title, FText& Author, FText& License); // Flags: Native|Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF74FC52E6C(relative to base address)
	};


	// Class FortniteUI.FortActivityView
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x440 - 0x3F0)
	class UFortActivityView : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_1[0x50]; // 0x3F0(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityView");
			return ret;
		}

		void BP_OnPartySizeChanged(int32_t PartySize); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnLocalPlayerPromotedToLeader(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnLocalPlayerDemoted(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortActivityDetailsModalBase
	// Inherited from UFortActivityView -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x130 (0x570 - 0x440)
	class UFortActivityDetailsModalBase : public UFortActivityView	
	{
	public:
		unsigned char UnknownData00_1[0x130]; // 0x440(0x130) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityDetailsModalBase");
			return ret;
		}
	};


	// Class FortniteUI.FortActivityModeSetSelectionModalBase
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x408 - 0x3F0)
	class UFortActivityModeSetSelectionModalBase : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x3F0(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortActivityModeSetSelectionModalBase");
			return ret;
		}
	};


	// Class FortniteUI.FortAthenaSurvivorTierBadge
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UFortAthenaSurvivorTierBadge : public UUserWidget	
	{
	public:
		EFortAthenaSurvivorTierBadgeSize BadgeSize; // 0x2B0(0x1)
		unsigned char UnknownData00_7[0xF]; // 0x2B1(0xF) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAthenaSurvivorTierBadge");
			return ret;
		}

		void SetBadgeSize(EFortAthenaSurvivorTierBadgeSize InBadgeSize); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5356C(relative to base address)
		void OverrideTierAndPrestigeLevel(int32_t CustomTier, int32_t CustomPrestigeLvl); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC53498(relative to base address)
		void HandlePostMatchVisibility(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC532B4(relative to base address)
		void BP_OnSurvivorTierStateChanged(int32_t Tier, int32_t PrestigeLevel); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnPresentAnimation(int32_t BeforeTier, int32_t BeforePrestigeLevel, int32_t AfterTier, int32_t AfterPrestigeLevel); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnBadgeSizeChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortAthenaSurvivorTiersQuestRewardsPanel
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B0 - 0x2B0)
	class UFortAthenaSurvivorTiersQuestRewardsPanel : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAthenaSurvivorTiersQuestRewardsPanel");
			return ret;
		}

		void OnSurvivorTierStateChanged(int32_t Prestige, int32_t TierRaw, int32_t TierDisplay); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FC533A4(relative to base address)
		void BP_OnSurvivorTierStateChanged(int32_t PrestigeLevel, int32_t TierRaw, int32_t TierDisplay); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortMobileHUDElementProxy
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x3C0 - 0x348)
	class UFortMobileHUDElementProxy : public UFortMobileHUDElement	
	{
	public:
		FText WidgetName; // 0x348(0x10)
		bool AppendWidgetAndBehaviorNames; // 0x358(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x359(0x3) UNKNOWN PROPERTY
		FLinearColor InBoundsHighlightColor; // 0x35C(0x10)
		FLinearColor OutOfBoundsProxyHighlightColor; // 0x36C(0x10)
		unsigned char UnknownData01_6[0x34]; // 0x37C(0x34) UNKNOWN PROPERTY
		UImage* Image_SelectionHighlight; // 0x3B0(0x8)
		UImage* Image_OutOfBoundsIndicator; // 0x3B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDElementProxy");
			return ret;
		}
	};


	// Class FortniteUI.FortAutorunLockHUDElementProxy
	// Inherited from UFortMobileHUDElementProxy -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3C8 - 0x3C0)
	class UFortAutorunLockHUDElementProxy : public UFortMobileHUDElementProxy	
	{
	public:
		UOverlay* Overlay_AutorunLockZone; // 0x3C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAutorunLockHUDElementProxy");
			return ret;
		}
	};


	// Class FortniteUI.FortAutorunLockZoneButton
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x370 - 0x368)
	class UFortAutorunLockZoneButton : public UBacchusHUDElement	
	{
	public:
		UFortAutorunLockZone* AutorunLockZone; // 0x368(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortAutorunLockZoneButton");
			return ret;
		}
	};


	// Class FortniteUI.FortBangWrapperContentInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortBangWrapperContentInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortBangWrapperContentInterface");
			return ret;
		}

		void OnStopCallout(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStartCallout(FName TutorialObjectiveName, ETutorialType TutorialType); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBangStateChanged(bool bEnabled, int32_t Count); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortPerUserViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x70 - 0x68)
	class UFortPerUserViewModel : public UMVVMViewModelBase	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x68(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPerUserViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortBatchViewModel
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x88 - 0x70)
	class UFortBatchViewModel : public UFortPerUserViewModel	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x70(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortBatchViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortBladeWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x310 - 0x2D8)
	class UFortBladeWidget : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData00_1[0x38]; // 0x2D8(0x38) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortBladeWidget");
			return ret;
		}

		void OnViewportResized(); // Flags: Event|Protected|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortCabinEmailManagementWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x348 - 0x2B0)
	class UFortCabinEmailManagementWidget : public UUserWidget	
	{
	public:
		UOverlay* Overlay_EmailEntry; // 0x2B0(0x8)
		UCommonTextBlock* Text_Warning; // 0x2B8(0x8)
		UCommonTextBlock* Text_MainDescription; // 0x2C0(0x8)
		UCommonButtonBase* Button_Done; // 0x2C8(0x8)
		UCommonButtonBase* Button_Cancel; // 0x2D0(0x8)
		UFortCTAButton* Button_ResendEmail; // 0x2D8(0x8)
		UFortCTAButton* Button_EditEmail; // 0x2E0(0x8)
		UFortInputField* InputField_Email; // 0x2E8(0x8)
		UCommonTextBlock* Text_Email; // 0x2F0(0x8)
		unsigned char UnknownData00_7[0x50]; // 0x2F8(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCabinEmailManagementWidget");
			return ret;
		}

		void OnShowFailureReason(FText& ErrorText); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnScreenStateChange(ECabinEmailViewState NewState); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnChangeEmailEditMode(bool bIsInEditMode); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleConfirmEmail(FText& NewText, TEnumAsByte<ETextCommit> CommitInfo); // Flags: Final|Native|Protected|HasOutParms, Memory Exec: 0x7FF74FC53188(relative to base address)
	};


	// Class FortniteUI.FortColorPickerConfiguration
	// Inherited from UDataAsset -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class UFortColorPickerConfiguration : public UDataAsset	
	{
	public:
		bool bNoColorOptionAvailable; // 0x30(0x1)
		EColorPickerType ColorPickerType; // 0x31(0x1)
		bool bInitializeCustomColorFromSelectedSwatch; // 0x32(0x1)
		EColorPickerColorRepresentation CustomColorRepresentation; // 0x33(0x1)
		unsigned char UnknownData00_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortColorPickerConfiguration");
			return ret;
		}
	};


	// Class FortniteUI.FortCompassWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x158 (0x470 - 0x318)
	class UFortCompassWidget : public UFortHUDElementWidget	
	{
	public:
		UMaterialInstanceDynamic* CompassMaterial; // 0x318(0x8)
		UImage* Image_Compass; // 0x320(0x8)
		FName CompassMaterialParam; // 0x328(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x32C(0x4) UNKNOWN PROPERTY
		FSlateFontInfo HeadingFont; // 0x330(0x58)
		unsigned char UnknownData01_6[0x8]; // 0x388(0x8) UNKNOWN PROPERTY
		FSlateBrush HeadingIndicatorBrush; // 0x390(0xB0)
		float MarkerVerticalOffset; // 0x440(0x4)
		float CompassPanOffset; // 0x444(0x4)
		unsigned char UnknownData02_7[0x28]; // 0x448(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCompassWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortContentGatingIntroModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3F8 - 0x3F0)
	class UFortContentGatingIntroModal : public UCommonActivatableWidget	
	{
	public:
		UCommonButtonBase* Button_CloseTouch; // 0x3F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortContentGatingIntroModal");
			return ret;
		}

		void ExitModal(); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC52C20(relative to base address)
	};


	// Class FortniteUI.FortControllerHighlightDiagram
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x450 - 0x3F0)
	class UFortControllerHighlightDiagram : public UCommonActivatableWidget	
	{
	public:
		UWidget* CurrentHighlightedElement; // 0x3F0(0x8)
		TMap<FName, UWidget*> ControllerHighlights; // 0x3F8(0x50)
		UCanvasPanel* CanvasPanel_Highlights; // 0x448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortControllerHighlightDiagram");
			return ret;
		}
	};


	// Class FortniteUI.FortCountdownTimerVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xA0 - 0x68)
	class UFortCountdownTimerVM : public UMVVMViewModelBase	
	{
	public:
		ECountdownTimerState TimerState; // 0x68(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x69(0x7) UNKNOWN PROPERTY
		FText TimeLeftText; // 0x70(0x10)
		unsigned char UnknownData01_7[0x20]; // 0x80(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCountdownTimerVM");
			return ret;
		}

		void StartTimer(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5382C(relative to base address)
		void SetupViewModel(FDateTime& InFutureTime, FText& InLiveText); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC53734(relative to base address)
		void ResetTimer(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC53558(relative to base address)
		void ClearCountdownData(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC52C0C(relative to base address)
	};


	// Class FortniteUI.FortCreativeCreateBuildModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x4D0 - 0x3F0)
	class UFortCreativeCreateBuildModal : public UCommonActivatableWidget	
	{
	public:
		UCommonAnimatedSwitcher* Switcher_Content; // 0x3F0(0x8)
		UPanelWidget* Panel_CreateBuild; // 0x3F8(0x8)
		UPanelWidget* Panel_CreateBuildInProgress; // 0x400(0x8)
		UPanelWidget* Panel_CreateBuildSucceeded; // 0x408(0x8)
		UPanelWidget* Panel_CreateBuildFailed; // 0x410(0x8)
		UCommonButtonBase* Button_PrimaryFunction; // 0x418(0x8)
		UCommonButtonBase* Button_CloseTouch; // 0x420(0x8)
		UCommonButtonBase* Button_CopyMnemonic; // 0x428(0x8)
		UButton* Button_CreatorPortalUrl; // 0x430(0x8)
		UCommonTextBlock* Text_CreatorPortalUrl; // 0x438(0x8)
		UCommonTextBlock* Text_Mnemonic; // 0x440(0x8)
		UCommonTextBlock* Text_CreateBuildError; // 0x448(0x8)
		UFortLazyImage* LazyImage_CreatorPortalQrCode; // 0x450(0x8)
		bool bCreateBuildInProgress; // 0x458(0x1)
		bool bClearPersistentData; // 0x459(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x45A(0x6) UNKNOWN PROPERTY
		FString CreatedMnemonic; // 0x460(0x10)
		FDataTableRowHandle ClearPersistentDataInputRowHandle; // 0x470(0x10)
		unsigned char UnknownData01_7[0x50]; // 0x480(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreateBuildModal");
			return ret;
		}

		void SetClearPersistentDataInputEnabled(bool bEnabled); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC53678(relative to base address)
		void SetClearPersistentData(bool bInClearPersistentData); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC535F8(relative to base address)
		void OnReceivedDoesIslandContainFabricDevices(bool bIslandContainsFabricDevices); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnQrCodeImageUpdated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMnemonicCopied(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreateBuildSucceeded(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreateBuildStarted(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreateBuildFailed(FString ErrorCode); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnContentSwitcherTransitioningChanged(bool bIsTransitioning); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnContentSwitcherActiveWidgetChanged(UWidget* ActiveWidget); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnClearPersistentDataSet(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleCreatorPortalUrlButtonClicked(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC532A0(relative to base address)
		void BP_Reset(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortCreativeCreatorAttributions
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x140 (0x530 - 0x3F0)
	class UFortCreativeCreatorAttributions : public UCommonActivatableWidget	
	{
	public:
		UFortDynamicEntryBox* DynamicEntryBox_CreditsContainer; // 0x3F0(0x8)
		FText CreatorTitle; // 0x3F8(0x10)
		FText AttributionsTitle; // 0x408(0x10)
		UUserWidget* AttributionsTitleWidget; // 0x418(0x8)
		FText CreditsTitle; // 0x420(0x10)
		UUserWidget* CreditsTitleWidget; // 0x430(0x8)
		FText AttributionsTextFormat; // 0x438(0x10)
		UClass* CreditsTeamTitleCardClass; // 0x448(0x8)
		UClass* CreditsCreatorAttributionsClass; // 0x450(0x8)
		TWeakObjectPtr<UClass*> CreditsAttributionsModalClass; // 0x458(0x20)
		UFortCreativeCreditsTeamTitleCard* Button_CreditsTeamTitleCard; // 0x478(0x8)
		UFortCreativeCreditsAttributions* Button_CreditsAttributions; // 0x480(0x8)
		UFortCreativeCreditsAttributions* Button_Credits; // 0x488(0x8)
		FMargin SectionTitlePadding; // 0x490(0x10)
		FMargin TitleCardButtonPadding; // 0x4A0(0x10)
		FMargin TeamMemberButtonPadding; // 0x4B0(0x10)
		FMargin AttributionsButtonPadding; // 0x4C0(0x10)
		FMargin CreditsButtonPadding; // 0x4D0(0x10)
		unsigned char UnknownData00_7[0x50]; // 0x4E0(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreatorAttributions");
			return ret;
		}

		void OnTitleCardButtonCreated(); // Flags: Event|Protected|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTeamMemberTitleCardButtonCreated(UFortCreativeCreditsTeamTitleCard* TeamMemberButton); // Flags: Event|Protected|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSectionTitleCreated(UFortCreativeCreditsSectionTitle* SectionTitle); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreditsButtonCreated(); // Flags: Event|Protected|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAttributionsButtonCreated(); // Flags: Event|Protected|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortCreativeCreditsAttributions
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x13B0 - 0x1390)
	class UFortCreativeCreditsAttributions : public UCommonButtonBase	
	{
	public:
		UTimelineComponent* HoverAnimationTimeline; // 0x1390(0x8)
		UCommonRichTextBlock* RichText_CreditsAttributionsShortDescription; // 0x1398(0x8)
		int32_t AttributionsPreviewTextWordLimit; // 0x13A0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x13A4(0x4) UNKNOWN PROPERTY
		UCurveLinearColor* HoverAnimationCurve; // 0x13A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreditsAttributions");
			return ret;
		}

		void OnAnimationUpdate(FLinearColor Color); // Flags: Final|Native|Private|HasDefaults|Const, Memory Exec: 0x7FF74FC55224(relative to base address)
		float GetHoverAnimationLength(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortCreativeCreditsSectionTitle
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E0 - 0x2D8)
	class UFortCreativeCreditsSectionTitle : public UCommonUserWidget	
	{
	public:
		UCommonTextBlock* Text_Title; // 0x2D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreditsSectionTitle");
			return ret;
		}

		void SetTitleText(FText& TitleText); // Flags: Final|Native|Public|HasOutParms|Const, Memory Exec: 0x7FF74FC55454(relative to base address)
	};


	// Class FortniteUI.FortCreativeCreditsTeamTitleCard
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x13B0 - 0x1390)
	class UFortCreativeCreditsTeamTitleCard : public UCommonButtonBase	
	{
	public:
		UCommonTextBlock* Text_CreatorTitle; // 0x1390(0x8)
		UCommonTextBlock* Text_CreatorName; // 0x1398(0x8)
		UCommonTextBlock* Text_CreatorDescription; // 0x13A0(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x13A8(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeCreditsTeamTitleCard");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeIslandInfoViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x88 (0xF0 - 0x68)
	class UFortCreativeIslandInfoViewModel : public UMVVMViewModelBase	
	{
	public:
		FMulticastInlineDelegate OnIslandMetaDataUpdateComplete; // 0x68(0x10)
		FMulticastInlineDelegate OnFailedToUpdateCreativePlotData; // 0x78(0x10)
		TArray<FText> IslandIntroduction; // 0x88(0x10)
		EDynamicXpCalibrationPhase XpCalibrationPhase; // 0x98(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x99(0x7) UNKNOWN PROPERTY
		UTexture2DDynamic* ThumbnailTexture; // 0xA0(0x8)
		UTexture2D* LobbyBackgroundTexture; // 0xA8(0x8)
		FString PublishedCreatorName; // 0xB0(0x10)
		bool bIsUpdatingIslandMetaData; // 0xC0(0x1)
		unsigned char UnknownData01_7[0x2F]; // 0xC1(0x2F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeIslandInfoViewModel");
			return ret;
		}

		void UpdateCreativePlotData(FString NewIslandTitle, TArray<FString>& NewIslandIntroductions); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC555A0(relative to base address)
		void UnbindViewModel(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC554F0(relative to base address)
		void SetIslandDescriptionTags(TArray<FCreativeIslandDescriptionTag>& IslandDescriptionTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC553BC(relative to base address)
		void OnIslandMetaDataUpdateComplete__DelegateSignature(FString Error); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFailedToUpdateCreativePlotData__DelegateSignature(FCreativeIslandInfo& IslandInfo); // Flags: MulticastDelegate|Public|Delegate|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsPlayerInAnExperienceTheyOwn(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC54FF0(relative to base address)
		void InitializeViewModel(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC54FA4(relative to base address)
		void HandleLinkDataQueryComplete(bool bSuccess, FString ErrorMessage, UFortGameActivity* LinkData); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC548A4(relative to base address)
		void HandleIslandMetaDataUpdateComplete(FString Error); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC54814(relative to base address)
		void HandleDownloadThumbnailComplete(bool bSuccess, UTexture2DDynamic* InThumbnailTexture); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC54750(relative to base address)
		FText GetIslandTitle(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC54644(relative to base address)
		TArray GetIslandDescriptionTags(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC54608(relative to base address)
		FText GetIslandCode(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC545CC(relative to base address)
	};


	// Class FortniteUI.FortMatchmakingKnobsModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2C8 (0x6B8 - 0x3F0)
	class UFortMatchmakingKnobsModal : public UCommonActivatableWidget	
	{
	public:
		float MobileOptionListEntrySpacing; // 0x3F0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x3F4(0x4) UNKNOWN PROPERTY
		TArray<FString> ScrolledOffWhitelistedPlayers; // 0x3F8(0x10)
		bool bInitializeDataInNativeConstruct; // 0x408(0x1)
		unsigned char UnknownData01_6[0x27]; // 0x409(0x27) UNKNOWN PROPERTY
		UPlaylistUserOptions* OptionsAsset; // 0x430(0x8)
		TArray<UObject*> OptionDataProviders; // 0x438(0x10)
		unsigned char UnknownData02_6[0x20]; // 0x448(0x20) UNKNOWN PROPERTY
		TMap<FString, FString> LoadedOptionValues; // 0x468(0x50)
		unsigned char UnknownData03_6[0x48]; // 0x4B8(0x48) UNKNOWN PROPERTY
		UCommonListView* OptionsList; // 0x500(0x8)
		UCommonTextBlock* TextBlock_TitleText; // 0x508(0x8)
		UCommonTextBlock* TextBlock_DescriptionText; // 0x510(0x8)
		UImage* Image_DisplayImage; // 0x518(0x8)
		FDataTableRowHandle RestoreDefaultsInputRowHandle; // 0x520(0x10)
		UClass* SubcategoryHeaderWidgetClass; // 0x530(0x8)
		bool bBindToOnLoadedOptionsChanged; // 0x538(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x539(0x7) UNKNOWN PROPERTY
		TMap<FGameplayTag, UFortCreativePropertySubcategoryHeaderListItem*> SubcategoryHeaderTagToListItems; // 0x540(0x50)
		unsigned char UnknownData05_7[0x128]; // 0x590(0x128) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingKnobsModal");
			return ret;
		}

		void SetSearchString(FString InSearchString); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750024F04(relative to base address)
		void SetOptionCategoryTagFilter(FGameplayTagContainer& InOptionCategoryTagFilter); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750024D34(relative to base address)
		void SetListDataSource(TEnumAsByte<UFortMatchmakingKnobsDataSource> ListType); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750024644(relative to base address)
		void RestoreOptionsToDefault(bool bRestoreAllOptions); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF750023CBC(relative to base address)
		void OnSetInGameMode(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSelectionUpdated(UFortMatchmakingKnobsSpinnerButton* CurrentSelection); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOptionsFiltered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInitForUserOptionValues(TScriptInterface<Class>& UserOptionValues); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInitForOptionsComponent(UFortActorOptionsComponent* OptionsComponent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnHoveredItemChanged(UObject* Item, bool bIsHovered); // Flags: Final|Native|Private, Memory Exec: 0x7FF7500228C0(relative to base address)
		bool OnHandleRestoreDefaultsInput(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDataInitialized(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCurrentItemSelectionChanged(UObject* Item); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750022748(relative to base address)
		void OnAcceptAnimationComplete(bool bApplyAllOptions); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7500223F4(relative to base address)
		void InitializeData(); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D0988B4(relative to base address)
		void InitForToyOptionsActor(AActor* InActor); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FF645D4(relative to base address)
		bool HasNonEventProperties(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750021E58(relative to base address)
		bool HasMatchingTags(UObject* Option, FGameplayTagContainer& CategoryTags, FGameplayTagContainer& ContextTags); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750021B78(relative to base address)
		bool HasEventFunctionProperty(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750021AE4(relative to base address)
		bool HasEventDescriptorProperty(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750021A50(relative to base address)
		void HandleRestorePropertiesClicked(); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74E313DD4(relative to base address)
		void HandleRestoreFunctionsClicked(); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74E3138BC(relative to base address)
		void HandleRestoreEventsClicked(); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74D8BB41C(relative to base address)
		void HandleLeaveIsland(AFortPlayerPawn* PlayerPawn); // Flags: Final|Native|Private, Memory Exec: 0x7FF7500212F4(relative to base address)
		void HandleForcedOffIsland(); // Flags: Final|Native|Private, Memory Exec: 0x7FF7500211E4(relative to base address)
		void HandleCancelClicked(); // Flags: Native|Event|Public|BlueprintEvent, Memory Exec: 0x7FF74D8BB7F8(relative to base address)
		EFortModifiedStatus GetSpinnerModificationStatus(UFortMatchmakingKnobsSpinnerButton* SpinnerButton); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750020C08(relative to base address)
		void GetSearchStringFilteredOptionCategoryTags(FGameplayTagContainer& OutSearchStringFilteredOptionCategoryTags); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF750020B50(relative to base address)
		FString GetSearchString(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750020B34(relative to base address)
		TArray GetScrolledOffWhitelistedPlayers(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750020AF8(relative to base address)
		EFortModifiedStatus GetModificationStatus(UObject* Option); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750020690(relative to base address)
		bool DoesContainString(UObject* Option, FString String); // Flags: Final|Native|Static|Protected|BlueprintCallable, Memory Exec: 0x7FF750020364(relative to base address)
		TScriptInterface BP_GetUserOptionValuesInterface(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750020158(relative to base address)
		UFortActorOptionsComponent BP_GetOptionsComponent(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF750020130(relative to base address)
		TScriptInterface BP_GetLabelOverrideInterface(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7500200B4(relative to base address)
		void ApplyChanges(bool bApplySettingsFromCachedData, bool bApplyAllOptions); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF75001FFEC(relative to base address)
	};


	// Class FortniteUI.FortCreativeMyIslandContentDebugPanel
	// Inherited from UFortMatchmakingKnobsModal -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x6D0 - 0x6B8)
	class UFortCreativeMyIslandContentDebugPanel : public UFortMatchmakingKnobsModal	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x6B8(0x8) UNKNOWN PROPERTY
		TArray<FString> OwnerPermissionAllowList; // 0x6C0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandContentDebugPanel");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeMyIslandContentKnobsPanel
	// Inherited from UFortMatchmakingKnobsModal -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x6C0 - 0x6B8)
	class UFortCreativeMyIslandContentKnobsPanel : public UFortMatchmakingKnobsModal	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x6B8(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandContentKnobsPanel");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeMyIslandContentPanelInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortCreativeMyIslandContentPanelInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandContentPanelInterface");
			return ret;
		}

		void BP_ShouldShowPanel(bool& bOutShouldShowPanel, EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience); // Flags: Event|Protected|HasOutParms|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortCreativeSettingsFlow
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1E0 (0x5D0 - 0x3F0)
	class UFortCreativeSettingsFlow : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x3F0(0x8) UNKNOWN PROPERTY
		UWidgetSwitcher* Switcher_EditorConnected; // 0x3F8(0x8)
		FName TabNameID; // 0x400(0x4)
		unsigned char UnknownData01_6[0xC]; // 0x404(0xC) UNKNOWN PROPERTY
		FFortTabButtonLabelInfo TabButtonLabelInfo; // 0x410(0xF0)
		FDataTableRowHandle ChannelBrowserInputRowHandle; // 0x500(0x10)
		TWeakObjectPtr<UClass*> SoftChannelBrowserClass; // 0x510(0x20)
		FDataTableRowHandle DeviceBrowserInputRowHandle; // 0x530(0x10)
		TWeakObjectPtr<UClass*> SoftDeviceBrowserClass; // 0x540(0x20)
		unsigned char UnknownData02_7[0x70]; // 0x560(0x70) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeSettingsFlow");
			return ret;
		}
	};


	// Class FortniteUI.FortCreativeMyIslandPanel
	// Inherited from UFortCreativeSettingsFlow -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x6B0 - 0x5D0)
	class UFortCreativeMyIslandPanel : public UFortCreativeSettingsFlow	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x5D0(0x20) UNKNOWN PROPERTY
		UFortTabListWidgetBase* TabList_MainContent; // 0x5F0(0x8)
		UCommonAnimatedSwitcher* Switcher_MainContent; // 0x5F8(0x8)
		FAthenaMapScreenContainerTabInfo MapScreenContainerTabInfo; // 0x600(0x40)
		bool bLinkTabListToSwitcher; // 0x640(0x1)
		bool bBindToMinigame; // 0x641(0x1)
		bool bIsDefaultMyIslandInfo; // 0x642(0x1)
		bool bIsOverriddenMyIslandInfo; // 0x643(0x1)
		unsigned char UnknownData01_6[0x4]; // 0x644(0x4) UNKNOWN PROPERTY
		FDataTableRowHandle StartEndMinigameInputRowHandle; // 0x648(0x10)
		FText StartMinigameText; // 0x658(0x10)
		FText EndMinigameText; // 0x668(0x10)
		TArray<FName> BlockedTabNames; // 0x678(0x10)
		unsigned char UnknownData02_7[0x28]; // 0x688(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeMyIslandPanel");
			return ret;
		}

		void UpdateStartEndMinigameInput(AFortMinigame* Minigame); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC556C0(relative to base address)
		void UpdateBackButtonText(FText NewText); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC55504(relative to base address)
		void ShouldShowTab(bool& bOutShouldShowTab, FName TabID, EFortMinigameState MinigameState, bool bIsInReadOnlyExperience, bool bIsOwnerOfCurrentExperience); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabVisibilitiesUpdated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStartEndMinigameInput(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMinigameStateChanged(EFortMinigameState MinigameState); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMinigameSettingsChanged(AFortMinigameSettingsBuilding* MinigameSettings); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActiveMainContentWidgetChanged(UWidget* ActiveWidget, int32_t ActiveWidgetIndex); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsUpdatingTabVisibilities(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC550E4(relative to base address)
		bool IsOwnerOfCurrentExperience(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC54FCC(relative to base address)
		void HandleMinigameStateChanged(AFortMinigame* Minigame, EFortMinigameState MinigameState); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC54A84(relative to base address)
		void HandleMinigameSettingsMachineChanged(UFortMinigameVolumeComponent* MinigameVolumeComponent, AFortMinigameSettingsBuilding* MinigameSettings); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC549C0(relative to base address)
		void HandleCreativePermissionsChanged(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5473C(relative to base address)
		UFortMinigameVolumeComponent GetMinigameVolumeComponent(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC54714(relative to base address)
		AFortMinigameSettingsBuilding GetMinigameSettingsMachine(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC546EC(relative to base address)
	};


	// Class FortniteUI.FortCreativePropertyCategoryTagToTextMap
	// Inherited from UDataAsset -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UFortCreativePropertyCategoryTagToTextMap : public UDataAsset	
	{
	public:
		TMap<FGameplayTag, FText> CategoryTagToTextMap; // 0x30(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativePropertyCategoryTagToTextMap");
			return ret;
		}

		FText GetDisplayName(FGameplayTag& CategoryTag); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC544EC(relative to base address)
	};


	// Class FortniteUI.FortCreativePropertySubcategoryHeaderListItem
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UFortCreativePropertySubcategoryHeaderListItem : public UObject	
	{
	public:
		FMulticastInlineDelegate OnIsExpandedChangedDynamicDelegate; // 0x28(0x10)
		TArray<UObject*> Options; // 0x38(0x10)
		unsigned char UnknownData00_7[0x20]; // 0x48(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativePropertySubcategoryHeaderListItem");
			return ret;
		}

		void SetIsExpanded(bool bInIsExpanded); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5533C(relative to base address)
		void OnIsExpandedChangedDynamic__DelegateSignature(bool bIsExpanded); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsExpanded(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC54FB8(relative to base address)
		FGameplayTag GetSubcategoryTag(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5D1AC8(relative to base address)
	};


	// Class FortniteUI.FortCreativeScoreboardPanel
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x540 - 0x528)
	class UFortCreativeScoreboardPanel : public UCommonActivatablePanelLegacy	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x528(0x8) UNKNOWN PROPERTY
		FDataTableRowHandle MainMenuInputRowHandle; // 0x530(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeScoreboardPanel");
			return ret;
		}

		void KickOffMatchmaking(FOnlineLinkId IslandToMatchmakeTo); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC550FC(relative to base address)
	};


	// Class FortniteUI.FortCreativeTimerContainerWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x80 (0x398 - 0x318)
	class UFortCreativeTimerContainerWidget : public UFortHUDElementWidget	
	{
	public:
		UClass* TimerViewModelClass; // 0x318(0x8)
		unsigned char UnknownData00_6[0x10]; // 0x320(0x10) UNKNOWN PROPERTY
		UClass* TimerWidgetDefaultClass; // 0x330(0x8)
		TMap<UObject*, FViewModelRelation> InterfaceViewModelMap; // 0x338(0x50)
		TScriptInterface<Class> ActiveInterface; // 0x388(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeTimerContainerWidget");
			return ret;
		}

		void OnTimerWidgetCreated(UUserWidget* Widget); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTimerWidgetActorUpdated(AActor* TimerWidgetActor); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC54C80(relative to base address)
		void HandlePlayerEnterVolume(APlayerState* PlayerState, AFortVolume* FortVolume); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC54B48(relative to base address)
	};


	// Class FortniteUI.FortCreativeTimerViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x50 (0xB8 - 0x68)
	class UFortCreativeTimerViewModel : public UMVVMViewModelBase	
	{
	public:
		FName DefaultTextStyle; // 0x68(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		FText DisplayText; // 0x70(0x10)
		FText DisplayRichText; // 0x80(0x10)
		FText LabelText; // 0x90(0x10)
		FText TimeText; // 0xA0(0x10)
		int32_t RemainingSeconds; // 0xB0(0x4)
		int32_t TotalSeconds; // 0xB4(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortCreativeTimerViewModel");
			return ret;
		}

		bool IsTextStyleValid(FName& TextStyle); // Flags: Native|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF74FC55044(relative to base address)
	};


	// Class FortniteUI.FortDiscoverSurfaceViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x68 (0xD0 - 0x68)
	class UFortDiscoverSurfaceViewModel : public UMVVMViewModelBase	
	{
	public:
		bool bQueryingPageInProgress; // 0x68(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x69(0x7) UNKNOWN PROPERTY
		TArray<UFortDiscoverProviderViewModel*> Providers; // 0x70(0x10)
		FName SurfaceName; // 0x80(0x4)
		unsigned char UnknownData01_7[0x4C]; // 0x84(0x4C) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverSurfaceViewModel");
			return ret;
		}

		void UpdateCachedSurfaceData(bool bShouldForceUpdate); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FBC25C(relative to base address)
		void StopVisibleImpressions(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FC7F80(relative to base address)
		void StartVisibleImpressions(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FC7FB8(relative to base address)
		void StartAnalyticsImpressions(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749FCCCB8(relative to base address)
		bool ShouldQueryOnConstruct(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF749ACFEB8(relative to base address)
		void SendSubviewEvent(UWidget* Widget, FString Label, FString Value); // Flags: Final|Native|Public|BlueprintCallable|Const, Memory Exec: 0x7FF74FF9632C(relative to base address)
		int32_t GetProviderIndexFromPanelName(FName PanelName); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FF94980(relative to base address)
		UFortDiscoverProviderViewModel GetProviderFromPanelName(FName PanelName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FF948F4(relative to base address)
		void FireExitedImpressionsFromSurface(); // Flags: RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF746F37328(relative to base address)
		void FetchNextPageFromPanelName(int32_t SelectionIndex, FName PanelName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FF93CAC(relative to base address)
		void FetchNextPageFromIndex(int32_t SelectionIndex, int32_t ProviderIndex); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FF93BEC(relative to base address)
	};


	// Class FortniteUI.FortDiscoverBrowseViewModel
	// Inherited from UFortDiscoverSurfaceViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x40 (0x110 - 0xD0)
	class UFortDiscoverBrowseViewModel : public UFortDiscoverSurfaceViewModel	
	{
	public:
		TArray<UFortDiscoverTileItemVM*> FeaturedCategories; // 0xD0(0x10)
		TArray<UFortDiscoverTileItemVM*> AllCategories; // 0xE0(0x10)
		FText FeaturedCategoriesPanelDisplayName; // 0xF0(0x10)
		FText AllCategoriesPanelDisplayName; // 0x100(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverBrowseViewModel");
			return ret;
		}

		void SetDataFromProviders(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748BEDE70(relative to base address)
		UFortDiscoverProviderViewModel GetFeaturedCategoriesProviderViewModel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5459C(relative to base address)
		UFortDiscoverProviderViewModel GetAllCategoriesProviderViewModel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC544B8(relative to base address)
	};


	// Class FortniteUI.FortDiscoverItemSelectorBase
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortDiscoverItemSelectorBase : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverItemSelectorBase");
			return ret;
		}

		UClass GetTileItemClass(UFortDiscoverTileItemVM* InTileItemViewModel); // Flags: RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF74FC564A8(relative to base address)
		UClass GetRowItemClass(UFortGameActivityProvider* InCategory); // Flags: RequiredAPI|Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF74FC56418(relative to base address)
	};


	// Class FortniteUI.FortDiscoverSearchViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x148 (0x1B0 - 0x68)
	class UFortDiscoverSearchViewModel : public UMVVMViewModelBase	
	{
	public:
		FString SearchTerm; // 0x68(0x10)
		bool bIsSearchInProgress; // 0x78(0x1)
		bool bIsCreatorSearchInProgress; // 0x79(0x1)
		bool bIsLinkCodeSearch; // 0x7A(0x1)
		unsigned char UnknownData00_6[0x5]; // 0x7B(0x5) UNKNOWN PROPERTY
		FString ResultsTerm; // 0x80(0x10)
		TArray<UFortDiscoverTileItemVM*> SearchResults; // 0x90(0x10)
		EDiscoverSearchMode SearchMode; // 0xA0(0x1)
		bool bWasLastCreatorQueryResultSuccessful; // 0xA1(0x1)
		ELinkEntryQueryResult LastLinkEntryQueryResult; // 0xA2(0x1)
		unsigned char UnknownData01_7[0x10D]; // 0xA3(0x10D) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverSearchViewModel");
			return ret;
		}

		void StopAnalyticsVisibilityImpressions(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57A44(relative to base address)
		void StartAnalyticsVisibilityImpressions(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC578A4(relative to base address)
		void StartAnalyticsSession(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57890(relative to base address)
		void StartAnalyticsImpressions(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5787C(relative to base address)
		bool IsAnySearchActiveOrInProgress(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7499AFC14(relative to base address)
		int32_t GetIslandResultCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC56328(relative to base address)
		int32_t GetCreatorResultCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC56300(relative to base address)
		void FireAnalyticsForBrowseAndSearch(UFortDiscoverBrowseViewModel* BrowseViewModel); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5626C(relative to base address)
		void ClearSearch(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5621C(relative to base address)
		void ActionSearch(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC560D8(relative to base address)
	};


	// Class FortniteUI.FortDiscoverTileItemVM
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x70 (0xE0 - 0x70)
	class UFortDiscoverTileItemVM : public UFortPerUserViewModel	
	{
	public:
		unsigned char UnknownData00_3[0x60]; // 0x70(0x60) UNKNOWN PROPERTY
		char ItemType; // 0xD0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		int32_t ColumnSize; // 0xD4(0x4)
		bool bDisplayAsSquareTile; // 0xD8(0x1)
		unsigned char UnknownData02_7[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDiscoverTileItemVM");
			return ret;
		}

		void StopVisibilityImpression(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57A60(relative to base address)
		void StopActiveImpression(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57A2C(relative to base address)
		void StartVisibilityImpression(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57A00(relative to base address)
		void StartActiveImpression(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57864(relative to base address)
		void ResetAnalytics(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC56BBC(relative to base address)
	};


	// Class FortniteUI.FortDynamicMotdFullscreenTile
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x400 - 0x3F0)
	class UFortDynamicMotdFullscreenTile : public UCommonActivatableWidget	
	{
	public:
		UMotdViewModel* Motd; // 0x3F0(0x8)
		UFortDynamicMotdMediaPlayer* MediaPlayer; // 0x3F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdFullscreenTile");
			return ret;
		}

		void SetMotd(UMotdViewModel* InMotd); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57058(relative to base address)
		void OnVideoBackgroundsAllowedChanged(bool bAllowVideoBackgrounds); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnButtonPressed(UMotdActionBase* Action, EMotdButtonStyle Style); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC56614(relative to base address)
	};


	// Class FortniteUI.FortDynamicMotdFullscreenWidget
	// Inherited from UMotdWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x410 - 0x408)
	class UFortDynamicMotdFullscreenWidget : public UMotdWidgetBase	
	{
	public:
		UAthenaScrollBox* ScrollBox; // 0x408(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdFullscreenWidget");
			return ret;
		}

		void SwipeRight(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwipeLeft(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSlideIndex(int32_t Index); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SendManualVideoControlEvent(bool bEnableSecondary); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC56BD0(relative to base address)
		void OnScrollInput(float ScrollDirection); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FC569E4(relative to base address)
		void OnMotdShown(FString ContentHash); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC568F4(relative to base address)
		void OnCurrentMotdSet(int32_t Index); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC56838(relative to base address)
		void OnButtonPressed(EButtonAction ButtonPressed, FString ContentHash); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC56728(relative to base address)
		void HandleInputMethodChanged(ECommonInputType NewInputType); // Flags: Final|Native|Protected, Memory Exec: 0x7FF74FC56538(relative to base address)
	};


	// Class FortniteUI.FortDynamicMotdMediaPlayer
	// Inherited from UObject
	// Size: 0xD0 (0xF8 - 0x28)
	class UFortDynamicMotdMediaPlayer : public UObject	
	{
	public:
		FMulticastInlineDelegate Loaded; // 0x28(0x10)
		FMulticastInlineDelegate Playing; // 0x38(0x10)
		FMulticastInlineDelegate Closed; // 0x48(0x10)
		FMulticastInlineDelegate Ended; // 0x58(0x10)
		FMulticastInlineDelegate TerminalErrorEvent; // 0x68(0x10)
		unsigned char UnknownData00_6[0x8]; // 0x78(0x8) UNKNOWN PROPERTY
		UFortBaseStreamingVideo* BasePlayer; // 0x80(0x8)
		UMediaTexture* MediaTexture; // 0x88(0x8)
		unsigned char UnknownData01_7[0x68]; // 0x90(0x68) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdMediaPlayer");
			return ret;
		}

		void VideoOnTerminalError(EBaseMediaTerminalErrorReason Reason); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC57B60(relative to base address)
		void VideoOnStarted(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC57B4C(relative to base address)
		void VideoOnSeeked(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC57B34(relative to base address)
		void VideoOnOpened(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC57B20(relative to base address)
		void VideoOnEnded(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC57B0C(relative to base address)
		void VideoOnClosed(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC57AF8(relative to base address)
		void Stop(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC57A18(relative to base address)
		void Start(FMotdVideo& MotdVideo, UMediaTexture* InMediaTexture, int32_t InMaxYResolution, bool bDisableCDNFailover, bool bManualLoop, int32_t InLoopOverride); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC573B0(relative to base address)
		void SetPriority(bool bInPriority); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC570E4(relative to base address)
		void Play(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC56A64(relative to base address)
		void MetadataSuccess(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC56600(relative to base address)
	};


	// Class FortniteUI.DynamicMotdVideoPlayerState
	// Inherited from UObject
	// Size: 0xF8 (0x120 - 0x28)
	class UDynamicMotdVideoPlayerState : public UObject	
	{
	public:
		FMulticastInlineDelegate PlayingEvent; // 0x28(0x10)
		FMulticastInlineDelegate TerminalEvent; // 0x38(0x10)
		FMulticastInlineDelegate EndedEvent; // 0x48(0x10)
		UFortDynamicMotdMediaPlayer* MediaPlayer; // 0x58(0x8)
		FString Name; // 0x60(0x10)
		bool bPreloaded; // 0x70(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x71(0x3) UNKNOWN PROPERTY
		FName TextureParam; // 0x74(0x4)
		bool bPlayImmediately; // 0x78(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		UMediaTexture* MediaTexture; // 0x80(0x8)
		unsigned char UnknownData02_6[0x88]; // 0x88(0x88) UNKNOWN PROPERTY
		UGameInstance* GameInstance; // 0x110(0x8)
		unsigned char UnknownData03_7[0x8]; // 0x118(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.DynamicMotdVideoPlayerState");
			return ret;
		}

		void TerminalError(EBaseMediaTerminalErrorReason Reason); // Flags: Final|Native|Public, Memory Exec: 0x7FF74FC57A78(relative to base address)
		void Playing(); // Flags: Final|Native|Public, Memory Exec: 0x7FF74FC56A78(relative to base address)
		void Loaded(); // Flags: Final|Native|Public, Memory Exec: 0x7FF74FC565EC(relative to base address)
		bool IsValid(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC565D0(relative to base address)
		bool IsFree(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC565B8(relative to base address)
		void Free(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC562EC(relative to base address)
		void Ended(); // Flags: Final|Native|Public, Memory Exec: 0x7FF74FC56258(relative to base address)
		void Closed(); // Flags: Final|Native|Public, Memory Exec: 0x7FF74FC56244(relative to base address)
	};


	// Class FortniteUI.FortDynamicMotdTeaserWidget
	// Inherited from UMotdWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x470 - 0x408)
	class UFortDynamicMotdTeaserWidget : public UMotdWidgetBase	
	{
	public:
		FMulticastInlineDelegate FullscreenWidgetCreated; // 0x408(0x10)
		FMulticastInlineDelegate VideoPlayerReady; // 0x418(0x10)
		bool bVideoReady; // 0x428(0x1)
		bool bShouldBeActive; // 0x429(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x42A(0x6) UNKNOWN PROPERTY
		UMotdViewModel* CurrentMotd; // 0x430(0x8)
		TArray<UDynamicMotdVideoPlayerState*> MediaPlayerStates; // 0x438(0x10)
		UFortDynamicMotdFullscreenWidget* CreatedFullscreenWidget; // 0x448(0x8)
		unsigned char UnknownData01_7[0x20]; // 0x450(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortDynamicMotdTeaserWidget");
			return ret;
		}

		UDynamicMotdVideoPlayerState StartVideo(UMotdViewModel* Motd, UMediaTexture* InTexture, FName InTextureParam, bool bPlayImmediately); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC578C0(relative to base address)
		void SetCurrentMotd(int32_t Index); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC56D4C(relative to base address)
		void ReleaseMediaPlayer(FText& Name, bool bAll); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC56A8C(relative to base address)
		void OnVideoBackgroundsAllowedChanged(bool bAllowVideoBackgrounds); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMotdShown(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC569D0(relative to base address)
		float GetMotdUpdateDebounce(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC563FC(relative to base address)
		UDynamicMotdVideoPlayerState GetMediaPlayer(FString& Name); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC56350(relative to base address)
		void AddFullScreenWidget(TWeakObjectPtr<UClass*> FullScreenWidget, int32_t Index); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC560EC(relative to base address)
	};


	// Class FortniteUI.FortEulaWidgetsContainer
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x418 - 0x3F0)
	class UFortEulaWidgetsContainer : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x3F0(0x10) UNKNOWN PROPERTY
		UCommonActivatableWidgetSwitcher* Switcher_EulaWidgets; // 0x400(0x8)
		UFortEulaWidget* Widget_OldEula; // 0x408(0x8)
		UFortEulaWidget* Widget_NewEula; // 0x410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEulaWidgetsContainer");
			return ret;
		}
	};


	// Class FortniteUI.FortEventDateTimeTextBlock
	// Inherited from UCommonTextBlock -> UTextBlock -> UTextLayoutWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x380 - 0x328)
	class UFortEventDateTimeTextBlock : public UCommonTextBlock	
	{
	public:
		unsigned char UnknownData00_1[0x58]; // 0x328(0x58) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEventDateTimeTextBlock");
			return ret;
		}

		void SetTimespanValue(FTimespan InTimespan, TEnumAsByte<DateFormat> InFormatStyle); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC571D8(relative to base address)
		void SetDateTimeValue(FDateTime InDateTime, TEnumAsByte<DateFormat> InFormatStyle, float InRefreshDelay); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC56DCC(relative to base address)
		void SetCountDownCompletionText(FText InCompletionText); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC56C90(relative to base address)
		void OnCurrentTimeTextBlockUpdated__DelegateSignature(double Seconds); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FDateTime GetDateTime(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74D097B08(relative to base address)
		void ClearTimer(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC56230(relative to base address)
	};


	// Class FortniteUI.FortEventLevelData
	// Inherited from UDataAsset -> UObject
	// Size: 0x60 (0x90 - 0x30)
	class UFortEventLevelData : public UDataAsset	
	{
	public:
		FString EventLevelStoreFrontName; // 0x30(0x10)
		TWeakObjectPtr<UAthenaRewardEventGraph*> EventLevelRewards; // 0x40(0x20)
		UClass* CinematicMovieWidget; // 0x60(0x8)
		UFortStreamMediaSource* ElectraMediaSource; // 0x68(0x8)
		UMediaPlayer* StreamedMediaPlayer; // 0x70(0x8)
		FName CinematicVideoName; // 0x78(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		FDataTableRowHandle InteractionHandle; // 0x80(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEventLevelData");
			return ret;
		}
	};


	// Class FortniteUI.FortEditableFilteredCountedTextBox
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x120 (0x3D0 - 0x2B0)
	class UFortEditableFilteredCountedTextBox : public UUserWidget	
	{
	public:
		int32_t EntryCharLimit; // 0x2B0(0x4)
		EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x2B4(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x2B5(0x3) UNKNOWN PROPERTY
		int32_t EnforcedEntryCharLimit; // 0x2B8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x2BC(0x4) UNKNOWN PROPERTY
		FText SuggestionText; // 0x2C0(0x10)
		unsigned char UnknownData02_6[0x1]; // 0x2D0(0x1) UNKNOWN PROPERTY
		bool bUseChatSanitizer; // 0x2D1(0x1)
		bool bShouldValidatePersistentID; // 0x2D2(0x1)
		bool bAllowLineBreaks; // 0x2D3(0x1)
		bool bAllowStyleEditing; // 0x2D4(0x1)
		bool bIgnoreCharLimitValidation; // 0x2D5(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x2D6(0x2) UNKNOWN PROPERTY
		FCharRangeList AllowedCharacters; // 0x2D8(0x10)
		bool bReplaceUserTextWithSanitizedString; // 0x2E8(0x1)
		bool bAllowSanitizedStrings; // 0x2E9(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x2EA(0x6) UNKNOWN PROPERTY
		FText DefaultSanitizationErrorText; // 0x2F0(0x10)
		FText AdditionalValidationErrorText; // 0x300(0x10)
		bool bCurrentlyValid; // 0x310(0x1)
		unsigned char UnknownData05_7[0xBF]; // 0x311(0xBF) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortEditableFilteredCountedTextBox");
			return ret;
		}

		void ValidatePersistentID(FText& Text); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateCharacterCount(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FFF2944(relative to base address)
		void SetTextWithForcedSanitization(FText& Text); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FFF1FD4(relative to base address)
		void SetEntryCharLimit(int32_t InCharLimit); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74DC6700C(relative to base address)
		void OnEditableTextHintChanged(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEditableTextChanged(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharCountTextChanged(FText& Text); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTextCommitted(FText& Text, TEnumAsByte<ETextCommit> CommitMethod); // Flags: Native|Protected|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FFEFFB0(relative to base address)
		void HandleTextChanged(FText& Text); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FFEFF14(relative to base address)
		bool GetSomeBool(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF748CDD424(relative to base address)
		bool GetIgnoreCharLimitValidation(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FFEEE9C(relative to base address)
		int32_t GetEntryCharLimit(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749FCCC20(relative to base address)
		FText GetEditedText(); // Flags: Native|Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF74FFEED3C(relative to base address)
		bool GetAllowStyleEditing(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FDC1F7C(relative to base address)
		bool GetAllowLineBreaks(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FFEE8F0(relative to base address)
		FString GetAllowedCharactersAsString(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FFEE908(relative to base address)
		void ForceSetText(FText& Text); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FFEE790(relative to base address)
	};


	// Class FortniteUI.FortFilteredNameEntryWidget
	// Inherited from UFortEditableFilteredCountedTextBox -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x400 - 0x3D0)
	class UFortFilteredNameEntryWidget : public UFortEditableFilteredCountedTextBox	
	{
	public:
		TEnumAsByte<ETextCommit> LastTextCommittedType; // 0x3D0(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x3D1(0x7) UNKNOWN PROPERTY
		UCommonButtonBase* Button_RenameInputButton; // 0x3D8(0x8)
		FMulticastInlineDelegate OnTextCommitByEnter; // 0x3E0(0x10)
		FMulticastInlineDelegate OnRenameInput; // 0x3F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFilteredNameEntryWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortFrontendExperienceFlowInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortFrontendExperienceFlowInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendExperienceFlowInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortFrontendOverlayInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortFrontendOverlayInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendOverlayInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortFrontendSurvivorTier
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UFortFrontendSurvivorTier : public UUserWidget	
	{
	public:
		FGameplayTag AssociatedQuestCategory; // 0x2B0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x2B4(0x4) UNKNOWN PROPERTY
		UCommonButtonBase* Button_GoToQuests; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendSurvivorTier");
			return ret;
		}
	};


	// Class FortniteUI.FortGameFeature_FortGameRegistryObserver
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UFortGameFeature_FortGameRegistryObserver : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr<UFortGameSettingRegistry*> AssociatedSettingsRegistry; // 0x30(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGameFeature_FortGameRegistryObserver");
			return ret;
		}
	};


	// Class FortniteUI.FortGameSettingRegistryExtension
	// Inherited from UFortGameSettingRegistryExtensionBase -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortGameSettingRegistryExtension : public UFortGameSettingRegistryExtensionBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGameSettingRegistryExtension");
			return ret;
		}
	};


	// Class FortniteUI.FortGameSettingSubsystem
	// Inherited from UFortLocalPlayerSubsystem -> ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UFortGameSettingSubsystem : public UFortLocalPlayerSubsystem	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x30(0x18) UNKNOWN PROPERTY
		UFortGameSettingRegistry* SettingRegistry; // 0x48(0x8)
		UFortGameFeature_FortGameRegistryObserver* SettingRegistryObserver; // 0x50(0x8)
		unsigned char UnknownData01_7[0x28]; // 0x58(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGameSettingSubsystem");
			return ret;
		}
	};


	// Class FortniteUI.FortGlobalActionDetailsDataSource
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortGlobalActionDetailsDataSource : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGlobalActionDetailsDataSource");
			return ret;
		}

		void RemoveOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74FC58CE4(relative to base address)
		FFortGlobalActionDetails GetValue(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF74FC58CB8(relative to base address)
		void AddOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74E2608AC(relative to base address)
	};


	// Class FortniteUI.FortGlobalVMResolver
	// Inherited from UMVVMViewModelContextResolver -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortGlobalVMResolver : public UMVVMViewModelContextResolver	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortGlobalVMResolver");
			return ret;
		}
	};


	// Class FortniteUI.FortHabaneroGenericEntry
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3F0 - 0x3F0)
	class UFortHabaneroGenericEntry : public UCommonActivatableWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroGenericEntry");
			return ret;
		}

		FText DateTimeAsTimeZoneTimeShort(FDateTime& InDateTime, FString InTimeZone); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC58B08(relative to base address)
	};


	// Class FortniteUI.FortHabaneroInfoEntry
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3F8 - 0x3F0)
	class UFortHabaneroInfoEntry : public UCommonActivatableWidget	
	{
	public:
		UFortHabaneroDisplayData* HabaneroDisplayData; // 0x3F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroInfoEntry");
			return ret;
		}

		void OnSetGameMode(FString GameMode); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortHabaneroInfoModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x440 - 0x3F0)
	class UFortHabaneroInfoModal : public UCommonActivatableWidget	
	{
	public:
		UVerticalBox* Vbox_Panels; // 0x3F0(0x8)
		UCommonButtonBase* Button_Close; // 0x3F8(0x8)
		UCommonButtonBase* Button_Close_Alt; // 0x400(0x8)
		UCommonButtonBase* Button_CloseTouch; // 0x408(0x8)
		UAthenaScrollBox* ScrollBox_Panels; // 0x410(0x8)
		unsigned char UnknownData00_6[0x10]; // 0x418(0x10) UNKNOWN PROPERTY
		bool bIsHabaneroTimerEnabled; // 0x428(0x1)
		unsigned char UnknownData01_7[0x17]; // 0x429(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroInfoModal");
			return ret;
		}

		void SetTimerVisibility(ESlateVisibility TimerVisibility); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTimerText(FTimespan& Timespan); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetProgress(FString ProgressKey, int32_t CurrentHabanero, int32_t CurrentPosition, float ProgressPercent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetGameType(FString GameMode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC58ED4(relative to base address)
		void SendPanelFocusedAnalytics(UWidget* Panel, FString Text); // Flags: Final|Native|Protected|BlueprintCallable|Const, Memory Exec: 0x7FF74FC58D88(relative to base address)
		void BP_OnScrollCompleted(bool bScrolledDown); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortHabaneroTierWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x420 - 0x3F0)
	class UFortHabaneroTierWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x3F0(0x20) UNKNOWN PROPERTY
		UFortHabaneroDisplayData* HabaneroDisplayData; // 0x410(0x8)
		bool bInitializeToRepresentLocalUser; // 0x418(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x419(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroTierWidget");
			return ret;
		}

		void UpdateWidgetDisplay(FFortHabaneroTier& DisplayData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartQueryForRank(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToFindRank(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortHabaneroLobbyWidget
	// Inherited from UFortHabaneroTierWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x438 - 0x420)
	class UFortHabaneroLobbyWidget : public UFortHabaneroTierWidget	
	{
	public:
		UCommonButtonBase* Button_Info; // 0x420(0x8)
		FGameplayTag RankedInfoBangTag; // 0x428(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x42C(0x4) UNKNOWN PROPERTY
		UClass* InfoModalClass; // 0x430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHabaneroLobbyWidget");
			return ret;
		}

		void UpdateProgressToNextHabanero(int32_t UnrealRankPlayerPosition, float ProgressPercent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBangVisible(bool bIsVisible); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortHUDVisibilityData
	// Inherited from UDataAsset -> UObject
	// Size: 0x30 (0x60 - 0x30)
	class UFortHUDVisibilityData : public UDataAsset	
	{
	public:
		FGameplayTag HUDVisibilityGameplayTag; // 0x30(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FText DisplayText; // 0x38(0x10)
		FText ToolTipText; // 0x48(0x10)
		bool Visible; // 0x58(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x59(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortHUDVisibilityData");
			return ret;
		}
	};


	// Class FortniteUI.FortSetting
	// Inherited from UObject
	// Size: 0x158 (0x180 - 0x28)
	class UFortSetting : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x48]; // 0x28(0x48) UNKNOWN PROPERTY
		UFortLocalPlayer* LocalPlayer; // 0x70(0x8)
		TWeakObjectPtr<UFortSetting*> SettingParent; // 0x78(0x8)
		UFortSettingRegistry* OwningRegistry; // 0x80(0x8)
		unsigned char UnknownData01_6[0x48]; // 0x88(0x48) UNKNOWN PROPERTY
		FFortSettingNameExtensions CustomExtensions; // 0xD0(0x18)
		unsigned char UnknownData02_7[0x98]; // 0xE8(0x98) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSetting");
			return ret;
		}

		FText GetWarningRichText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E150(relative to base address)
		FText GetDynamicDetails(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E0D4(relative to base address)
		ESlateVisibility GetDisplayNameVisibility(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74EFB9D68(relative to base address)
		FText GetDisplayName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E0B8(relative to base address)
		FString GetDevName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025DF64(relative to base address)
		FText GetDescriptionRichText(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3331D4(relative to base address)
	};


	// Class FortniteUI.FortSettingValue
	// Inherited from UFortSetting -> UObject
	// Size: 0x0 (0x180 - 0x180)
	class UFortSettingValue : public UFortSetting	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValue");
			return ret;
		}
	};


	// Class FortniteUI.FortInputSettingBase
	// Inherited from UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x8 (0x188 - 0x180)
	class UFortInputSettingBase : public UFortSettingValue	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x180(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortInputSettingBase");
			return ret;
		}
	};


	// Class FortniteUI.FortInventoryScreenContainer
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x430 - 0x3F0)
	class UFortInventoryScreenContainer : public UCommonActivatableWidget	
	{
	public:
		UInputComponent* InventoryScreenInputComponent; // 0x3F0(0x8)
		FDataTableRowHandle BackInputRowHandle; // 0x3F8(0x10)
		TArray<FName> BlockedInputActions; // 0x408(0x10)
		TArray<FName> BlockedInputAxes; // 0x418(0x10)
		unsigned char UnknownData00_7[0x8]; // 0x428(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortInventoryScreenContainer");
			return ret;
		}
	};


	// Class FortniteUI.FortItemManagementMulchPanel
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortItemManagementMulchPanel : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemManagementMulchPanel");
			return ret;
		}

		void ShowMulchConfirmationModal(); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF748D7CC28(relative to base address)
		void NotifyPanelDeactivated(); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF748F06970(relative to base address)
		void NotifyPanelActivated(); // Flags: Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74EEDF7EC(relative to base address)
		void HideMulchConfirmationModal(); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF749263428(relative to base address)
	};


	// Class FortniteUI.FortFrontendInventoryFilterFunctionLibrary
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortFrontendInventoryFilterFunctionLibrary : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortFrontendInventoryFilterFunctionLibrary");
			return ret;
		}

		FText ToText(EFortFrontendInventoryFilter FrontendInventoryFilter); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC5AE38(relative to base address)
	};


	// Class FortniteUI.FortItemPreviewScreen
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1B8 (0x718 - 0x560)
	class UFortItemPreviewScreen : public UFortActivatablePanel	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x560(0x10) UNKNOWN PROPERTY
		FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x570(0x10)
		FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x580(0x10)
		FDataTableRowHandle ItemViewZoomOutInputAction; // 0x590(0x10)
		FDataTableRowHandle ItemViewZoomInInputAction; // 0x5A0(0x10)
		FDataTableRowHandle ItemViewRotateInputAction; // 0x5B0(0x10)
		UWidgetAnimation* AnimationToHideItemInfo; // 0x5C0(0x8)
		bool bAutoShowDetails; // 0x5C8(0x1)
		bool bFireAnalyticsViewEvent; // 0x5C9(0x1)
		bool bItemDetailsHidden; // 0x5CA(0x1)
		unsigned char UnknownData01_6[0x1]; // 0x5CB(0x1) UNKNOWN PROPERTY
		float HideItemInfoHeaderDurationSecs; // 0x5CC(0x4)
		unsigned char UnknownData02_6[0x8]; // 0x5D0(0x8) UNKNOWN PROPERTY
		bool bAllowItemRotation; // 0x5D8(0x1)
		bool bAllowItemZooming; // 0x5D9(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x5DA(0x2) UNKNOWN PROPERTY
		FGameplayTag PreviewSceneChangerTag; // 0x5DC(0x4)
		FGameplayTag PreviewSceneChangerOverrideTag; // 0x5E0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x5E4(0x4) UNKNOWN PROPERTY
		AFortItemPreviewSceneChanger* PreviewSceneChanger; // 0x5E8(0x8)
		UFortItemView* ItemViewObject; // 0x5F0(0x8)
		float CameraEntryTransitionDuration; // 0x5F8(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x5FC(0x4) UNKNOWN PROPERTY
		UCurveFloat* CameraEntryTransitionCurve; // 0x600(0x8)
		unsigned char UnknownData06_6[0x59]; // 0x608(0x59) UNKNOWN PROPERTY
		bool bPreviewActionsEnabled; // 0x661(0x1)
		unsigned char UnknownData07_6[0x1E]; // 0x662(0x1E) UNKNOWN PROPERTY
		UWidget* Widget_CameraFrame; // 0x680(0x8)
		UCommonButtonBase* Button_PreviewAction; // 0x688(0x8)
		UCommonButtonBase* Button_PreviewAction1; // 0x690(0x8)
		UCommonButtonBase* Button_Camera; // 0x698(0x8)
		TSet<UCommonButtonBase*> PreviewActionButtons; // 0x6A0(0x50)
		UCommonActivatableWidget* OverrideFocusWidget; // 0x6F0(0x8)
		FMulticastInlineDelegate OnShowItemInfo; // 0x6F8(0x10)
		UFortItemDownloadIndicator* ItemDownloadIndicator; // 0x708(0x8)
		UCommonTextBlock* Text_DebugPreviewDetails; // 0x710(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemPreviewScreen");
			return ret;
		}

		void ShowItemDetails(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7500788B8(relative to base address)
		void RequestChangeFloorMaterialScalarParameter(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750077E40(relative to base address)
		void RequestChangeBackgroundMaterialScalarParameter(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF750077D7C(relative to base address)
		void PreviewAction(FName ActionName); // Flags: Final|RequiredAPI|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF750077C28(relative to base address)
		void OnPreviewActionButtonUpdated(FText& RowDisplayName, UCommonButtonBase* Button); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideItemDetails(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7500777F8(relative to base address)
		AFortItemPreviewSceneChanger GetPreviewSceneChanger(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C1E1CD4(relative to base address)
	};


	// Class FortniteUI.FortItemPreviewWidget
	// Inherited from UFortItemPreviewScreen -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x778 - 0x718)
	class UFortItemPreviewWidget : public UFortItemPreviewScreen	
	{
	public:
		FMulticastInlineDelegate OnPreviewItemShown; // 0x718(0x10)
		UFortItemVM* CurrentItemVM; // 0x728(0x8)
		UFortTypedModularLoadoutVM* CurrentLoadoutVM; // 0x730(0x8)
		UFortItemVM* FallbackItemVM; // 0x738(0x8)
		TArray<FMcpVariantChannelInfo> VariantOverrides; // 0x740(0x10)
		bool bCanDisplayUserBackpack; // 0x750(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x751(0x7) UNKNOWN PROPERTY
		FGameplayTag ProductOverride; // 0x758(0x4)
		EItemPreviewRestrictionMode RestrictionMode; // 0x75C(0x1)
		bool bAllowPawnOverrideOnExclusiveItems; // 0x75D(0x1)
		bool bAllowUpdateWhileDeactivated; // 0x75E(0x1)
		bool bRestrictZoomToWidget; // 0x75F(0x1)
		unsigned char UnknownData01_7[0x18]; // 0x760(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortItemPreviewWidget");
			return ret;
		}

		void UpdatePreview(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC5AF64(relative to base address)
		void ToggleVariantOverrideOnCurrentItem(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5AED0(relative to base address)
		void SetVariantOverrides(TArray<FMcpVariantChannelInfo>& InVariantOverrides); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC5AD94(relative to base address)
		void SetSlotIndexOverrideAndCurrentItem(int32_t InSlotIndex, UFortItemVM* InItemVM); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5ACC4(relative to base address)
		void SetSlotIndexOverride(int32_t SlotIndex); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74782F2FC(relative to base address)
		void SetRotationOffset(FRotator& InRotationOffset); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC5AC38(relative to base address)
		void SetFallbackPreviewItem(UFortItemVM* ItemVM); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5ABA4(relative to base address)
		void SetCurrentPreviewLoadout(UFortTypedModularLoadoutVM* LoadoutVM); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5AB00(relative to base address)
		void SetCurrentPreviewItem(UFortItemVM* ItemVM); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74782F084(relative to base address)
		TArray GetSpecialPreviewActions(UFortItemVM* ItemVM); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A588(relative to base address)
		void ClearPreviewItem(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5A318(relative to base address)
		bool AllowToggleVariantOverrideOnCurrentItem(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A1E4(relative to base address)
	};


	// Class FortniteUI.FortPresentationItemLootInfo
	// Inherited from UObject
	// Size: 0x218 (0x240 - 0x28)
	class UFortPresentationItemLootInfo : public UObject	
	{
	public:
		FFortReceivedItemLootInfo ItemReceivedInfo; // 0x28(0x218)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPresentationItemLootInfo");
			return ret;
		}
	};


	// Class FortniteUI.ItemReceivedHeaderBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2C8 - 0x2B0)
	class UItemReceivedHeaderBase : public UUserWidget	
	{
	public:
		UFortGiftBoxItem* GiftBoxItem; // 0x2B0(0x8)
		FString FromUsername; // 0x2B8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ItemReceivedHeaderBase");
			return ret;
		}

		void SetBlueprintGiftBoxItem(UFortGiftBoxItem* GiftBox, FString FromUser, TArray<FFortReceivedItemLootInfo>& ItemDefs, bool bSelfGift); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitFromGiftBoxItem_BP(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortKeyboardPresetRotator
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2E0 - 0x2D8)
	class UFortKeyboardPresetRotator : public UCommonUserWidget	
	{
	public:
		int32_t SelectedIndex; // 0x2D8(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x2DC(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortKeyboardPresetRotator");
			return ret;
		}
	};


	// Class FortniteUI.FortLevelSaveComponentViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x30 (0x98 - 0x68)
	class UFortLevelSaveComponentViewModel : public UMVVMViewModelBase	
	{
	public:
		EBackupSaveState CachedBackupSaveState; // 0x68(0x1)
		EBackupSaveState CachedBackupRestoreState; // 0x69(0x1)
		bool bCachedIsOnPublishedIsland; // 0x6A(0x1)
		unsigned char UnknownData00_7[0x2D]; // 0x6B(0x2D) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortLevelSaveComponentViewModel");
			return ret;
		}

		void UnbindViewModel(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5AF50(relative to base address)
		void RestoreIslandFromBackup(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5AA98(relative to base address)
		void ResetIsland(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5AA54(relative to base address)
		bool IsPublishingEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A910(relative to base address)
		bool IsLastCheckpointDateSet(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A8F8(relative to base address)
		void InitializeViewModel(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5A8E4(relative to base address)
		void HandleCheckpointDateChanged(FDateTime CheckpointDate); // Flags: Final|Native|Private|HasDefaults, Memory Exec: 0x7FF74FC5A7D4(relative to base address)
		void HandleBackupSaveStateChanged(EBackupSaveState SaveState); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5A754(relative to base address)
		void HandleBackupRestoreStateChanged(EBackupSaveState RestoreState); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5A6D4(relative to base address)
		FTimespan GetTimeSinceLastCheckpoint(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A680(relative to base address)
		bool CanResetIsland(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A2B8(relative to base address)
		bool CanBackupAndRestoreIsland(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A294(relative to base address)
		void BackupIsland(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5A22C(relative to base address)
	};


	// Class FortniteUI.FortLoadingScreenCustomWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortLoadingScreenCustomWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortLoadingScreenCustomWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingErrorViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class UFortMatchmakingErrorViewModel : public UMVVMViewModelBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingErrorViewModel");
			return ret;
		}

		bool HasRedirect(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		bool HasError(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		FText GetPlayButtonOverrideText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A540(relative to base address)
		FMatchmakingWidgetErrorVisuals GetErrorVisuals(); // Flags: Final|Native|Private|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A404(relative to base address)
		EFortUIMatchmakingError GetCurrentError(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
	};


	// Class FortniteUI.FortMatchmakingSuggestionWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x2F8 - 0x2D8)
	class UFortMatchmakingSuggestionWidget : public UCommonUserWidget	
	{
	public:
		UWidget* SharedDataTestVoting_Container; // 0x2D8(0x8)
		UCommonButtonBase* Button_SharedDataTest_Accept; // 0x2E0(0x8)
		UCommonButtonBase* Button_SharedDataTest_Reject; // 0x2E8(0x8)
		UCommonTextBlock* Text_RequestedTextChange; // 0x2F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingSuggestionWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UFortMatchmakingViewModel : public UMVVMViewModelBase	
	{
	public:
		EFortUIMatchmakingStatus MatchmakingStatus; // 0x68(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		int32_t TimeElapsed; // 0x6C(0x4)
		UFortMatchmakingErrorViewModel* ErrorViewModel; // 0x70(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingViewModel");
			return ret;
		}

		void ReadyUp(); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC5AA18(relative to base address)
		void OpenModeSettings(); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC5A9DC(relative to base address)
		void LaunchMatch(); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC5A9A0(relative to base address)
		bool IsModeSettingsButtonEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		bool IsDebugStartMatchButtonEnabled(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		char GetTotalPlayerCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		FText GetModeSettingsSecondaryText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A4DC(relative to base address)
		FText GetModeSettingsPrimaryText(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A478(relative to base address)
		UClass GetMatchFoundIslandWidget(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74D7895EC(relative to base address)
		EIslandJoinability GetGameStatus(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		float GetDownloadProgress(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74E12724C(relative to base address)
		char GetCurrentReadyPlayerCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF748CDD424(relative to base address)
		FText GetCurrentIslandTitle(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5A3A0(relative to base address)
		UClass GetCurrentIslandCustomLogo(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74D7895EC(relative to base address)
		void CancelMatchmaking(); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC5A2DC(relative to base address)
	};


	// Class FortniteUI.MatchmakingWidgetErrorVisualsContainer
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UMatchmakingWidgetErrorVisualsContainer : public UObject	
	{
	public:
		bool bDefaultDataIsProductSpecific; // 0x28(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		FMatchmakingWidgetErrorVisualsDefaultData DefaultData; // 0x30(0x28)
		TArray<FMatchmakingWidgetErrorVisuals> ErrorVisualsData; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MatchmakingWidgetErrorVisualsContainer");
			return ret;
		}
	};


	// Class FortniteUI.MatchmakingWidgetErrorVisualsForFortnite
	// Inherited from UMatchmakingWidgetErrorVisualsContainer -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class UMatchmakingWidgetErrorVisualsForFortnite : public UMatchmakingWidgetErrorVisualsContainer	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MatchmakingWidgetErrorVisualsForFortnite");
			return ret;
		}
	};


	// Class FortniteUI.OnPlayButtonClickedWhenErrorAction
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOnPlayButtonClickedWhenErrorAction : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OnPlayButtonClickedWhenErrorAction");
			return ret;
		}
	};


	// Class FortniteUI.OpenParentalControlScreenAction
	// Inherited from UOnPlayButtonClickedWhenErrorAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOpenParentalControlScreenAction : public UOnPlayButtonClickedWhenErrorAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OpenParentalControlScreenAction");
			return ret;
		}
	};


	// Class FortniteUI.OpenDetailsScreenAction
	// Inherited from UOnPlayButtonClickedWhenErrorAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOpenDetailsScreenAction : public UOnPlayButtonClickedWhenErrorAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OpenDetailsScreenAction");
			return ret;
		}
	};


	// Class FortniteUI.OpenCampaignScreenAction
	// Inherited from UOnPlayButtonClickedWhenErrorAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOpenCampaignScreenAction : public UOnPlayButtonClickedWhenErrorAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.OpenCampaignScreenAction");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingWidgetContext
	// Inherited from UFortLocalPlayerSubsystem -> ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0xC8 (0xF8 - 0x30)
	class UFortMatchmakingWidgetContext : public UFortLocalPlayerSubsystem	
	{
	public:
		TScriptInterface<Class> WidgetExtension; // 0x30(0x10)
		unsigned char UnknownData00_6[0x18]; // 0x40(0x18) UNKNOWN PROPERTY
		FMatchmakingWidgetErrorVisualsDefaultData ErrorVisualsDefaultData; // 0x58(0x28)
		FMatchmakingWidgetErrorVisualsDefaultData ProductSpecificErrorVisualsDefaultData; // 0x80(0x28)
		TMap<FName, FMatchmakingWidgetErrorVisuals> ErrorVisualsByName; // 0xA8(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingWidgetContext");
			return ret;
		}
	};


	// Class FortniteUI.FortMatchmakingWidgetExtensionInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortMatchmakingWidgetExtensionInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMatchmakingWidgetExtensionInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortMediaVideoWidgetConfig
	// Inherited from UEpicMediaVideoWidgetConfig -> UObject
	// Size: 0x8 (0x58 - 0x50)
	class UFortMediaVideoWidgetConfig : public UEpicMediaVideoWidgetConfig	
	{
	public:
		bool bUseSkipBoundaries; // 0x50(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x51(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMediaVideoWidgetConfig");
			return ret;
		}
	};


	// Class FortniteUI.FortMinigameInfoViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x28 (0x90 - 0x68)
	class UFortMinigameInfoViewModel : public UMVVMViewModelBase	
	{
	public:
		unsigned char UnknownData00_1[0x28]; // 0x68(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMinigameInfoViewModel");
			return ret;
		}

		void UnbindViewModel(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5C564(relative to base address)
		void InitializeViewModel(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5C37C(relative to base address)
		void HandleMinigameStateChanged(AFortMinigame* Minigame, EFortMinigameState MinigameState); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C2BC(relative to base address)
		void HandleMinigameSettingsMachineChanged(UFortMinigameVolumeComponent* MinigameVolumeComponent, AFortMinigameSettingsBuilding* MinigameSettings); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C1FC(relative to base address)
		UFortMinigameVolumeComponent GetMinigameVolumeComponent(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5C058(relative to base address)
		EFortMinigameState GetMinigameState(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5C030(relative to base address)
		AFortMinigameSettingsBuilding GetMinigameSettings(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5BFF8(relative to base address)
		AFortMinigame GetMinigame(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5BFC4(relative to base address)
	};


	// Class FortniteUI.HUDWidgetBehavior
	// Inherited from UObject
	// Size: 0x90 (0xB8 - 0x28)
	class UHUDWidgetBehavior : public UObject	
	{
	public:
		FText HUDLayoutToolName; // 0x28(0x10)
		TArray<UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x38(0x10)
		TMap<FGameplayTag, FString> CustomPropertyDefaultOverrides; // 0x48(0x50)
		TArray<UFortMobileHUDWidgetBehaviorExtension*> BehaviorExtensions; // 0x98(0x10)
		TArray<FMobileEnhancedInputData> InputActionsData; // 0xA8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDWidgetBehavior");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileActionButtonBehavior
	// Inherited from UHUDWidgetBehavior -> UObject
	// Size: 0x78 (0x130 - 0xB8)
	class UFortMobileActionButtonBehavior : public UHUDWidgetBehavior	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0xB8(0x8) UNKNOWN PROPERTY
		TArray<FName> ActionNames; // 0xC0(0x10)
		UPaperSprite* Sprite; // 0xD0(0x8)
		TWeakObjectPtr<UPaperSprite*> DeferredBestSprite; // 0xD8(0x8)
		FGameplayTag HUDLayoutToolSaveTag_Legacy; // 0xE0(0x4)
		unsigned char UnknownData01_6[0x14]; // 0xE4(0x14) UNKNOWN PROPERTY
		TArray<UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents; // 0xF8(0x10)
		TArray<UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides; // 0x108(0x10)
		int32_t ForcedZOrder; // 0x118(0x4)
		unsigned char UnknownData02_6[0xC]; // 0x11C(0xC) UNKNOWN PROPERTY
		bool bIsToggleButtonDefaultValue; // 0x128(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x129(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileActionButtonBehavior");
			return ret;
		}

		void HandleInputStackChanged(); // Flags: RequiredAPI|Native|Protected, Memory Exec: 0x7FF747A5CDF4(relative to base address)
	};


	// Class FortniteUI.FortMobileActionButtonBehavior_Reload
	// Inherited from UFortMobileActionButtonBehavior -> UHUDWidgetBehavior -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UFortMobileActionButtonBehavior_Reload : public UFortMobileActionButtonBehavior	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileActionButtonBehavior_Reload");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UFortMobileButtonBehaviorComponent : public UObject	
	{
	public:
		UFortMobileActionButtonBehavior* ButtonBehavior; // 0x28(0x8)
		TArray<UFortButtonBehaviorComponentOverride*> ButtonBehaviorComponentOverrides; // 0x30(0x10)
		unsigned char UnknownData00_7[0x8]; // 0x40(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_IconPicker
	// Inherited from UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UFortMobileButtonBehaviorComponent_IconPicker : public UFortMobileButtonBehaviorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_IconPicker");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComboComponent_IconPicker
	// Inherited from UFortMobileButtonBehaviorComponent_IconPicker -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x10 (0x58 - 0x48)
	class UFortMobileButtonBehaviorComboComponent_IconPicker : public UFortMobileButtonBehaviorComponent_IconPicker	
	{
	public:
		TArray<FQueriedResultIconAssignment> IconAssignementQueries; // 0x48(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComboComponent_IconPicker");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_Visibility
	// Inherited from UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UFortMobileButtonBehaviorComponent_Visibility : public UFortMobileButtonBehaviorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_Visibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComboComponent_Visibility
	// Inherited from UFortMobileButtonBehaviorComponent_Visibility -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x10 (0x58 - 0x48)
	class UFortMobileButtonBehaviorComboComponent_Visibility : public UFortMobileButtonBehaviorComponent_Visibility	
	{
	public:
		TArray<FQueriedResultVisibilityAssignment> VisibilityAssignementQueries; // 0x48(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComboComponent_Visibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_Color
	// Inherited from UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UFortMobileButtonBehaviorComponent_Color : public UFortMobileButtonBehaviorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_Color");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_AbilityTagColor
	// Inherited from UFortMobileButtonBehaviorComponent_Color -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x18 (0x60 - 0x48)
	class UFortMobileButtonBehaviorComponent_AbilityTagColor : public UFortMobileButtonBehaviorComponent_Color	
	{
	public:
		TArray<FTagColor> ColorOverrides; // 0x48(0x10)
		UAbilitySystemComponent* AbilitySystemComponent; // 0x58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_AbilityTagColor");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_InteractionVisibility
	// Inherited from UFortMobileButtonBehaviorComponent_Visibility -> UFortMobileButtonBehaviorComponent -> UObject
	// Size: 0x8 (0x50 - 0x48)
	class UFortMobileButtonBehaviorComponent_InteractionVisibility : public UFortMobileButtonBehaviorComponent_Visibility	
	{
	public:
		FInteractionVisibility InteractionVisibility; // 0x48(0x3)
		unsigned char UnknownData00_7[0x5]; // 0x4B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_InteractionVisibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileButtonBehaviorComponent_TexturePicker
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortMobileButtonBehaviorComponent_TexturePicker : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileButtonBehaviorComponent_TexturePicker");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileEasyLootGrid
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x3A0 - 0x348)
	class UFortMobileEasyLootGrid : public UFortMobileHUDElement	
	{
	public:
		UButton* Button_AutoPickUp; // 0x348(0x8)
		UButton* Button_CollapsedList; // 0x350(0x8)
		UVerticalBox* LootGridListBox; // 0x358(0x8)
		UImage* Panel_Background; // 0x360(0x8)
		UCommonListView* ListView_Items; // 0x368(0x8)
		UOverlay* Overlay_FullBackpack; // 0x370(0x8)
		TWeakObjectPtr<UFortControllerComponent_Interaction*> InteractionComponent; // 0x378(0x8)
		unsigned char UnknownData00_6[0x8]; // 0x380(0x8) UNKNOWN PROPERTY
		TArray<UFortMobileEasyLootGridItemEntry*> LootGridListItems; // 0x388(0x10)
		unsigned char UnknownData01_7[0x8]; // 0x398(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileEasyLootGrid");
			return ret;
		}

		void UpdateListPostAnimation(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5C578(relative to base address)
		void OnLootFeedBack(bool bEnable); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCollapsedListPressed(bool bShouldCollapseList); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBackpackFullChanged(bool bFull); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAutoPickupPressed(bool bEnable); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsEasyLootGridEnabledForActor(AFortPlayerController* FortPC, AActor* PickupItem); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC5C410(relative to base address)
		bool IsEasyLootGridEnabled(AFortPlayerController* FortPC); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC5C390(relative to base address)
		void HandleCollapsedListPressed(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C0A0(relative to base address)
		void HandleAutoPickUpPressed(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C08C(relative to base address)
	};


	// Class FortniteUI.FortMobileEasyLootGridItemEntry
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UFortMobileEasyLootGridItemEntry : public UObject	
	{
	public:
		TWeakObjectPtr<AActor*> LootGridItem; // 0x28(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileEasyLootGridItemEntry");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileEasyLootGridListEntry
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x2F8 - 0x2B0)
	class UFortMobileEasyLootGridListEntry : public UUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x2B0(0x8) UNKNOWN PROPERTY
		UCommonButtonBase* Button_PickUp; // 0x2B8(0x8)
		UCommonButtonBase* Button_Consume; // 0x2C0(0x8)
		USizeBox* Box_SecondaryAbility; // 0x2C8(0x8)
		UTextBlock* Text_WeaponName; // 0x2D0(0x8)
		UTextBlock* Text_WeaponRarity; // 0x2D8(0x8)
		UAthenaItemIcon* ItemIcon; // 0x2E0(0x8)
		TWeakObjectPtr<UFortMobileEasyLootGridItemEntry*> LootGridItemEntry; // 0x2E8(0x8)
		bool bAnimItemAdded; // 0x2F0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x2F1(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileEasyLootGridListEntry");
			return ret;
		}

		void SecondaryButtonClicked(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C51C(relative to base address)
		void PrimaryButtonClicked(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C508(relative to base address)
		void OnItemRemoved(UFortMobileEasyLootGrid* List); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnItemAdded(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent_Active_Visibility
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UFortMobileHudWidgetContentComponent_Active_Visibility : public UObject	
	{
	public:
		UFortMobileHudWidgetContentComponent_Active* WidgetComponent; // 0x28(0x8)
		TArray<FTagVisibility> TagVisibilities; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent_Active_Visibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent_Active_PlayerTagVisibility
	// Inherited from UFortMobileHudWidgetContentComponent_Active_Visibility -> UObject
	// Size: 0x8 (0x48 - 0x40)
	class UFortMobileHudWidgetContentComponent_Active_PlayerTagVisibility : public UFortMobileHudWidgetContentComponent_Active_Visibility	
	{
	public:
		UAbilitySystemComponent* AbilitySystemComponent; // 0x40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent_Active_PlayerTagVisibility");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UFortMobileHudWidgetContentComponent : public UObject	
	{
	public:
		UHUDWidgetBehavior* WidgetBehavior; // 0x28(0x8)
		unsigned char UnknownData00_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHudWidgetContentComponent_InteractionRadialCooldown
	// Inherited from UFortMobileHudWidgetContentComponent -> UObject
	// Size: 0x28 (0x68 - 0x40)
	class UFortMobileHudWidgetContentComponent_InteractionRadialCooldown : public UFortMobileHudWidgetContentComponent	
	{
	public:
		TWeakObjectPtr<UClass*> RadialCooldownSoftClass; // 0x40(0x20)
		UInteractionRadialBacchusButton* CurrentRadialCooldownWidget; // 0x60(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHudWidgetContentComponent_InteractionRadialCooldown");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel
	// Inherited from UObject
	// Size: 0x30 (0x58 - 0x28)
	class UFortMobileHUDWidgetCustomPropertyModel : public UObject	
	{
	public:
		bool bIsVisibleToTheUser; // 0x28(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		FString PropertyDevName; // 0x30(0x10)
		FText PropertyDisplayName; // 0x40(0x10)
		FGameplayTag PropertyTag; // 0x50(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x54(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Bool
	// Inherited from UFortMobileHUDWidgetCustomPropertyModel -> UObject
	// Size: 0x8 (0x60 - 0x58)
	class UFortMobileHUDWidgetCustomPropertyModel_Bool : public UFortMobileHUDWidgetCustomPropertyModel	
	{
	public:
		bool DefaultValue; // 0x58(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x59(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel_Bool");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetCustomPropertyModel_AutorunPreference
	// Inherited from UFortMobileHUDWidgetCustomPropertyModel_Bool -> UFortMobileHUDWidgetCustomPropertyModel -> UObject
	// Size: 0x0 (0x60 - 0x60)
	class UFortMobileHUDWidgetCustomPropertyModel_AutorunPreference : public UFortMobileHUDWidgetCustomPropertyModel_Bool	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetCustomPropertyModel_AutorunPreference");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileStickBehavior
	// Inherited from UHUDWidgetBehavior -> UObject
	// Size: 0x40 (0xF8 - 0xB8)
	class UFortMobileStickBehavior : public UHUDWidgetBehavior	
	{
	public:
		TArray<FMobileEnhancedInputData> XInputActionsData; // 0xB8(0x10)
		TArray<FMobileEnhancedInputData> YInputActionsData; // 0xC8(0x10)
		TArray<FMobileEnhancedInputData> SignedSizeInputActionsData; // 0xD8(0x10)
		TArray<FMobileEnhancedInputData> RotationInputActionsData; // 0xE8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileStickBehavior");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileHUDWidgetBehaviorExtension
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UFortMobileHUDWidgetBehaviorExtension : public UObject	
	{
	public:
		TArray<UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x28(0x10)
		UHUDWidgetBehavior* OwnerWidgetBehavior; // 0x38(0x8)
		TArray<FMobileEnhancedInputData> InputActionsData; // 0x40(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileHUDWidgetBehaviorExtension");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileStickBehaviorExtension
	// Inherited from UFortMobileHUDWidgetBehaviorExtension -> UObject
	// Size: 0x40 (0x90 - 0x50)
	class UFortMobileStickBehaviorExtension : public UFortMobileHUDWidgetBehaviorExtension	
	{
	public:
		TArray<FMobileEnhancedInputData> XInputActionsData; // 0x50(0x10)
		TArray<FMobileEnhancedInputData> YInputActionsData; // 0x60(0x10)
		TArray<FMobileEnhancedInputData> SignedSizeInputActionsData; // 0x70(0x10)
		TArray<FMobileEnhancedInputData> RotationInputActionsData; // 0x80(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileStickBehaviorExtension");
			return ret;
		}
	};


	// Class FortniteUI.FortMobileTextIconDataMapping
	// Inherited from UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x50 (0x80 - 0x30)
	class UFortMobileTextIconDataMapping : public UPrimaryDataAsset	
	{
	public:
		TMap<FString, UPaperSprite*> Mapping; // 0x30(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMobileTextIconDataMapping");
			return ret;
		}
	};


	// Class FortniteUI.FortModalContainerData
	// Inherited from UDataAsset -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UFortModalContainerData : public UDataAsset	
	{
	public:
		TArray<FFortModalContainerSizeEntry> Entries; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortModalContainerData");
			return ret;
		}
	};


	// Class FortniteUI.FortMoveStickHUDElementProxy
	// Inherited from UFortMobileHUDElementProxy -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x3F0 - 0x3C0)
	class UFortMoveStickHUDElementProxy : public UFortMobileHUDElementProxy	
	{
	public:
		UOverlay* Overlay_Highlights; // 0x3C0(0x8)
		USizeBox* SizeBox_AutorunLockZoneHidden; // 0x3C8(0x8)
		USizeBox* SizeBox_AutorunLockZoneSize; // 0x3D0(0x8)
		USizeBox* SizeBox_AutorunDirectionArrowSpaceSize; // 0x3D8(0x8)
		FGameplayTag AutorunLockZoneSizePropertyTag; // 0x3E0(0x4)
		FGameplayTag AutoRunPaddingPropertyTag; // 0x3E4(0x4)
		float DefaultAutorunLockZoneSize; // 0x3E8(0x4)
		float DefaultAutorunLockZoneTopPadding; // 0x3EC(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMoveStickHUDElementProxy");
			return ret;
		}
	};


	// Class FortniteUI.FortMPItemShopRow
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2D8 - 0x2B0)
	class UFortMPItemShopRow : public UUserWidget	
	{
	public:
		FMulticastInlineDelegate OnOfferTileFocusedEvent; // 0x2B0(0x10)
		FString FocusedOfferId; // 0x2C0(0x10)
		UUIKitGridPanel* GridPanel_Tiles; // 0x2D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMPItemShopRow");
			return ret;
		}

		bool ShouldLoadPresentationsOnScrollComplete(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5C530(relative to base address)
		void OnOfferTileFocused__DelegateSignature(FString OfferId); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UCommonButtonBase CreateEntryTile(UFortItemShopOfferVM* OfferVM, UClass* TileEntryWidgetClass); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5BEE8(relative to base address)
	};


	// Class FortniteUI.FortMPLobbyOnboardingModal
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3F8 - 0x3F0)
	class UFortMPLobbyOnboardingModal : public UCommonActivatableWidget	
	{
	public:
		UCommonButtonBase* Button_GetStarted; // 0x3F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMPLobbyOnboardingModal");
			return ret;
		}

		void ExitModal(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF749B1B2C4(relative to base address)
	};


	// Class FortniteUI.FortMtxStorePanelContainerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortMtxStorePanelContainerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMtxStorePanelContainerInterface");
			return ret;
		}
	};


	// Class FortniteUI.UIKitSelectableButtonViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UUIKitSelectableButtonViewModel : public UMVVMViewModelBase	
	{
	public:
		FText Label; // 0x68(0x10)
		UTexture2D* Icon; // 0x78(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitSelectableButtonViewModel");
			return ret;
		}
	};


	// Class FortniteUI.UIKitTabGroupButtonViewModel
	// Inherited from UUIKitSelectableButtonViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x90 - 0x80)
	class UUIKitTabGroupButtonViewModel : public UUIKitSelectableButtonViewModel	
	{
	public:
		bool bEnableTabID; // 0x80(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x81(0x3) UNKNOWN PROPERTY
		FName TabID; // 0x84(0x4)
		bool bEnableSubGroupID; // 0x88(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		FName SubGroupID; // 0x8C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitTabGroupButtonViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortTabViewModel
	// Inherited from UUIKitTabGroupButtonViewModel -> UUIKitSelectableButtonViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x1E0 (0x270 - 0x90)
	class UFortTabViewModel : public UUIKitTabGroupButtonViewModel	
	{
	public:
		bool bEnabled; // 0x90(0x1)
		bool bCollapsed; // 0x91(0x1)
		unsigned char UnknownData00_6[0xE]; // 0x92(0xE) UNKNOWN PROPERTY
		FFortTopBarTabButtonInfo TabInfo; // 0xA0(0x1D0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTabViewModel");
			return ret;
		}

		void SetBangType(EFortBangType Type); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61BD8(relative to base address)
		FText GetTabDisplayName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74F6E04A4(relative to base address)
		UClass GetOverrideTabWidget(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7494839FC(relative to base address)
		EFortUIFeature GetLinkedUIFeature(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749297D20(relative to base address)
		EFortUIFeature GetForwardOnRemoval(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC6180C(relative to base address)
		EFortTopBarTabButtonGroup GetButtonGroup(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74959FD90(relative to base address)
		EFortBangType GetBangType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749652AB8(relative to base address)
	};


	// Class FortniteUI.FortMTXTabViewModel
	// Inherited from UFortTabViewModel -> UUIKitTabGroupButtonViewModel -> UUIKitSelectableButtonViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x270 - 0x270)
	class UFortMTXTabViewModel : public UFortTabViewModel	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortMTXTabViewModel");
			return ret;
		}

		void HandleLocalAccountInfoChanged(FFortPrivateAccountInfo NewInfo); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC5C0B4(relative to base address)
	};


	// Class FortniteUI.FortNodeCanvasEntityInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortNodeCanvasEntityInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortNodeCanvasEntityInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortNullHUD
	// Inherited from UFortUIStateWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x448 - 0x408)
	class UFortNullHUD : public UFortUIStateWidgetBase	
	{
	public:
		unsigned char UnknownData00_3[0x30]; // 0x408(0x30) UNKNOWN PROPERTY
		UCommonUserWidget* AthenaHUDMenu; // 0x438(0x8)
		UCommonUserWidget* ActionBar_BottomBar; // 0x440(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortNullHUD");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialUserViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UFortSocialUserViewModel : public UMVVMViewModelBase	
	{
	public:
		TWeakObjectPtr<UFortSocialUser*> SocialUser; // 0x68(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x70(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialUserViewModel");
			return ret;
		}

		void SetSocialUser(UFortSocialUser* InSocialUser); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable, Memory Exec: 0x7FF7480730C8(relative to base address)
		void SetShouldForceUpdateUser(bool bNewForceUpdateUser); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC60168(relative to base address)
		UFortSocialUser GetSocialUser(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5F920(relative to base address)
	};


	// Class FortniteUI.FortOnlineStatusViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x80 - 0x78)
	class UFortOnlineStatusViewModel : public UFortSocialUserViewModel	
	{
	public:
		EPresenceIndicatorState OnlineStatus; // 0x78(0x1)
		bool bHideStatus; // 0x79(0x1)
		bool bIsLocalPlayerSharingActivity; // 0x7A(0x1)
		unsigned char UnknownData00_7[0x5]; // 0x7B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortOnlineStatusViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortOptionsCategoryHeader
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UFortOptionsCategoryHeader : public UObject	
	{
	public:
		FText DisplayText; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortOptionsCategoryHeader");
			return ret;
		}
	};


	// Class FortniteUI.FortOptionsMenuInputData
	// Inherited from UDataAsset -> UObject
	// Size: 0xB0 (0xE0 - 0x30)
	class UFortOptionsMenuInputData : public UDataAsset	
	{
	public:
		FName ActionName; // 0x30(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FText DisplayText; // 0x38(0x10)
		FText PrimaryText; // 0x48(0x10)
		FText SecondaryText; // 0x58(0x10)
		int32_t ElementNumber; // 0x68(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		UCommonTextBlock* TabText; // 0x70(0x8)
		FFortActionKeyMapping ActionKeyMapping; // 0x78(0x68)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortOptionsMenuInputData");
			return ret;
		}

		float GetInputScale(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C8DFC24(relative to base address)
		EFortInputActionGroup GetInputActionGroup(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5E860(relative to base address)
	};


	// Class FortniteUI.FortPassLevelViewModel
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x30 (0xA0 - 0x70)
	class UFortPassLevelViewModel : public UFortPerUserViewModel	
	{
	public:
		FString CurrentChapter; // 0x70(0x10)
		FString CurrentSeason; // 0x80(0x10)
		int32_t NumBattleStars; // 0x90(0x4)
		int32_t CurrentLevel; // 0x94(0x4)
		int32_t CurrentXP; // 0x98(0x4)
		int32_t XpToNextLevel; // 0x9C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPassLevelViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortPersistentTabObject
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortPersistentTabObject : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPersistentTabObject");
			return ret;
		}

		void OnTabInitialized(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabExited(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabEntered(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabDestroyed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortPinScreen
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x538 - 0x528)
	class UFortPinScreen : public UCommonActivatablePanelLegacy	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x528(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPinScreen");
			return ret;
		}
	};


	// Class FortniteUI.FortPlayerAvatar
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B0 - 0x2B0)
	class UFortPlayerAvatar : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerAvatar");
			return ret;
		}

		void ResetPlayerAvatar(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RepresentLocalPlayer(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF749F9E36C(relative to base address)
		void OnSetSocialUser(UFortSocialUser* InUser); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortPlayerAvatarViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xB0 - 0x78)
	class UFortPlayerAvatarViewModel : public UFortSocialUserViewModel	
	{
	public:
		bool bUseLargeImage; // 0x78(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		UTexture2D* AvatarTexture; // 0x80(0x8)
		bool bLoading; // 0x88(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		FColor BackgroundColor; // 0x8C(0x4)
		FColor HighlightColor; // 0x90(0x4)
		unsigned char UnknownData02_7[0x1C]; // 0x94(0x1C) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerAvatarViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortPlayerBannerViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x58 (0xD0 - 0x78)
	class UFortPlayerBannerViewModel : public UFortSocialUserViewModel	
	{
	public:
		FName IconId; // 0x78(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		UTexture2D* IconTexture; // 0x80(0x8)
		FName ColorId; // 0x88(0x4)
		FLinearColor PrimaryColor; // 0x8C(0x10)
		FLinearColor SecondaryColor; // 0x9C(0x10)
		int32_t CurrentLevel; // 0xAC(0x4)
		bool bUseLargeTexture; // 0xB0(0x1)
		unsigned char UnknownData01_7[0x1F]; // 0xB1(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerBannerViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortPlayerSurveyResponseChoiceBase
	// Inherited from UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x13A0 - 0x1390)
	class UFortPlayerSurveyResponseChoiceBase : public UCommonButtonBase	
	{
	public:
		UCommonTextBlock* Text_Response; // 0x1390(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x1398(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerSurveyResponseChoiceBase");
			return ret;
		}

		void SetChoiceType(TEnumAsByte<EFortPlayerSurveyResponseChoiceType> Type); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSurveyResetChoice(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortPlayerSurveyResponseWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x420 - 0x3F0)
	class UFortPlayerSurveyResponseWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_1[0x30]; // 0x3F0(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPlayerSurveyResponseWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortPluginWidgetInjectionSlot
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x2D8 - 0x2B0)
	class UFortPluginWidgetInjectionSlot : public UUserWidget	
	{
	public:
		FString PluginId; // 0x2B0(0x10)
		FString PluginWidgetId; // 0x2C0(0x10)
		UNamedSlot* InjectionSlot; // 0x2D0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPluginWidgetInjectionSlot");
			return ret;
		}

		TArray GetValidPluginIds(); // Flags: Final|Native|Private|Const, Memory Exec: 0x7FF74FC5E904(relative to base address)
		TArray GetValidInjectableWidgetIds(); // Flags: Final|Native|Private|Const, Memory Exec: 0x7FF74FC5E8C0(relative to base address)
	};


	// Class FortniteUI.FortPolymorphicTileView
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3F8 - 0x3F0)
	class UFortPolymorphicTileView : public UCommonActivatableWidget	
	{
	public:
		UFortCommonTileView* TileView; // 0x3F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPolymorphicTileView");
			return ret;
		}

		void SetListItems(TArray<UObject*>& InListItems); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC5EA08(relative to base address)
		UClass GetDesiredEntryClassForItem(UObject* Item); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortPolymorphicListView
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x3F8 - 0x3F0)
	class UFortPolymorphicListView : public UCommonActivatableWidget	
	{
	public:
		UCommonListView* ListView; // 0x3F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPolymorphicListView");
			return ret;
		}

		void SetListItems(TArray<UObject*>& InListItems); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC5EA08(relative to base address)
		UClass GetDesiredEntryClassForItem(UObject* Item); // Flags: Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortPopupModal
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UFortPopupModal : public UUserWidget	
	{
	public:
		UCommonButtonBase* IconTextButton_Close; // 0x2B0(0x8)
		UCommonButtonBase* Button_CloseTouch; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortPopupModal");
			return ret;
		}
	};


	// Class FortniteUI.FortRankedViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xA0 - 0x68)
	class UFortRankedViewModel : public UMVVMViewModelBase	
	{
	public:
		UFortSocialUser* SocialUser; // 0x68(0x8)
		bool bIsIslandRanked; // 0x70(0x1)
		bool bIsPlayerRanked; // 0x71(0x1)
		bool bHasRankProtection; // 0x72(0x1)
		bool bHasSeenRankProtectionFTUE; // 0x73(0x1)
		unsigned char UnknownData00_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		FString RankType; // 0x78(0x10)
		int32_t CurrentRank; // 0x88(0x4)
		int32_t HighestRank; // 0x8C(0x4)
		int32_t CurrentPlayerPosition; // 0x90(0x4)
		float Progress; // 0x94(0x4)
		unsigned char UnknownData01_7[0x8]; // 0x98(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRankedViewModel");
			return ret;
		}

		void SetHasSeenRankProtectionFTUE(bool bInHasSeenRankProtectionFTUE); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5E988(relative to base address)
		void InitializeRankedViewModal(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74812CC24(relative to base address)
	};


	// Class FortniteUI.FortRankedWidgetExtensionInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortRankedWidgetExtensionInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRankedWidgetExtensionInterface");
			return ret;
		}

		TWeakObjectPtr GetRankInfoModalOverride(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5E874(relative to base address)
	};


	// Class FortniteUI.FortRedirectorVariantWrapper
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x328 - 0x2D8)
	class UFortRedirectorVariantWrapper : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		UFortVariantEditorWidgetBase* VariantPicker; // 0x2E0(0x8)
		UPanelWidget* Container; // 0x2E8(0x8)
		FMulticastInlineDelegate OnRotationRequestedEvent; // 0x2F0(0x10)
		UFortVariantItemVM* VariantItemVM; // 0x300(0x8)
		TArray<UFortVariantChannelVM*> WaitingChannelVMs; // 0x308(0x10)
		unsigned char UnknownData01_7[0x10]; // 0x318(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRedirectorVariantWrapper");
			return ret;
		}

		void OnRotationRequestedEvent__DelegateSignature(FRotator& RotationOffset, bool bSnap); // Flags: MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleVariantEngaged(FMcpVariantChannelInfo& InVariantChannelInfo, UFortVariantItemVM* ItemVM); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleRotationOffsetRequested(FRotator& RotationOffset, bool bSnap); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddVariantChannelVM(UFortVariantChannelVM* ChannelVM); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5E6EC(relative to base address)
	};


	// Class FortniteUI.FortRichTextTextureDecorator
	// Inherited from URichTextBlockDecorator -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UFortRichTextTextureDecorator : public URichTextBlockDecorator	
	{
	public:
		UObject* LoadedResourceObject; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRichTextTextureDecorator");
			return ret;
		}
	};


	// Class FortniteUI.FortRichTextTextureDecoratorHelpers
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortRichTextTextureDecoratorHelpers : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRichTextTextureDecoratorHelpers");
			return ret;
		}

		FText MakeFortRichTextTexture(TWeakObjectPtr<UTexture2D*> InTexture, bool bUseDesiredSize, int32_t Width, int32_t Height); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC5FE4C(relative to base address)
		FText MakeFortRichTextMaterial(TWeakObjectPtr<UMaterialInterface*> InMaterial, bool bUseDesiredSize, int32_t Width, int32_t Height); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure, Memory Exec: 0x7FF74FC5FE4C(relative to base address)
	};


	// Class FortniteUI.FortSaveLoadoutPopup
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x588 - 0x560)
	class UFortSaveLoadoutPopup : public UFortActivatablePanel	
	{
	public:
		UFortEditableFilteredCountedTextBox* Text_EditableLoadoutName; // 0x560(0x8)
		FMulticastInlineDelegate OnActionConfirmedEvent; // 0x568(0x10)
		FMulticastInlineDelegate OnActionDeclinedEvent; // 0x578(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSaveLoadoutPopup");
			return ret;
		}

		void SanitizeText(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC60154(relative to base address)
		void OnSanitizationReady(bool bSuccess, FString Sanitizedtext); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoadoutActionSaveEvent__DelegateSignature(FString NewName); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoadoutActionDeclineEvent__DelegateSignature(); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleActionDeclined(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5FA24(relative to base address)
		void HandleActionConfirmed(FString OptionalNewName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC5F944(relative to base address)
	};


	// Class FortniteUI.FortServerBrowserActionData
	// Inherited from UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0xE0 (0x110 - 0x30)
	class UFortServerBrowserActionData : public UPrimaryDataAsset	
	{
	public:
		EFortServerBrowserAction ActionType; // 0x30(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
		FText Title; // 0x38(0x10)
		FText Description; // 0x48(0x10)
		unsigned char UnknownData01_6[0x8]; // 0x58(0x8) UNKNOWN PROPERTY
		FSlateBrush TileImage; // 0x60(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortServerBrowserActionData");
			return ret;
		}
	};


	// Class FortniteUI.FortServerBrowserActionDataPopup
	// Inherited from UFortServerBrowserActionData -> UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x20 (0x130 - 0x110)
	class UFortServerBrowserActionDataPopup : public UFortServerBrowserActionData	
	{
	public:
		TWeakObjectPtr<UClass*> PopupClass; // 0x110(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortServerBrowserActionDataPopup");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingExperiencePluginTrackerSubsystem
	// Inherited from UFortLocalPlayerSubsystem -> ULocalPlayerSubsystem -> USubsystem -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UFortSettingExperiencePluginTrackerSubsystem : public UFortLocalPlayerSubsystem	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingExperiencePluginTrackerSubsystem");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingPreviewInput
	// Inherited from UFortInputSettingBase -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x78 (0x200 - 0x188)
	class UFortSettingPreviewInput : public UFortInputSettingBase	
	{
	public:
		unsigned char UnknownData00_1[0x78]; // 0x188(0x78) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingPreviewInput");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingsListEntrySetting_Category
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2E8 - 0x2D8)
	class UFortSettingsListEntrySetting_Category : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		UCommonButtonBase* Button_Category; // 0x2E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsListEntrySetting_Category");
			return ret;
		}

		void SetCategoryName(FText& InCategoryName); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExpandCategory(bool bIsInstant); // Flags: Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CollapseCategory(bool bIsInstant); // Flags: Event|Public|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_SetIsSelected(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_ResetCategory(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortSettingsPanelBase
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x3C8 (0x7B8 - 0x3F0)
	class UFortSettingsPanelBase : public UCommonActivatableWidget	
	{
	public:
		UFortSettingRegistry* Registry; // 0x3F0(0x8)
		FFortSettingsFilterState FilterState; // 0x3F8(0x3A0)
		unsigned char UnknownData00_6[0x10]; // 0x798(0x10) UNKNOWN PROPERTY
		FMulticastInlineDelegate BP_OnExecuteNamedAction; // 0x7A8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsPanelBase");
			return ret;
		}

		void OnExecuteNamedActionBP__DelegateSignature(UFortSetting* Setting, FName Action); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.SettingsScreen
	// Inherited from UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x5D0 - 0x560)
	class USettingsScreen : public UFortActivatablePanel	
	{
	public:
		unsigned char UnknownData00_3[0x60]; // 0x560(0x60) UNKNOWN PROPERTY
		TWeakObjectPtr<UFortSettingRegistry*> SettingRegistry; // 0x5C0(0x8)
		UFortSettingsPanelBase* Settings_Panel; // 0x5C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.SettingsScreen");
			return ret;
		}

		void SaveSettings(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF7502D3760(relative to base address)
		void ResetSettings(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF7502D374C(relative to base address)
		void OnSettingsDirtyStateChanged(bool bSettingsDirty); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NavigateToSettings(TArray<FName> SettingsCollectionNames); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF7502D3658(relative to base address)
		bool HaveSettingsBeenChanged(); // Flags: Final|Native|Protected|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FFEEF50(relative to base address)
		void CloseSettings(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF7502D3214(relative to base address)
		bool AttemptToPopNavigation(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF7502D3174(relative to base address)
	};


	// Class FortniteUI.FortSettingsScreen
	// Inherited from USettingsScreen -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x170 (0x740 - 0x5D0)
	class UFortSettingsScreen : public USettingsScreen	
	{
	public:
		FVector2D IconOnlyTabIconSize; // 0x5D0(0x10)
		UClass* TabButtonClass; // 0x5E0(0x8)
		USettingsScreenTabSchemaCollection* TabSchemaCollection; // 0x5E8(0x8)
		UNamedSettingActionCollection* NamedSettingActionCollection; // 0x5F0(0x8)
		FDataTableRowHandle ApplySettingsActionRowHandle; // 0x5F8(0x10)
		unsigned char UnknownData00_6[0x8]; // 0x608(0x8) UNKNOWN PROPERTY
		FDataTableRowHandle ResetSettingsToDefaultActionRowHandle; // 0x610(0x10)
		FDataTableRowHandle BackActionRowHandle; // 0x620(0x10)
		UClass* SaveProgressModalClass; // 0x630(0x8)
		UFortProgressModal* SaveProgressModalInstance; // 0x638(0x8)
		FDataTableRowHandle TestSettingsActionRowHandle; // 0x640(0x10)
		FDataTableRowHandle ApplyAndTestSettingsActionRowHandle; // 0x650(0x10)
		unsigned char UnknownData01_6[0xC0]; // 0x660(0xC0) UNKNOWN PROPERTY
		UNamedSlot* SaveProgressLayer; // 0x720(0x8)
		UCommonButtonBase* Button_CloseTouch; // 0x728(0x8)
		unsigned char UnknownData02_7[0x10]; // 0x730(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsScreen");
			return ret;
		}

		void NavigateToSetting(FName SettingCategory, FString SettingToSelect); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC6002C(relative to base address)
		void HandleTestSettings(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF74FC5FCF0(relative to base address)
		void HandleTabSelected(FName TabID); // Flags: Final|Native|Private|BlueprintCallable, Memory Exec: 0x7FF74FC5FC70(relative to base address)
		void HandleResetSettingsToDefault(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF74FC5FBE4(relative to base address)
		void HandleBack(bool& bPassThrough); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF74FC5FB58(relative to base address)
		void HandleApplySettings(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF74FC5FACC(relative to base address)
		void HandleApplyAndTestSettings(bool& Passthrough); // Flags: Final|Native|Private|HasOutParms, Memory Exec: 0x7FF74FC5FA40(relative to base address)
	};


	// Class FortniteUI.FortSettingsScreenViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UFortSettingsScreenViewModel : public UMVVMViewModelBase	
	{
	public:
		TArray<UUIKitTabGroupButtonViewModel*> TopNavTabs; // 0x68(0x10)
		FName SelectedTopNavTabID; // 0x78(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingsScreenViewModel");
			return ret;
		}

		void Reset(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC60140(relative to base address)
	};


	// Class FortniteUI.FortSettingTimeWindows
	// Inherited from UFortSetting -> UObject
	// Size: 0x20 (0x1A0 - 0x180)
	class UFortSettingTimeWindows : public UFortSetting	
	{
	public:
		unsigned char UnknownData00_1[0x20]; // 0x180(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingTimeWindows");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscrete
	// Inherited from UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x8 (0x188 - 0x180)
	class UFortSettingValueDiscrete : public UFortSettingValue	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x180(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscrete");
			return ret;
		}

		TArray GetDiscreteOptions(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E078(relative to base address)
		int32_t GetDiscreteOptionInitialIndex(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E050(relative to base address)
		int32_t GetDiscreteOptionIndex(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E028(relative to base address)
		int32_t GetDiscreteOptionDefaultIndex(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025E000(relative to base address)
		TArray GetDisabledOptionsReasons(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025DFC0(relative to base address)
		TArray GetDisabledOptions(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75025DF80(relative to base address)
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic
	// Inherited from UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x80 (0x208 - 0x188)
	class UFortSettingValueDiscreteDynamic : public UFortSettingValueDiscrete	
	{
	public:
		unsigned char UnknownData00_1[0x80]; // 0x188(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic_Vector2D
	// Inherited from UFortSettingValueDiscreteDynamic -> UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x0 (0x208 - 0x208)
	class UFortSettingValueDiscreteDynamic_Vector2D : public UFortSettingValueDiscreteDynamic	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic_Vector2D");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic_Anchors
	// Inherited from UFortSettingValueDiscreteDynamic_Vector2D -> UFortSettingValueDiscreteDynamic -> UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x0 (0x208 - 0x208)
	class UFortSettingValueDiscreteDynamic_Anchors : public UFortSettingValueDiscreteDynamic_Vector2D	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic_Anchors");
			return ret;
		}
	};


	// Class FortniteUI.FortSettingValueDiscreteDynamic_ControllerPreset
	// Inherited from UFortSettingValueDiscrete -> UFortSettingValue -> UFortSetting -> UObject
	// Size: 0x10 (0x198 - 0x188)
	class UFortSettingValueDiscreteDynamic_ControllerPreset : public UFortSettingValueDiscrete	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x188(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSettingValueDiscreteDynamic_ControllerPreset");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialPanelContainerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortSocialPanelContainerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialPanelContainerInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialSidebarPanelInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortSocialSidebarPanelInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialSidebarPanelInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialStyle
	// Inherited from UDataAsset -> UObject
	// Size: 0x9000 (0x9030 - 0x30)
	class UFortSocialStyle : public UDataAsset	
	{
	public:
		FSocialStyle Style; // 0x30(0x8FF0)
		USocialStyleDataAsset* OverrideStyle; // 0x9020(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x9028(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialStyle");
			return ret;
		}
	};


	// Class FortniteUI.FortSocialUserInfoViewModel
	// Inherited from UFortSocialUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xB0 - 0x78)
	class UFortSocialUserInfoViewModel : public UFortSocialUserViewModel	
	{
	public:
		FText LastInteractionInfo; // 0x78(0x10)
		FText UserRichPresenceText; // 0x88(0x10)
		FText MutualFriendsText; // 0x98(0x10)
		bool bShouldEncourageEpicFriendship; // 0xA8(0x1)
		bool bIsRebootRallyEligible; // 0xA9(0x1)
		bool bIsFriend; // 0xAA(0x1)
		bool bIsSocialBanned; // 0xAB(0x1)
		bool bIsInviteSent; // 0xAC(0x1)
		bool bIsInZone; // 0xAD(0x1)
		unsigned char UnknownData00_7[0x2]; // 0xAE(0x2) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSocialUserInfoViewModel");
			return ret;
		}

		bool InZonePresenceEnabled(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74997AB38(relative to base address)
	};


	// Class FortniteUI.FortReplayViewSettingsTabBase
	// Inherited from UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x528 - 0x528)
	class UFortReplayViewSettingsTabBase : public UCommonActivatablePanelLegacy	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortReplayViewSettingsTabBase");
			return ret;
		}

		void SetWidgetValues(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetToDefault(); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74D8BB404(relative to base address)
		void ResetFocusedElement(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCameraTypeChanged(AFortPlayerControllerSpectating* FortPlayerControllerSpectating, ESpectatorCameraType CameraType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CenterOnTab(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortSpectatorCameraFXTab
	// Inherited from UFortReplayViewSettingsTabBase -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x530 - 0x528)
	class UFortSpectatorCameraFXTab : public UFortReplayViewSettingsTabBase	
	{
	public:
		UCommonUserWidget* Rotator_CameraFX; // 0x528(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSpectatorCameraFXTab");
			return ret;
		}
	};


	// Class FortniteUI.FortSqueegeeWidgetInjectionSlot
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x328 - 0x2B0)
	class UFortSqueegeeWidgetInjectionSlot : public UUserWidget	
	{
	public:
		ESqueegeeWidgetInjection DesiredInjection; // 0x2B0(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x2B1(0x7) UNKNOWN PROPERTY
		FSqueegeeStyleParams StyleParams; // 0x2B8(0x30)
		UNamedSlot* InjectionSlot; // 0x2E8(0x8)
		unsigned char UnknownData01_6[0x20]; // 0x2F0(0x20) UNKNOWN PROPERTY
		UFortSqueegeeWidget* InjectedSqueegeeWidget; // 0x310(0x8)
		unsigned char UnknownData02_7[0x10]; // 0x318(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSqueegeeWidgetInjectionSlot");
			return ret;
		}

		void ShowActivityDataFromViewModel(UFortActivityViewModel* GameActivityViewModel); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC6037C(relative to base address)
		void ShowActivityData(UFortGameActivity* GameActivity); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC602E4(relative to base address)
		void SetUnlockPlayer(AFortPlayerController* UnlockPlayer); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC601E4(relative to base address)
	};


	// Class FortniteUI.FortSqueegeeWidget
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x2F8 - 0x2D8)
	class UFortSqueegeeWidget : public UCommonUserWidget	
	{
	public:
		unsigned char UnknownData00_1[0x20]; // 0x2D8(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortSqueegeeWidget");
			return ret;
		}

		void ShowUnlockPinForActivity(AFortPlayerController* UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|Const, Memory Exec: 0x7FF74FC6049C(relative to base address)
		void ShowParentalControls(AFortPlayerController* UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|Const, Memory Exec: 0x7FF74FC60410(relative to base address)
		void SetUnlockPlayer(AFortPlayerController* UnlockPlayer); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetGameActivity(UFortGameActivity* GameActivity); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsCabinModeEnabled(AFortPlayerController* UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5FD7C(relative to base address)
		bool AreParentalControlsEnabled(AFortPlayerController* UnlockPlayerController); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5F854(relative to base address)
	};


	// Class FortniteUI.FortStandaloneFrontendScreenInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortStandaloneFrontendScreenInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortStandaloneFrontendScreenInterface");
			return ret;
		}
	};


	// Class FortniteUI.FortStartLoginContainer
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x428 - 0x3F0)
	class UFortStartLoginContainer : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x3F0(0x20) UNKNOWN PROPERTY
		UCommonActivatableWidgetSwitcher* Switcher_StartLogin; // 0x410(0x8)
		UFortPlayedBeforeSelect* Widget_PlayedBeforeSelect; // 0x418(0x8)
		UFortStartLoginWidget* Widget_StartLogin; // 0x420(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortStartLoginContainer");
			return ret;
		}
	};


	// Class FortniteUI.FortStartLoginWidget
	// Inherited from UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x410 - 0x3F0)
	class UFortStartLoginWidget : public UCommonActivatableWidget	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x3F0(0x10) UNKNOWN PROPERTY
		UCommonButtonBase* Button_Login; // 0x400(0x8)
		UBackgroundBlur* BackgroundBlur_PendingSpinner; // 0x408(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortStartLoginWidget");
			return ret;
		}
	};


	// Class FortniteUI.UIKitTabGroupViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x78 - 0x68)
	class UUIKitTabGroupViewModel : public UMVVMViewModelBase	
	{
	public:
		TArray<UUIKitTabGroupButtonViewModel*> Tabs; // 0x68(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.UIKitTabGroupViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortTabGroupViewModel
	// Inherited from UUIKitTabGroupViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x78 - 0x78)
	class UFortTabGroupViewModel : public UUIKitTabGroupViewModel	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTabGroupViewModel");
			return ret;
		}
	};


	// Class FortniteUI.FortTeamMemberPedestalNameplateViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x50 (0xB8 - 0x68)
	class UFortTeamMemberPedestalNameplateViewModel : public UMVVMViewModelBase	
	{
	public:
		TWeakObjectPtr<UFortSocialUser*> SocialUser; // 0x68(0x8)
		UFortSocialUserNameViewModel* NameInfo; // 0x70(0x8)
		UFortSocialUserPartyViewModel* PartyInfo; // 0x78(0x8)
		UFortSocialUserInfoViewModel* UserInfo; // 0x80(0x8)
		UFortOnlineStatusViewModel* OnlineStatusInfo; // 0x88(0x8)
		UFortRankedViewModel* RankedInfo; // 0x90(0x8)
		UFortPlayerBannerViewModel* BannerInfo; // 0x98(0x8)
		bool bIsLocalPlayer; // 0xA0(0x1)
		bool bIsTalking; // 0xA1(0x1)
		bool bIsMutedByLocalPlayer; // 0xA2(0x1)
		unsigned char UnknownData00_6[0x1]; // 0xA3(0x1) UNKNOWN PROPERTY
		float VolumeLevel; // 0xA4(0x4)
		EPedestalNameplateMatchmakingStatus MatchmakingStatus; // 0xA8(0x1)
		bool bIsInLobby; // 0xA9(0x1)
		EPedestalNameplateAction CurrentAvailableAction; // 0xAA(0x1)
		bool bIsActionInProgress; // 0xAB(0x1)
		int32_t DownloadProgress; // 0xAC(0x4)
		UClass* OpenProfileActionMenuClass; // 0xB0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTeamMemberPedestalNameplateViewModel");
			return ret;
		}

		void Whisper(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61F44(relative to base address)
		void ViewProfile(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61F30(relative to base address)
		void ToggleMute(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61EB8(relative to base address)
		void SetSocialUserFromPlayerUniqueNetId(FUniqueNetIdRepl& UniqueID); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC61DE8(relative to base address)
		void SetSocialUser(UFortSocialUser* InSocialUser); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61CE8(relative to base address)
		void PromoteToLeader(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61AB8(relative to base address)
		void PerformAction(EPedestalNameplateAction Action); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC619B8(relative to base address)
		void OpenSidebar(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC619A4(relative to base address)
		void KickFromParty(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61910(relative to base address)
		void HandleOnLobbyStarted(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC618D4(relative to base address)
		void HandleOnLobbyDisconnected(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC618AC(relative to base address)
		UFortSocialUser GetSocialUser(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5F920(relative to base address)
	};


	// Class FortniteUI.FortTeamMemberPedestalSocialNudgeViewModel
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x28 (0x90 - 0x68)
	class UFortTeamMemberPedestalSocialNudgeViewModel : public UMVVMViewModelBase	
	{
	public:
		TWeakObjectPtr<UFortSocialUser*> SocialUser; // 0x68(0x8)
		UFortSocialUserNameViewModel* NameInfo; // 0x70(0x8)
		UFortSocialUserInfoViewModel* UserInfo; // 0x78(0x8)
		UFortPlayerAvatarViewModel* AvatarInfo; // 0x80(0x8)
		EPedestalSocialNudgeAction CurrentAvailableAction; // 0x88(0x1)
		bool bIsInviteInProgress; // 0x89(0x1)
		bool bIsJoining; // 0x8A(0x1)
		bool bIsInLobby; // 0x8B(0x1)
		bool bIslandAllowsJoinInProgress; // 0x8C(0x1)
		unsigned char UnknownData00_7[0x3]; // 0x8D(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTeamMemberPedestalSocialNudgeViewModel");
			return ret;
		}

		void SetSocialUserFromPlayerUniqueNetId(FUniqueNetIdRepl& UniqueID); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF748CEF57C(relative to base address)
		void SetSocialUser(UFortSocialUser* InSocialUser); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61D68(relative to base address)
		void PerformAction(EPedestalSocialNudgeAction Action); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61A38(relative to base address)
		void OpenSidebar(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC619A4(relative to base address)
		void HandleOnLobbyStarted(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC618E8(relative to base address)
		void HandleOnLobbyDisconnected(); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC618C0(relative to base address)
		UFortSocialUser GetSocialUser(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC5F920(relative to base address)
	};


	// Class FortniteUI.FortTextChatSendingMessageVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UFortTextChatSendingMessageVM : public UMVVMViewModelBase	
	{
	public:
		FString MessageToSend; // 0x68(0x10)
		FName ChannelId; // 0x78(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatSendingMessageVM");
			return ret;
		}

		void Reset(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61B10(relative to base address)
		bool NeedsChannelPicker(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC61968(relative to base address)
	};


	// Class FortniteUI.FortTextChatChannelVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x20 (0x88 - 0x68)
	class UFortTextChatChannelVM : public UMVVMViewModelBase	
	{
	public:
		FString ChannelName; // 0x68(0x10)
		EFortTextChatChannelType ChannelType; // 0x78(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x79(0x3) UNKNOWN PROPERTY
		int32_t UnreadMessagesCount; // 0x7C(0x4)
		bool bIsMuted; // 0x80(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x81(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortTextChatMessageVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x58 (0xC0 - 0x68)
	class UFortTextChatMessageVM : public UMVVMViewModelBase	
	{
	public:
		FName MessageId; // 0x68(0x4)
		EFortTextChatMessageType MessageType; // 0x6C(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x6D(0x3) UNKNOWN PROPERTY
		FText Text; // 0x70(0x10)
		FDateTime DateReceived; // 0x80(0x8)
		UFortPlayerAvatarViewModel* PlayerAvatar; // 0x88(0x8)
		FString DisplayName; // 0x90(0x10)
		bool bPreviousMessageWasFromSameSender; // 0xA0(0x1)
		bool bPreviousMessageIsSameGameOrParty; // 0xA1(0x1)
		unsigned char UnknownData01_7[0x1E]; // 0xA2(0x1E) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatMessageVM");
			return ret;
		}

		void ViewProfile(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74921B8F8(relative to base address)
		void Report(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74921B8F8(relative to base address)
	};


	// Class FortniteUI.FortTextChatPlayerVM
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x38 (0xA8 - 0x70)
	class UFortTextChatPlayerVM : public UFortPerUserViewModel	
	{
	public:
		TArray<UFortTextChatChannelVM*> Channels; // 0x70(0x10)
		TArray<UFortTextChatMessageVM*> Messages; // 0x80(0x10)
		FName CurrentChannelId; // 0x90(0x4)
		EFortTextChatChannelType CurrentChannelType; // 0x94(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x95(0x3) UNKNOWN PROPERTY
		UFortTextChatSendingMessageVM* MessageToSend; // 0x98(0x8)
		bool bNewerMessagesAppearedForTheCurrentChannel; // 0xA0(0x1)
		bool bIsFirstNewMessageForTheCurrentChannel; // 0xA1(0x1)
		unsigned char UnknownData01_7[0x6]; // 0xA2(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTextChatPlayerVM");
			return ret;
		}

		void SetNewerMessagesAppearedForTheCurrentChannel(bool bInNewerMessagesAppearedForTheCurrentChannel); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61C68(relative to base address)
		void Send(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC61B5C(relative to base address)
		void InitializeTextChatVM(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC618FC(relative to base address)
		bool GetNewerMessagesAppearedForTheCurrentChannel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74E228C6C(relative to base address)
		UFortTextChatMessageVM GetMessageVM(FString MessageId); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC61700(relative to base address)
		UFortTextChatSendingMessageVM GetMessageToSend(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749B40548(relative to base address)
		TArray GetMessages(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC6183C(relative to base address)
		bool GetIsFirstNewMessageForTheCurrentChannel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC61824(relative to base address)
		EFortTextChatChannelType GetCurrentChannelType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC617F4(relative to base address)
		FName GetCurrentChannelId(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74F92EA60(relative to base address)
		UFortTextChatChannelVM GetChannelVM(FString ChannelId); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC61700(relative to base address)
		TArray GetChannels(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC61788(relative to base address)
		void ChangeCurrentChannel(FName& InChannelId); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC6162C(relative to base address)
	};


	// Class FortniteUI.FortTimespanDataSource
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortTimespanDataSource : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTimespanDataSource");
			return ret;
		}

		void RemoveOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74FC58CE4(relative to base address)
		FTimespan GetValue(); // Flags: Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF74FC58CB8(relative to base address)
		void AddOnChangeDelegate(FDelegateProperty& InDelegate); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74E2608AC(relative to base address)
	};


	// Class FortniteUI.FortTouchStick
	// Inherited from UBacchusHUDElement -> UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x378 - 0x368)
	class UFortTouchStick : public UBacchusHUDElement	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x368(0x8) UNKNOWN PROPERTY
		UHUDWidgetBehavior* WidgetBehavior; // 0x370(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortTouchStick");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction
	// Inherited from UGameFeatureAction -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFortUIGameFeatureAction : public UGameFeatureAction	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction_ExtendMatchmakingWidget
	// Inherited from UFortUIGameFeatureAction -> UGameFeatureAction -> UObject
	// Size: 0x98 (0xC0 - 0x28)
	class UFortUIGameFeatureAction_ExtendMatchmakingWidget : public UFortUIGameFeatureAction	
	{
	public:
		TWeakObjectPtr<UClass*> ExtensionClass; // 0x28(0x20)
		TWeakObjectPtr<UClass*> ErrorVisualsClass; // 0x48(0x20)
		TWeakObjectPtr<UObject*> ActiveExtension; // 0x68(0x8)
		unsigned char UnknownData00_7[0x50]; // 0x70(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction_ExtendMatchmakingWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction_ExtendRankedWidget
	// Inherited from UFortUIGameFeatureAction -> UGameFeatureAction -> UObject
	// Size: 0x80 (0xA8 - 0x28)
	class UFortUIGameFeatureAction_ExtendRankedWidget : public UFortUIGameFeatureAction	
	{
	public:
		TWeakObjectPtr<UClass*> ExtensionClass; // 0x28(0x20)
		TArray<TWeakObjectPtr> ActiveRankedWidgetExtensions; // 0x48(0x10)
		unsigned char UnknownData00_7[0x50]; // 0x58(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction_ExtendRankedWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortUIGameFeatureAction_SetLobbyData
	// Inherited from UFortUIGameFeatureAction -> UGameFeatureAction -> UObject
	// Size: 0xD8 (0x100 - 0x28)
	class UFortUIGameFeatureAction_SetLobbyData : public UFortUIGameFeatureAction	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FFrontendLobbyData FrontendLobbyData; // 0x30(0xA8)
		TArray<FFrontendLobbyActor> LoadedLobbyActors; // 0xD8(0x10)
		unsigned char UnknownData01_7[0x18]; // 0xE8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIGameFeatureAction_SetLobbyData");
			return ret;
		}
	};


	// Class FortniteUI.FortUISpecialEventSubsystem
	// Inherited from UGameInstanceSubsystem -> USubsystem -> UObject
	// Size: 0x28 (0x58 - 0x30)
	class UFortUISpecialEventSubsystem : public UGameInstanceSubsystem	
	{
	public:
		FMulticastInlineDelegate OnNewUISpecialEventState; // 0x30(0x10)
		FMulticastInlineDelegate OnTemporarySpecialUIEvent; // 0x40(0x10)
		unsigned char UnknownData00_7[0x8]; // 0x50(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUISpecialEventSubsystem");
			return ret;
		}

		void SpecialUIEventDelegate__DelegateSignature(TEnumAsByte<EFortUISpecialEvents> InEventName); // Flags: MulticastDelegate|Public|Delegate, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetCurrentUISpecialEventState(TEnumAsByte<EFortUISpecialEvents> InNewEventState); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63C68(relative to base address)
		TEnumAsByte GetCurrentUIEventState(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74C3166E0(relative to base address)
		void CallTemporarySpecialUIEvent(TEnumAsByte<EFortUISpecialEvents> InNewTemporaryEvent); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63990(relative to base address)
	};


	// Class FortniteUI.FortUIStyleDefinitionAsset
	// Inherited from UDataAsset -> UObject
	// Size: 0xDC0 (0xDF0 - 0x30)
	class UFortUIStyleDefinitionAsset : public UDataAsset	
	{
	public:
		FFortUIStyleDefinition StyleDefinition; // 0x30(0xDC0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUIStyleDefinitionAsset");
			return ret;
		}
	};


	// Class FortniteUI.FortUserWidget
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UFortUserWidget : public UUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x2B0(0x8) UNKNOWN PROPERTY
		bool bConsumePointerInput; // 0x2B8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x2B9(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUserWidget");
			return ret;
		}
	};


	// Class FortniteUI.FortUserChoiceWidget
	// Inherited from UFortUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2C0 - 0x2C0)
	class UFortUserChoiceWidget : public UFortUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortUserChoiceWidget");
			return ret;
		}

		void SetChoices(FChoiceData& ChoiceItems); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortVariantChannelVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x100 (0x168 - 0x68)
	class UFortVariantChannelVM : public UMVVMViewModelBase	
	{
	public:
		TArray<UFortVariantItemVM*> VariantItems; // 0x68(0x10)
		FText RowDisplayName; // 0x78(0x10)
		UFortItemVM* CosmeticItem; // 0x88(0x8)
		ECosmeticVariantRowType RowType; // 0x90(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x91(0x7) UNKNOWN PROPERTY
		FMcpVariantChannelInfo VariantChannelInfo; // 0x98(0x40)
		UFortVariantItemVM* SelectedVariantItem; // 0xD8(0x8)
		UFortVariantItemVM* EquippedVariantItem; // 0xE0(0x8)
		bool bAllowOwnershipVisibility; // 0xE8(0x1)
		bool bShowUnownedAsLocked; // 0xE9(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xEA(0x6) UNKNOWN PROPERTY
		FText DisclaimerText; // 0xF0(0x10)
		unsigned char UnknownData02_7[0x68]; // 0x100(0x68) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantChannelVM");
			return ret;
		}

		void ShowVariantEngaged(UFortVariantItemVM* InVariant); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63DD8(relative to base address)
		void HandleVariantEngaged(UFortVariantItemVM* InVariant); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63A98(relative to base address)
		UFortVariantItemVM GetSelectedVariantItem(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74D691680(relative to base address)
	};


	// Class FortniteUI.FortVariantTiledChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x168 - 0x168)
	class UFortVariantTiledChannelVM : public UFortVariantChannelVM	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantTiledChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortRankedVariantTiledChannelVM
	// Inherited from UFortVariantTiledChannelVM -> UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x170 - 0x168)
	class UFortRankedVariantTiledChannelVM : public UFortVariantTiledChannelVM	
	{
	public:
		AFortPlayerController* OwningPlayer; // 0x168(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortRankedVariantTiledChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantRichColorChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x40 (0x1A8 - 0x168)
	class UFortVariantRichColorChannelVM : public UFortVariantChannelVM	
	{
	public:
		TArray<UCustomColorSwatch*> ColorSwatches; // 0x168(0x10)
		UFortCosmeticRichColorVariant* CachedCosmeticVariant; // 0x178(0x8)
		unsigned char UnknownData00_7[0x28]; // 0x180(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantRichColorChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantNumericChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x30 (0x198 - 0x168)
	class UFortVariantNumericChannelVM : public UFortVariantChannelVM	
	{
	public:
		UFortVariantItemVM* ItemVM; // 0x168(0x8)
		unsigned char UnknownData00_6[0x10]; // 0x170(0x10) UNKNOWN PROPERTY
		UFortCosmeticNumericalVariant* NumericalVariant; // 0x180(0x8)
		FText NumDisplay; // 0x188(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantNumericChannelVM");
			return ret;
		}

		void ChangeNumericalValue(int32_t NumericalDelta); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63A18(relative to base address)
	};


	// Class FortniteUI.FortVariantSliderChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x40 (0x1A8 - 0x168)
	class UFortVariantSliderChannelVM : public UFortVariantChannelVM	
	{
	public:
		UFortVariantItemVM* ItemVM; // 0x168(0x8)
		UFortCosmeticFloatSliderVariant* FloatVariant; // 0x170(0x8)
		AFortPlayerController* OwningPlayer; // 0x178(0x8)
		float SliderStep; // 0x180(0x4)
		float CurrentFloatValue; // 0x184(0x4)
		float CurrentProgress; // 0x188(0x4)
		float CurrentProgressBar; // 0x18C(0x4)
		FText SliderDisplayText; // 0x190(0x10)
		bool bIsLocked; // 0x1A0(0x1)
		bool bRealTimePreviewUpdate; // 0x1A1(0x1)
		unsigned char UnknownData00_7[0x6]; // 0x1A2(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSliderChannelVM");
			return ret;
		}

		void SetFloatValue(float InFloatValue, bool bCommit); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63CFC(relative to base address)
	};


	// Class FortniteUI.FortVariantTextureChannelVM
	// Inherited from UFortVariantChannelVM -> UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x178 - 0x168)
	class UFortVariantTextureChannelVM : public UFortVariantChannelVM	
	{
	public:
		AFortPlayerController* OwningPlayer; // 0x168(0x8)
		unsigned char UnknownData00_6[0x4]; // 0x170(0x4) UNKNOWN PROPERTY
		bool bShowArchivedItems; // 0x174(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x175(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantTextureChannelVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantItemButtonMP
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x80 (0x1460 - 0x13E0)
	class UFortVariantItemButtonMP : public UCommonButtonLegacy	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x13E0(0x10) UNKNOWN PROPERTY
		FLinearColor LockedTintColor; // 0x13F0(0x10)
		FName IconParamName; // 0x1400(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1404(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr<UMaterialInstance*> VariantMaterial; // 0x1408(0x20)
		TWeakObjectPtr<UTexture2D*> ExplicitlyNoneIcon; // 0x1428(0x20)
		UImage* Image_VariantDisplay; // 0x1448(0x8)
		UFortApplyVarianceToInterfaceMaterialFlow* MaterialVarianceFlowUI; // 0x1450(0x8)
		unsigned char UnknownData02_7[0x8]; // 0x1458(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantItemButtonMP");
			return ret;
		}

		void SetupVariantPreviewImage(); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74FC63DC4(relative to base address)
		UFortVariantItemVM GetAssociatedVariant(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortVariantItemVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0xC8 (0x130 - 0x68)
	class UFortVariantItemVM : public UMVVMViewModelBase	
	{
	public:
		UFortItemVM* CosmeticItem; // 0x68(0x8)
		UFortApplyVarianceToInterfaceMaterialFlow* MaterialVarianceFlowUI; // 0x70(0x8)
		UMaterialInterface* OriginalMaterial; // 0x78(0x8)
		bool bOwned; // 0x80(0x1)
		bool bEquipped; // 0x81(0x1)
		bool bDisabled; // 0x82(0x1)
		bool bHasConflict; // 0x83(0x1)
		bool bIsOwnershipVisibilityAllowed; // 0x84(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		FGameplayTag VariantChannel; // 0x88(0x4)
		FGameplayTag VariantTag; // 0x8C(0x4)
		FString VariantCustomData; // 0x90(0x10)
		FVariantDisplayInfo VariantDisplayInfo; // 0xA0(0x38)
		FText ConflictingText; // 0xD8(0x10)
		bool bIsConflicting; // 0xE8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xE9(0x7) UNKNOWN PROPERTY
		FText AgeGateText; // 0xF0(0x10)
		bool bHasAgeGate; // 0x100(0x1)
		bool bShowUnownedAsLocked; // 0x101(0x1)
		unsigned char UnknownData02_6[0x6]; // 0x102(0x6) UNKNOWN PROPERTY
		FText UnlockRequirements; // 0x108(0x10)
		bool bIsLocked; // 0x118(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x119(0x7) UNKNOWN PROPERTY
		FText DisclaimerText; // 0x120(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantItemVM");
			return ret;
		}

		void ApplyMaterialVariance(UImage* Image); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63910(relative to base address)
	};


	// Class FortniteUI.FortVariantRichColorItemVM
	// Inherited from UFortVariantItemVM -> UMVVMViewModelBase -> UObject
	// Size: 0x10 (0x140 - 0x130)
	class UFortVariantRichColorItemVM : public UFortVariantItemVM	
	{
	public:
		FText ColorName; // 0x130(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantRichColorItemVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantTextureItemVM
	// Inherited from UFortVariantItemVM -> UMVVMViewModelBase -> UObject
	// Size: 0x8 (0x138 - 0x130)
	class UFortVariantTextureItemVM : public UFortVariantItemVM	
	{
	public:
		UAthenaCosmeticItemDefinition* VariantCosmeticDef; // 0x130(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantTextureItemVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantRankedItemVM
	// Inherited from UFortVariantItemVM -> UMVVMViewModelBase -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UFortVariantRankedItemVM : public UFortVariantItemVM	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantRankedItemVM");
			return ret;
		}

		void OnRankUpdated(int32_t InNewRank, uint32_t InPlayerId); // Flags: Final|Native|Public, Memory Exec: 0x7FF74FC63B1C(relative to base address)
	};


	// Class FortniteUI.FortVariantSelectorFilterVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0xA0 (0x108 - 0x68)
	class UFortVariantSelectorFilterVM : public UMVVMViewModelBase	
	{
	public:
		FText Label; // 0x68(0x10)
		UFortVariantSelectorSubFilterVM* MainFilter; // 0x78(0x8)
		FFortVariantFilterTabInfo_Primary PrimaryFilterInfo; // 0x80(0x88)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSelectorFilterVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantSelectorSubFilterVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0xA8 (0x110 - 0x68)
	class UFortVariantSelectorSubFilterVM : public UMVVMViewModelBase	
	{
	public:
		unsigned char UnknownData00_3[0x78]; // 0x68(0x78) UNKNOWN PROPERTY
		TWeakObjectPtr<UObject*> Icon; // 0xE0(0x20)
		FText Label; // 0x100(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSelectorSubFilterVM");
			return ret;
		}
	};


	// Class FortniteUI.FortVariantSelectorVM
	// Inherited from UFortPerUserViewModel -> UMVVMViewModelBase -> UObject
	// Size: 0x198 (0x208 - 0x70)
	class UFortVariantSelectorVM : public UFortPerUserViewModel	
	{
	public:
		TMap<FGameplayTag, FGameplayTag> ProductOverrideChannels; // 0x70(0x50)
		UAthenaVariantPickerConfig* ConfigurationData; // 0xC0(0x8)
		TArray<UFortVariantSelectorFilterVM*> PrimaryFilters; // 0xC8(0x10)
		TArray<UFortVariantSelectorSubFilterVM*> SecondaryFilters; // 0xD8(0x10)
		TArray<UFortVariantSetVM*> VariantSets; // 0xE8(0x10)
		unsigned char UnknownData00_6[0x10]; // 0xF8(0x10) UNKNOWN PROPERTY
		TArray<FMcpVariantChannelInfo> CurrentVariantOverrides; // 0x108(0x10)
		UFortLockerCategoryItemVM* SelectedCategory; // 0x118(0x8)
		UFortItemVM* SelectedItem; // 0x120(0x8)
		UFortVariantItemVM* InspectedVariantItemVM; // 0x128(0x8)
		TArray<UFortVariantChannelVM*> VariantChannels; // 0x130(0x10)
		unsigned char UnknownData01_6[0x30]; // 0x140(0x30) UNKNOWN PROPERTY
		UFortVariantSelectorFilterVM* CurrentPrimaryFilter; // 0x170(0x8)
		UFortVariantSelectorSubFilterVM* CurrentSecondaryFilter; // 0x178(0x8)
		unsigned char UnknownData02_6[0x50]; // 0x180(0x50) UNKNOWN PROPERTY
		bool bAllowDisplayUnownedVariants; // 0x1D0(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x1D1(0x1) UNKNOWN PROPERTY
		bool bShowUnownedAsLocked; // 0x1D2(0x1)
		bool bShowAgeGateWarnings; // 0x1D3(0x1)
		bool bShowFilterFullSize; // 0x1D4(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x1D5(0x3) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnVariantEngagedEvent; // 0x1D8(0x10)
		FMulticastInlineDelegate OnVariantOverridesChangedEvent; // 0x1E8(0x10)
		FMulticastInlineDelegate OnRotationRequestedEvent; // 0x1F8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSelectorVM");
			return ret;
		}

		void UpdateVariantChannels(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC66860(relative to base address)
		void UpdateVariantChannelConflicts(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC6684C(relative to base address)
		void SetShowArchivedVariants(bool bShow); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65FDC(relative to base address)
		void SetSelectedItem(UFortItemVM* InSelectedItem); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65F5C(relative to base address)
		void SetSelectedCategory(UFortLockerCategoryItemVM* InSelectedCategory); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65EDC(relative to base address)
		void SetCurrentSecondaryFilter(UFortVariantSelectorSubFilterVM* InCurrentSecondaryFilter); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65714(relative to base address)
		void SetCurrentPrimaryFilter(UFortVariantSelectorFilterVM* InCurrentPrimaryFilter); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65694(relative to base address)
		void SetConfigurationData(UAthenaVariantPickerConfig* InConfigurationData); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65614(relative to base address)
		void OnVariantOverridesChangedEvent__DelegateSignature(TArray<FMcpVariantChannelInfo>& InVariantOverridesInfo); // Flags: MulticastDelegate|Public|Delegate|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnVariantChangedEvent__DelegateSignature(FMcpVariantChannelInfo& InChannelInfo); // Flags: MulticastDelegate|Public|Delegate|HasOutParms, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRotationRequestedEvent__DelegateSignature(FRotator& RotationOffset, bool bSnap); // Flags: MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DismissVariantChannels(); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC651F4(relative to base address)
	};


	// Class FortniteUI.FortVariantSetVM
	// Inherited from UMVVMViewModelBase -> UObject
	// Size: 0x30 (0x98 - 0x68)
	class UFortVariantSetVM : public UMVVMViewModelBase	
	{
	public:
		TArray<UFortVariantChannelVM*> VariantChannels; // 0x68(0x10)
		ECosmeticVariantRowType RowType; // 0x78(0x1)
		unsigned char UnknownData00_7[0x1F]; // 0x79(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVariantSetVM");
			return ret;
		}

		void HandleRotationRequested(FRotator& RotationOffset, bool bSnap); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC65378(relative to base address)
		ECosmeticVariantRowType GetRowType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC65364(relative to base address)
	};


	// Class FortniteUI.FortVehicleFuelGauge
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1F8 (0x4A8 - 0x2B0)
	class UFortVehicleFuelGauge : public UUserWidget	
	{
	public:
		unsigned char UnknownData00_3[0x1A8]; // 0x2B0(0x1A8) UNKNOWN PROPERTY
		UMaterialInstanceDynamic* ImageSecondaryMeterMaterial; // 0x458(0x8)
		FName ImageMeterFillParamName; // 0x460(0x4)
		FName SecondaryMeterFillLineColorParamName; // 0x464(0x4)
		FLinearColor SecondaryMeterFillLineColorDefault; // 0x468(0x10)
		FLinearColor SecondaryMeterFillLineColorLowFuel; // 0x478(0x10)
		UOverlay* Overlay_Meter; // 0x488(0x8)
		UOverlay* Overlay_FuelIcon; // 0x490(0x8)
		UImage* Image_MeterIconGlow; // 0x498(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x4A0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVehicleFuelGauge");
			return ret;
		}

		void UpdateFuelChanged(float FuelPercent, bool bIsFuelLow); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC6605C(relative to base address)
		void ShowInfiniteFuel(bool bHasInfiniteFuel); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMeterOverlayVisibility(ESlateVisibility NewVisibility); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC65968(relative to base address)
		void SetIconOverlayVisibility(ESlateVisibility NewVisibility); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC6585C(relative to base address)
		void OnVehicleUpdated(AFortAthenaVehicle* NewVehicle); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTankFull(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7474A9F44(relative to base address)
		void OnRefuelingCosmeticsStarted(); // Flags: Native|Event|Public|BlueprintEvent, Memory Exec: 0x7FF74F0F9DB4(relative to base address)
		void OnRefuelingCosmeticsFinished(bool bIsFuelLow); // Flags: Native|Event|Public|BlueprintEvent, Memory Exec: 0x7FF74FC65590(relative to base address)
		float GetCurrentFuelValue(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC65338(relative to base address)
		void BP_HandleExtensionWidgetCreated(UUserWidget* Widget, EUIExtensionSlot SlotType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.FortVideoWidgetBase
	// Inherited from UEpicMediaVideoWidgetBase -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x4D8 - 0x498)
	class UFortVideoWidgetBase : public UEpicMediaVideoWidgetBase	
	{
	public:
		FMulticastInlineDelegate MediaPreEndEvent; // 0x498(0x10)
		UFortMediaSubtitlesPlayer* SubtitlePlayer; // 0x4A8(0x8)
		ULocalizedOverlays* SubtitleOverlays; // 0x4B0(0x8)
		USubtitleDisplay* Subtitles; // 0x4B8(0x8)
		unsigned char UnknownData00_7[0x18]; // 0x4C0(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortVideoWidgetBase");
			return ret;
		}

		void SetMediaPreEndTimeSeconds(float InSeconds); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC658DC(relative to base address)
	};


	// Class FortniteUI.FortViewModelsManager
	// Inherited from UGameInstanceSubsystem -> USubsystem -> UObject
	// Size: 0xF0 (0x120 - 0x30)
	class UFortViewModelsManager : public UGameInstanceSubsystem	
	{
	public:
		TMap<UObject*, EFortViewModelsDestructionType> ViewModelCache; // 0x30(0x50)
		unsigned char UnknownData00_7[0xA0]; // 0x80(0xA0) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortViewModelsManager");
			return ret;
		}
	};


	// Class FortniteUI.FortWeaponReticleRechargeStackBasePipBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x2B8 - 0x2B0)
	class UFortWeaponReticleRechargeStackBasePipBase : public UUserWidget	
	{
	public:
		UImage* ImagePip; // 0x2B0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortWeaponReticleRechargeStackBasePipBase");
			return ret;
		}

		void SetPipProgressColor(FLinearColor Color, FName PipColorMatParamName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC65D00(relative to base address)
		void SetImagePip(UImage* Image); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74EA4CBC8(relative to base address)
		void SetFillPercent(float FillPercent, FName PipPercentMatParamName); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF74FC65794(relative to base address)
	};


	// Class FortniteUI.FortWeaponReticleRechargeStackBasePipCollectionBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UFortWeaponReticleRechargeStackBasePipCollectionBase : public UUserWidget	
	{
	public:
		UDynamicEntryBox* PipDynamicEntryBox; // 0x2B0(0x8)
		int32_t CurrentCount; // 0x2B8(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x2BC(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.FortWeaponReticleRechargeStackBasePipCollectionBase");
			return ret;
		}

		void UpdateRemainingRechargeTimeAtIndex(float FillPercent, int32_t Index, FName PipPercentMatParamName, bool ShouldSetPipColor, FLinearColor NotReadyColor, FLinearColor ReadyColor, FName PipColorMatParamName); // Flags: Final|Native|Protected|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC664B8(relative to base address)
		void UpdateRemainingRechargeTime(float TimeRemaining, float TotalDuration, FName PipPercentMatParamName, bool ShouldSetPipColor, FLinearColor NotReadyColor, FLinearColor ReadyColor, FName PipColorMatParamName); // Flags: Final|Native|Protected|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC66124(relative to base address)
		void SetPipColor(float Progress, int32_t Index, FLinearColor NotReadyColor, FLinearColor ReadyColor, FName PipColorMatParamName); // Flags: Final|Native|Protected|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF74FC659E8(relative to base address)
		void SetDynamicEntryBox(UDynamicEntryBox* DynamicEntryBox); // Flags: Final|Native|Protected|BlueprintCallable, Memory Exec: 0x7FF74EA4CBC8(relative to base address)
		UDynamicEntryBox GetDynamicEntryBox(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74EA4AE60(relative to base address)
		int32_t GetCurrentCount(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF749FCCC20(relative to base address)
	};


	// Class FortniteUI.GamePhaseWidget
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x320 - 0x318)
	class UGamePhaseWidget : public UFortHUDElementWidget	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x318(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.GamePhaseWidget");
			return ret;
		}

		void OnMinigameStateChanged(AFortMinigame* Minigame, EFortMinigameState NewMinigameState); // Flags: Native|Protected, Memory Exec: 0x7FF74F0F9CEC(relative to base address)
		void OnMinigameReady(AFortMinigame* Minigame); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MinigameStateChangedEvent(AFortMinigame* Minigame, EFortMinigameState NewMinigameState); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.GameStateComponent_PlayerFeedback
	// Inherited from UGameStateComponent -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x0 (0xA0 - 0xA0)
	class UGameStateComponent_PlayerFeedback : public UGameStateComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.GameStateComponent_PlayerFeedback");
			return ret;
		}
	};


	// Class FortniteUI.HudBindingCheckInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UHudBindingCheckInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HudBindingCheckInterface");
			return ret;
		}

		void ShowBindWidgets(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF748E753C0(relative to base address)
		bool ShouldShowPromptInHud(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF747A09D0C(relative to base address)
		void HideBindWidgets(); // Flags: Native|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF749263428(relative to base address)
		void GetBindActions(TArray<FName>& OutActions); // Flags: Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF74FC6525C(relative to base address)
	};


	// Class FortniteUI.HUDLayoutToolV2_WidgetPreview
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x320 - 0x2D8)
	class UHUDLayoutToolV2_WidgetPreview : public UCommonUserWidget	
	{
	public:
		UCreateHUDWidgetDragDropOperation* CreateHUDWidgetOperation; // 0x2D8(0x8)
		unsigned char UnknownData00_6[0x10]; // 0x2E0(0x10) UNKNOWN PROPERTY
		float DragDistanceThresholdMillimeters; // 0x2F0(0x4)
		unsigned char UnknownData01_6[0x1C]; // 0x2F4(0x1C) UNKNOWN PROPERTY
		UCommonTextBlock* TextBlock_InstancesLeftCounter; // 0x310(0x8)
		UBorder* Border_Background; // 0x318(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDLayoutToolV2_WidgetPreview");
			return ret;
		}

		void HandleOperationDrop(UDragDropOperation* Operation); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FE86FF4(relative to base address)
	};


	// Class FortniteUI.HUDLayoutToolV2_AutorunPreview
	// Inherited from UHUDLayoutToolV2_WidgetPreview -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x328 - 0x320)
	class UHUDLayoutToolV2_AutorunPreview : public UHUDLayoutToolV2_WidgetPreview	
	{
	public:
		UOverlay* Overlay_AutorunLockZone; // 0x320(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDLayoutToolV2_AutorunPreview");
			return ret;
		}
	};


	// Class FortniteUI.HUDLayoutToolV2_MoveStickPreview
	// Inherited from UHUDLayoutToolV2_WidgetPreview -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x330 - 0x320)
	class UHUDLayoutToolV2_MoveStickPreview : public UHUDLayoutToolV2_WidgetPreview	
	{
	public:
		UOverlay* Overlay_ImprovedMoveStick; // 0x320(0x8)
		UOverlay* Overlay_OriginalMoveStick; // 0x328(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.HUDLayoutToolV2_MoveStickPreview");
			return ret;
		}
	};


	// Class FortniteUI.InteractionRadialBacchusButton
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x330 - 0x318)
	class UInteractionRadialBacchusButton : public UFortHUDElementWidget	
	{
	public:
		UImage* Timer_Image; // 0x318(0x8)
		UWidgetAnimation* RadialTimerAnimation; // 0x320(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x328(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.InteractionRadialBacchusButton");
			return ret;
		}

		void OnInteractionTimerChanged(AActor* TrackedActor, float duration, float Remaining); // Flags: Final|Native|Private, Memory Exec: 0x7FF74FC65498(relative to base address)
	};


	// Class FortniteUI.ItemCostWidgetBase
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE0 (0x390 - 0x2B0)
	class UItemCostWidgetBase : public UUserWidget	
	{
	public:
		UBorder* RarityBorder; // 0x2B0(0x8)
		UHorizontalBox* ResourceWidgetsContainer; // 0x2B8(0x8)
		bool bShowRarityData : 1; // 0x2C0:0(0x1)
		bool bUseBackgroundForAffordabilityFeedback : 1; // 0x2C0:1(0x1)
		unsigned char UnknownData00_5[0x7]; // 0x2C1(0x7) UNKNOWN PROPERTY
		TArray<UFortResourceWidget*> ResourceWidgets; // 0x2C8(0x10)
		unsigned char UnknownData01_7[0xB8]; // 0x2D8(0xB8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ItemCostWidgetBase");
			return ret;
		}

		void SetRarityData(FFortRarityItemData& RarityData); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC6930C(relative to base address)
		void SetItemCostInternal(TMap<TEnumAsByte, int32_t>& Costs); // Flags: Final|Native|Protected|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF74FC6923C(relative to base address)
		UFortResourceWidget CreateResourceCountWidget(bool bInUseBackgroundForAffordabilityFeedback, TEnumAsByte<EFortResourceType> ResourceType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class FortniteUI.ItemShopPreviewData
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UItemShopPreviewData : public UObject	
	{
	public:
		UFortItemVM* ItemVM; // 0x28(0x8)
		unsigned char UnknownData00_7[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.ItemShopPreviewData");
			return ret;
		}

		bool HasLoadoutOverride(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74FC6915C(relative to base address)
	};


	// Class FortniteUI.LastKillerInfoExtensionWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class ULastKillerInfoExtensionWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.LastKillerInfoExtensionWidgetInterface");
			return ret;
		}
	};


	// Class FortniteUI.MobileHUDElementCanvas
	// Inherited from UFortMobileHUDElement -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x368 - 0x348)
	class UMobileHUDElementCanvas : public UFortMobileHUDElement	
	{
	public:
		UClass* HUDElementClassToCreate; // 0x348(0x8)
		UFortMobileHUDElement* CreatedWidget; // 0x350(0x8)
		UCanvasPanelSlot* AsCanvasPanelSlot; // 0x358(0x8)
		UCanvasPanel* CanvasPanel_Wrapper; // 0x360(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MobileHUDElementCanvas");
			return ret;
		}
	};


	// Class FortniteUI.MotdActionBase
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UMotdActionBase : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdActionBase");
			return ret;
		}

		bool ShouldCloseWidget(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C5D1E6C(relative to base address)
		void CallToAction(AFortPlayerController* PlayerController); // Flags: Native|Public|BlueprintCallable, Memory Exec: 0x7FF74FC63DD8(relative to base address)
	};


	// Class FortniteUI.PrmChannel
	// Inherited from UObject
	// Size: 0x80 (0xA8 - 0x28)
	class UPrmChannel : public UObject	
	{
	public:
		unsigned char UnknownData00_1[0x80]; // 0x28(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.PrmChannel");
			return ret;
		}
	};


	// Class FortniteUI.MotdChannel
	// Inherited from UPrmChannel -> UObject
	// Size: 0xC8 (0x170 - 0xA8)
	class UMotdChannel : public UPrmChannel	
	{
	public:
		unsigned char UnknownData00_1[0xC8]; // 0xA8(0xC8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/FortniteUI.MotdChannel");
			return ret;
		}
	};


	// Class FortniteUI.MotdDiscoveryAction
	// Inherited from UMotdActionBase -> UObject
	// Size: 0x20 (0x50 - 0x30)
	class UMotdDiscoveryAction : public UMotdActionBase	
	{
	public:
		unsigned char UnknownData00_1[0x20]; // 0x30(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
