#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Items
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Struct /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_Procedural_AnimBP.SunRose_Wings_Procedural_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x607 (0x608 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_253 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x1B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x300(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x330(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x3C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x3F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x4B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x4E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x5A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5D8(0x30)
	};


	// Struct /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Player_AnimBP.SunRose_Player_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x179F (0x17A0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_254 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		int32_t __IntProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		int32_t __IntProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		int32_t __IntProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		int32_t __IntProperty; // 0x60(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x64(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x68(0x10)
		EAlphaBlendOption __EnumProperty; // 0x78(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x80(0x10)
		TArray<float> __ArrayProperty; // 0x90(0x10)
		FName __NameProperty; // 0xA0(0x4)
		int32_t __IntProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		int32_t __IntProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		int32_t __IntProperty; // 0xB4(0x4)
		FName __NameProperty; // 0xB8(0x4)
		int32_t __IntProperty; // 0xBC(0x4)
		FName __NameProperty; // 0xC0(0x4)
		FName __NameProperty; // 0xC4(0x4)
		EBlendListTransitionType __EnumProperty; // 0xC8(0x1)
		unsigned char UnknownData03_6[0x7]; // 0xC9(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xD0(0x10)
		FName __NameProperty; // 0xE0(0x4)
		FName __NameProperty; // 0xE4(0x4)
		int32_t __IntProperty; // 0xE8(0x4)
		FName __NameProperty; // 0xEC(0x4)
		int32_t __IntProperty; // 0xF0(0x4)
		FName __NameProperty; // 0xF4(0x4)
		FName __NameProperty; // 0xF8(0x4)
		int32_t __IntProperty; // 0xFC(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x100(0x2C)
		float __FloatProperty; // 0x12C(0x4)
		bool __BoolProperty; // 0x130(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x131(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x134(0x4)
		EAnimSyncMethod __EnumProperty; // 0x138(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x139(0x1)
		unsigned char UnknownData05_6[0x6]; // 0x13A(0x6) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x140(0x8)
		UCurveFloat* __CurveFloat; // 0x148(0x8)
		bool __BoolProperty; // 0x150(0x1)
		EAlphaBlendOption __EnumProperty; // 0x151(0x1)
		EBlendListTransitionType __EnumProperty; // 0x152(0x1)
		unsigned char UnknownData06_6[0x5]; // 0x153(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x158(0x10)
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		FName __NameProperty; // 0x170(0x4)
		FName __NameProperty; // 0x174(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x178(0x18)
		FName __NameProperty; // 0x190(0x4)
		FName __NameProperty; // 0x194(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x198(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x218(0x18)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x230(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x238(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x268(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x270(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2A0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2A8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2D8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2E0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x310(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x318(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x348(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x410(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x418(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x448(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4E0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x510(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x518(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x548(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x550(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x558(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x588(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_DeadBlending; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xAA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xC50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xC80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xCB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xD10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xDA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xDD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xE00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xE60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xE90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xEF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1010(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1040(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1070(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1100(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x11F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x14C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x15B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x16A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x16D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1700(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x1730(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1738(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x1768(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1770(0x30)
	};


	// Struct /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Player_AnimBP.SunRose_Player_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x3C (0x3D - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_255 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x19(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		bool __BoolProperty; // 0x24(0x1)
		bool __BoolProperty; // 0x25(0x1)
		bool __BoolProperty; // 0x26(0x1)
		bool __BoolProperty; // 0x27(0x1)
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		bool __BoolProperty; // 0x3C(0x1)
	};


	// Struct /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_AnimBP.SunRose_Wings_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2557 (0x2558 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_256 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		int32_t __IntProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		int32_t __IntProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		int32_t __IntProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		int32_t __IntProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		int32_t __IntProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		int32_t __IntProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		int32_t __IntProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		int32_t __IntProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		int32_t __IntProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		int32_t __IntProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		int32_t __IntProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		int32_t __IntProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		int32_t __IntProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		int32_t __IntProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		int32_t __IntProperty; // 0xB8(0x4)
		FName __NameProperty; // 0xBC(0x4)
		FName __NameProperty; // 0xC0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC4(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xC8(0x10)
		EAlphaBlendOption __EnumProperty; // 0xD8(0x1)
		unsigned char UnknownData02_6[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xE0(0x10)
		EAnimSyncMethod __EnumProperty; // 0xF0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xF1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xF4(0x4)
		TArray<float> __ArrayProperty; // 0xF8(0x10)
		FName __NameProperty; // 0x108(0x4)
		FName __NameProperty; // 0x10C(0x4)
		FName __NameProperty; // 0x110(0x4)
		int32_t __IntProperty; // 0x114(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x118(0x2C)
		FName __NameProperty; // 0x144(0x4)
		int32_t __IntProperty; // 0x148(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x14C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x14D(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x150(0x4)
		FName __NameProperty; // 0x154(0x4)
		int32_t __IntProperty; // 0x158(0x4)
		float __FloatProperty; // 0x15C(0x4)
		float __FloatProperty; // 0x160(0x4)
		bool __BoolProperty; // 0x164(0x1)
		EAnimSyncMethod __EnumProperty; // 0x165(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x166(0x1)
		unsigned char UnknownData05_6[0x1]; // 0x167(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x168(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x16C(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x170(0x8)
		UCurveFloat* __CurveFloat; // 0x178(0x8)
		bool __BoolProperty; // 0x180(0x1)
		EAlphaBlendOption __EnumProperty; // 0x181(0x1)
		EBlendListTransitionType __EnumProperty; // 0x182(0x1)
		unsigned char UnknownData07_6[0x5]; // 0x183(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x188(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x198(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1B0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x230(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x608(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x638(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x668(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x698(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x728(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x758(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x788(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x818(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x848(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x878(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x908(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x938(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x968(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x998(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xA88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xAB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xCF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xD58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xDB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xED8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1028(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1058(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1088(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1118(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_DeadBlending; // 0x1298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x12C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x14A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x14D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x15C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x15F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x16B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x16E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x17A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x17D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x18C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x19B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x19E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1A18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1A48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1AA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1AD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1B98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1BC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1BF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1C88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1CB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1CE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1D48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1DA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1DD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1E38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1E98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1EC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1EF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1F28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1F58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1FB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1FE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x20A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x20D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x21C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x21F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x22B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x22E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimGraph; // 0x2378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x23A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x23D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x2408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x24C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x24F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x2528(0x30)
	};


	// Struct /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_AnimBP.SunRose_Wings_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x28 (0x29 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_257 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		bool __BoolProperty; // 0x19(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x1A(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		bool __BoolProperty; // 0x20(0x1)
		bool __BoolProperty; // 0x21(0x1)
		bool __BoolProperty; // 0x22(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x23(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x24(0x4)
		bool __BoolProperty; // 0x28(0x1)
	};


	// Struct /DeployableTurretGameplay/Items/DeployableTurret/UI/STRUCT_TurretMessage.STRUCT_TurretMessage
	// Size: 0x20 (0x20 - 0x0)
	struct FSTRUCT_TurretMessage	
	{
	public:
		UBP_DeployableTurret_TurretMessageDataType_C* MessageData_28_4559C4D74175241D33F5E4BEB73DE1A8; // 0x0(0x8)
		ABGA_Athena_Sentry_Turret_Deployable_V2_C* SourceTurret_23_FE723E534182E3AC71F904AA3CD35DD6; // 0x8(0x8)
		bool ShowMessage_25_5A673AAA4467D28FFD71D690F6246F24; // 0x10(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		AController* MessageOwner_32_EFF5DB5F4C941F6915B5E882552F3052; // 0x18(0x8)
	};


	// Struct /DeployableTurretGameplay/Items/DeployableTurret/Meshes/DeployableTurret_Gadget_Skeleton_AnimBP.DeployableTurret_Gadget_Skeleton_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1027 (0x1028 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_258 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		int32_t __IntProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		int32_t __IntProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		int32_t __IntProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		int32_t __IntProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		int32_t __IntProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		int32_t __IntProperty; // 0x44(0x4)
		UBlendProfile* __BlendProfile; // 0x48(0x8)
		UCurveFloat* __CurveFloat; // 0x50(0x8)
		unsigned char UnknownData01_7[0xFD0]; // 0x58(0xFD0) UNKNOWN PROPERTY
	};


	// Struct /DeployableTurretGameplay/Items/DeployableTurret/Meshes/DeployableTurret_Gadget_Skeleton_AnimBP.DeployableTurret_Gadget_Skeleton_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1 (0x2 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_259 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
	};


	// Struct /DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_WEP_AnimBP.FeyCrab_Launcher_WEP_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0xA3F (0xA40 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_260 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x8(0x8)
		UCurveFloat* __CurveFloat; // 0x10(0x8)
		EAlphaBlendOption __EnumProperty; // 0x18(0x1)
		EBlendListTransitionType __EnumProperty; // 0x19(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x1A(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		int32_t __IntProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		int32_t __IntProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		int32_t __IntProperty; // 0x58(0x4)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0x5C(0x1)
		bool __BoolProperty; // 0x5D(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x5E(0x2) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x60(0x4)
		float __FloatProperty; // 0x64(0x4)
		UAnimSequenceBase* __AnimSequenceBase; // 0x68(0x8)
		FName __NameProperty; // 0x70(0x4)
		int32_t __IntProperty; // 0x74(0x4)
		float __FloatProperty; // 0x78(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x7C(0x2C)
		float __FloatProperty; // 0xA8(0x4)
		bool __BoolProperty; // 0xAC(0x1)
		EAnimSyncMethod __EnumProperty; // 0xAD(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xAE(0x1)
		unsigned char UnknownData03_6[0x1]; // 0xAF(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		FName __NameProperty; // 0xB8(0x4)
		int32_t __IntProperty; // 0xBC(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0xC0(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xD8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x158(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xA10(0x30)
	};


	// Struct /DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_WEP_AnimBP.FeyCrab_Launcher_WEP_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1 (0x2 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_261 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
	};


	// Struct /DryBox/Items/NyxGlass/Animation/NyxGlass_AnimBP.NyxGlass_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1557 (0x1558 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_262 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		int32_t __IntProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x20(0x18)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		UAnimSequenceBase* __AnimSequenceBase; // 0x40(0x8)
		FName __NameProperty; // 0x48(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0x50(0x8)
		FName __NameProperty; // 0x58(0x4)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0x5C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x5D(0x3) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0x60(0x8)
		FName __NameProperty; // 0x68(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x70(0x10)
		FName __NameProperty; // 0x80(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x84(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x88(0x18)
		FName __NameProperty; // 0xA0(0x4)
		int32_t __IntProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		unsigned char UnknownData05_6[0x4]; // 0xAC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xB0(0x10)
		UBlendProfile* __BlendProfile; // 0xC0(0x8)
		UCurveFloat* __CurveFloat; // 0xC8(0x8)
		EAlphaBlendOption __EnumProperty; // 0xD0(0x1)
		EBlendListTransitionType __EnumProperty; // 0xD1(0x1)
		unsigned char UnknownData06_6[0x6]; // 0xD2(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xD8(0x10)
		FName __NameProperty; // 0xE8(0x4)
		FName __NameProperty; // 0xEC(0x4)
		FName __NameProperty; // 0xF0(0x4)
		FName __NameProperty; // 0xF4(0x4)
		int32_t __IntProperty; // 0xF8(0x4)
		unsigned char UnknownData07_6[0x4]; // 0xFC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x100(0x18)
		FName __NameProperty; // 0x118(0x4)
		int32_t __IntProperty; // 0x11C(0x4)
		bool __BoolProperty; // 0x120(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x121(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x124(0x4)
		FName __NameProperty; // 0x128(0x4)
		int32_t __IntProperty; // 0x12C(0x4)
		float __FloatProperty; // 0x130(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x134(0x2C)
		float __FloatProperty; // 0x160(0x4)
		bool __BoolProperty; // 0x164(0x1)
		EAnimSyncMethod __EnumProperty; // 0x165(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x166(0x1)
		unsigned char UnknownData09_6[0x1]; // 0x167(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		FName __NameProperty; // 0x170(0x4)
		FName __NameProperty; // 0x174(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x178(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x190(0x80)
		FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x210(0x8)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x218(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x230(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x260(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x6B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x7D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x8C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x9B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x9E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xA18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xA48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xAA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xAD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xB08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xB98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xBC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xBF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xC28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xC88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0xCB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xCE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0xD48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0xE08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xEC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xEF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xF28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0xF58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xF88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x12E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x14C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x14F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1528(0x30)
	};


	// Struct /DryBox/Items/NyxGlass/Animation/NyxGlass_AnimBP.NyxGlass_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x1D (0x1E - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_263 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		int32_t __IntProperty; // 0x14(0x4)
		int32_t __IntProperty; // 0x18(0x4)
		bool __BoolProperty; // 0x1C(0x1)
		bool __BoolProperty; // 0x1D(0x1)
	};


	// Struct /DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_LayerAnimBP.FeyCrab_Launcher_LayerAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x8B7 (0x8B8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_264 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x58(0x8)
		UCurveFloat* __CurveFloat; // 0x60(0x8)
		EAlphaBlendOption __EnumProperty; // 0x68(0x1)
		EBlendListTransitionType __EnumProperty; // 0x69(0x1)
		unsigned char UnknownData02_6[0x6]; // 0x6A(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x70(0x10)
		float __FloatProperty; // 0x80(0x4)
		bool __BoolProperty; // 0x84(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x88(0x4)
		bool __BoolProperty; // 0x8C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x8D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x8E(0x1)
		unsigned char UnknownData04_6[0x1]; // 0x8F(0x1) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x90(0x18)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xB0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x130(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x208(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x238(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x240(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x270(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x278(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2A8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2B0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2E0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x888(0x30)
	};


	// Struct /DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_LayerAnimBP.FeyCrab_Launcher_LayerAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x17 (0x18 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_265 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		bool __BoolProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
	};


	// Struct /GrappleGloves/Items/GrappleGloves/Animation/Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1DD7 (0x1DD8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_266 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		int32_t __IntProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		int32_t __IntProperty; // 0x30(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x38(0x18)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x58(0x18)
		FName __NameProperty; // 0x70(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x78(0x18)
		FName __NameProperty; // 0x90(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x94(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x98(0x10)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0xB0(0x18)
		FName __NameProperty; // 0xC8(0x4)
		FName __NameProperty; // 0xCC(0x4)
		FName __NameProperty; // 0xD0(0x4)
		int32_t __IntProperty; // 0xD4(0x4)
		TArray<float> __ArrayProperty; // 0xD8(0x10)
		FName __NameProperty; // 0xE8(0x4)
		int32_t __IntProperty; // 0xEC(0x4)
		FName __NameProperty; // 0xF0(0x4)
		int32_t __IntProperty; // 0xF4(0x4)
		FName __NameProperty; // 0xF8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xFC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x100(0x10)
		FName __NameProperty; // 0x110(0x4)
		FName __NameProperty; // 0x114(0x4)
		FName __NameProperty; // 0x118(0x4)
		FName __NameProperty; // 0x11C(0x4)
		int32_t __IntProperty; // 0x120(0x4)
		FName __NameProperty; // 0x124(0x4)
		int32_t __IntProperty; // 0x128(0x4)
		FName __NameProperty; // 0x12C(0x4)
		FName __NameProperty; // 0x130(0x4)
		FName __NameProperty; // 0x134(0x4)
		int32_t __IntProperty; // 0x138(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x13C(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x140(0x8)
		UCurveFloat* __CurveFloat; // 0x148(0x8)
		EAlphaBlendOption __EnumProperty; // 0x150(0x1)
		EBlendListTransitionType __EnumProperty; // 0x151(0x1)
		unsigned char UnknownData06_6[0x6]; // 0x152(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x158(0x10)
		bool __BoolProperty; // 0x168(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x169(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x16C(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x170(0x2C)
		float __FloatProperty; // 0x19C(0x4)
		bool __BoolProperty; // 0x1A0(0x1)
		EAnimSyncMethod __EnumProperty; // 0x1A1(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x1A2(0x1)
		unsigned char UnknownData08_6[0x1]; // 0x1A3(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1A4(0x4)
		FName __NameProperty; // 0x1A8(0x4)
		FName __NameProperty; // 0x1AC(0x4)
		FName __NameProperty; // 0x1B0(0x4)
		unsigned char UnknownData09_6[0x4]; // 0x1B4(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x1B8(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1D0(0x80)
		FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x250(0x8)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x258(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x270(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2A0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x518(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x548(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x578(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x5A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x5D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x608(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x638(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x668(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x698(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x6F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x728(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x758(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x788(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x7B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x7E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x818(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x848(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x878(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x8D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x908(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x938(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x968(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x998(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xAB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xAE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xB18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xC08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xCC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xDB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xDE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xED8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xF98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xFC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xFF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1028(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1058(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1088(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x10E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1118(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1148(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1178(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x11A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1418(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x15C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x15F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x16B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x16E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x17A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x17D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x19B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x19E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1A48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1AA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1AD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1B98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1BC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1BF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1C28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1C58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1C88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1CB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1CE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1D18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1D48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1D78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1DA8(0x30)
	};


	// Struct /GrappleGloves/Items/GrappleGloves/Animation/Grapple_Gloves_Gadget_AnimBP_copied.Grapple_Gloves_Gadget_AnimBP_copied_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x25 (0x26 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_267 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		bool __BoolProperty; // 0x2(0x1)
		unsigned char UnknownData00_6[0x1]; // 0x3(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
		bool __BoolProperty; // 0x18(0x1)
		bool __BoolProperty; // 0x19(0x1)
		bool __BoolProperty; // 0x1A(0x1)
		unsigned char UnknownData01_6[0x1]; // 0x1B(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		bool __BoolProperty; // 0x24(0x1)
		bool __BoolProperty; // 0x25(0x1)
	};

}
