#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Athena
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class /Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresets.MobileHUDPresets_C
	// Inherited from UFortMobileHUDPresetContainer -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UMobileHUDPresets_C : public UFortMobileHUDPresetContainer	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresets.MobileHUDPresets_C");
			return ret;
		}
	};


	// Class /Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresetsInDevelopment.MobileHUDPresetsInDevelopment_C
	// Inherited from UFortMobileHUDPresetContainer -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UMobileHUDPresetsInDevelopment_C : public UFortMobileHUDPresetContainer	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresetsInDevelopment.MobileHUDPresetsInDevelopment_C");
			return ret;
		}
	};


	// Class /Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthPositive.GCNL_Creative_Powerup_HealthPositive_C
	// Inherited from AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x0 (0x9B0 - 0x9B0)
	class AGCNL_Creative_Powerup_HealthPositive_C : public AFortGameplayCueNotify_Loop	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthPositive.GCNL_Creative_Powerup_HealthPositive_C");
			return ret;
		}
	};


	// Class /Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthNegative.GCNL_Creative_Powerup_HealthNegative_C
	// Inherited from AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x0 (0x9B0 - 0x9B0)
	class AGCNL_Creative_Powerup_HealthNegative_C : public AFortGameplayCueNotify_Loop	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCNL_Creative_Powerup_HealthNegative.GCNL_Creative_Powerup_HealthNegative_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot.GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot.GE_NPC_Behavior_TargetSlots_Ranged_AbandonSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse.GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_SlotInUse_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse.GE_NPC_Behavior_TargetSlots_Ranged_SlotInUse_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Parents/FallImmunity/GE_Athena_TillLandFallDamageImmunity.GE_Athena_TillLandFallDamageImmunity_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_TillLandFallDamageImmunity_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Parents/FallImmunity/GE_Athena_TillLandFallDamageImmunity.GE_Athena_TillLandFallDamageImmunity_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NavFilters/NavFilter_NPC_AnyTraversable.NavFilter_NPC_AnyTraversable_C
	// Inherited from UNavigationQueryFilter -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UNavFilter_NPC_AnyTraversable_C : public UNavigationQueryFilter	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NavFilters/NavFilter_NPC_AnyTraversable.NavFilter_NPC_AnyTraversable_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_Max.GE_NPC_Behavior_TargetSlots_Melee_Max_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_Max_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_Max.GE_NPC_Behavior_TargetSlots_Melee_Max_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot.GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot.GE_NPC_Behavior_TargetSlots_Ranged_OverrideSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Controllers/NPC_Wildlife_Controller_Parent.NPC_Wildlife_Controller_Parent_C
	// Inherited from AAthenaAIController -> AFortAIController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x10 (0x618 - 0x608)
	class ANPC_Wildlife_Controller_Parent_C : public AAthenaAIController	
	{
	public:
		UAthenaMarkerComponent* AthenaMarker; // 0x608(0x8)
		UFortAthenaNpcPatrollingComponent* FortAthenaNpcPatrolling; // 0x610(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Controllers/NPC_Wildlife_Controller_Parent.NPC_Wildlife_Controller_Parent_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/RecentlyDamaged/GE_NPC_Gameplay_Status_RecentlyDamaged_10sec.GE_NPC_Gameplay_Status_RecentlyDamaged_10sec_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Gameplay_Status_RecentlyDamaged_10sec_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/RecentlyDamaged/GE_NPC_Gameplay_Status_RecentlyDamaged_10sec.GE_NPC_Gameplay_Status_RecentlyDamaged_10sec_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s.GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s.GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_GoalSelection_Tamed.GE_NPC_GoalSelection_Tamed_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_GoalSelection_Tamed_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_GoalSelection_Tamed.GE_NPC_GoalSelection_Tamed_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Convert_Damage.GE_NPC_Parent_Convert_Damage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Parent_Convert_Damage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Convert_Damage.GE_NPC_Parent_Convert_Damage_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner.GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_SlotOwner_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner.GE_NPC_Behavior_TargetSlots_Ranged_SlotOwner_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Pawns/NPC/Parents/NPCFunctionLibrary.NPCFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UNPCFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Pawns/NPC/Parents/NPCFunctionLibrary.NPCFunctionLibrary_C");
			return ret;
		}

		void HasCustomEffect(FGameplayTag CustomFXTag, AFortPawn* Pawn, UObject* __WorldContext, bool& HasCustomEffect); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayCustomEffect(FGameplayTag CustomFXTag, AFortPawn* Pawn, UObject* __WorldContext, bool& Success); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCustomEffectByTag(FGameplayTag CustomFXTag, UFortPawnComponent_AICustomEffects* PawnCustomVFXComp, UObject* __WorldContext, FNPCCustomEffect& CustomFX); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCustomEffectLocation(FName SocketName, AFortPawn* Pawn, UObject* __WorldContext, FTransform& EffectTransformLocation); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/NavFilters/NavFilter_NPC_AvoidAllWater.NavFilter_NPC_AvoidAllWater_C
	// Inherited from URecastFilter_UseDefaultArea -> UNavigationQueryFilter -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UNavFilter_NPC_AvoidAllWater_C : public URecastFilter_UseDefaultArea	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NavFilters/NavFilter_NPC_AvoidAllWater.NavFilter_NPC_AvoidAllWater_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Alert_Cooldown.GE_NPC_Parent_Alert_Cooldown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Parent_Alert_Cooldown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Alert_Cooldown.GE_NPC_Parent_Alert_Cooldown_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_InSafeZone.GE_InSafeZone_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_InSafeZone_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GE_InSafeZone.GE_InSafeZone_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Parents/FallImmunity/GA_Athena_TillLandFallDamageImmunity_Parent.GA_Athena_TillLandFallDamageImmunity_Parent_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x70 (0xBB0 - 0xB40)
	class UGA_Athena_TillLandFallDamageImmunity_Parent_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		UClass* GE_FallDamageImmunity; // 0xB48(0x8)
		FActiveGameplayEffectHandle GEH_FallDamageImmunity; // 0xB50(0x8)
		double Delay_PostLand; // 0xB58(0x8)
		FGameplayTag Tag_SurfaceSwimming; // 0xB60(0x4)
		FGameplayTag Tag_Sliding; // 0xB64(0x4)
		FGameplayTagContainer TC_IgnoreApplication; // 0xB68(0x20)
		FGameplayTag Tag_InVehicle; // 0xB88(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB8C(0x4) UNKNOWN PROPERTY
		double Delay_WaterSwimBind; // 0xB90(0x8)
		bool ApplyInAirOnly; // 0xB98(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xB99(0x3) UNKNOWN PROPERTY
		FGameplayTag TagIsRiding; // 0xB9C(0x4)
		TArray<UAbilityTask_WaitGameplayTagAdded*> WaitTagAsyncTasks; // 0xBA0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Parents/FallImmunity/GA_Athena_TillLandFallDamageImmunity_Parent.GA_Athena_TillLandFallDamageImmunity_Parent_C");
			return ret;
		}

		void Added_3DBE819D4ED6A0A0909A7690321F9B09(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_15DBA1504E74C72F22BBCBAD8E3CD31E(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_052C8416489756AFAF2C5391148ABB52(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_1195BCDD4C66168D5746C2BD02970859(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CallEnd(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetUpWaits(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetUpBinds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PawnLanded(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementModeChanged(ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveBinds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_TillLandFallDamageImmunity_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GE_Athena_FallDmgImmune_FX.GE_Athena_FallDmgImmune_FX_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_FallDmgImmune_FX_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GE_Athena_FallDmgImmune_FX.GE_Athena_FallDmgImmune_FX_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_Max.GE_NPC_Behavior_TargetSlots_Ranged_Max_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Ranged_Max_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Ranged/GE_NPC_Behavior_TargetSlots_Ranged_Max.GE_NPC_Behavior_TargetSlots_Ranged_Max_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotInUse.GE_NPC_Behavior_TargetSlots_Melee_SlotInUse_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_SlotInUse_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotInUse.GE_NPC_Behavior_TargetSlots_Melee_SlotInUse_C");
			return ret;
		}
	};


	// Class /Game/Athena/SafeZone/GE_OutsideSafeZoneDamage.GE_OutsideSafeZoneDamage_C
	// Inherited from UGET_PeriodicEnergyDamage_C -> UGET_PeriodicPhysicalDamage_C -> UGET_PeriodicDamageParent_C -> UGET_AfflictedParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_OutsideSafeZoneDamage_C : public UGET_PeriodicEnergyDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/SafeZone/GE_OutsideSafeZoneDamage.GE_OutsideSafeZoneDamage_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot.GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_AbandonSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot.GE_NPC_Behavior_TargetSlots_Melee_AbandonSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotOwner.GE_NPC_Behavior_TargetSlots_Melee_SlotOwner_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_SlotOwner_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_SlotOwner.GE_NPC_Behavior_TargetSlots_Melee_SlotOwner_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_Irwin.GE_Quest_Converted_Irwin_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Quest_Converted_Irwin_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_Irwin.GE_Quest_Converted_Irwin_C");
			return ret;
		}
	};


	// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot.GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Behavior_TargetSlots_Melee_OverrideSlot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot.GE_NPC_Behavior_TargetSlots_Melee_OverrideSlot_C");
			return ret;
		}
	};


	// Class /Game/Athena/AthenaFunctionLibrary.AthenaFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AthenaFunctionLibrary.AthenaFunctionLibrary_C");
			return ret;
		}

		void SpawnLootFromTableUsingItemEntry(FName TierGroupName, int32_t WorldLevel, int32_t ForcedLootTier, FVector Position, FVector Direction, int32_t OverrideMaxStackCount, bool bToss, bool bRandomRotation, bool bBlockedFromAutoPickup, int32_t PickupInstigatorHandle, EFortPickupSourceTypeFlag SourceType, EFortPickupSpawnSource Source, AFortPlayerController* OptionalOwnerPC, bool bPickupOnlyRelevantToOwner, UObject* __WorldContext, TArray<AFortPickup*>& ItemPickupsSpawned); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnLootFromArray(TArray<FFortItemEntry>& Array, FVector Position, FVector Direction, int32_t OverrideMaxStackCount, bool bToss, bool bRandomRotation, bool bBlockedFromAutoPickup, int32_t PickupInstigatorHandle, EFortPickupSourceTypeFlag SourceType, EFortPickupSpawnSource Source, AFortPlayerController* OptionalOwnerPC, bool bPickupOnlyRelevantToOwner, UObject* __WorldContext, TArray<AFortPickup*>& ItemPickupsSpawned); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetPlayerGroundedZ(AFortPlayerPawn* PlayerPawn, UObject* __WorldContext, double& Ground Z); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldAllowDeathEffects(FGameplayTagContainer Damage Or Death Tags, UObject* __WorldContext); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetActorMeshExtents(AActor* Actor, UObject* __WorldContext, FVector& BoundingBoxExtents); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UnclampedLerp(double A, double B, double Alpha, UObject* __WorldContext, double& Return Value); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FGameplayEffectContextHandle MakeSimpleFortEffectContext(AActor* Instigator, AActor* Damage Source, UObject* __WorldContext); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnLootFromTable(FName TierGroupName, int32_t WorldLevel, int32_t ForcedLootTier, FVector Position, FVector Direction, int32_t OverrideMaxStackCount, bool bToss, bool bRandomRotation, bool bBlockedFromAutoPickup, int32_t PickupInstigatorHandle, EFortPickupSourceTypeFlag SourceType, EFortPickupSpawnSource Source, AFortPlayerController* OptionalOwnerPC, bool bPickupOnlyRelevantToOwner, UObject* __WorldContext, TArray<AFortPickup*>& ItemPickupsSpawned); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool RowToBool(FScalableFloat& Input, double Level, UObject* __WorldContext); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AllOnSameTeam(AActor* Actor, TArray<AActor*>& ActorArray, UObject* __WorldContext, bool& Result); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CreateEnvironmentalKnockbackExplosion(FVector ExplosionSourcePoint, double ExplosionRadius, double Intensity, double MinKnockbackAngle, bool Reverse, AActor* SpecificActor, UObject* __WorldContext); // Flags: Static|Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/DrivableVehicles/GE_VehicleDamage_PhysicsObject_Global.GE_VehicleDamage_PhysicsObject_Global_C
	// Inherited from UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_VehicleDamage_PhysicsObject_Global_C : public UGet_DirectDamageParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GE_VehicleDamage_PhysicsObject_Global.GE_VehicleDamage_PhysicsObject_Global_C");
			return ret;
		}
	};


	// Class /Game/Athena/Prototype/Blueprints/White/GE_AntiGrav.GE_AntiGrav_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_AntiGrav_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Prototype/Blueprints/White/GE_AntiGrav.GE_AntiGrav_C");
			return ret;
		}
	};


	// Class /Game/Athena/Effects/Blueprints/Ash/GE_SnowFlakes_PlayerEffect.GE_SnowFlakes_PlayerEffect_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SnowFlakes_PlayerEffect_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Effects/Blueprints/Ash/GE_SnowFlakes_PlayerEffect.GE_SnowFlakes_PlayerEffect_C");
			return ret;
		}
	};


	// Class /Game/Athena/Prototype/Blueprints/White/GE_Lowgrav.GE_Lowgrav_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Lowgrav_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Prototype/Blueprints/White/GE_Lowgrav.GE_Lowgrav_C");
			return ret;
		}
	};


	// Class /Game/Athena/PawnHighlight_Interface.PawnHighlight_Interface_C
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UPawnHighlight_Interface_C : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PawnHighlight_Interface.PawnHighlight_Interface_C");
			return ret;
		}

		void RemoveHighlightFromSource(UObject* Source); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddHighlightFromSource(UObject* Source, FPawnHighlight Highlight, bool OnlyUpdateIfCurrent); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_Revive.GE_Athena_Revive_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Revive_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_Revive.GE_Athena_Revive_C");
			return ret;
		}
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_Revive_Self.GE_Athena_Revive_Self_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Revive_Self_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_Revive_Self.GE_Athena_Revive_Self_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Components/MultiInteractActorComponent.MultiInteractActorComponent_C
	// Inherited from UFortActorComponent_MultiInteract -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x21 (0x1E1 - 0x1C0)
	class UMultiInteractActorComponent_C : public UFortActorComponent_MultiInteract	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1C0(0x8)
		FGameplayTag RemoveInteractPlayerTag; // 0x1C8(0x4)
		FGameplayTag AddInteractPlayerTag; // 0x1CC(0x4)
		FGameplayTag LoopingMultiInteractTag; // 0x1D0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x1D4(0x4) UNKNOWN PROPERTY
		double RequiredDuration; // 0x1D8(0x8)
		bool GCNLApplied; // 0x1E0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Components/MultiInteractActorComponent.MultiInteractActorComponent_C");
			return ret;
		}

		void AddGCNL(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveGCNL(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteGCNFromTag(AFortPlayerPawn* PlayerPawn, FGameplayTag& InteractTag, int32_t PreviousInteractPlayerCount); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetRequiredDuration(double NewRequiredDuration); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateForPlayerJustJoinedInteraction(AFortPlayerStateAthena* JoinedPlayer); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateForPlayerJustLeftInteraction(AFortPlayerStateAthena* LeftPlayer); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MultiInteractActorComponent(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/MappedEffects/Lockout/GA_Athena_Lockout.GA_Athena_Lockout_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x18 (0xB58 - 0xB40)
	class UGA_Athena_Lockout_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FTimerHandle Timer_LockoutFailsafe; // 0xB48(0x8)
		double LockoutFailsafeTime; // 0xB50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/Lockout/GA_Athena_Lockout.GA_Athena_Lockout_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Failsafe(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Lockout(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/MappedEffects/Lockout/GE_Athena_Lockout.GE_Athena_Lockout_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Lockout_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/Lockout/GE_Athena_Lockout.GE_Athena_Lockout_C");
			return ret;
		}
	};


	// Class /Game/Athena/SafeZone/GE_UnderwaterDamage.GE_UnderwaterDamage_C
	// Inherited from UGET_PeriodicEnergyDamage_C -> UGET_PeriodicPhysicalDamage_C -> UGET_PeriodicDamageParent_C -> UGET_AfflictedParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UnderwaterDamage_C : public UGET_PeriodicEnergyDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/SafeZone/GE_UnderwaterDamage.GE_UnderwaterDamage_C");
			return ret;
		}
	};


	// Class /Game/Athena/Effects/Blueprints/ColdBreath/GE_ColdBreath_V2.GE_ColdBreath_V2_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ColdBreath_V2_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Effects/Blueprints/ColdBreath/GE_ColdBreath_V2.GE_ColdBreath_V2_C");
			return ret;
		}
	};


	// Class /Game/Athena/Sounds/Weapons/BulletWhips/BulletWhipTrackerComponent_Default.BulletWhipTrackerComponent_Default_C
	// Inherited from UBulletWhipTrackerComponentBase -> UActorComponent -> UObject
	// Size: 0x0 (0xF8 - 0xF8)
	class UBulletWhipTrackerComponent_Default_C : public UBulletWhipTrackerComponentBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Sounds/Weapons/BulletWhips/BulletWhipTrackerComponent_Default.BulletWhipTrackerComponent_Default_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Phoebe/NavFilter/NavFilter_Phoebe.NavFilter_Phoebe_C
	// Inherited from UFortNavigationFilter -> UNavigationQueryFilter -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UNavFilter_Phoebe_C : public UFortNavigationFilter	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Phoebe/NavFilter/NavFilter_Phoebe.NavFilter_Phoebe_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/GameplayEffects/GE_Patrolling.GE_Patrolling_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Patrolling_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/GameplayEffects/GE_Patrolling.GE_Patrolling_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Phoebe/BP_PhoebePlayerController.BP_PhoebePlayerController_C
	// Inherited from AFortAthenaAIBotController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x28 (0x1710 - 0x16E8)
	class ABP_PhoebePlayerController_C : public AFortAthenaAIBotController	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x16E8(0x8) UNKNOWN PROPERTY
		UFortControllerComponent_RechargeWeapons* RechargingWeaponsComponent; // 0x16F0(0x8)
		UFortBlackboardComponent* Blackboard1; // 0x16F8(0x8)
		UFortAthenaAIBotBuildingComponent* FortAthenaAIBotBuilding; // 0x1700(0x8)
		UAIPerceptionComponent* AIPerception; // 0x1708(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Phoebe/BP_PhoebePlayerController.BP_PhoebePlayerController_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/BP_PhoebeController_NonParticipant.BP_PhoebeController_NonParticipant_C
	// Inherited from ABP_PhoebePlayerController_C -> AFortAthenaAIBotController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x0 (0x1710 - 0x1710)
	class ABP_PhoebeController_NonParticipant_C : public ABP_PhoebePlayerController_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BP_PhoebeController_NonParticipant.BP_PhoebeController_NonParticipant_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_HireNPC.GE_Quest_Converted_HireNPC_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Quest_Converted_HireNPC_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Quests/QuestAbilities/QuestGEs/GE_Quest_Converted_HireNPC.GE_Quest_Converted_HireNPC_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C
	// Inherited from UFortPatrolAnimLayer -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0xC98 (0x11D8 - 0x540)
	class UMANG_PatrolLayerAnimBP_C : public UFortPatrolAnimLayer	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x540(0x1C)
		unsigned char UnknownData00_6[0x4]; // 0x55C(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x560(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x568(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x570(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x590(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x640(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x660(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x710(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x730(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7E0(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x828(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x850(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x878(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x918(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x940(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x968(0x70)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x9D8(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAC8(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xAF0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB10(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xB38(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xB58(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xBC8(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xC90(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xD80(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xDA8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xE18(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xE38(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xE60(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF28(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xF70(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xF90(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1058(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x10D0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10F8(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1140(0x78)
		FAnimNode_Root AnimGraphNode_Root; // 0x11B8(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/MANG/AnimSet/MANG_PatrolLayerAnimBP.MANG_PatrolLayerAnimBP_C");
			return ret;
		}

		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/NPCs/Base/BPI_NonParticipant.BPI_NonParticipant_C
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBPI_NonParticipant_C : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BPI_NonParticipant.BPI_NonParticipant_C");
			return ret;
		}

		void AttemptPlayVocalReinforcementSound(FGameplayTagContainer MetadataTagContainer); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayVoiceSoundByTag(FGameplayTag SoundBankTag); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Cooldown.GE_NPC_Status_Stressed_Cooldown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Status_Stressed_Cooldown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Cooldown.GE_NPC_Status_Stressed_Cooldown_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Infinite.GE_NPC_Status_Stressed_Infinite_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Status_Stressed_Infinite_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Infinite.GE_NPC_Status_Stressed_Infinite_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/GE_NPC_Challenged.GE_NPC_Challenged_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NPC_Challenged_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/GE_NPC_Challenged.GE_NPC_Challenged_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/PhantomBooth/GE_Athena_Disguise_Remove.GE_Athena_Disguise_Remove_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Disguise_Remove_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/PhantomBooth/GE_Athena_Disguise_Remove.GE_Athena_Disguise_Remove_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/BP_BotController_NPC_Base.BP_BotController_NPC_Base_C
	// Inherited from ABP_PhoebeController_NonParticipant_C -> ABP_PhoebePlayerController_C -> AFortAthenaAIBotController -> AAIController -> AController -> AActor -> UObject
	// Size: 0x50 (0x1760 - 0x1710)
	class ABP_BotController_NPC_Base_C : public ABP_PhoebeController_NonParticipant_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1710(0x8)
		UFortAthenaNpcPatrollingComponent* FortAthenaNpcPatrolling; // 0x1718(0x8)
		UClass* GE_Patrolling; // 0x1720(0x8)
		FActiveGameplayEffectHandle GE_PatrollingSpeedHandle; // 0x1728(0x8)
		FRotator SavedRotationRate; // 0x1730(0x18)
		FRotator PatrollingRotationRate; // 0x1748(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BP_BotController_NPC_Base.BP_BotController_NPC_Base_C");
			return ret;
		}

		void StopPatrolling(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartPatrolling(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemovePatrollingGE(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddPatrollingGE(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_0_PatrollingComponentOnStartPatrolling__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_1_PatrollingComponentOnStopPatrolling__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_BotController_NPC_Base(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/Actors/ConvertedMarkerInfo.ConvertedMarkerInfo_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xF8 (0x3D0 - 0x2D8)
	class UConvertedMarkerInfo_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UImage* Image_Avatar; // 0x2E0(0x8)
		UImage* Image_Command; // 0x2E8(0x8)
		UCommonVisibilitySwitcher* ImageSwitcher; // 0x2F0(0x8)
		UImage* SquadMarker; // 0x2F8(0x8)
		FTimerHandle DBNOPulseTimer; // 0x300(0x8)
		FGameplayTagContainer RelevantPlaylistTags; // 0x308(0x20)
		bool bIsTalking; // 0x328(0x1)
		bool bShowBackgroundOverridden; // 0x329(0x1)
		bool bEnemyVersion; // 0x32A(0x1)
		unsigned char UnknownData00_6[0x5]; // 0x32B(0x5) UNKNOWN PROPERTY
		TWeakObjectPtr<UTexture2D*> Icon_Move; // 0x330(0x20)
		TWeakObjectPtr<UTexture2D*> Icon_Hold; // 0x350(0x20)
		TWeakObjectPtr<UTexture2D*> Icon_BackToMe; // 0x370(0x20)
		TWeakObjectPtr<UTexture2D*> Icon_Revive; // 0x390(0x20)
		TWeakObjectPtr<UTexture2D*> Icon_Attack; // 0x3B0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/ConvertedMarkerInfo.ConvertedMarkerInfo_C");
			return ret;
		}

		void SetBackgroundVisibility(bool bOverride, bool bBackgroundVisible); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_68559753464A154900ECA9BC6BB940C0(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_25BCEE7642585A8BD6CE1CAFC70FEAF3(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OverrideShowBackground(bool bShowBackground); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitPlayerIconState(AFortPlayerStateAthena* PSA); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateCommandIcon(PingCommandType PingCommand, FLinearColor Color); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitNPCCommandIcon(FLinearColor Color); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ConvertedMarkerInfo(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/SimpleMaterialProgressBar.SimpleMaterialProgressBar_C
	// Inherited from UFortSimpleMaterialProgressBar -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3A8 - 0x3A8)
	class USimpleMaterialProgressBar_C : public UFortSimpleMaterialProgressBar	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/SimpleMaterialProgressBar.SimpleMaterialProgressBar_C");
			return ret;
		}
	};


	// Class /Game/Athena/HUD/Actors/NPCStatusWidgetBar.NPCStatusWidgetBar_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xF1 (0x3A1 - 0x2B0)
	class UNPCStatusWidgetBar_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		USizeBox* BarSizeBox; // 0x2B8(0x8)
		UImage* Image_BarBG; // 0x2C0(0x8)
		UImage* Image_CastShadow; // 0x2C8(0x8)
		USimpleMaterialProgressBar_C* ProgressBarDelta; // 0x2D0(0x8)
		USimpleMaterialProgressBar_C* ProgressBarFill; // 0x2D8(0x8)
		FLinearColor FillColor1; // 0x2E0(0x10)
		FLinearColor FillColor2; // 0x2F0(0x10)
		FLinearColor Delta1; // 0x300(0x10)
		FLinearColor Delta2; // 0x310(0x10)
		FLinearColor FillColor1_75Percent; // 0x320(0x10)
		FLinearColor FillColor2_75Percent; // 0x330(0x10)
		FLinearColor FillColor1_50Percent; // 0x340(0x10)
		FLinearColor FillColor2_50Percent; // 0x350(0x10)
		FLinearColor FillColor1_25Percent; // 0x360(0x10)
		FLinearColor FillColor2_25Percent; // 0x370(0x10)
		FLinearColor FillColor1_100Percent; // 0x380(0x10)
		FLinearColor FillColor2_100Percent; // 0x390(0x10)
		bool DifferentProgressColors; // 0x3A0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/NPCStatusWidgetBar.NPCStatusWidgetBar_C");
			return ret;
		}

		void SetHealthBarColorDependingHealth(double CurrentPercentage); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPercent(double Value); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetNumPips(int32_t NumPips); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPercentInstant(double Value); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NPCStatusWidgetBar(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/Actors/NPCStatusWidget.NPCStatusWidget_C
	// Inherited from UNPCStatusWidgetBase -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x490 - 0x428)
	class UNPCStatusWidget_C : public UNPCStatusWidgetBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x428(0x8)
		UNPCStatusWidgetBar_C* Bar_Health; // 0x430(0x8)
		UNPCStatusWidgetBar_C* Bar_Shield; // 0x438(0x8)
		UOverlay* Overlay_BarsPrefix; // 0x440(0x8)
		UVerticalBox* VerticalBox_BarExtensions; // 0x448(0x8)
		FTimerHandle VisibiltyTimer; // 0x450(0x8)
		FMulticastInlineDelegate VisibilityChanged; // 0x458(0x10)
		double StatusWidgetVisibleDuration; // 0x468(0x8)
		double CurrentHealthPercent; // 0x470(0x8)
		double CurrentShieldPercent; // 0x478(0x8)
		bool KeepVisibilityOn; // 0x480(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x481(0x7) UNKNOWN PROPERTY
		AFortPawn* FortPawn; // 0x488(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/NPCStatusWidget.NPCStatusWidget_C");
			return ret;
		}

		void EventUpdateStatus(double Health, double Shield, bool ShowShield); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventHideStatus(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChangeWidgetVisibleDuration(double StatusWidgetVisibleDuration); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetKeepVisibilityOn(bool KeepVisibilityOn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryCallEventHideByTimer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_HandlePlaylistExtensionWidgetCreated(UUserWidget* Widget, EUIExtensionSlot SlotType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPawnFocused(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NPCStatusWidget(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VisibilityChanged__DelegateSignature(bool bVisible); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/Actors/NPCConvertedIndicatorMarker.NPCConvertedIndicatorMarker_C
	// Inherited from UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x5D8 - 0x5B0)
	class UNPCConvertedIndicatorMarker_C : public UAthenaMarkedActorIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5B0(0x8)
		UImage* IrwinIndicator; // 0x5B8(0x8)
		UConvertedMarkerInfo_C* RidingMarkerInfo; // 0x5C0(0x8)
		FLinearColor CachedColor; // 0x5C8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Actors/NPCConvertedIndicatorMarker.NPCConvertedIndicatorMarker_C");
			return ret;
		}

		void OnSetMarkerData(FFortWorldMarkerData& FortWorldMarkerData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPingCommandEvent(PingCommandType CommandType); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NPCConvertedIndicatorMarker(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C
	// Inherited from AFortAIPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x8E4 (0x4024 - 0x3740)
	class ANPC_Pawn_Parent_C : public AFortAIPawn	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3740(0x8)
		USoundLibraryComponent* SoundLibrary; // 0x3748(0x8)
		UFortPawnComponent_CustomDepth* FortPawnComponent_CustomDepth; // 0x3750(0x8)
		UCapsuleComponent* WeaponCapsuleCollision; // 0x3758(0x8)
		UFortTaggedNavFiltersComponent* FortTaggedNavFilters; // 0x3760(0x8)
		UFortActorComponent_Affiliation* FortActorComponent_Affiliation; // 0x3768(0x8)
		USoundLibraryComponent* SoundLibrary_Component; // 0x3770(0x8)
		UAudioComponent* MovementAudioComponent; // 0x3778(0x8)
		UNPC_VoiceComponent_C* NPC_VoiceComponent; // 0x3780(0x8)
		UAudioComponent* VOAudioComponent; // 0x3788(0x8)
		UFortWidgetComponent* NPCStatusWidget; // 0x3790(0x8)
		float Timeline_ScaleMeshInOrOut_MeshScaleAlpha_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x3798(0x4)
		TEnumAsByte<ETimelineDirection> Timeline_ScaleMeshInOrOut__Direction_9DAAC0B243D26E4160CEC3A458AE0E86; // 0x379C(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x379D(0x3) UNKNOWN PROPERTY
		UTimelineComponent* Timeline_ScaleMeshInOrOut; // 0x37A0(0x8)
		UClass* GE_NPC_RecentlyDamaged; // 0x37A8(0x8)
		TEnumAsByte<Enum_NPC_AlertLevel> NPC_AlertLevel; // 0x37B0(0x1)
		TEnumAsByte<Enum_NPC_AlertLevel> NPC_AlertLevelPrevious; // 0x37B1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x37B2(0x6) UNKNOWN PROPERTY
		TMap<TEnumAsByte, FGameplayTag> NPC_AlertLevelToTagMap; // 0x37B8(0x50)
		bool NPC_StatusWidgetHealthBarDisabled; // 0x3808(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x3809(0x3) UNKNOWN PROPERTY
		FGameplayTag GameplayCue_PickupGrabbed; // 0x380C(0x4)
		EFortRarity NPC_BestLootRarityInInventory; // 0x3810(0x1)
		bool NPC_DebugPawn; // 0x3811(0x1)
		bool NPC_ShowInventoryRarityVisuals; // 0x3812(0x1)
		unsigned char UnknownData03_6[0x5]; // 0x3813(0x5) UNKNOWN PROPERTY
		double InventoryGlowDelay; // 0x3818(0x8)
		FScalableFloat NPC_NumberOfInventoryItemsToDeliverHF; // 0x3820(0x28)
		bool NPC_SpawnInvisible; // 0x3848(0x1)
		bool NPC_ScaleMeshInOnSpawn; // 0x3849(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x384A(0x6) UNKNOWN PROPERTY
		FGameplayTagContainer TC_NPC_SpawnAbilityTag; // 0x3850(0x20)
		FGameplayTagContainer TC_NPC_AlternateSpawnAbilityTag; // 0x3870(0x20)
		bool NPC_IsSpawning; // 0x3890(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x3891(0x7) UNKNOWN PROPERTY
		double NPC_OriginalGravityScale; // 0x3898(0x8)
		FRotator NPC_OriginalRotationRate; // 0x38A0(0x18)
		bool NPC_HasPawnGoal; // 0x38B8(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x38B9(0x7) UNKNOWN PROPERTY
		AActor* NPC_PawnGoalActor; // 0x38C0(0x8)
		FScalableFloat NPC_NumberOfInventoryItemsToConsumeBeforeFullHF; // 0x38C8(0x28)
		bool NPC_PawnIsDestroyingBuildingForNavigation; // 0x38F0(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x38F1(0x7) UNKNOWN PROPERTY
		FScalableFloat MaxIdleVODelay; // 0x38F8(0x28)
		FScalableFloat MinIdleVODelay; // 0x3920(0x28)
		FScalableFloat NPC_DeathDropLootDelay; // 0x3948(0x28)
		FName NPC_DeathDropLootTierGroupName; // 0x3970(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x3974(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer NPC_DeathDropLootRequiredDamageTags; // 0x3978(0x20)
		FGameplayTagContainer NPC_DeathDropLootForbiddenDamageTags; // 0x3998(0x20)
		FGameplayTagContainer GrantStartingItemsAbilityTC; // 0x39B8(0x20)
		bool NPC_HasItemInInventory; // 0x39D8(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x39D9(0x3) UNKNOWN PROPERTY
		FGameplayTag VoiceTag_FullAlertIdle; // 0x39DC(0x4)
		FGameplayTag VoiceTag_Idle; // 0x39E0(0x4)
		FGameplayTag VoiceTag_ReturnToIdle; // 0x39E4(0x4)
		FGameplayTag VoiceTag_LostTarget; // 0x39E8(0x4)
		FGameplayTag VoiceTag_Suspicious; // 0x39EC(0x4)
		FGameplayTag VoiceTag_FullAlert; // 0x39F0(0x4)
		unsigned char UnknownData10_6[0x4]; // 0x39F4(0x4) UNKNOWN PROPERTY
		TArray<FStruct_NPC_TargetSlots> NPC_TargetSlotsHF; // 0x39F8(0x10)
		bool NPC_DamageCanCancelIntroPhase; // 0x3A08(0x1)
		unsigned char UnknownData11_6[0x7]; // 0x3A09(0x7) UNKNOWN PROPERTY
		FGameplayTagQuery TQ_NPC_DamageTagsThatCanCancelIntroPhase; // 0x3A10(0x48)
		UClass* GE_NPC_IntroPhaseBehaviorCooldown; // 0x3A58(0x8)
		FGameplayTagContainer TC_IntroBehaviorActive; // 0x3A60(0x20)
		bool Debug_NPC_AlertLevelForced; // 0x3A80(0x1)
		bool NPC_PawnCanInteractInternal; // 0x3A81(0x1)
		unsigned char UnknownData12_6[0x6]; // 0x3A82(0x6) UNKNOWN PROPERTY
		FScalableFloat NPC_PrimtiveDataFloatSetRandomlyInRange; // 0x3A88(0x28)
		FScalableFloat NPC_PrimtiveDataFloatIndexHF; // 0x3AB0(0x28)
		FScalableFloat NPC_PrimtiveDataFloatMinRangeHF; // 0x3AD8(0x28)
		FScalableFloat NPC_PrimtiveDataFloatMaxRangeHF; // 0x3B00(0x28)
		AActor* NPC_Leader; // 0x3B28(0x8)
		FGameplayTag GameplayCue_LeaderSet; // 0x3B30(0x4)
		unsigned char UnknownData13_6[0x4]; // 0x3B34(0x4) UNKNOWN PROPERTY
		double NPC_Skeletal_Mesh_Index; // 0x3B38(0x8)
		USoundBase* TamedSound; // 0x3B40(0x8)
		UAudioComponent* StateChangeSound; // 0x3B48(0x8)
		FScalableFloat NPC_ShouldDespawnFromStormHF; // 0x3B50(0x28)
		FScalableFloat NPC_DespawnTimerHF; // 0x3B78(0x28)
		FGameplayTag NPC_DespawnGameplayTag; // 0x3BA0(0x4)
		unsigned char UnknownData14_6[0x4]; // 0x3BA4(0x4) UNKNOWN PROPERTY
		FTimerHandle NPC_TestIsInSafeZoneTimer; // 0x3BA8(0x8)
		FTimerHandle NPC_DespawnFromStormTimer; // 0x3BB0(0x8)
		bool NPC_isTryingToDespawn; // 0x3BB8(0x1)
		unsigned char UnknownData15_6[0x3]; // 0x3BB9(0x3) UNKNOWN PROPERTY
		FGameplayTag NPC_ResetIntroGameplayTags; // 0x3BBC(0x4)
		double SelectedPrimitiveDataFloat; // 0x3BC0(0x8)
		FGameplayTag GameplayCue_Death; // 0x3BC8(0x4)
		unsigned char UnknownData16_6[0x4]; // 0x3BCC(0x4) UNKNOWN PROPERTY
		TArray<UMaterialInterface*> OG_Materials; // 0x3BD0(0x10)
		bool NPC_Apply_GE_for_Swimming; // 0x3BE0(0x1)
		unsigned char UnknownData17_6[0x7]; // 0x3BE1(0x7) UNKNOWN PROPERTY
		UClass* NPC_GE_ClassToApplyForSwimming; // 0x3BE8(0x8)
		bool NPC_Apply_Water_Enter_Exit_Burst_GC; // 0x3BF0(0x1)
		unsigned char UnknownData18_6[0x3]; // 0x3BF1(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle NPC_GE_AppliedForSwimming; // 0x3BF4(0x8)
		FName GoalActorBBKey; // 0x3BFC(0x4)
		FGameplayTag GameplayCueLureInterest; // 0x3C00(0x4)
		unsigned char UnknownData19_6[0x4]; // 0x3C04(0x4) UNKNOWN PROPERTY
		UObject* NPC_PreviousLureGoal; // 0x3C08(0x8)
		FGameplayTag Enter_Water; // 0x3C10(0x4)
		FGameplayTag Exit_Water; // 0x3C14(0x4)
		FScalableFloat NPC_MaxDistanceFromDamagedNPCToDrawHeallthBarHF; // 0x3C18(0x28)
		FScalableFloat NPC_HealthBarHideTimeAfterDeathHF; // 0x3C40(0x28)
		FScalableFloat NPC_PlayEffectWhenLuredHF; // 0x3C68(0x28)
		FScalableFloat NPC_PawnCanInteractHF; // 0x3C90(0x28)
		FScalableFloat NPC_AllowInteractOnlyWhenUnawareHF; // 0x3CB8(0x28)
		FScalableFloat NPC_AllowInteractWhenHasLeaderHF; // 0x3CE0(0x28)
		FScalableFloat NPC_AllowDrownInShallowWaterHF; // 0x3D08(0x28)
		bool NPC_IsInventoryInitialized; // 0x3D30(0x1)
		unsigned char UnknownData20_6[0x3]; // 0x3D31(0x3) UNKNOWN PROPERTY
		float LeaderClearedCueDelay; // 0x3D34(0x4)
		FGameplayTag GameplayCue_LeaderCleared; // 0x3D38(0x4)
		bool isGCForLeaderSetLooping; // 0x3D3C(0x1)
		unsigned char UnknownData21_6[0x3]; // 0x3D3D(0x3) UNKNOWN PROPERTY
		FGameplayTag NPC_DeathByStormTag; // 0x3D40(0x4)
		bool NPC_TryDespawnAbility; // 0x3D44(0x1)
		unsigned char UnknownData22_6[0x3]; // 0x3D45(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GeOutsideSafeZoneDamageHandle; // 0x3D48(0x8)
		bool IsGEStormDamageInit; // 0x3D50(0x1)
		bool NPC_MeshScalingInProgress; // 0x3D51(0x1)
		bool NPC_DisableCapsuleOverlapsWhenScalingOut; // 0x3D52(0x1)
		unsigned char UnknownData23_6[0x5]; // 0x3D53(0x5) UNKNOWN PROPERTY
		FVector NPC_OriginalMeshScale; // 0x3D58(0x18)
		FMulticastInlineDelegate NPCScaleMeshInCompleted; // 0x3D70(0x10)
		FMulticastInlineDelegate NPCScaleMeshOutCompleted; // 0x3D80(0x10)
		bool NPC_CanDropLoot; // 0x3D90(0x1)
		unsigned char UnknownData24_6[0x7]; // 0x3D91(0x7) UNKNOWN PROPERTY
		FScalableFloat NPC_StaleDespawnTestDistance_HF; // 0x3D98(0x28)
		FScalableFloat NPC_StaleDespawnTimeThreshold_HF; // 0x3DC0(0x28)
		double NPC_LastNonStaleCheckTime; // 0x3DE8(0x8)
		bool bCanBeDamagedByNullInstigator; // 0x3DF0(0x1)
		bool IsEnteringWater; // 0x3DF1(0x1)
		unsigned char UnknownData25_6[0x6]; // 0x3DF2(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate NPCPawnInteractWithDispatcher; // 0x3DF8(0x10)
		bool NPCDynamicBlockConversionOnInteract; // 0x3E08(0x1)
		bool NPC_TempInteractOverride; // 0x3E09(0x1)
		unsigned char UnknownData26_6[0x6]; // 0x3E0A(0x6) UNKNOWN PROPERTY
		USoundBase* HeadShot_Sound; // 0x3E10(0x8)
		FName Headshot_FX_Socket; // 0x3E18(0x4)
		bool UseHeadShotFX; // 0x3E1C(0x1)
		unsigned char UnknownData27_6[0x3]; // 0x3E1D(0x3) UNKNOWN PROPERTY
		FGameplayTagContainer TC_WeaponTypesAllowedForHeadshotFX; // 0x3E20(0x20)
		bool AllowHeadshot; // 0x3E40(0x1)
		unsigned char UnknownData28_6[0x7]; // 0x3E41(0x7) UNKNOWN PROPERTY
		double AdditiveHitReactRetriggerDelay; // 0x3E48(0x8)
		UAnimMontage* Additive_Hit_React_Montage; // 0x3E50(0x8)
		USoundBase* Death_Normal_Sound; // 0x3E58(0x8)
		UParticleSystem* HeadshotFXEmitterTemplate; // 0x3E60(0x8)
		FGameplayTagContainer Sound_Library_Collection_Tags; // 0x3E68(0x20)
		FGameplayTagContainer Sound_Library_Default_Tags; // 0x3E88(0x20)
		FGameplayTagContainer Sound_Library_Alert_Tags; // 0x3EA8(0x20)
		FGameplayTagContainer Sound_Library_Aggressive_Tags; // 0x3EC8(0x20)
		TArray<USoundLibrary*> SoundLibs_Default; // 0x3EE8(0x10)
		TArray<USoundLibrary*> SoundLibs_Alert; // 0x3EF8(0x10)
		USoundLibrary* CurrentSoundLib; // 0x3F08(0x8)
		TArray<USoundLibrary*> SoundLibs_Aggressive; // 0x3F10(0x10)
		TArray<USoundLibrary*> SoundLibs_Foley; // 0x3F20(0x10)
		TArray<USoundLibrary*> SoundLibs_Foley_Water; // 0x3F30(0x10)
		USoundLibrary* CurrentFoleyLib; // 0x3F40(0x8)
		double Custom_Depth_Update_Rate; // 0x3F48(0x8)
		UClass* Class; // 0x3F50(0x8)
		UClass* GE_Converted; // 0x3F58(0x8)
		FActiveGameplayEffectHandle GE_Converted_Handle; // 0x3F60(0x8)
		double NPC_Death_Time; // 0x3F68(0x8)
		float ScaleMeshInOrOutPlayRate; // 0x3F70(0x4)
		bool AllowSkipScaleOutIfNotRecentlyRendered; // 0x3F74(0x1)
		unsigned char UnknownData29_6[0x3]; // 0x3F75(0x3) UNKNOWN PROPERTY
		FMulticastInlineDelegate NPCAlertLevelUpdated; // 0x3F78(0x10)
		FGameplayTagContainer GameplayTagsToBlockHitReact; // 0x3F88(0x20)
		FGameplayTag GCInstantDeathTag; // 0x3FA8(0x4)
		unsigned char UnknownData30_6[0x4]; // 0x3FAC(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate NPCPickupGrabInitiated; // 0x3FB0(0x10)
		UContextualAnimSceneAsset* CAS_Interaction_Petting; // 0x3FC0(0x8)
		UContextualAnimSceneAsset* CAS_Interaction_Feeding; // 0x3FC8(0x8)
		UContextualAnimSceneAsset* CAS_Interaction_Taming; // 0x3FD0(0x8)
		TWeakObjectPtr<UClass*> Athena_GameState_SoftClass; // 0x3FD8(0x20)
		FMulticastInlineDelegate NPCEnteredWaterBody; // 0x3FF8(0x10)
		bool NPC_Apply_Deep_Water_Enter_Exit_Burst_GC; // 0x4008(0x1)
		unsigned char UnknownData31_6[0x3]; // 0x4009(0x3) UNKNOWN PROPERTY
		FGameplayTag Enter_Deep_Water; // 0x400C(0x4)
		FGameplayTag Exit_Deep_Water; // 0x4010(0x4)
		bool NPC_Client_Apply_Water_Enter_Exit_Burst_GC; // 0x4014(0x1)
		unsigned char UnknownData32_6[0x3]; // 0x4015(0x3) UNKNOWN PROPERTY
		FGameplayTag GameplayCue_SystemInstantDeath; // 0x4018(0x4)
		bool RunningInstantDeathCue; // 0x401C(0x1)
		unsigned char UnknownData33_6[0x3]; // 0x401D(0x3) UNKNOWN PROPERTY
		FGameplayTag GCInstantDeathTagTwo; // 0x4020(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Parent.NPC_Pawn_Parent_C");
			return ret;
		}

		void Orphaned(bool& IsOrphaned, AFortPawn* AttachedPawn); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldRunInstantDeathCue(FGameplayTagContainer DeathTags, AActor* Instigator, AActor* DamageCauser, bool& Result); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC GetPreviousAlertLevelInfo(TEnumAsByte<Enum_NPC_AlertLevel>& AlertLevel, FGameplayTag& AlertLevelTag, bool& ValidDataFound); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC AlertLevelUpdatedClient(); // Flags: Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTrackedActorStateFromCurrentAlertLevel(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveLibraryCollection(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Check Tag(FGameplayTagContainer Tag Container, bool& ShouldDefault); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSoundLibraryCollection(bool AddLibraries, bool& ValidLibraries); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryShowHealthBar(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_NPC Death Time(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayStateChangeAudio(TEnumAsByte<Enum_NPC_AlertLevel> Index); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsConverted(bool& IsConverted); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC GhostCollisionSettings(bool NoCollisionForRanged, bool NoCollisionForMelee, bool NoCollisionForProjectiles, bool OnlyOverlapCollisionForPawns); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool CanUpdateSoundLib(TArray<USoundLibrary*>& TargetArray); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayAdditiveHitReacts(FVector& Hit Direction, UAnimMontage* Anim Montage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC DamageRemovesIdlePhaseTagGE(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetSoundFoleyLibrary(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC CanBeInteractedWith(bool& CanInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC CheckForDespawnIfStaleToPlayers(AFortPlayerPawn* ClosestFortPlayerPawn); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC SetCanDropLoot(bool CanDropLoot); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC GetSafeZonePhase(int32_t& SafeZonePhase); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_NPC Leader(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play Water Splash at Water Surface(AFortWaterBodyActor* Water Body, FGameplayTag GameplayCueTag); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetMaterialFromDeath(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_SelectedPrimitiveDataFloat(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckSoundLibraryRemoved(TArray<USoundLibrary*>& Libraries); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckSoundLibraryAdded(TArray<USoundLibrary*>& Libraries); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSoundLibrary(TEnumAsByte<Enum_NPC_AlertLevel> Alert Level); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ClearOutTargetSlots(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC UpdateInteract(bool CanInteract, bool& EnabledInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC HasLeader?(bool& HasLeader?, AActor* Leader); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC SetLeader(AActor* Leader, bool& Success?, AActor* LeaderSet); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC AttemptToSetLeader(AActor* PossibleLeader, EUnconvertReason UnconvertReason); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPrimitiveDataFloat(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SelectPrimitiveDataFloat(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StoreOriginalGravityAndRotation(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC DisableIntroPhaseBehavior(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC DamageAttemptDisableIntroPhaseBehavior(FGameplayTagContainer DamageTags); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC TargetSlotIsUsingOverride(TEnumAsByte<Enum_NPC_TargetSlots> TargetSlotType, AActor* TargetWeWantToSlotOnto, bool& Override); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC TargetSlotInfo(TEnumAsByte<Enum_NPC_TargetSlots> TargetSlotType, AActor* TargetWeWantToSlotOnto, int32_t& TargetSlotCount, int32_t& TargetSlotMax, int32_t& NPC TargetSlotsRequired, bool& TargetSlotsMaxOrMore, bool& TargetSlotCountIsExactlyMax, bool& NPC IsTargetSlotOwner, bool& NPC HasSpaceToSlotOnTarget, TEnumAsByte<Enum_NPC_TargetSlots>& TargetSlotTypeOut, UClass* TargetSlotCountingGE, FScalableFloat& AI TargetSlotSizeHF, FScalableFloat& AI TargetSlotDurationHF, UClass* TargetSlotOverrideGE, UClass* TargetSlotOwnerGE, UClass* TargetSlotCountingMaxedGE); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC CheckIsInSafeZone(bool& TestSucceeded, bool& isInSafeZone); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC HandleAlertLevelVoice(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC TryToDropLootOnDeath(FGameplayTagContainer DamageTags, bool& CanDropLoot); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ApplyGameplayEffectWithMMRScaling(AActor* Actor, UClass* GE Class); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC SetLootCollectionPhaseCompleteToBlackboard(bool LootCollectionPhaseComplete); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ResetOriginalRotationRate(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ResetOriginalGravityScale(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC SetReturnGatheredLootToBlackboard(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC GetScalableFloatHotfixValue(FScalableFloat& ScalableFloatHotfix, double AtLevel, bool& AsBool, int32_t& AsIntRounded, double& AsFloat); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ScalableFloatIsValid(FScalableFloat& ScalableFloat, bool& Valid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC PickupDropped(AFortPickup* FortPickupDropped); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC PickupGrabbed_Destroyed(AActor* ActorGrabbed); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC PickupGrabbed(AFortPickup* FortPickupGrabbed); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_NPC BestLootRarityInInventory(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC SendGameplayCuePickupGrabbed(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC PawnDebugMessage(FString String, bool OnlyWhenDebug); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC GetInventoryInformation(bool& HasItemInInventory, int32_t& TotalNumberOfInventoryItems, int32_t& LastInventoryItemIndex, bool& HasEnoughItemsToDeliver, bool& ConsumedEnoughItemsToBeConsideredFull); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC SetBestLootRarityInInventory(EFortRarity& NPC BestLootRarityInInventory); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_NPC_AlertLevel(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC GetAlertLevelInfo(TEnumAsByte<Enum_NPC_AlertLevel>& AlertLevel, FGameplayTag& AlertLevelTag, bool& ValidDataFound); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ApplyRecentlyDamagedTagGE(UClass* RecentlyDamagedOverride); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldUpdateSkeletalMesh(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScaleMeshInOrOut__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScaleMeshInOrOut__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WidgetVisibilityChanged(bool bVisible); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC ParentLaunchVehicle(AActor* Vehicle, FVector Velocity); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TestLoot(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC UpdateHealthBarComponentVisibility(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceivePossessed(AController* NewController); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RequestUpdateNPCAlertLevel(TEnumAsByte<Enum_NPC_AlertLevel> NPC_AlertLevel, TEnumAsByte<Enum_NPC_ModifyAlertLevelReason> Reason); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCAlertLevelChangedClient(TEnumAsByte<Enum_NPC_AlertLevel> NPC_AlertLevel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC InitializeIdleVO(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerIdleVO(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCEnableHealthBars(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCDisableHealthBars(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_AlertLevel_ForceLevel(TEnumAsByte<Enum_NPC_AlertLevel> NewNPC_AlertLevel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_AlertLevel_ClearDebug(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_ForceAlertLevel_Invalid(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_ForceAlertLevel_Unaware(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_ForceAlertLevel_NA(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_ForceAlertLevel_Alerted(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Debug_ForceAlertLevel_Aggressive(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleInteracts(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC Pawn Interact(AFortAIPawn* AI, AFortPlayerController* InteractingPlayerController, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On NPC PawnInteractedWith(AActor* AIPawn, AFortPlayerPawn* InteractingPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginDeepWaterInteraction(FVector WaterSurfaceLocation, float WaterDepth, AWaterBody* WaterBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC LeaderSet(bool Success?, AActor* Leader, EUnconvertReason UnconvertReason); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TestIsInSafeZone(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GrantStartingItems(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryToDespawnDueToStorm(bool Reset Timer); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeTestInSafeZone(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DespawnDueToStorm(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamageServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerDeathFX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEndDance(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginDance(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void End Music Tracker(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BeginMusicTracker(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopUpdatingHealthBarWidget(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveSoundSystemLibraries(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddSoundSystemLibraries(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeInventory(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartUpdatingHleathBarWidget(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC AlertLevelChangedServer(TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPawnHealthChanged_Event(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredWaterBody(AFortWaterBodyActor* WaterBody, bool bIsFirstBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedWaterBody(AFortWaterBodyActor* WaterBody, bool bIsLastBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LuredOnServer(TEnumAsByte<Enum_NPC_AlertLevel> AlertLevel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LuredInterest(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayEnterWaterSplash(AFortWaterBodyActor* Water Body); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayExitWaterSplash(AFortWaterBodyActor* Water Body); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryWaterInteractionDrown(bool CalledFromDeepWaterInteraction); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopTestingIsInSafeZone(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCScaleMeshIn(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCScaleMeshOut(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerDespawnAbility(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC MulticastGameplayCueDeath(bool ShouldRunInstantDeathCue); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSoundLibFoley(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AdditiveHitReactDelay(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateCustomDepth(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEndDeepWaterInteraction(FVector PreviousWaterSurfaceLocation, float WaterDepth, AWaterBody* WaterBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ForceUpdateCustomDepth(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredWaterBodyClient(AFortWaterBodyActor* WaterBody, bool bIsFirstBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedWaterBodyClient(AFortWaterBodyActor* WaterBody, bool bIsLastBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NPC_Pawn_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCEnteredWaterBody__DelegateSignature(AFortWaterBodyActor* Water Body, bool Entering Water ?); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCPickupGrabInitiated__DelegateSignature(AFortPickup* FortPickupGrabbed); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCAlertLevelUpdated__DelegateSignature(TEnumAsByte<Enum_NPC_AlertLevel> NPC Alert Level); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCPawnInteractWithDispatcher__DelegateSignature(AActor* AIPawn, AFortPlayerPawn* InteractingPlayerPawn); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCScaleMeshOutCompleted__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCScaleMeshInCompleted__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C
	// Inherited from ANPC_Pawn_Parent_C -> AFortAIPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x1AC (0x41D0 - 0x4024)
	class ANPC_Pawn_Wildlife_Parent_C : public ANPC_Pawn_Parent_C	
	{
	public:
		unsigned char UnknownData00_3[0x4]; // 0x4024(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x4028(0x8)
		UFortCharacterPartsComponent* FortCharacterParts; // 0x4030(0x8)
		UNiagaraComponent* Wildlife_FootDust; // 0x4038(0x8)
		UFortPawnComponent_Convert* ConvertComponent; // 0x4040(0x8)
		TWeakObjectPtr<UClass*> Layer_Idle; // 0x4048(0x20)
		TWeakObjectPtr<UClass*> Layer_Locomotion; // 0x4068(0x20)
		TWeakObjectPtr<UClass*> Layer_Jump; // 0x4088(0x20)
		char LeaderTeam; // 0x40A8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x40A9(0x7) UNKNOWN PROPERTY
		USoundEffectSourcePresetChain* VocalSourceEffectChainOverride; // 0x40B0(0x8)
		bool bTamingEnabled; // 0x40B8(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x40B9(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnPickupGrabbed_Destroyed; // 0x40C0(0x10)
		bool bCanBeInteractedWithWhileTamed; // 0x40D0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x40D1(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GE_Quest_Converted_Handle; // 0x40D4(0x8)
		unsigned char UnknownData04_6[0x4]; // 0x40DC(0x4) UNKNOWN PROPERTY
		UClass* GE_Quest_Converted_Irwin; // 0x40E0(0x8)
		FMulticastInlineDelegate ConvertedDispatcher; // 0x40E8(0x10)
		bool bIsBeingRidden; // 0x40F8(0x1)
		bool NPCStatusWidgetShouldDisplayDamage; // 0x40F9(0x1)
		unsigned char UnknownData05_6[0x6]; // 0x40FA(0x6) UNKNOWN PROPERTY
		UClass* GE_GoalSelectionWhileTamed; // 0x4100(0x8)
		FGameplayTagContainer T_GoalSelectionWhileTamed; // 0x4108(0x20)
		double CurrentEnergy; // 0x4128(0x8)
		FGameplayTag IrwinSlidingGC; // 0x4130(0x4)
		bool bLeaderSetSuccess; // 0x4134(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x4135(0x3) UNKNOWN PROPERTY
		FGameplayTag JumpLandSoundLibTag; // 0x4138(0x4)
		FGameplayTag TameSoundLibTag; // 0x413C(0x4)
		USoundBase* SoundIndicatorSound_Unridden; // 0x4140(0x8)
		USoundBase* SoundIndicatorSound_Ridden; // 0x4148(0x8)
		bool OverrideIncomingDmg; // 0x4150(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x4151(0x7) UNKNOWN PROPERTY
		double OverridenIncomingDmgAmount; // 0x4158(0x8)
		FMulticastInlineDelegate OnModifiedDamageReceived; // 0x4160(0x10)
		double ColorVariation; // 0x4170(0x8)
		char Default_Unconvert_Reason; // 0x4178(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x4179(0x7) UNKNOWN PROPERTY
		FScalableFloat StuckBouncing_UnstuckEnabled; // 0x4180(0x28)
		int32_t StuckBouncing_LaunchCount; // 0x41A8(0x4)
		int32_t StuckBouncing_MinLaunchCount; // 0x41AC(0x4)
		FActiveGameplayEffectHandle StuckBouncing_GeHandle; // 0x41B0(0x8)
		UClass* StuckBouncing_GE; // 0x41B8(0x8)
		double StuckBouncing_UnstuckVelocityMaxZRotationAngle; // 0x41C0(0x8)
		double StuckBouncing_UnstuckVelocity; // 0x41C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Pawns/NPC/Parents/NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C");
			return ret;
		}

		void ApplyVariation(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetColorVariation(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVector OnLaunchCharacter(FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryShowHealthBar(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintCanInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayStateChangeAudio(TEnumAsByte<Enum_NPC_AlertLevel> Index); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayAdditiveHitReacts(FVector& Hit Direction, UAnimMontage* Anim Montage); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		float BlueprintModifyIncomingDamage(float Damage, FGameplayTagContainer& DamageTags, FGameplayEffectContextHandle& EffectContext, AController* EventInstigator, AActor* DamageCauser); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPCStatusWidget_UpdateKeepVisible(bool ShouldKeepVisible); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CanBeInteractedWithWhenTamed(bool& bCanInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC PickupGrabbed_Destroyed(AActor* ActorGrabbed); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTamingEnabled(bool EnableTaming); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC CanBeInteractedWith(bool& CanInteract); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AttachAndApplyVocalFX(FSoundLibraryPlayResult& SoundLibraryResult); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play Water Splash at Water Surface(AFortWaterBodyActor* Water Body, FGameplayTag GameplayCueTag); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsValidAutoFireTarget(AActor* Attacker); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play Sound Lib(FGameplayTag Event Name); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTamingIndicator(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_LeaderTeam(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_9DC5FDA543FAF13BB29E95AA78B28A06(UClass* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LinkAnimationLayers(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AsyncLinkAnimationLayer(TWeakObjectPtr<UClass*> AnimationLayer); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCustomizationsLoaded_BP(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On NPC PawnInteractedWith(AActor* AIPawn, AFortPlayerPawn* InteractingPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_0_ConvertedEvent__DelegateSignature(AFortPawn* InstigatorPawn, AFortPawn* ConvertedPawn); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(AFortPawn* UnconvertedPawn, EUnconvertReason UnconvertReason); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC AlertLevelChangedServer(TEnumAsByte<Enum_NPC_AlertLevel> NPCAlertLevel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC LeaderSet(bool Success?, AActor* Leader, EUnconvertReason UnconvertReason); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SoundLibrary_Component_K2Node_ComponentBoundEvent_2_OnSoundLibraryPlayEvent__DelegateSignature(FSoundLibraryPlayResult& Results, USoundLibraryContext* Context); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeingControlledChanged(bool bControlled); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnApplyEffectOptimization(int32_t NewBudgetValue); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NPC UpdateHealthBarComponentVisibility(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPawnHealthChanged_Event(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Pawn Focused(AFortPawn* FocusedPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideStatus(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSlidingStateChanged(bool bNewSlidingState); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLanded(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOutOfConvertResistanceServer(float ConvertDamageDone, FGameplayTagContainer& SourceTags, FGameplayEffectContextHandle& EffectContext, AController* EffectInstigator, AActor* EffectCauser); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RestoreConvertResistance(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CE_UpdateSurfaceType(UActorComponent* Component, bool bReset); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Customization Applied(TScriptInterface<Class> Value); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NPC_Pawn_Wildlife_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnModifiedDamageReceived__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ConvertedDispatcher__DelegateSignature(bool Converted, AFortPawn* InstigatorPawn); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPickupGrabbed_Destroyed__DelegateSignature(ANPC_Pawn_Wildlife_Parent_C* WildlifePawn, AActor* ActorGrabbed); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C
	// Inherited from AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0xF8 (0x5D60 - 0x5C68)
	class APlayerPawn_Athena_Generic_Parent_C : public AFortPlayerPawnAthena	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x5C68(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x5C70(0x8)
		UMotionWarpingComponent* MotionWarping; // 0x5C78(0x8)
		UMultiInteractActorComponent_C* MultiInteractActorComponent; // 0x5C80(0x8)
		TArray<UMaterialInterface*> Default_Weapon_Materials; // 0x5C88(0x10)
		TArray<UMaterialInstanceDynamic*> PawnBackpackMaterials; // 0x5C98(0x10)
		TArray<UMaterialInstanceDynamic*> PawnHatMaterials; // 0x5CA8(0x10)
		TArray<UMaterialInstanceDynamic*> PawnHeadMaterials; // 0x5CB8(0x10)
		TArray<UMaterialInstanceDynamic*> PawnBodyMaterials; // 0x5CC8(0x10)
		TArray<UMaterialInstanceDynamic*> PawnCharmMaterials; // 0x5CD8(0x10)
		TArray<UMaterialInstanceDynamic*> PawnFaceMaterials; // 0x5CE8(0x10)
		UPostProcessComponent* PlayerPostProcessFX; // 0x5CF8(0x8)
		TArray<USkeletalMeshComponent*> SkeletalMeshes; // 0x5D00(0x10)
		TArray<UMaterialInstanceDynamic*> PawnMaterials_ALL; // 0x5D10(0x10)
		FMulticastInlineDelegate ShootingTargetReactToJump; // 0x5D20(0x10)
		FMulticastInlineDelegate OnPlayHit; // 0x5D30(0x10)
		FMulticastInlineDelegate OnEnteredVehicleDispatcher; // 0x5D40(0x10)
		FMulticastInlineDelegate OnExitedVehicleDispatcher; // 0x5D50(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PlayerPawn_Athena_Generic_Parent.PlayerPawn_Athena_Generic_Parent_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredVehicle(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedVehicle(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnJumped(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerPawn_Athena_Generic_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedVehicleDispatcher__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredVehicleDispatcher__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPlayHit__DelegateSignature(AActor* SelfActor, AActor* OtherActor, FVector NormalImpulse, FHitResult& Hit); // Flags: Public|Delegate|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShootingTargetReactToJump__DelegateSignature(AFortPlayerPawnAthena* JumpingPlayer); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C
	// Inherited from APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x2C0 (0x6020 - 0x5D60)
	class APlayerPawn_Athena_Generic_C : public APlayerPawn_Athena_Generic_Parent_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5D60(0x8)
		UParticleSystemComponent* Effect_WaterInteraction_FX; // 0x5D68(0x8)
		bool IsInWater; // 0x5D70(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x5D71(0x7) UNKNOWN PROPERTY
		FRotator RunWalkParticleRotation; // 0x5D78(0x18)
		int32_t WaterCounter; // 0x5D90(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x5D94(0x4) UNKNOWN PROPERTY
		double Tick_Delta_Seconds; // 0x5D98(0x8)
		USoundBase* Sound_Shield_Impact; // 0x5DA0(0x8)
		USoundBase* Sound_Shield_Destroyed; // 0x5DA8(0x8)
		USoundBase* Sound_Shield_Destroyed_1P; // 0x5DB0(0x8)
		USoundBase* Sound_Shield_FullyCharged; // 0x5DB8(0x8)
		USoundBase* Sound_Shield_StartRecharge; // 0x5DC0(0x8)
		bool BodyValid; // 0x5DC8(0x1)
		bool BackpackValid; // 0x5DC9(0x1)
		bool HatValid; // 0x5DCA(0x1)
		bool FaceValid; // 0x5DCB(0x1)
		bool CharmValid; // 0x5DCC(0x1)
		bool HeadValid; // 0x5DCD(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x5DCE(0x2) UNKNOWN PROPERTY
		TArray<UMaterialInstanceDynamic*> TempArray; // 0x5DD0(0x10)
		USceneComponent* Sound_Player_Hit; // 0x5DE0(0x8)
		UClass* SpeechBubbleWidgetClass; // 0x5DE8(0x8)
		FText LastSpeechText; // 0x5DF0(0x10)
		double Time_when_you_ll_be_able_to_splash_again; // 0x5E00(0x8)
		AActor* CurrentWaterMeshActor; // 0x5E08(0x8)
		FHitResult WaterTraceHitLocation; // 0x5E10(0xF8)
		FVector StableVelocityVector; // 0x5F08(0x18)
		UParticleSystem* PlayerRunTemplate_Ground; // 0x5F20(0x8)
		UParticleSystem* PlayerWalkTemplate_Ground; // 0x5F28(0x8)
		UParticleSystem* PlayerRunTemplate_Water; // 0x5F30(0x8)
		UParticleSystem* PlayerWalkTemplate_Water; // 0x5F38(0x8)
		USkeletalMesh* Pawn_Charm_Skeletal_Mesh; // 0x5F40(0x8)
		UMaterialInterface* WeaponMaterialOverride; // 0x5F48(0x8)
		bool TickWaterLevel; // 0x5F50(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x5F51(0x7) UNKNOWN PROPERTY
		UTextureRenderTarget2D* WetnessDepthTexture; // 0x5F58(0x8)
		UMaterialInstanceDynamic* WaterLevelMID; // 0x5F60(0x8)
		UMaterialInstanceDynamic* WaterDecayMID; // 0x5F68(0x8)
		bool Was_RTT_Enabled_Var_Set; // 0x5F70(0x1)
		bool Is_RTT_Enabled; // 0x5F71(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x5F72(0x6) UNKNOWN PROPERTY
		double StartingMinCapsuleShadowVis; // 0x5F78(0x8)
		double InstigatorCheckDistanceSqrd; // 0x5F80(0x8)
		double SlideDustActivateSpeed; // 0x5F88(0x8)
		bool CanSpawnSlideKickupFX_; // 0x5F90(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x5F91(0x7) UNKNOWN PROPERTY
		UParticleSystem* Effect_Player_ShieldActivate; // 0x5F98(0x8)
		UParticleSystem* Effect_PLayer_ShieldBreak; // 0x5FA0(0x8)
		bool GhostMode; // 0x5FA8(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x5FA9(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate AnimNotify_Begin; // 0x5FB0(0x10)
		FMulticastInlineDelegate AnimNotify_End; // 0x5FC0(0x10)
		USoundBase* Sound_Shield_Destroyed_2D; // 0x5FD0(0x8)
		USoundBase* Sound_Shield_Destroyed_Crit_2D; // 0x5FD8(0x8)
		FMulticastInlineDelegate PlayDamageEffect; // 0x5FE0(0x10)
		double ReppedCapsuleExtraHalfHeight; // 0x5FF0(0x8)
		double CachedCapsuleHalfHeight; // 0x5FF8(0x8)
		FMulticastInlineDelegate OnCharacterPartsMIDInitialized; // 0x6000(0x10)
		USkeletalMeshComponent* NullPart_Mesh; // 0x6010(0x8)
		UNiagaraSystem* Effect_PLayer_ShieldBreak_LW; // 0x6018(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PlayerPawn_Athena_Generic.PlayerPawn_Athena_Generic_C");
			return ret;
		}

		void Melee_Effect_Color(FVector& Melee_Color_Set); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_CapsuleEnlarged(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayShieldDestroyedSound(FGameplayCueParameters& GameplayCueParameters); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReInitFrontendPetDisplay(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Are the wind and water RTT passes enabled(bool& NewParam); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DisableWaterLevelTick(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Create and Duplicate Effect Poseable Skeletal Mesh(UMaterialInterface* Material to Apply, TArray<UMaterialInstanceDynamic*>& Empty MID Array, int32_t TranslucentSortPriority, UPoseableMeshComponent* PoseableMesh, TEnumAsByte<EFortCustomPartType> CustomBodyType, USkeletalMeshComponent* PartMesh); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SlaveAMeshToTheBody(USkeletalMeshComponent* Mesh, USkeletalMeshComponent* Master); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Create and Duplicate Effect Skeletal Meshes Parent(USkeletalMeshComponent* DuplicatedSkeletalMeshComponent, UMaterialInterface* Material to Apply, TArray<UMaterialInstanceDynamic*>& Empty MID Array, int32_t TranslucentSortPriority, USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> CustomBodyType); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingRight(bool First Right); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingLeft(bool First Left); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingRight_End(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingLeft_End(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLanded(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponEquipped(AFortWeapon* NewWeapon, AFortWeapon* PrevWeapon); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharacterPartsReinitialized(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Exited/Entered WaterVolume(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CharacterDestroyed(AActor* DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BindOnDestroyed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimTrailsNotify(bool bActive); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimTrailsDisable(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.SpookyMist.Loop(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Shield.PotionConsumed(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Damage.Shielded(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Shield.Destroyed(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Shield.Reapplied(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Loop.Shadow.Bomb(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ToggleLandFX(bool NewHidden); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMovementStyleChanged(TEnumAsByte<EFortMovementStyle> PreviousMovementStyle, TEnumAsByte<EFortMovementStyle> NewMovementStyle); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Hide VFX In Frontend Hologram(bool isFrontEndHologram); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPart(AFortPlayerPawn* Pawn, UCustomCharacterPart* Part, USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPartApplied(AFortPlayerPawn* Pawn, UCustomCharacterPart* Part, USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerPawn_Athena_Generic(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharacterPartsMIDInitialized__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayDamageEffect__DelegateSignature(FGameplayTagContainer Damage Tags, FHitResult Hit Info, AFortPawn* Instigated By, AActor* Damage Causer); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_End__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_Begin__DelegateSignature(bool bActive); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C
	// Inherited from APlayerPawn_Athena_Generic_C -> APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x9CC (0x69EC - 0x6020)
	class APlayerPawn_Athena_C : public APlayerPawn_Athena_Generic_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x6020(0x8)
		UFortContrailsComponent* FortContrails; // 0x6028(0x8)
		UFortUnderwaterDamageComponent* FortUnderwaterDamage; // 0x6030(0x8)
		float Timeline_0_BlendWeight_A4943458400C3662DB243099F9EAC7E8; // 0x6038(0x4)
		TEnumAsByte<ETimelineDirection> Timeline_0__Direction_A4943458400C3662DB243099F9EAC7E8; // 0x603C(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x603D(0x3) UNKNOWN PROPERTY
		UTimelineComponent* Timeline; // 0x6040(0x8)
		USkeletalMeshComponent* TargetHead; // 0x6048(0x8)
		USkeletalMeshComponent* TargetBody; // 0x6050(0x8)
		TArray<UMaterialInterface*> PawnHeadMaterials; // 0x6058(0x10)
		TArray<UMaterialInterface*> PawnBodyMaterials; // 0x6068(0x10)
		FGameplayTagContainer TC_FlakVest; // 0x6078(0x20)
		FGameplayEventData Event_Data; // 0x6098(0xB0)
		FGameplayTag EventSpawnEffect; // 0x6148(0x4)
		bool IsMale; // 0x614C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x614D(0x3) UNKNOWN PROPERTY
		AFortWeapon* MenuGoingCommandowWeapon; // 0x6150(0x8)
		USoundBase* SafeZonePassThroughSound; // 0x6158(0x8)
		bool bHasBeenOutsideSafeZone; // 0x6160(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x6161(0x3) UNKNOWN PROPERTY
		FLinearColor ThreatColor; // 0x6164(0x10)
		unsigned char UnknownData03_6[0x4]; // 0x6174(0x4) UNKNOWN PROPERTY
		USoundBase* PlayerKilledSound; // 0x6178(0x8)
		UParticleSystemComponent* WindDebrisParticles; // 0x6180(0x8)
		UParticleSystemComponent* FallingRainParticles; // 0x6188(0x8)
		UParticleSystemComponent* StormAuraParticles; // 0x6190(0x8)
		FVector LightningSpawnLocation; // 0x6198(0x18)
		double LightningIntensityMin; // 0x61B0(0x8)
		double LightningIntensityMax; // 0x61B8(0x8)
		AActor* SafeZoneActor; // 0x61C0(0x8)
		double LightningIntensity; // 0x61C8(0x8)
		UPointLightComponent* RandomLightningLight; // 0x61D0(0x8)
		double LightningTimelinePlaySpeedMin; // 0x61D8(0x8)
		double LightningTimelinePlaySpeedMax; // 0x61E0(0x8)
		double LightningFlashDiameter; // 0x61E8(0x8)
		double LightningFlashHeight; // 0x61F0(0x8)
		double LightningFlashRepeatDelayMin; // 0x61F8(0x8)
		double LightningFlashRepeatDelayMax; // 0x6200(0x8)
		AEmitterCameraLensEffectBase* RainCameraLensParticles; // 0x6208(0x8)
		double _ChanceOfLightningMesh; // 0x6210(0x8)
		bool ShowInvulnerableVisuals; // 0x6218(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x6219(0x7) UNKNOWN PROPERTY
		UAudioComponent* StormAudioLoop_Inst; // 0x6220(0x8)
		double StormAudioVolume; // 0x6228(0x8)
		UAudioComponent* FallingAudioLoop_Inst; // 0x6230(0x8)
		bool bIsPlayingFallingSound; // 0x6238(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x6239(0x7) UNKNOWN PROPERTY
		double PlayerAttributes_Speed_Walk; // 0x6240(0x8)
		double PlayerAttributes_Speed_Run; // 0x6248(0x8)
		double PlayerAttributes_Speed_Sprint; // 0x6250(0x8)
		int32_t MaxTrailsLOD; // 0x6258(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x625C(0x4) UNKNOWN PROPERTY
		UPostProcessComponent* MobilePostProcess; // 0x6260(0x8)
		bool bIsOutsideSafeZoneCached; // 0x6268(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x6269(0x7) UNKNOWN PROPERTY
		TArray<UMaterialInstanceDynamic*> ResOutMaterials; // 0x6270(0x10)
		ADuplicateResOutMesh_C* RezInFXActor; // 0x6280(0x8)
		bool bQueueRezIn; // 0x6288(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x6289(0x7) UNKNOWN PROPERTY
		ADuplicateResOutMesh_C* RezOutFXActor; // 0x6290(0x8)
		bool bQueueRezOut; // 0x6298(0x1)
		bool bWasEverInWarmUp; // 0x6299(0x1)
		bool bStormAudioCleanedUp; // 0x629A(0x1)
		unsigned char UnknownData09_6[0x5]; // 0x629B(0x5) UNKNOWN PROPERTY
		FTransform Box_Local_Transform; // 0x62A0(0x60)
		double BoundsRadius; // 0x6300(0x8)
		UPointLightComponent* TeleportationPointLight; // 0x6308(0x8)
		double MaxLightIntensity; // 0x6310(0x8)
		FName Socket_MeshTop; // 0x6318(0x4)
		FName Socket_MeshBot; // 0x631C(0x4)
		FName MIDParam_Transition; // 0x6320(0x4)
		FName MIDParam_DissolvePercent; // 0x6324(0x4)
		FName MIDParam_DissolveDirection; // 0x6328(0x4)
		FName MIDParam_DissolveBaseLoc; // 0x632C(0x4)
		FName MIDParam_DissolveDistance; // 0x6330(0x4)
		FName MIDParam_DissolveFirstSpawn; // 0x6334(0x4)
		UMaterialInterface* Mat_CharacterDissolve; // 0x6338(0x8)
		TArray<UMaterialInstanceDynamic*> DissolveMIDs; // 0x6340(0x10)
		bool bUseNewTeleportFX; // 0x6350(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x6351(0x3) UNKNOWN PROPERTY
		FGameplayTag OutsideSafeZoneGameplayCueTag; // 0x6354(0x4)
		int32_t SafeZonePhase; // 0x6358(0x4)
		int32_t WhichSafeZoneTag; // 0x635C(0x4)
		bool bOutsideSafeZoneGameplayCueActive; // 0x6360(0x1)
		unsigned char UnknownData11_6[0x7]; // 0x6361(0x7) UNKNOWN PROPERTY
		FScalableFloat SafeZoneDamageScalableFloat; // 0x6368(0x28)
		bool bFrontendPartyInProgress; // 0x6390(0x1)
		bool bLockOnInteractionComplete; // 0x6391(0x1)
		unsigned char UnknownData12_6[0x6]; // 0x6392(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate ResIn; // 0x6398(0x10)
		FMulticastInlineDelegate ResOut; // 0x63A8(0x10)
		FMulticastInlineDelegate SwingRight; // 0x63B8(0x10)
		FMulticastInlineDelegate SwingLeft; // 0x63C8(0x10)
		bool bSkeletalArrayReady; // 0x63D8(0x1)
		unsigned char UnknownData13_6[0x3]; // 0x63D9(0x3) UNKNOWN PROPERTY
		int32_t CurDissolveSetupAttempt; // 0x63DC(0x4)
		USoundBase* DBNOEnterSound; // 0x63E0(0x8)
		FMulticastInlineDelegate onFadeToWhiteTeleported; // 0x63E8(0x10)
		bool Is_Ashton; // 0x63F8(0x1)
		unsigned char UnknownData14_6[0x7]; // 0x63F9(0x7) UNKNOWN PROPERTY
		UParticleSystemComponent* Ashton; // 0x6400(0x8)
		FMulticastInlineDelegate SwingRightEnd; // 0x6408(0x10)
		FMulticastInlineDelegate SwingLeftEnd; // 0x6418(0x10)
		FGameplayTag PhoneGhostCue; // 0x6428(0x4)
		FGameplayTag WhiteoutCue; // 0x642C(0x4)
		FGameplayTag OutsideSafeZoneCue; // 0x6430(0x4)
		FGameplayTag OutsideSafeZone2Cue; // 0x6434(0x4)
		FGameplayTag OutsideSafeZone3Cue; // 0x6438(0x4)
		bool PlayRespawnFXOnSpawn; // 0x643C(0x1)
		unsigned char UnknownData15_6[0x3]; // 0x643D(0x3) UNKNOWN PROPERTY
		AFortPlayerPawnAthena* PlayerPawnAthena; // 0x6440(0x8)
		FMulticastInlineDelegate SwingRight2; // 0x6448(0x10)
		FMulticastInlineDelegate SwingLeft2; // 0x6458(0x10)
		bool TestProceduralWaterInIsolation; // 0x6468(0x1)
		bool Is_First_Water_Body; // 0x6469(0x1)
		bool Is_Last_Water_Body; // 0x646A(0x1)
		unsigned char UnknownData16_6[0x5]; // 0x646B(0x5) UNKNOWN PROPERTY
		double AccumulatedNormalizedDiveSpeed; // 0x6470(0x8)
		FGameplayTag WaterSprintBoostTag; // 0x6478(0x4)
		unsigned char UnknownData17_6[0x4]; // 0x647C(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate CCPM_isHiddenInProp; // 0x6480(0x10)
		TMap<UObject*, FPawnHighlight> PawnHighlights; // 0x6490(0x50)
		FPawnHighlight Current_Highlight; // 0x64E0(0x30)
		UObject* Current_Highlight_Source; // 0x6510(0x8)
		FPawnHighlight Invulnerable_Highlight; // 0x6518(0x30)
		bool IsGalileo; // 0x6548(0x1)
		unsigned char UnknownData18_6[0x7]; // 0x6549(0x7) UNKNOWN PROPERTY
		FScalableFloat HotFixSnow; // 0x6550(0x28)
		TSet<FName> NoSnowPlaylists; // 0x6578(0x50)
		FGameplayTag GalileoPlaylistTag; // 0x65C8(0x4)
		unsigned char UnknownData19_6[0x4]; // 0x65CC(0x4) UNKNOWN PROPERTY
		TArray<UMaterialInstanceDynamic*> WeaponMIDs; // 0x65D0(0x10)
		int32_t AmountOfTimesToAttemptRestoreMats; // 0x65E0(0x4)
		FGameplayTag TC_PawnAthenaNPC; // 0x65E4(0x4)
		double HitGlowBrightnessScalar; // 0x65E8(0x8)
		TArray<UMaterialInterface*> CurrentWeaponMaterials; // 0x65F0(0x10)
		TArray<USkeletalMeshComponent*> CurrentWeaponMeshes; // 0x6600(0x10)
		TArray<UMaterialInstanceDynamic*> WeaponDissolveMIDs; // 0x6610(0x10)
		double HitGlowBrightnessScalar_Mobile; // 0x6620(0x8)
		FGameplayTag TC_PawnAthenaDecoy; // 0x6628(0x4)
		unsigned char UnknownData20_6[0x4]; // 0x662C(0x4) UNKNOWN PROPERTY
		double ScaleRate; // 0x6630(0x8)
		FGameplayTagContainer TetherQuestTag; // 0x6638(0x20)
		FName FirefliesTag; // 0x6658(0x4)
		unsigned char UnknownData21_6[0x4]; // 0x665C(0x4) UNKNOWN PROPERTY
		FTransform RightSideRim_Transform; // 0x6660(0x60)
		USpotLightComponent* Right_Side_Rim_Light; // 0x66C0(0x8)
		double Rim_light_Shadow_Bias; // 0x66C8(0x8)
		double Rim_Light_Intensity; // 0x66D0(0x8)
		FRotator PlayerAimRotation; // 0x66D8(0x18)
		FScalableFloat ControlRotationReplicationTickRate; // 0x66F0(0x28)
		FGameplayTag Elimination_Rez_Sequence_GC; // 0x6718(0x4)
		FGameplayTag Creative_Respawn_Teleportation_GC; // 0x671C(0x4)
		FGameplayTag Teleport_In_GC; // 0x6720(0x4)
		unsigned char UnknownData22_6[0x4]; // 0x6724(0x4) UNKNOWN PROPERTY
		double RimLightDistanceFromCamera; // 0x6728(0x8)
		FLinearColor Rim_Light_Color___Night; // 0x6730(0x10)
		FLinearColor Rim_Light_Color___Day; // 0x6740(0x10)
		FGameplayTag PhoneModeratorModeGameplayCue; // 0x6750(0x4)
		FGameplayTag PhoneInvulnerableGameplayCue; // 0x6754(0x4)
		bool Swinging_HandsUp; // 0x6758(0x1)
		bool Swinging_LockedToHip; // 0x6759(0x1)
		unsigned char UnknownData23_6[0x6]; // 0x675A(0x6) UNKNOWN PROPERTY
		double InputDragCoefficient; // 0x6760(0x8)
		bool ToggleSwingNativized; // 0x6768(0x1)
		unsigned char UnknownData24_6[0x7]; // 0x6769(0x7) UNKNOWN PROPERTY
		UAudioComponent* SwingingSound; // 0x6770(0x8)
		UCurveFloat* Swinging_ReelingInCurve; // 0x6778(0x8)
		UCurveFloat* Swinging_NotReelingInCurve; // 0x6780(0x8)
		FVector Swinging_OriginalVecToTarget; // 0x6788(0x18)
		bool Swinging_ReelingIn; // 0x67A0(0x1)
		unsigned char UnknownData25_6[0x7]; // 0x67A1(0x7) UNKNOWN PROPERTY
		double Swinging_Goal_Length; // 0x67A8(0x8)
		UCurveFloat* Swinging_ReelingTimeCurve; // 0x67B0(0x8)
		bool Swinging_ColliderBigger; // 0x67B8(0x1)
		unsigned char UnknownData26_6[0x7]; // 0x67B9(0x7) UNKNOWN PROPERTY
		TArray<FAudioParameter> SoundParams; // 0x67C0(0x10)
		bool Swinging_UseNewRotationAlgorithm; // 0x67D0(0x1)
		unsigned char UnknownData27_6[0x7]; // 0x67D1(0x7) UNKNOWN PROPERTY
		FVector AttachedWallInverseNormal; // 0x67D8(0x18)
		FVector VelocityOnSlideStart; // 0x67F0(0x18)
		double SlideStartTime; // 0x6808(0x8)
		double MaxSlideTime; // 0x6810(0x8)
		UCurveVector* WallSlidingVelocityMultiplierCurve; // 0x6818(0x8)
		UCurveFloat* WallSlidingAddedDownwardVelocityMultiplierCurve; // 0x6820(0x8)
		double WallSlidingAddedDownwardVelocityMax; // 0x6828(0x8)
		FVector AttachedWallNormal; // 0x6830(0x18)
		FVector WallSlidingVelocity; // 0x6848(0x18)
		double DesiredDistanceToAttachedWall; // 0x6860(0x8)
		double MinGroundSlopeToLeaveAttachedWall; // 0x6868(0x8)
		FFortGameplayAbilityMontageInfo OverrideSearchMontageInfo; // 0x6870(0x58)
		bool Is_Hidding_CharacterParrts; // 0x68C8(0x1)
		unsigned char UnknownData28_6[0x7]; // 0x68C9(0x7) UNKNOWN PROPERTY
		double RimlightCVARBoost; // 0x68D0(0x8)
		bool Rimlight_Enabled; // 0x68D8(0x1)
		unsigned char UnknownData29_6[0x7]; // 0x68D9(0x7) UNKNOWN PROPERTY
		FString LCVar_Name; // 0x68E0(0x10)
		APhysicalRimlight_C* PhysicalRimlightActor; // 0x68F0(0x8)
		FScalableFloat UGC_RimLightIntensity; // 0x68F8(0x28)
		USoundBase* SFX_WaterExit_3P; // 0x6920(0x8)
		USoundBase* SFX_WaterExit_1P; // 0x6928(0x8)
		USoundBase* SFX_WaterEntry_3P; // 0x6930(0x8)
		USoundBase* SFX_WaterEntry_1P; // 0x6938(0x8)
		FScalableFloat EnableDecayRow; // 0x6940(0x28)
		double CeilingHeight; // 0x6968(0x8)
		FVector BAProtoVelocity; // 0x6970(0x18)
		FScalableFloat HF_TetherMultiplierHorz; // 0x6988(0x28)
		FScalableFloat HF_TetherMultiplierVert; // 0x69B0(0x28)
		FGameplayTag Teleport_In_GC_Frontend; // 0x69D8(0x4)
		unsigned char UnknownData30_6[0x4]; // 0x69DC(0x4) UNKNOWN PROPERTY
		FTimerHandle Re_apply_Highlight_Timer; // 0x69E0(0x8)
		FGameplayTag Style_Transfer_GC_Frontend; // 0x69E8(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/PlayerPawn_Athena.PlayerPawn_Athena_C");
			return ret;
		}

		void PlayDeathEffects(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UGC BindRimLightIntensityChange(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UGC InitRimlightIntensity(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRimlightIntensity(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMaterialRimlightIntensity(double Multiplier); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPhysicalRimlightIntensity(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Rimlight Setup(FString CVarName); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetRightAxis(double& Return Value); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetForwardAxis(double& Return Value); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AttemptToSetRimLight(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetPawnIsInLocalSquad(bool& IsInLocalSquad); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Swinging_AttachLocation(FVector& Location, bool& AttachPointExists); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Swinging_ResetMeshTransform(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Swinging_SetJumpHeight(double Jump ZVelocity); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsSwingGrounded(bool& IsSwingingGrounded); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVector SwingingVectorToAttachPoint(FString caller ID); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Swinging_StopReelingIn(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Swinging_StartReelingIn(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVector Swing_GetStartPoint(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsSwingAttached(bool& IsSwingAttached); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingDetached(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingAttached(FVector AttachLocation, AActor* AttachedActor); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsSwinging(bool& IsSwinging); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Swinging_CheckGrounded(bool& Grounded?, FVector& HitNormal, double& Distance); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_UpdateCustomMovement(float DeltaTime); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void handleCvarsUpdated(FString CVarName); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_PlayerAimRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetAimPoint(FRotator& ControlRotation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool PawnIsDecoy(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool PawnIsNPC(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveSkeletalMeshComponentsFromWeaponObject(AFortWeapon* WeaponObject); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddSkeletalMeshComponentsFromWeaponObject(AFortWeapon* WeaponObject); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GalileoMaterialSetup(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Get Highest Priority Highlight(UObject* Source, FPawnHighlight& Top Priority); // Flags: Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Highlight Pawn from Source(UObject* Source, FPawnHighlight Highlight, bool Only Update If Current); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Remove Pawn Highlight from Source(UObject* Source); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyPawnHighlight(UObject* Source, FPawnHighlight HitGlow); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_PlayRespawnFXOnSpawn(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LockonSearchCompleteTimedOut(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLockOnSearchCompleted(bool& bConsumeEvent); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPartyInProgress(bool bIsPartyInProgress); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CleanUpTeleportationFXLight(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RestoreCharacterMats(bool& bFullyCompleted); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPetHidden(bool NewHidden); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupDissolveFx(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CleanupDissolveFX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateDissolveFx(double Scalar_Transition, double Scalar_ZHeight, double Scalar_LightIntensity); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnTeleportationLight(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FindBounds(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void QueueTeleportOut(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void QueueTeleportIn(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStartLongInteract(AActor* ReceivingActor, bool& Out_bConsumeEvent, bool& Out_bSkipSetInteractDuration, bool& Out_bSkipStartAnimation, EItemInteractionType& Out_ItemInteractionType); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InWarmup(bool& bInWarmup); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopLoopingAudio(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EnableWaterAudio(bool Is Entering Water); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetLocationInCircle_XY(FVector& LocationLocalSpace); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_0__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_0__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnReady_978607004CDEB137CACF38831BECEF40(AFortGameStateAthena* GameState, UFortPlaylist* Playlist, FGameplayTagContainer& PlaylistContextTags); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SafeZoneStatusChanged(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Athena.Equipping(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceivePossessed(AController* NewController); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Athena.Player.BeingRevivedFromDBNO(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveStormFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.Activation.DBNOResurrect(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredWaterVolume(FVector& WaterSurfaceLocation); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedWaterVolume(FVector& WaterSurfaceLocation); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NotifyTeammateSkydivedFromBus(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLeftReplayRelevancy(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredReplayRelevancy(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharacterCustomizationCompleted(AFortPlayerPawn* Pawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnResInDuringWarmup(); // Flags: BlueprintCosmetic|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddStormFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSafeZonePhaseAndGameplayCueTag(int32_t InSafeZonePhase, bool bSpawnGameplayCue); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSafeZoneTagWhenChanged(int32_t NewWhichSafeZoneTag, FGameplayTag GameplayTag, bool bSpawnGameplayCue); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOutsideSafeZonePhaseChanged(int32_t SafeZonePhase); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveSafeZoneGameplayCue(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnReceivedStormSurgeDamage(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingLeft(bool First Left); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingRight(bool First Right); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Abilities.Activation.DBNOEnter(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ActivateInvincibleVisuals(double duration); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Athena.Reloading(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TeleportInNSeconds(double SecondsTillTeleport, FVector DestLocation, FRotator DestRotation); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClientRunSnowGC(bool Instant); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WhiteoutAndTeleport(FVector DestLocation, FRotator DestRotation, bool Instant, double Gravity); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Athena.Boost(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreativeStopGhost(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreativeStartGhost(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingLeft_End(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MeleeSwingRight_End(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddSafeZoneGameplayCue(); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveSafeZoneGameplayCueServerToClient(); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSuccessfulBuildingEdit(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play Respawn FX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSpawnImmunityTimeReset(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredWaterBody(AFortWaterBodyActor* WaterBody, bool bIsFirstBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedWaterBody(AFortWaterBodyActor* WaterBody, bool bIsLastBody); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginWaterSprintBoost(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void isHiddingInProp(bool IsHidden); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLandscapeCheckFailedAndTeleported(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ScalePlayerUp(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ScalePlayerDown(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTetheredExitPressed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTetheredExitReleased(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTetherStarted(APawn* LastTetherPawn); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTetherEnded(APawn* LastTetherPawn); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartAImRotationTick(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EndRotationTick(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReplicateAimRotation(FRotator PlayerAimRotation); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AimTick(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Damage(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Healing(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Damage.Shielded(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Shield.PotionConsumed(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupColdTag(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyColdTag(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyColdTag_Retry(UFortAbilitySystemComponent* AbilitySystemComponent, AFortPlayerPawn* AffectedPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreativeModeratorModeActivate(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreativeModeratorModeDeactivate(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreativeStartInvulnerable(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCreativeStopInvulnerable(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddHighlightFromSource(UObject* Source, FPawnHighlight Highlight, bool OnlyUpdateIfCurrent); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveHighlightFromSource(UObject* Source); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDisplayHitNotify(float DamageDealt, bool bCriticalHit, bool bFatalHit, bool bShieldHit, AActor* HitActor, FGameplayTagContainer HitTags, FVector HitLocation); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Hide Character Parts(bool IsHidden); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPart(AFortPlayerPawn* Pawn, UCustomCharacterPart* Part, USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDBNOStateChanged_Event(AFortPawn* FortPawn, bool bInIsDBNO); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredOrExitedWaterVolume(bool bEntered, FVector WaterSurfaceLocation); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayWaterEnterExitAudioAndFX(FVector WaterSurfaceLocation); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMovementStyleChanged(TEnumAsByte<EFortMovementStyle> PreviousMovementStyle, TEnumAsByte<EFortMovementStyle> NewMovementStyle); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharacterPartsReinitialized(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Event Materials Refreshed(AFortPlayerPawn* PlayerPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnResInDuringStyleTransference(); // Flags: BlueprintCosmetic|Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Re-apply Highlight(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerPawn_Athena(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CCPM_isHiddenInProp__DelegateSignature(bool IsHidden); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingLeft2__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingRight2__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingLeftEnd__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingRightEnd__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void onFadeToWhiteTeleported__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingLeft__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SwingRight__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResOut__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResIn__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/Phoebe/BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C
	// Inherited from APlayerPawn_Athena_C -> APlayerPawn_Athena_Generic_C -> APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x18 (0x6A04 - 0x69EC)
	class ABP_PlayerPawn_Athena_Phoebe_C : public APlayerPawn_Athena_C	
	{
	public:
		unsigned char UnknownData00_3[0x4]; // 0x69EC(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x69F0(0x8)
		FName AIEvaluator_CharacterLaunchedKeyName; // 0x69F8(0x4)
		bool bUseCosmeticVariants; // 0x69FC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x69FD(0x3) UNKNOWN PROPERTY
		int32_t CosmeticVariantID; // 0x6A00(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Phoebe/BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C");
			return ret;
		}

		void ComputeCosmeticVariantID(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AssignCosmeticVariant(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharacterCustomizationCompleted(AFortPlayerPawn* Pawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/GameplayCueNotifies/GCN_Athena_PlayerLevelUp.GCN_Athena_PlayerLevelUp_C
	// Inherited from UFortGameplayCueNotify_Burst -> UGameplayCueNotify_Static -> UObject
	// Size: 0x0 (0x218 - 0x218)
	class UGCN_Athena_PlayerLevelUp_C : public UFortGameplayCueNotify_Burst	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCN_Athena_PlayerLevelUp.GCN_Athena_PlayerLevelUp_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C
	// Inherited from ABP_PlayerPawn_Athena_Phoebe_C -> APlayerPawn_Athena_C -> APlayerPawn_Athena_Generic_C -> APlayerPawn_Athena_Generic_Parent_C -> AFortPlayerPawnAthena -> AFortPlayerPawn -> AFortPawn -> AFGF_Character -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x264 (0x6C68 - 0x6A04)
	class ABP_PlayerPawn_NonParticipant_C : public ABP_PlayerPawn_Athena_Phoebe_C	
	{
	public:
		unsigned char UnknownData00_3[0x4]; // 0x6A04(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x6A08(0x8)
		UFortPawnComponent_AIPatrol* FortPawnComponent_AIPatrol; // 0x6A10(0x8)
		UFortAthenaAlertStateComponent* FortAthenaAlertState; // 0x6A18(0x8)
		UAudioComponent* VOAudioComponent; // 0x6A20(0x8)
		bool UseAlertness; // 0x6A28(0x1)
		bool UseVO; // 0x6A29(0x1)
		bool UseIdleVO; // 0x6A2A(0x1)
		bool UseDropExtraLootOnDeath; // 0x6A2B(0x1)
		bool UseFullBodyHitReact; // 0x6A2C(0x1)
		bool UseChangedTargetReplication; // 0x6A2D(0x1)
		bool UseAlertSound; // 0x6A2E(0x1)
		EAlertLevel AlertLevel; // 0x6A2F(0x1)
		EAlertLevel OldAlertLevel; // 0x6A30(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x6A31(0x3) UNKNOWN PROPERTY
		FGameplayTag GameplayCueAlertState; // 0x6A34(0x4)
		UClass* GE_NPC_Status_Stressed_Infinite; // 0x6A38(0x8)
		UClass* GE_NPC_Status_Stressed_Cooldown; // 0x6A40(0x8)
		double MinDistanceToTargetToPlayCombatAlertAnimation; // 0x6A48(0x8)
		FScalableFloat MinIdleVODelay; // 0x6A50(0x28)
		FScalableFloat MaxIdleVODelay; // 0x6A78(0x28)
		FName LootTierNameToSpawnWhenDead; // 0x6AA0(0x4)
		FName LootTier_Medium; // 0x6AA4(0x4)
		FName LootTier_Shell; // 0x6AA8(0x4)
		FName LootTier_Heavy; // 0x6AAC(0x4)
		FName LootTier_Light; // 0x6AB0(0x4)
		FName LootTier_Rockets; // 0x6AB4(0x4)
		UFortGameplayDataTrackerComponentManager* DataTrackerComponentManager; // 0x6AB8(0x8)
		FGameplayTag AlertLevelUnawareTag; // 0x6AC0(0x4)
		FGameplayTag AlertLevelAlertedTag; // 0x6AC4(0x4)
		FGameplayTag AlertLevelAggressiveTag; // 0x6AC8(0x4)
		FGameplayTag TC_DisguiseTag; // 0x6ACC(0x4)
		UClass* GE_RemoveDisguise; // 0x6AD0(0x8)
		UFortAbilitySet* HitReactAbilitySet; // 0x6AD8(0x8)
		UAnimMontage* DefaultFullbodyHitReactionMontage; // 0x6AE0(0x8)
		UFortPatrolAnimAsset* CurrentPatrolAnimAsset; // 0x6AE8(0x8)
		UClass* PatrolLayerAnimBP; // 0x6AF0(0x8)
		TArray<FFortPatrolAnimSetWeaponPair> PatrolAnimSetPairs; // 0x6AF8(0x10)
		bool bShouldDoFullAnimationUpdate; // 0x6B08(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x6B09(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GEDuelHandle; // 0x6B0C(0x8)
		unsigned char UnknownData03_6[0x4]; // 0x6B14(0x4) UNKNOWN PROPERTY
		UClass* GE_DuelTag; // 0x6B18(0x8)
		AFortPlayerPawn* Challenger; // 0x6B20(0x8)
		UClass* OverrideLayerAnimBP; // 0x6B28(0x8)
		UFortPatrolAnimAsset* FallbackPatrolAnimAsset; // 0x6B30(0x8)
		bool bIsInVehicleThatSupportsNoAlertState; // 0x6B38(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x6B39(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle GE_Quest_Converted_Handle; // 0x6B3C(0x8)
		unsigned char UnknownData05_6[0x4]; // 0x6B44(0x4) UNKNOWN PROPERTY
		UClass* GE_Quest_Converted_HireNPC; // 0x6B48(0x8)
		USoundBase* DeathFX_Sound; // 0x6B50(0x8)
		AFortPawn* PawnConverter; // 0x6B58(0x8)
		FGameplayTagContainer TagsToApplyOnConvertedPawn; // 0x6B60(0x20)
		FGameplayTagContainer TagsToApplyOnConvertingPawn; // 0x6B80(0x20)
		USoundLibrary* PawnSoundLibrary; // 0x6BA0(0x8)
		bool RemoveTagsOnUnconverted; // 0x6BA8(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x6BA9(0x7) UNKNOWN PROPERTY
		UFortAbilitySet* GASToApplyOnConvertedPawn; // 0x6BB0(0x8)
		bool RemoveGASOnUnconverted; // 0x6BB8(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x6BB9(0x7) UNKNOWN PROPERTY
		FFortAbilitySetHandle HNDL_EquippedAbilitySet; // 0x6BC0(0x38)
		AActor* NewTargetActor; // 0x6BF8(0x8)
		FMulticastInlineDelegate OnTargetChanged; // 0x6C00(0x10)
		FMulticastInlineDelegate OnAlertLevelChanged; // 0x6C10(0x10)
		FMulticastInlineDelegate OnDeath; // 0x6C20(0x10)
		FTimerHandle IdleVOTimerHandle; // 0x6C30(0x8)
		FScalableFloat UseMotionMatchingForPatrols; // 0x6C38(0x28)
		FGameplayTag TagEventVOTrigger; // 0x6C60(0x4)
		FGameplayTag VOSoundBankTag; // 0x6C64(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C");
			return ret;
		}

		void OnRep_VOSoundBankTag(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayDeathEffects(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetNPCAnimSpeedScalar(double SpeedScalar); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SoundLibrarySetup(bool IsAdding); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePawnUnconverted(AFortPawn* UnconvertedPawn); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePawnConverted(AFortPawn* InstigatorPawn, AFortPawn* ConvertedPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayAlertLevelVO(EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleAlertStateUpdates(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_bIsInVehicleThatSupportsNoAlertState(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateAlertStateVehicleCheck(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClientOnTargetChanged(AActor* NewTarget); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetIconPlacement(AActor* SelfActor, AActor* ViewingActor, FVector& OutLocation, FVector& OutExtents); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClientOnAlertLevelChanged(EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeAnimInstanceSettings(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdatePatrolAnimSet(AFortWeapon* NewWeapon); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCurrentFullbodyHitReactionMontage(UAnimMontage* CurrentMontage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetDataTrackerActorStateFromAlertLevel(EAlertLevel AlertLevel); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DataTrackerSetup(bool Is Registering); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupLootTierNameWithWeapon(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AlertLevelChanged(EAlertLevel OldAlertLevel, EAlertLevel InputPin); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayVoiceComponentSoundByTag(FGameplayTag SoundBankTag, UAudioComponent* AudioComponent); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetAlertedStateGameplayCue(bool Alerted, bool Combat); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_NewTargetActor(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_AlertLevel(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_B49137724EF50A4A93D3CD91A40FC1F7(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AttemptPlayVocalReinforcementSound(FGameplayTagContainer MetadataTagContainer); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDBNOStateChanged_Event(AFortPawn* FortPawn, bool bInIsDBNO); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ActivateAlertDBNOCleanUp(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAlertLEvelCHangedEvent(AFortAthenaAIBotController* BotController, EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerIdleVO(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponEquipped(AFortWeapon* NewWeapon, AFortWeapon* PrevWeapon); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult& Hit); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCharacterCustomizationCompleted(AFortPlayerPawn* Pawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GameplayCue.Player.Interrogation.Voice.PickedUp(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponAttachmentChangedDelegate_Event(AFortWeapon* NewWeapon, AFortWeapon* PrevWeapon); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChallengerDied(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetChallenger(AFortPlayerPawn* Challenger); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LinkPatrolAnimLayer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LinkOverrideAnimLayer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAnimInputEvent(UFortAnimInputEvent* AnimInputEvent); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReLinkAnimLayer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayVoiceSoundByTag(FGameplayTag SoundBankTag); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnteredVehicleEvent(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedVehicleEvent(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_PlayerPawn_NonParticipant_ConvertComponent_K2Node_ComponentBoundEvent_1_ConvertedEvent__DelegateSignature(AFortPawn* InstigatorPawn, AFortPawn* ConvertedPawn); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(AFortPawn* UnconvertedPawn, EUnconvertReason UnconvertReason); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitedVehicle(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDied_Event(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AiTargetChanged(AActor* OldTarget, AActor* NewTarget); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetActorForInteraction(AActor* ForwardInteractionActor); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Multicast Play Voice Sound By Tag(FGameplayTag SoundBankTag); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ListenForVOEvent(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_PlayerPawn_NonParticipant(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeath__DelegateSignature(EDeathCause Cause); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAlertLevelChanged__DelegateSignature(EAlertLevel OldAlertLevel, EAlertLevel NewAlertLevel); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTargetChanged__DelegateSignature(AActor* NewTarget); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/AI/NPCs/Base/Abilities/GAB_ApplyFullBodyHit_NonParticipant.GAB_ApplyFullBodyHit_NonParticipant_C
	// Inherited from UGAB_GenericApplyFullBodyHit_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x0 (0xBB1 - 0xBB1)
	class UGAB_ApplyFullBodyHit_NonParticipant_C : public UGAB_GenericApplyFullBodyHit_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/NPCs/Base/Abilities/GAB_ApplyFullBodyHit_NonParticipant.GAB_ApplyFullBodyHit_NonParticipant_C");
			return ret;
		}

		void PickFullBodyHitMontageSection(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/GameplayCueNotifies/GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C
	// Inherited from AFortGameplayCueNotifyAthena_AIAlertState -> AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x58 (0xAA8 - 0xA50)
	class AGCNL_AthenaAI_NonParticipant_AlertState_C : public AFortGameplayCueNotifyAthena_AIAlertState	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA50(0x8)
		FLinearColor IconColorAlert; // 0xA58(0x10)
		FLinearColor IconColorThreatend; // 0xA68(0x10)
		double AnimationLength; // 0xA78(0x8)
		FLinearColor IconColorAlertInner; // 0xA80(0x10)
		USoundBase* Hostile_Combat_Sound; // 0xA90(0x8)
		USoundBase* SearchingSound; // 0xA98(0x8)
		USoundBase* Non_hostile_Combat_Sound; // 0xAA0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/GameplayCueNotifies/GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C");
			return ret;
		}

		void AnimateAlertIcon(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play Alert Sound(AActor* TargetedActor); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnApplication(AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, ULegacyCameraShake* BurstCameraShakeInstance, ADecalActor* BurstDecalInstance); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnIconVisible(AActor* Target); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/QuestInteractables/AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaQuestFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/QuestInteractables/AthenaQuestFunctionLibrary.AthenaQuestFunctionLibrary_C");
			return ret;
		}

		void Athena_PlayQuestRewardFeedback_WithSoundAtQuestActorLocation(bool PlayFX_onPlayer?, USoundBase* Success_Sound, UNiagaraSystem* Success_Niagara, UForceFeedbackEffect* Success_Shake, AActor* QuestActor, AFortPlayerPawn* PlayerPawn, FTransform Effect_Transform, UObject* __WorldContext); // Flags: Static|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_CheckActorHasTags(AActor* TargetActor, FGameplayTagContainer TagsToCheck, bool OnlyExactMatch, UObject* __WorldContext, bool& bDidActorHaveTags); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_PartyAssistCheck(AFortPlayerController* PlayerController, FName ObjectiveBackendName, UObject* __WorldContext, bool& bIsAssistingObjective, bool& bIsValidPlayerController); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_PlayQuestRewardFeedback(bool PlayFX_onPlayer?, USoundBase* Success_Sound, UNiagaraSystem* Success_Niagara, UForceFeedbackEffect* Success_Shake, AActor* QuestActor, AFortPlayerPawn* PlayerPawn, FTransform Effect_Transform, UObject* __WorldContext); // Flags: Static|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool Athena_IsCreativeOrPlaygroundPlaylist(FGameplayTagContainer& TagContainer, UObject* __WorldContext); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_CheckCreativeMode(AGameStateBase* InGameState, UObject* __WorldContext, bool& CanCompleteQuest); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_QuestObjectiveCounter(AFortPlayerController* FortPlayerControllerAthena, UFortQuestItemDefinition* ObjectiveItem, FDataTableRowHandle ObjectiveStat, UObject* __WorldContext, int32_t& QuestCountAchieved, int32_t& QuestCountRequired, bool& CountSuccessfullyReturned); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_GiveQuestUpdateToPlayers(UFortQuestItemDefinition* InQuestItemRef, FName ObjectiveBackendName, FDataTableRowHandle ObjectiveStatEvent, TArray<AFortPlayerController*>& PlayerControllersForUpdate, UObject* __WorldContext); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_CheckQuestAndObjectiveCompletionMP(TArray<AFortPlayerController*>& InPlayerControlle, UFortQuestItemDefinition* InQuestItemRef, FName ObjectiveBackendName, UObject* __WorldContext, bool& QuestIsValid, bool& QuestCompleted, bool& ObjectiveCompleted); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_CheckQuestAndObjectiveCompletion(AFortPlayerController* InPlayerControlle, UFortQuestItemDefinition* InQuestItemRef, FName ObjectiveBackendName, UObject* __WorldContext, bool& QuestIsValid, bool& QuestCompleted, bool& ObjectiveCompleted); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena_HasPlayerCompletedQuest(AFortPlayerController* InPlayerControlle, UFortQuestItemDefinition* InQuestItemRef, UObject* __WorldContext, bool& HasQuest, bool& QuestCompleted); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Athena Has Quest(AFortPlayerController* InPlayerControlle, UFortQuestItemDefinition* InQuestItemRef, UObject* __WorldContext, bool& PlayerHasQuest); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Cosmetics/Sprays/BP_SprayDecal.BP_SprayDecal_C
	// Inherited from AFortSprayDecalInstance -> ABuildingSMActor -> ABuildingActor -> AActor -> UObject
	// Size: 0xB2 (0xC82 - 0xBD0)
	class ABP_SprayDecal_C : public AFortSprayDecalInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xBD0(0x8)
		double DecalFadeoutTime; // 0xBD8(0x8)
		UDecalComponent* EmissiveDecal; // 0xBE0(0x8)
		UMaterialInstanceDynamic* EmissiveDecalMID; // 0xBE8(0x8)
		double DecalSize; // 0xBF0(0x8)
		UMaterialInterface* EmissiveMatSource; // 0xBF8(0x8)
		double DecalDepth; // 0xC00(0x8)
		UAthenaSprayItemDefinition* SprayAsset; // 0xC08(0x8)
		int32_t LoadsOutstanding; // 0xC10(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xC14(0x4) UNKNOWN PROPERTY
		TWeakObjectPtr<UTexture2D*> DecalTextureOverrideSoft; // 0xC18(0x20)
		UTexture2D* DecalTextureOverride; // 0xC38(0x8)
		FLinearColor BannerPrimaryColor; // 0xC40(0x10)
		FLinearColor BannerSecondaryColor; // 0xC50(0x10)
		AFortPlayerController* SpawningPlayerController; // 0xC60(0x8)
		TArray<AActor*> NearbyBuildingActors; // 0xC68(0x10)
		double SpawnStartTimeDelay; // 0xC78(0x8)
		bool bIsFrontEndPreview; // 0xC80(0x1)
		bool bDestroyOnTrapPlaced; // 0xC81(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Cosmetics/Sprays/BP_SprayDecal.BP_SprayDecal_C");
			return ret;
		}

		void Initialize Spray Spawned from Gameplay(double InDecalSize, UAthenaSprayItemDefinition* InSprayAsset, AFortPlayerController* InSpawningPlayerController); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddBoxCollisionForCreative(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FindNearbyBuildingActorsAndBindDelegates(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UnbindAndClearNearbyBuildingActors(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_DecalFadeoutTime(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FUniqueNetIdRepl GetInstigatorPlayerId(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CreateDecalComponents(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_F8AB699B4D8DD22B5A0409B608B7D6FA(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_F925FF00475A018319C73E9FB1540BC6(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnReady_B252FED346EAB98D54D786BD15C1CC7B(AFortGameStateAthena* GameState, UFortPlaylist* Playlist, FGameplayTagContainer& PlaylistContextTags); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSprayAssetReplicatedDown(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSprayInfoReady(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartSprayFadeOutDueToNewPlacement(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNearbyWallDied(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNearbyWallDamaged(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBounceOccurs(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNearbyTrapPlaced(ABuildingTrap* Trap, bool bDetatched); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PostLevelSaveSpawnCleanup(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWallDestoryed(AActor* DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_SprayDecal(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_FallDamageImmunityFX.GE_Athena_ZipLine_FallDamageImmunityFX_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_ZipLine_FallDamageImmunityFX_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_FallDamageImmunityFX.GE_Athena_ZipLine_FallDamageImmunityFX_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp_NoJump.GE_Athena_HidingProp_ExitingProp_NoJump_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_ExitingProp_NoJump_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp_NoJump.GE_Athena_HidingProp_ExitingProp_NoJump_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava.GE_SurfaceChange_Lava_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava.GE_SurfaceChange_Lava_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Chrome_Surface.GE_SurfaceChange_Chrome_Surface_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Chrome_Surface_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Chrome_Surface.GE_SurfaceChange_Chrome_Surface_C");
			return ret;
		}
	};


	// Class /Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Shield.GE_SiphonEffect_Shield_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SiphonEffect_Shield_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Shield.GE_SiphonEffect_Shield_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GE_DudeBro_Vent.GE_DudeBro_Vent_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DudeBro_Vent_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GE_DudeBro_Vent.GE_DudeBro_Vent_C");
			return ret;
		}
	};


	// Class /Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Heal.GE_SiphonEffect_Heal_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SiphonEffect_Heal_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Heroes/Abilities/Siphon/GE_SiphonEffect_Heal.GE_SiphonEffect_Heal_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_Passive.GE_Athena_ZipLine_Passive_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_ZipLine_Passive_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GE_Athena_ZipLine_Passive.GE_Athena_ZipLine_Passive_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GE_WilliePete_PlayerLaunch_ApplyGC.GE_WilliePete_PlayerLaunch_ApplyGC_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_WilliePete_PlayerLaunch_ApplyGC_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/GE_WilliePete_PlayerLaunch_ApplyGC.GE_WilliePete_PlayerLaunch_ApplyGC_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_BlockMovement.GA_Athena_HidingProp_BlockMovement_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_Athena_HidingProp_BlockMovement_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_BlockMovement.GA_Athena_HidingProp_BlockMovement_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_HidingProp_BlockMovement(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_GettingInProp.GE_Athena_HidingProp_GettingInProp_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_GettingInProp_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_GettingInProp.GE_Athena_HidingProp_GettingInProp_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Suppress.GE_SurfaceChange_Ice_Suppress_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Ice_Suppress_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Suppress.GE_SurfaceChange_Ice_Suppress_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered_PassiveTriggered.GA_Athena_Tethered_PassiveTriggered_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x14 (0xB54 - 0xB40)
	class UGA_Athena_Tethered_PassiveTriggered_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTag GCN_BoostTag; // 0xB48(0x4)
		FGameplayTag GCN_JumpTag; // 0xB4C(0x4)
		FGameplayTag ZiplineExit; // 0xB50(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered_PassiveTriggered.GA_Athena_Tethered_PassiveTriggered_C");
			return ret;
		}

		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Tethered_PassiveTriggered(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/DrivableVehicles/GE_AthenaInVehicle.GE_AthenaInVehicle_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_AthenaInVehicle_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GE_AthenaInVehicle.GE_AthenaInVehicle_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp.GE_Athena_HidingProp_ExitingProp_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_ExitingProp_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_ExitingProp.GE_Athena_HidingProp_ExitingProp_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Sand_Surface.GE_SurfaceChange_Sand_Surface_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Sand_Surface_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/Sand/GE_SurfaceChange_Sand_Surface.GE_SurfaceChange_Sand_Surface_C");
			return ret;
		}
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_DBNO_HealthBonus.GE_Athena_DBNO_HealthBonus_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_DBNO_HealthBonus_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_DBNO_HealthBonus.GE_Athena_DBNO_HealthBonus_C");
			return ret;
		}
	};


	// Class /Game/Athena/DrivableVehicles/GA_AthenaExitVehicle.GA_AthenaExitVehicle_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x58 (0xB98 - 0xB40)
	class UGA_AthenaExitVehicle_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTag Keep_DBNO_players_in_Vehicles; // 0xB48(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB4C(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer Event_Damage_Died_Tags; // 0xB50(0x20)
		FVehicleExitData VehicleExitData; // 0xB70(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_AthenaExitVehicle.GA_AthenaExitVehicle_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_AthenaExitVehicle(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/DrivableVehicles/GA_AthenaEnterVehicle.GA_AthenaEnterVehicle_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_AthenaEnterVehicle_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_AthenaEnterVehicle.GA_AthenaEnterVehicle_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_AthenaEnterVehicle(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/Props/B_WilliePete_WaterBodyChild.B_WilliePete_WaterBodyChild_C
	// Inherited from AFortWaterBodyActor -> AWaterBody -> AActor -> UObject
	// Size: 0x10 (0x408 - 0x3F8)
	class AB_WilliePete_WaterBodyChild_C : public AFortWaterBodyActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3F8(0x8)
		UArrowComponent* Debug; // 0x400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/Props/B_WilliePete_WaterBodyChild.B_WilliePete_WaterBodyChild_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_WilliePete_WaterBodyChild(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GA_SurfaceChange_Ice_IceCheckOnTimer.GA_SurfaceChange_Ice_IceCheckOnTimer_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x20 (0xB60 - 0xB40)
	class UGA_SurfaceChange_Ice_IceCheckOnTimer_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn* FortPlayerPawn; // 0xB48(0x8)
		FTimerHandle TraceTimer; // 0xB50(0x8)
		FTimerHandle OffIceTimer; // 0xB58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GA_SurfaceChange_Ice_IceCheckOnTimer.GA_SurfaceChange_Ice_IceCheckOnTimer_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TraceForTerrain(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveIceGE(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_SurfaceChange_Ice_IceCheckOnTimer(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/ThrownConsumables/IceGrenade/GA_Athena_RemoveIceFeetOnWater.GA_Athena_RemoveIceFeetOnWater_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x10 (0xB50 - 0xB40)
	class UGA_Athena_RemoveIceFeetOnWater_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn* Fort_Player_Pawn; // 0xB48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ThrownConsumables/IceGrenade/GA_Athena_RemoveIceFeetOnWater.GA_Athena_RemoveIceFeetOnWater_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Movement Mode Changed(ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_RemoveIceFeetOnWater(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/DrivableVehicles/GA_Vehicle_ExitHoldEvent.GA_Vehicle_ExitHoldEvent_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x30 (0xB70 - 0xB40)
	class UGA_Vehicle_ExitHoldEvent_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTag EquippingCue; // 0xB48(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB4C(0x4) UNKNOWN PROPERTY
		AFortPlayerController* PlayerController; // 0xB50(0x8)
		UAbilityTask_WaitGameplayEvent* OnHoldExitStartedAsyncTask; // 0xB58(0x8)
		UAbilityTask_WaitGameplayEvent* OnHoldExitStoppedAsyncTask; // 0xB60(0x8)
		FActiveGameplayEffectHandle GameplayEffectHandle; // 0xB68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_Vehicle_ExitHoldEvent.GA_Vehicle_ExitHoldEvent_C");
			return ret;
		}

		void EventReceived_7AE1D485464AEC7EB429C3877D33AF69(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_209BF560404B83EBEAA8DD8090C443AC(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Enter Vehicle Passenger(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Enter Vehicle Driver(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Fully Exit Vehicle(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Vehicle_ExitHoldEvent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/ForagedItems/Rift/GE_Rift_Athena_Teleport.GE_Rift_Athena_Teleport_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Rift_Athena_Teleport_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/ForagedItems/Rift/GE_Rift_Athena_Teleport.GE_Rift_Athena_Teleport_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ThrownConsumables/GE_ThrownConsumable_InWindup.GE_ThrownConsumable_InWindup_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ThrownConsumable_InWindup_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ThrownConsumables/GE_ThrownConsumable_InWindup.GE_ThrownConsumable_InWindup_C");
			return ret;
		}
	};


	// Class /Game/Athena/HUD/Duel/GA_DuelObserver.GA_DuelObserver_C
	// Inherited from UFortGameplayAbility_ObserveDuels -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB58 - 0xB50)
	class UGA_DuelObserver_C : public UFortGameplayAbility_ObserveDuels	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Duel/GA_DuelObserver.GA_DuelObserver_C");
			return ret;
		}

		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDuelChange(EDuelState NewDuelState, FDuelOverlayData& ChangedDuelOverlayData); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_DuelObserver(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_HidingProp_DestroyStructure.GE_HidingProp_DestroyStructure_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_HidingProp_DestroyStructure_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_HidingProp_DestroyStructure.GE_HidingProp_DestroyStructure_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Gameplay/Sword/GE_Blade_LeapSlam_BuildingDestroy.GE_Blade_LeapSlam_BuildingDestroy_C
	// Inherited from UGET_DirectPhysicalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Blade_LeapSlam_BuildingDestroy_C : public UGET_DirectPhysicalDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Gameplay/Sword/GE_Blade_LeapSlam_BuildingDestroy.GE_Blade_LeapSlam_BuildingDestroy_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/AthenaConsumablesSharedFunctionLibrary.AthenaConsumablesSharedFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAthenaConsumablesSharedFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/AthenaConsumablesSharedFunctionLibrary.AthenaConsumablesSharedFunctionLibrary_C");
			return ret;
		}

		void Get Actor Forward Cardinal Direction(AActor* Actor, UObject* __WorldContext, TEnumAsByte<ECardinalDirection>& OutCardinalDirection, double& OutYaw); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsOverlappingDeployableBlockVolume(UObject* WorldContextObject, float BlockingAreaCheckRadius, FVector Location, FName ItemSpecificBlockingTag, UObject* __WorldContext, bool& bOverlapping); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Playlists/DefaultModifiers/GE_DefaultResourceCap.GE_DefaultResourceCap_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DefaultResourceCap_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Playlists/DefaultModifiers/GE_DefaultResourceCap.GE_DefaultResourceCap_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GE_ZipLine_Damage_Structure.GE_ZipLine_Damage_Structure_C
	// Inherited from UGET_DirectPhysicalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ZipLine_Damage_Structure_C : public UGET_DirectPhysicalDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GE_ZipLine_Damage_Structure.GE_ZipLine_Damage_Structure_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_LandedOn.GA_Athena_HidingProp_LandedOn_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x58 (0xB98 - 0xB40)
	class UGA_Athena_HidingProp_LandedOn_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FScalableFloat HidingEnabled; // 0xB48(0x28)
		FScalableFloat Hiding_Enable_From_Landing; // 0xB70(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_LandedOn.GA_Athena_HidingProp_LandedOn_C");
			return ret;
		}

		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_HidingProp_LandedOn(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice.GE_SurfaceChange_Ice_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Ice_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice.GE_SurfaceChange_Ice_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Linger.GE_SurfaceChange_Ice_Linger_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Ice_Linger_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Ice_Linger.GE_SurfaceChange_Ice_Linger_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Snow.GE_SurfaceChange_Snow_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Snow_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Snow.GE_SurfaceChange_Snow_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_ReachedEnd.GA_Athena_ZipLine_ReachedEnd_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xF8 (0xC38 - 0xB40)
	class UGA_Athena_ZipLine_ReachedEnd_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB48(0x8)
		FScalableFloat MaxLateralSpeed; // 0xB50(0x28)
		FVector ImpulseVec; // 0xB78(0x18)
		FScalableFloat JumpVertStrength; // 0xB90(0x28)
		FScalableFloat LateralDamping; // 0xBB8(0x28)
		FScalableFloat MaxZiplineVel; // 0xBE0(0x28)
		bool Debug; // 0xC08(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xC09(0x7) UNKNOWN PROPERTY
		FScalableFloat MinJumpVertStrength; // 0xC10(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_ReachedEnd.GA_Athena_ZipLine_ReachedEnd_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_ZipLine_ReachedEnd(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GAT_Athena_PurpleStuff.GAT_Athena_PurpleStuff_C
	// Inherited from UGAT_TriggeredAbility_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x13 (0xB60 - 0xB4D)
	class UGAT_Athena_PurpleStuff_C : public UGAT_TriggeredAbility_C	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0xB4D(0x3) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0xB50(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GAT_Athena_PurpleStuff.GAT_Athena_PurpleStuff_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GAT_Athena_PurpleStuff(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Health.GE_Athena_PurpleStuff_Health_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_PurpleStuff_Health_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Health.GE_Athena_PurpleStuff_Health_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/HidingProp_CameraModifier.HidingProp_CameraModifier_C
	// Inherited from UCameraModifier -> UObject
	// Size: 0x8 (0x50 - 0x48)
	class UHidingProp_CameraModifier_C : public UCameraModifier	
	{
	public:
		AFortPlayerPawn* Pawn; // 0x48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/HidingProp_CameraModifier.HidingProp_CameraModifier_C");
			return ret;
		}

		void BlueprintModifyCamera(float DeltaTime, FVector ViewLocation, FRotator ViewRotation, float FOV, FVector& NewViewLocation, FRotator& NewViewRotation, float& NewFOV); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_Teleporting.GE_Athena_HidingProp_Teleporting_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_Teleporting_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_Teleporting.GE_Athena_HidingProp_Teleporting_C");
			return ret;
		}
	};


	// Class /Game/Athena/DrivableVehicles/GA_AthenaInVehicle.GA_AthenaInVehicle_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x28 (0xB68 - 0xB40)
	class UGA_AthenaInVehicle_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTagContainer ExitTag; // 0xB48(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/DrivableVehicles/GA_AthenaInVehicle.GA_AthenaInVehicle_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_AthenaInVehicle(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GE_DudebroDamageWallsLOTS.GE_DudebroDamageWallsLOTS_C
	// Inherited from UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DudebroDamageWallsLOTS_C : public UGet_DirectDamageParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GE_DudebroDamageWallsLOTS.GE_DudebroDamageWallsLOTS_C");
			return ret;
		}
	};


	// Class /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Wildlife_Knockback_Player.GA_NPC_Wildlife_Knockback_Player_C
	// Inherited from UGAB_GenericApplyKnockback_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x0 (0xC69 - 0xC69)
	class UGA_NPC_Wildlife_Knockback_Player_C : public UGAB_GenericApplyKnockback_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Wildlife_Knockback_Player.GA_NPC_Wildlife_Knockback_Player_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tether_DamageStructure.GE_Athena_Tether_DamageStructure_C
	// Inherited from UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Tether_DamageStructure_C : public UGet_DirectDamageParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tether_DamageStructure.GE_Athena_Tether_DamageStructure_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_HidingInProp.GA_Athena_HidingProp_HidingInProp_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x54 (0xB94 - 0xB40)
	class UGA_Athena_HidingProp_HidingInProp_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FGameplayTagContainer ChangeEquipmentTag; // 0xB48(0x20)
		FScalableFloat Row_bDisablePlayerCollision; // 0xB68(0x28)
		float WaitForRequiredTagTime; // 0xB90(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_HidingInProp.GA_Athena_HidingProp_HidingInProp_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GrapplerFailSafe(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EndAbilityIfMissingTag(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_HidingProp_HidingInProp(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_HidingInProp.GE_Athena_HidingProp_HidingInProp_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_HidingInProp_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_HidingInProp.GE_Athena_HidingProp_HidingInProp_C");
			return ret;
		}
	};


	// Class /Game/Athena/MappedEffects/GE_Athena_DBNO_Bleed.GE_Athena_DBNO_Bleed_C
	// Inherited from UGET_PeriodicEnergyDamage_C -> UGET_PeriodicPhysicalDamage_C -> UGET_PeriodicDamageParent_C -> UGET_AfflictedParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_DBNO_Bleed_C : public UGET_PeriodicEnergyDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/MappedEffects/GE_Athena_DBNO_Bleed.GE_Athena_DBNO_Bleed_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Shields.GE_Athena_PurpleStuff_Shields_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_PurpleStuff_Shields_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GE_Athena_PurpleStuff_Shields.GE_Athena_PurpleStuff_Shields_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/DudeBro/GA_DudeBro_Vent.GA_DudeBro_Vent_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x44 (0xB84 - 0xB40)
	class UGA_DudeBro_Vent_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		USkeletalMeshComponent* VehicleSkelMesh; // 0xB48(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB50(0x8)
		double GravFloorAltitude; // 0xB58(0x8)
		double UpwardLaunchVelocity; // 0xB60(0x8)
		TArray<AActor*> VentsHitBeforeLanding; // 0xB68(0x10)
		int32_t NumVentsToHitForQuest; // 0xB78(0x4)
		FGameplayTag Tag_to_Check; // 0xB7C(0x4)
		FGameplayTag VentBlocked; // 0xB80(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/DudeBro/GA_DudeBro_Vent.GA_DudeBro_Vent_C");
			return ret;
		}

		void ActuallyCleanPlayerUp(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_4065C3B14D35BDC4C0608DB5BD4A1EBA(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayerCapsuleHit(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementModeChangedDelegate_Event(ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_DudeBro_Vent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_DamageCoolDown.GE_SurfaceChange_Lava_DamageCoolDown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_DamageCoolDown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_DamageCoolDown.GE_SurfaceChange_Lava_DamageCoolDown_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage_Periodic.GE_SurfaceChange_Lava_Damage_Periodic_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_Damage_Periodic_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage_Periodic.GE_SurfaceChange_Lava_Damage_Periodic_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage.GE_SurfaceChange_Lava_Damage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_SurfaceChange_Lava_Damage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GE_SurfaceChange_Lava_Damage.GE_SurfaceChange_Lava_Damage_C");
			return ret;
		}
	};


	// Class /Game/Athena/Environments/Blueprints/SurfaceEffects/GAB_SurfaceChange.GAB_SurfaceChange_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x2E8 (0xE28 - 0xB40)
	class UGAB_SurfaceChange_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		bool Debug; // 0xB48(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xB49(0x7) UNKNOWN PROPERTY
		FScalableFloat RemovalDelay; // 0xB50(0x28)
		FScalableFloat IcySurfacesEnabled; // 0xB78(0x28)
		FGameplayTagContainer HasIce; // 0xBA0(0x20)
		UClass* GE_SurfaceChange_Ice; // 0xBC0(0x8)
		UClass* GE_SurfaceChange_Snow; // 0xBC8(0x8)
		UClass* GE_SurfaceChange_Lava; // 0xBD0(0x8)
		AFortPawn* AvatarPawn; // 0xBD8(0x8)
		FGameplayTagContainer IceTags; // 0xBE0(0x20)
		FGameplayTagContainer LavaTags; // 0xC00(0x20)
		FGameplayTagContainer SnowTags; // 0xC20(0x20)
		FGameplayTagContainer SandTags; // 0xC40(0x20)
		FGameplayTagContainer ChromeTags; // 0xC60(0x20)
		double LavaBounceMultiplier; // 0xC80(0x8)
		double RandomAngleOffset; // 0xC88(0x8)
		FScalableFloat RandomConeAngle; // 0xC90(0x28)
		FScalableFloat FacingAngleVelocityComponent; // 0xCB8(0x28)
		FScalableFloat BaseVerticalBounceVelocity; // 0xCE0(0x28)
		FScalableFloat BaseLateralBounceVelocity; // 0xD08(0x28)
		FScalableFloat MaxBounceMultiplier; // 0xD30(0x28)
		FScalableFloat BounceMultiplierStepAmount; // 0xD58(0x28)
		FRandomStream RandomAngleStream; // 0xD80(0x8)
		FGameplayTag LavaBounceCue; // 0xD88(0x4)
		FGameplayTag EventTag_SandUnburrow; // 0xD8C(0x4)
		FScalableFloat IceLingerDuration; // 0xD90(0x28)
		FGameplayTagContainer PreviousSurfaceTagContainer; // 0xDB8(0x20)
		UAsyncAction_StartListeningToStatefulEvent* GamePhaseUpdatedAsyncTask; // 0xDD8(0x8)
		FGameplayTagContainer LavaPeriodicDamageTags; // 0xDE0(0x20)
		FScalableFloat LavaPeriodicDamageEnabled; // 0xE00(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Environments/Blueprints/SurfaceEffects/GAB_SurfaceChange.GAB_SurfaceChange_C");
			return ret;
		}

		void HandleLavaPeriodicDamageGE(UFortMovementComp_Character* FortMovementComp, UFortSurfaceTrackingComponent* FortSurfaceTrackingComp); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldRemoveLavaPeriodicDamage(UFortMovementComp_Character* FortMovementComp, UFortSurfaceTrackingComponent* FortSurfaceTrackingComp); // Flags: Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldApplyLavaPeriodicDamage(UFortMovementComp_Character* FortMovementComp, UFortSurfaceTrackingComponent* FortSurfaceTrackingComp); // Flags: Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_ReplicatedRandomAngle(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SurfaceCleanup(bool AddLingeringEffects, TEnumAsByte<EPhysicalSurface> SurfaceType); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LavaBounce(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HotfixableGEApplication(FScalableFloat& Input, UClass* GameplayEffectAppliedOnTrue, UClass* GameplayEffectAppliedOnFalse, FActiveGameplayEffectHandle& GE Handle); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SurfaceCleanupSpecial(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEventStateCleared_392FFBA342A999104DC902825BE7B094(UAsyncAction_StartListeningToStatefulEvent* ProxyObject); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSavedEventStateExists_392FFBA342A999104DC902825BE7B094(UAsyncAction_StartListeningToStatefulEvent* ProxyObject); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEventReceived_392FFBA342A999104DC902825BE7B094(UAsyncAction_StartListeningToStatefulEvent* ProxyObject); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementModeChanged(ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamePhaseChanged(EAthenaGamePhase GamePhase); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GAB_SurfaceChange(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_TeleportCoolDown.GE_Athena_HidingProp_TeleportCoolDown_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_HidingProp_TeleportCoolDown_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GE_Athena_HidingProp_TeleportCoolDown.GE_Athena_HidingProp_TeleportCoolDown_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/Grenade/BP_ProjectileTrajectory_Athena.BP_ProjectileTrajectory_Athena_C
	// Inherited from ABP_ProjectileTrajectory_C -> AFortProjectileTrajectory -> AActor -> UObject
	// Size: 0x0 (0x30A - 0x30A)
	class ABP_ProjectileTrajectory_Athena_C : public ABP_ProjectileTrajectory_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/BP_ProjectileTrajectory_Athena.BP_ProjectileTrajectory_Athena_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_Jump.GA_Athena_ZipLine_Jump_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xA0 (0xBE0 - 0xB40)
	class UGA_Athena_ZipLine_Jump_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB48(0x8)
		FScalableFloat MaxLateralSpeed; // 0xB50(0x28)
		FVector ImpulseVec; // 0xB78(0x18)
		FScalableFloat JumpVertStrength; // 0xB90(0x28)
		FScalableFloat JumpLateralDamper; // 0xBB8(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_Jump.GA_Athena_ZipLine_Jump_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_ZipLine_Jump(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/SplineZipline/BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C
	// Inherited from AFortAthenaSplineZipline -> AFortAthenaZipline -> AFortAthenaZiplineBase -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x128 (0xDC8 - 0xCA0)
	class ABP_Athena_Environmental_ZipLine_Spline_C : public AFortAthenaSplineZipline	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xCA0(0x8)
		USphereComponent* EndPointInteractSphere; // 0xCA8(0x8)
		USphereComponent* StartPointInteractSphere; // 0xCB0(0x8)
		UStaticMesh* SplineStaticMesh; // 0xCB8(0x8)
		double TangentSmoothStrength; // 0xCC0(0x8)
		bool AutoSmoothTangents; // 0xCC8(0x1)
		TEnumAsByte<ESplineMeshAxis> ForwardMeshAxis; // 0xCC9(0x1)
		unsigned char UnknownData00_6[0x6]; // 0xCCA(0x6) UNKNOWN PROPERTY
		FVector MotorOffset; // 0xCD0(0x18)
		ABuildingActor* PoleA; // 0xCE8(0x8)
		ABuildingActor* PoleB; // 0xCF0(0x8)
		FVector PoleASocketLocation; // 0xCF8(0x18)
		FVector PoleBSocketLocation; // 0xD10(0x18)
		int32_t LowerPointID; // 0xD28(0x4)
		int32_t HigherPointID; // 0xD2C(0x4)
		FVector HigherEndLocation; // 0xD30(0x18)
		FVector LowerEndLocation; // 0xD48(0x18)
		double AutoLinearFactorLow; // 0xD60(0x8)
		double AutoLinearFactorHigh; // 0xD68(0x8)
		double AutoSplineTangentLengthCoef; // 0xD70(0x8)
		double AutoSplineTangentHorizCoef; // 0xD78(0x8)
		double AutoSplineTangentVertCoef; // 0xD80(0x8)
		bool Auto_Set_Spline_Ends; // 0xD88(0x1)
		bool Auto_Set_Spline_Mids; // 0xD89(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xD8A(0x6) UNKNOWN PROPERTY
		TArray<UMaterialInstanceDynamic*> SplineMaterials; // 0xD90(0x10)
		FGameplayTagContainer BlockInteractTags; // 0xDA0(0x20)
		double TilingDivisor; // 0xDC0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/SplineZipline/BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C");
			return ret;
		}

		void GetMIDForSplineMeshComp(USplineMeshComponent* SplineMeshComp, int32_t ElementIndex, UMaterialInstanceDynamic* Mid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSplineMeshMaterials(USplineMeshComponent* SplineMeshComp, int32_t SplineIndex); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CreateSplineMesh(int32_t FirstPoint, int32_t SecondPoint); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetInteractionCollision(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetCableTilingBySplineLength(UMeshComponent* Target); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintCanInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted, TEnumAsByte<TInteractionType> InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetAutoHorizAndVertVectors(FVector highVector, FVector LowVector, FVector& VertVec, FVector& HorizVec); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Calc Auto Location At Alpha(double InAlpha, bool DrawDebug, FVector& PointLocation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSplinePositionAndTangent(bool SetPosition, bool SetTangent, int32_t ID); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CalculatePositionOfPoles(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AutoSmoothTanget(FVector Tangent, FVector PointA, FVector PointB, FVector& SmoothedTangent); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddSplineMeshSegment(USplineMeshComponent* SplineMeshSegment); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePoleDied(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnZipliningStarted(AFortPlayerPawn* InteractingPawn, UPrimitiveComponent* InteractComponent); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnZipliningStopped(AFortPlayerPawn* InteractingPawn, UPrimitiveComponent* InteractComponent, float ZiplineUsageDuration); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline.PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C
	// Inherited from AFortAthenaSplineZipline -> AFortAthenaZipline -> AFortAthenaZiplineBase -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x139 (0xDD9 - 0xCA0)
	class APROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C : public AFortAthenaSplineZipline	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xCA0(0x8)
		UStaticMesh* SplineStaticMesh; // 0xCA8(0x8)
		double TangentSmoothStrength; // 0xCB0(0x8)
		bool AutoSmoothTangents; // 0xCB8(0x1)
		TEnumAsByte<ESplineMeshAxis> ForwardMeshAxis; // 0xCB9(0x1)
		unsigned char UnknownData00_6[0x6]; // 0xCBA(0x6) UNKNOWN PROPERTY
		FVector MotorOffset; // 0xCC0(0x18)
		AActor* PoleA; // 0xCD8(0x8)
		AActor* PoleB; // 0xCE0(0x8)
		FVector PoleASocketLocation; // 0xCE8(0x18)
		FVector PoleBSocketLocation; // 0xD00(0x18)
		int32_t LowerPointID; // 0xD18(0x4)
		int32_t HigherPointID; // 0xD1C(0x4)
		FVector HigherEndLocation; // 0xD20(0x18)
		FVector LowerEndLocation; // 0xD38(0x18)
		double AutoLinearFactorLow; // 0xD50(0x8)
		double AutoLinearFactorHigh; // 0xD58(0x8)
		double AutoSplineTangentLengthCoef; // 0xD60(0x8)
		double AutoSplineTangentHorizCoef; // 0xD68(0x8)
		double AutoSplineTangentVertCoef; // 0xD70(0x8)
		bool Auto_Set_Spline_Ends; // 0xD78(0x1)
		bool Auto_Set_Spline_Mids; // 0xD79(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xD7A(0x6) UNKNOWN PROPERTY
		TArray<UMaterialInstanceDynamic*> SplineMaterials; // 0xD80(0x10)
		FGameplayTagContainer BlockInteractTags; // 0xD90(0x20)
		double TilingDivisor; // 0xDB0(0x8)
		TArray<USplineMeshComponent*> SplineMeshComponents; // 0xDB8(0x10)
		TArray<AFortPlayerPawn*> PlayerPawnArray; // 0xDC8(0x10)
		bool Debug; // 0xDD8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline.PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline_C");
			return ret;
		}

		void RemovePlayerFromZipliningArray(AFortPlayerPawn* Item); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddPlayerToZipliningArray(AFortPlayerPawn* NewItem); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetCableTilingBySplineLength(UMeshComponent* Target); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintCanInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted, TEnumAsByte<TInteractionType> InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetAutoHorizAndVertVectors(FVector highVector, FVector LowVector, FVector& VertVec, FVector& HorizVec); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Calc Auto Location At Alpha(double InAlpha, bool DrawDebug, FVector& PointLocation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSplinePositionAndTangent(bool SetPosition, bool SetTangent, int32_t ID); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CalculatePositionOfPoles(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AutoSmoothTanget(FVector Tangent, FVector PointA, FVector PointB, FVector& SmoothedTangent); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddSplineMeshSegment(USplineMeshComponent* SplineMeshSegment); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WaitThenSetDynamicSpline(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnZipliningStarted(AFortPlayerPawn* InteractingPawn, UPrimitiveComponent* InteractComponent); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnZipliningStopped(AFortPlayerPawn* InteractingPawn, UPrimitiveComponent* InteractComponent, float ZiplineUsageDuration); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PROTOTYPE_BP_Athena_Dynamic_ZipLine_Spline(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/Parents/GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C
	// Inherited from UFortGameplayAbility_ConsumableThrowParent -> UFortGameplayAbility_ThrowTrajectory -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x18C (0x1004 - 0xE78)
	class UGA_Athena_Consumable_Throw_Parent_C : public UFortGameplayAbility_ConsumableThrowParent	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xE78(0x8)
		bool AbilityKeyPressed; // 0xE80(0x1)
		bool InThrowWindup; // 0xE81(0x1)
		unsigned char UnknownData00_6[0x6]; // 0xE82(0x6) UNKNOWN PROPERTY
		FScalableFloat bIsEnabled; // 0xE88(0x28)
		FGameplayTagContainer Tag_BlockAbilityActivation; // 0xEB0(0x20)
		bool bIsSecondaryFire; // 0xED0(0x1)
		bool bThrowInstantly; // 0xED1(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xED2(0x6) UNKNOWN PROPERTY
		FScalableFloat ProjectileGravityScale; // 0xED8(0x28)
		FScalableFloat ProjectileSpeed; // 0xF00(0x28)
		ABP_ProjectileTrajectory_C* TrajectoryIndicator; // 0xF28(0x8)
		UClass* TrajectoryIndicatorClass; // 0xF30(0x8)
		double TrajectoryUpdateInterval; // 0xF38(0x8)
		UAnimMontage* CookMontage; // 0xF40(0x8)
		UAnimMontage* CookMontage1P; // 0xF48(0x8)
		UAnimMontage* ThrowMontage; // 0xF50(0x8)
		UAnimMontage* ThrowMontage1P; // 0xF58(0x8)
		double TrajectoryTimeStep; // 0xF60(0x8)
		int32_t TrajectoryMaxSteps; // 0xF68(0x4)
		FName TrajectoryCollisionProfileName; // 0xF6C(0x4)
		UClass* GE_InWindup; // 0xF70(0x8)
		UClass* CameraMode; // 0xF78(0x8)
		bool ReturnPhysicalMaterial; // 0xF80(0x1)
		unsigned char UnknownData02_6[0x7]; // 0xF81(0x7) UNKNOWN PROPERTY
		FGameplayTagContainer Tags_UseNullFailedActivateReason; // 0xF88(0x20)
		bool bIsThrowing; // 0xFA8(0x1)
		bool SpawnedOnEquip; // 0xFA9(0x1)
		unsigned char UnknownData03_6[0x2]; // 0xFAA(0x2) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle Handle_GE_InWindup; // 0xFAC(0x8)
		bool bPreventDeploymentInBlockAreas; // 0xFB4(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xFB5(0x3) UNKNOWN PROPERTY
		float DeployableBlockingAreaCheckRadius; // 0xFB8(0x4)
		unsigned char UnknownData05_6[0x4]; // 0xFBC(0x4) UNKNOWN PROPERTY
		FVector DeployableBlockingAreaCheckOffset; // 0xFC0(0x18)
		float Trajectory_Max_Distance_Between_Spline_Points; // 0xFD8(0x4)
		int32_t Trajectory_Max_Bounces; // 0xFDC(0x4)
		float Trajectory_Initial_Distance; // 0xFE0(0x4)
		bool Projectile_Trajectory_Data_Initialized; // 0xFE4(0x1)
		unsigned char UnknownData06_6[0x3]; // 0xFE5(0x3) UNKNOWN PROPERTY
		UFortAbilityTask_PlayMontageWaitTarget* ThrowMontageAsyncTask; // 0xFE8(0x8)
		TArray<AActor*> TrajectoryIgnoredWorldActors; // 0xFF0(0x10)
		FName UniqueBlockDeploymentTag; // 0x1000(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Parents/GA_Athena_Consumable_Throw_Parent.GA_Athena_Consumable_Throw_Parent_C");
			return ret;
		}

		bool ShouldOnlyShowTrajectoryOnUse(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		AFortProjectileTrajectory SpawnTrajectoryIndicator(bool bSpawnOnEquip); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UClass GetProjectileTrajectoryActor(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetProjectileTrajectoryPoints(TArray<FVector>& OutSplinePoints, TArray<FVector>& OutSplineTangents, FHitResult& OutHitResult); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsAbilityBlocked(bool& bIsBlocked); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Get Throw Montage(UAnimMontage* Montage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCookMontage(UAnimMontage* Montage); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CalculateProjectileTrajectory(AFortPawn* Instigator, FVector InitialLocation, FVector InitialVelocity, FHitResult& OutHitResult, TArray<FVector>& OutSplinePoints, TArray<FVector>& OutSplineTangents); // Flags: Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayAbilitySpecHandle Handle, FGameplayTagContainer& RelevantTags); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsTrajectoryLocationValid(TArray<FVector>& SplinePoints, TArray<FVector>& SplineTangents, FHitResult TrajectoryHitResult, bool& bIsLocationValid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnUpdateTrajectory(TArray<FVector>& SplinePoints, TArray<FVector>& SplineTangents, FHitResult TrajectoryHitResult); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddValidCamera(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OverrideFailedReason(FGameplayTagContainer& FailedReason, FGameplayTagContainer& OverridenFailedReason); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetProjectileInitialGravityScaleToUse(double& GravityScaleToUse); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetProjectileInitialSpeedToUse(double& ProjectileSpeedToUse); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CleanupTrajectory(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PostThrowCleanup(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTrajectorySpline(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupDummyProjectile(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PrethrowSetup(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Completed_01C5B37D48E3DC6F82DDC58640CE2A27(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Cancelled_01C5B37D48E3DC6F82DDC58640CE2A27(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Triggered_01C5B37D48E3DC6F82DDC58640CE2A27(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRelease_76BCD7D74FEC0FB6EFBBDFB57A0107B0(float TimeHeld); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_E3F1B58D4D7A664CB557709F9DAE3C9F(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSync_9C8FDC8044B1444580A9809C231F294D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCancelled_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInterrupted_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendOut_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendedIn_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCompleted_D89CCB8E47DB19D6DCF41F96F207CC3D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSync_9EB4FE09402E9C3EFFEFC699136D00E3(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitTrajectoryVariables(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ThrowMontageStarted(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAbilityInputReleased(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ThrowProjectile(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTrajectory(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CleanupTrajectoryIndicatorOnUnequip(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Consumable_Throw_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Playlists/DefaultModifiers/GE_DefaultTurboBuildSettings.GE_DefaultTurboBuildSettings_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_DefaultTurboBuildSettings_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Playlists/DefaultModifiers/GE_DefaultTurboBuildSettings.GE_DefaultTurboBuildSettings_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_GettingInProp.GA_Athena_HidingProp_GettingInProp_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_Athena_HidingProp_GettingInProp_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/HidingProps/GA_Athena_HidingProp_GettingInProp.GA_Athena_HidingProp_GettingInProp_C");
			return ret;
		}

		void Triggered_48F6DF3C4B1DB1F251B2C48A13F1870E(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_HidingProp_GettingInProp(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tethered.GE_Athena_Tethered_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Tethered_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GE_Athena_Tethered.GE_Athena_Tethered_C");
			return ret;
		}
	};


	// Class /Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered.GA_Athena_Tethered_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8C (0xBCC - 0xB40)
	class UGA_Athena_Tethered_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FActiveGameplayEffectHandle GE_TetheredHandle; // 0xB48(0x8)
		AFortPlayerPawn* OwningFortPlayerPawn; // 0xB50(0x8)
		double maxSpeedToPlayGCN; // 0xB58(0x8)
		FGameplayTag GCTagPlayerLand; // 0xB60(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB64(0x4) UNKNOWN PROPERTY
		UClass* StructureDamageGE; // 0xB68(0x8)
		FGameplayTag SmashGC; // 0xB70(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xB74(0x4) UNKNOWN PROPERTY
		FScalableFloat BreakStructuresOnTetherEnabled; // 0xB78(0x28)
		FScalableFloat BreakStructuresOnTetherRange; // 0xBA0(0x28)
		FGameplayTag Event_FishingForceEnd; // 0xBC8(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/FloppingRabbit/GA_Athena_Tethered.GA_Athena_Tethered_C");
			return ret;
		}

		void BreakNearbyStructures(FVector ForwardVector, double OffsetForward); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementModeChangedDelegate_Event(ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BreakBuildingsAtPlayerInDirectionOfTether(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Tethered(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/ForagedItems/Rift/GA_Rift_Athena_Skydive.GA_Rift_Athena_Skydive_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xF8 (0xC38 - 0xB40)
	class UGA_Rift_Athena_Skydive_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		UAnimMontage* FallingAnimation; // 0xB48(0x8)
		double Hangtimee; // 0xB50(0x8)
		USkeletalMeshComponent* VehicleSkelMesh; // 0xB58(0x8)
		FScalableFloat HangTime; // 0xB60(0x28)
		FGameplayTag EventTag; // 0xB88(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB8C(0x4) UNKNOWN PROPERTY
		FScalableFloat KickFromVehicle_; // 0xB90(0x28)
		USoundBase* LocalPlayerSound; // 0xBB8(0x8)
		UClass* GameplayCueGE; // 0xBC0(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xBC8(0x8)
		bool bHolstered; // 0xBD0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xBD1(0x3) UNKNOWN PROPERTY
		FName RiftSkydiveHolster; // 0xBD4(0x4)
		FVector ImpulseStrength; // 0xBD8(0x18)
		bool bNeedsInputEnable; // 0xBF0(0x1)
		unsigned char UnknownData02_6[0x7]; // 0xBF1(0x7) UNKNOWN PROPERTY
		FTimerHandle SafetyTimer; // 0xBF8(0x8)
		FVector NewVar; // 0xC00(0x18)
		FGameplayTagContainer UnblockTagsIfPassenger; // 0xC18(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/ForagedItems/Rift/GA_Rift_Athena_Skydive.GA_Rift_Athena_Skydive_C");
			return ret;
		}

		void RemoveSkydivingGameplayEffect(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCancelled_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInterrupted_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendOut_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendedIn_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCompleted_AA0523504B7CA4F488E1E6A11F48308A(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPlayerToSkydive(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDestroyed_Event(AActor* DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPawnEnteredWater(AFortPlayerPawn* FortPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPawnLanded(FHitResult& Hit); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleForceEnd(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnZiplineStateChanged(bool bIsZiplining, AFortPlayerPawn* FortPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMovementModeChanged(ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Rift_Athena_Skydive(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_Grenade_Base.B_Prj_Athena_Grenade_Base_C
	// Inherited from AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x186 (0xCAE - 0xB28)
	class AB_Prj_Athena_Grenade_Base_C : public AFortProjectileBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB28(0x8)
		UNiagaraComponent* NS_Fuse_Particle; // 0xB30(0x8)
		UFortCollisionAudioComponent* FortCollisionAudio; // 0xB38(0x8)
		URotatingMovementComponent* RotatingMovement; // 0xB40(0x8)
		UStaticMeshComponent* Mesh; // 0xB48(0x8)
		UAudioComponent* GrenadeFuse_AudioComponent; // 0xB50(0x8)
		UParticleSystemComponent* Effect_Distance; // 0xB58(0x8)
		TWeakObjectPtr<UParticleSystem*> P_Explosion; // 0xB60(0x20)
		USoundBase* Cue_ExplosionSound; // 0xB80(0x8)
		TWeakObjectPtr<UParticleSystem*> P_Explosion_Water; // 0xB88(0x20)
		int32_t NumberOfBouncesTillExplode; // 0xBA8(0x4)
		int32_t CurrentNumberOfBounces; // 0xBAC(0x4)
		USoundBase* Cue_GrenadeFuseSound; // 0xBB0(0x8)
		double BouncePawnAgainstPawnGravityScale; // 0xBB8(0x8)
		UForceFeedbackEffect* ExplosionForceFeedbackNear; // 0xBC0(0x8)
		UForceFeedbackEffect* ExplosionForceFeedbackFar; // 0xBC8(0x8)
		USoundBase* Cue_Bounce; // 0xBD0(0x8)
		UClass* ExplosionCameraShake; // 0xBD8(0x8)
		double FuseTime; // 0xBE0(0x8)
		double ExplosionRadius; // 0xBE8(0x8)
		FRotator Explosion_Rotation; // 0xBF0(0x18)
		UAudioComponent* WaterFuseAudioComponent; // 0xC08(0x8)
		USoundBase* Water_Debris_Explosion; // 0xC10(0x8)
		USoundBase* Splash_Sound; // 0xC18(0x8)
		UTexture* SoundIndicatorIcon; // 0xC20(0x8)
		FTimerHandle FuseIndicatorTimer; // 0xC28(0x8)
		TWeakObjectPtr<UNiagaraSystem*> NS_Explosion; // 0xC30(0x20)
		TWeakObjectPtr<UNiagaraSystem*> NS_Explosion_Water; // 0xC50(0x20)
		EFXType FXType; // 0xC70(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xC71(0x7) UNKNOWN PROPERTY
		UFXSystemAsset* VFX_Explosion; // 0xC78(0x8)
		UFXSystemAsset* VFX_Explosion_Water; // 0xC80(0x8)
		FTimerHandle FuseTimer_; // 0xC88(0x8)
		UNiagaraSystem* NS_HitWater; // 0xC90(0x8)
		USoundBase* WaterFuseSound; // 0xC98(0x8)
		UFXSystemAsset* FX_Physical_Surface; // 0xCA0(0x8)
		int32_t PhysicalSurfaceID; // 0xCA8(0x4)
		bool bShowFuseSoundIndicator; // 0xCAC(0x1)
		TEnumAsByte<EPhysicalSurface> E_Surface_Type; // 0xCAD(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_Grenade_Base.B_Prj_Athena_Grenade_Base_C");
			return ret;
		}

		void PhysicalSurfaceCheck(int32_t Physical Surface ID, bool& CheckedPhysicalSurfaceID); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetExplosion(bool InWater, UFXSystemAsset* FX System); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FuseEnded(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_6A6D02914DCE95902837C994D84D08EA(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_6A6D02914DCE95902837C994C3BE7DC5(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStop(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Stop_Rotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExploded(TArray<AActor*>& HitActors, TArray<FHitResult>& HitResults); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBounce(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveAnyDamage(float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnResumeSimulation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Splash(AFortWaterBodyActor* WaterBody, UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(AFortWaterBodyActor* WaterBody, UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Held Water Impact(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowFuseIndicator(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AysncLoad(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_Prj_Athena_Grenade_Base(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C
	// Inherited from AB_Prj_Athena_Grenade_Base_C -> AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x56 (0xD04 - 0xCAE)
	class AB_Prj_Athena_FragGrenade_C : public AB_Prj_Athena_Grenade_Base_C	
	{
	public:
		unsigned char UnknownData00_3[0x2]; // 0xCAE(0x2) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0xCB0(0x8)
		UNiagaraComponent* NS_Object_FloatingInWater; // 0xCB8(0x8)
		UBP_SurfaceTypeSoundComponent_C* BP_SurfaceTypeSoundComponent; // 0xCC0(0x8)
		float PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD; // 0xCC8(0x4)
		TEnumAsByte<ETimelineDirection> PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD; // 0xCCC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xCCD(0x3) UNKNOWN PROPERTY
		UTimelineComponent* PreExploWarning; // 0xCD0(0x8)
		FGameplayTag FeedbackCue; // 0xCD8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xCDC(0x4) UNKNOWN PROPERTY
		UNiagaraSystem* Niagara_Bounse; // 0xCE0(0x8)
		TEnumAsByte<PreExplodeRampType> PreExplodeOptimization; // 0xCE8(0x1)
		unsigned char UnknownData03_6[0x7]; // 0xCE9(0x7) UNKNOWN PROPERTY
		double PreExplodeRampTime; // 0xCF0(0x8)
		FName GrenadeFuseParamName; // 0xCF8(0x4)
		float PreExplodeTimerRampFrequency; // 0xCFC(0x4)
		float PreExplodeTimerAccumulatedRampTime; // 0xD00(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C");
			return ret;
		}

		void PreExploWarning__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreExploWarning__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FuseEnded(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExploded(TArray<AActor*>& HitActors, TArray<FHitResult>& HitResults); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBounce(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Pre Explo Audio Tell(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature(AFortWaterBodyActor* WaterBody, UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_3_WaterInteractionOnExitWater__DelegateSignature(AFortWaterBodyActor* WaterBody, UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsLastBody); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TimerPreExplode(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_Prj_Athena_FragGrenade(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/AthenaEliminationIndicator.AthenaEliminationIndicator_C
	// Inherited from UAthenaEliminationIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x5E0 - 0x5B8)
	class UAthenaEliminationIndicator_C : public UAthenaEliminationIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5B8(0x8)
		UWidgetAnimation* Outro; // 0x5C0(0x8)
		UWidgetAnimation* Intro; // 0x5C8(0x8)
		UImage* Arrow; // 0x5D0(0x8)
		UImage* Image_Diamondpulse; // 0x5D8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/AthenaEliminationIndicator.AthenaEliminationIndicator_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_AthenaEliminationIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Tutorial/Contextual/ContextTutorialIndicator.ContextTutorialIndicator_C
	// Inherited from UAthenaContextTutorialIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x111 (0x701 - 0x5F0)
	class UContextTutorialIndicator_C : public UAthenaContextTutorialIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5F0(0x8)
		UWidgetAnimation* ST_in_bounce; // 0x5F8(0x8)
		UWidgetAnimation* ST_Text_Out_Fast; // 0x600(0x8)
		UWidgetAnimation* ST_Marker_Out02; // 0x608(0x8)
		UWidgetAnimation* ST_Marker_Out01; // 0x610(0x8)
		UWidgetAnimation* ST_Text_Out; // 0x618(0x8)
		UWidgetAnimation* ST_Text_in; // 0x620(0x8)
		UWidgetAnimation* ST_Arrow_Disappear; // 0x628(0x8)
		UWidgetAnimation* ST_Arrow_Bounce; // 0x630(0x8)
		UWidgetAnimation* ST_Arrow_Transition; // 0x638(0x8)
		UWidgetAnimation* ST_Out_Arrow_Marker; // 0x640(0x8)
		UWidgetAnimation* ST_Marker_FadeIN; // 0x648(0x8)
		UWidgetAnimation* ST_Arrow_Fade; // 0x650(0x8)
		UWidgetAnimation* ST_in_Spin_Arrow_Marker; // 0x658(0x8)
		UWidgetAnimation* ST_DiamondBox_Fade; // 0x660(0x8)
		UWidgetAnimation* ST_Diamond_Disappear; // 0x668(0x8)
		UWidgetAnimation* ST_Marker_MoveReaction; // 0x670(0x8)
		UWidgetAnimation* ST_in_DiamondBox_Spin; // 0x678(0x8)
		UWidgetAnimation* ST_Marker_Idle; // 0x680(0x8)
		UWidgetAnimation* ST_in_Diamond_Spin; // 0x688(0x8)
		UWidgetAnimation* ST_border; // 0x690(0x8)
		UWidgetAnimation* ST_in; // 0x698(0x8)
		UImage* Circle; // 0x6A0(0x8)
		UImage* Circle; // 0x6A8(0x8)
		UCommonTextBlock* Description; // 0x6B0(0x8)
		UEditableTextBox* DescriptionOLD; // 0x6B8(0x8)
		UImage* Icon; // 0x6C0(0x8)
		UImage* Icon; // 0x6C8(0x8)
		UImage* Image_SmallIndicator; // 0x6D0(0x8)
		UImage* Image_SmallIndicator_Child; // 0x6D8(0x8)
		UImage* Sign; // 0x6E0(0x8)
		UImage* Sign; // 0x6E8(0x8)
		UImage* White_Box_Child; // 0x6F0(0x8)
		UImage* White_Box_Solo; // 0x6F8(0x8)
		bool bIntroAnimationDone; // 0x700(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Tutorial/Contextual/ContextTutorialIndicator.ContextTutorialIndicator_C");
			return ret;
		}

		void Finished_FBBD6B5248E73C61005758B21F90D160(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Finished_191D6D204EA6EF5125923CB749C84A4A(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Finished_5FDAD1724A4ABC34EC3B7F9D90839344(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Finished_6F1BBAF94537A4D7945ED5A452FC1188(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayOutAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetIndicatorText(FText& Text); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayBounceAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayInAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ContextTutorialIndicator(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_Rethrow.GA_Athena_Grenade_Rethrow_C
	// Inherited from UGA_Athena_Consumable_Throw_Parent_C -> UFortGameplayAbility_ConsumableThrowParent -> UFortGameplayAbility_ThrowTrajectory -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x2C (0x1030 - 0x1004)
	class UGA_Athena_Grenade_Rethrow_C : public UGA_Athena_Consumable_Throw_Parent_C	
	{
	public:
		unsigned char UnknownData00_3[0x4]; // 0x1004(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1008(0x8)
		AFortProjectileBase* Projectile; // 0x1010(0x8)
		double TossDelay; // 0x1018(0x8)
		FName HolsterId; // 0x1020(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1024(0x4) UNKNOWN PROPERTY
		double PostThrowEndDelay; // 0x1028(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/Grenade/GA_Athena_Grenade_Rethrow.GA_Athena_Grenade_Rethrow_C");
			return ret;
		}

		void DetachProjectile(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AttachProjectile(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Completed_3B7299CC49B6C5C075996A9C8DDF315F(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Cancelled_3B7299CC49B6C5C075996A9C8DDF315F(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Triggered_3B7299CC49B6C5C075996A9C8DDF315F(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFinish_B295E6694DBD8B2B2478A38EA60F5624(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ThrowProjectile(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RethrowProjectile(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AttemptSpawnThrownProjectile(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Grenade_Rethrow(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/PurpleStuff/GA_Athena_Slurp_OLD.GA_Athena_Slurp_OLD_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x30 (0xB70 - 0xB40)
	class UGA_Athena_Slurp_OLD_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB48(0x8)
		int32_t IncreCheck; // 0xB50(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB54(0x4) UNKNOWN PROPERTY
		double MaxTicks; // 0xB58(0x8)
		FTimerHandle TimerHandle; // 0xB60(0x8)
		double TickRate; // 0xB68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/PurpleStuff/GA_Athena_Slurp_OLD.GA_Athena_Slurp_OLD_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyHealthOrShield(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Slurp_OLD(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/Team/RebootCardIndicator.RebootCardIndicator_C
	// Inherited from UAthenaRebootCardIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x610 - 0x5E0)
	class URebootCardIndicator_C : public UAthenaRebootCardIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5E0(0x8)
		UBorder* Border_Nameplate; // 0x5E8(0x8)
		UImage* burst; // 0x5F0(0x8)
		UImage* Image_RebootIcon; // 0x5F8(0x8)
		USpacer* IndicatorSpacer; // 0x600(0x8)
		UHorizontalBox* RebootCountdownContainer; // 0x608(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Team/RebootCardIndicator.RebootCardIndicator_C");
			return ret;
		}

		void bp_UpdateCountdownText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleDisplayForSelf(bool bSelf); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_RebootCardIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/HUD/Team/RebootVanIndicator.RebootVanIndicator_C
	// Inherited from UAthenaRebootVanIndicator -> UAthenaMarkedActorIndicator -> UFortActorIndicatorWidget -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x600 - 0x5C0)
	class URebootVanIndicator_C : public UAthenaRebootVanIndicator	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5C0(0x8)
		UWidgetAnimation* Intro; // 0x5C8(0x8)
		UBorder* Border_Nameplate; // 0x5D0(0x8)
		UImage* Icon; // 0x5D8(0x8)
		UImage* Image_RebootIcon; // 0x5E0(0x8)
		UImage* Image_SmallIndicator; // 0x5E8(0x8)
		UImage* Image_Van; // 0x5F0(0x8)
		USpacer* IndicatorSpacer; // 0x5F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/HUD/Team/RebootVanIndicator.RebootVanIndicator_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_RebootVanIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/SCMachine/BGA_Athena_SCMachine_Pickup.BGA_Athena_SCMachine_Pickup_C
	// Inherited from ABuildingGameplayActorSpawnChip -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0xEB (0xB9B - 0xAB0)
	class ABGA_Athena_SCMachine_Pickup_C : public ABuildingGameplayActorSpawnChip	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xAB0(0x8)
		UCapsuleComponent* OverlapCollision; // 0xAB8(0x8)
		UStaticMeshComponent* ParentMesh; // 0xAC0(0x8)
		UFortLinkToActorComponent* FortLinkToActor; // 0xAC8(0x8)
		UAudioComponent* SC_Machine_Memory_Card_Loop_Cue; // 0xAD0(0x8)
		UParticleSystemComponent* SpawninEffect; // 0xAD8(0x8)
		UStaticMeshComponent* BackgroundGlow; // 0xAE0(0x8)
		UStaticMeshComponent* Card; // 0xAE8(0x8)
		int32_t UnHide; // 0xAF0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xAF4(0x4) UNKNOWN PROPERTY
		double DelayBeforeUnhide; // 0xAF8(0x8)
		char OwnerTeam; // 0xB00(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xB01(0x7) UNKNOWN PROPERTY
		FTimerHandle Timer_DestroyPickup; // 0xB08(0x8)
		FScalableFloat Row_PickupLife; // 0xB10(0x28)
		FText InteractText; // 0xB38(0x10)
		UParticleSystem* SpawnOutParticle; // 0xB48(0x8)
		USoundBase* PickupSound; // 0xB50(0x8)
		bool SpawnSoundPlayed; // 0xB58(0x1)
		unsigned char UnknownData02_6[0x7]; // 0xB59(0x7) UNKNOWN PROPERTY
		USoundBase* SpawnInSound; // 0xB60(0x8)
		bool IsPendingKill; // 0xB68(0x1)
		bool HideAndKill; // 0xB69(0x1)
		unsigned char UnknownData03_6[0x6]; // 0xB6A(0x6) UNKNOWN PROPERTY
		FScalableFloat Row_PickUpInteractTime; // 0xB70(0x28)
		bool IsDelayingDeath; // 0xB98(0x1)
		bool OwnerDiedInVortex; // 0xB99(0x1)
		bool CollectedPickup; // 0xB9A(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/SCMachine/BGA_Athena_SCMachine_Pickup.BGA_Athena_SCMachine_Pickup_C");
			return ret;
		}

		bool BuildDataRegistryResolverScope(TArray<FName>& InOutResolverScopes, int32_t& InOutPriority); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UObject GetCacheContextOverride(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Enable Hide and Kill(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Mark as Pending Kill(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Mark Spawn Sound As Played(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Un Hide(int32_t UnHide); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Mark As Collected(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_CollectedPickup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintGetInteractionTime(AFortPawn* InteractingPawn, float& OutInteractionTime, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool CanHandleCleanupEvents(); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_HideAndKill(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldDie(float Damage, AController* EventInstigator, AActor* DamageCauser, bool bIsTest, FGameplayEffectContextHandle& EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText BlueprintGetInteractionString(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintCanInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted, TEnumAsByte<TInteractionType> InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_UnHide(); // Flags: HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DestroyPickup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintOnInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CollectPickup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDestroyPickup(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnSound(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideAndKillPickup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DelayDestroyPickup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BGA_Athena_SCMachine_Pickup_FortLinkToActor_K2Node_ComponentBoundEvent_4_OnLinkedActorDestroyed__DelegateSignature(AActor* DamageCauser); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BGA_Athena_SCMachine_Pickup(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Apollo/Water/Blueprints/BP_FluidSim_FN.BP_FluidSim_FN_C
	// Inherited from ABP_FluidSim_01_C -> ABP_FluidSimParent_C -> AActor -> UObject
	// Size: 0x1C0 (0x790 - 0x5D0)
	class ABP_FluidSim_FN_C : public ABP_FluidSim_01_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5D0(0x8)
		FFluidForceDynamic BoatForceSettings; // 0x5D8(0x70)
		FFluidForceDynamic PlayerForceSettings; // 0x648(0x70)
		FFluidForceDynamic MechForceSettings; // 0x6B8(0x70)
		TArray<AFortPawn*> RelevantFortPawns; // 0x728(0x10)
		bool Use_FN_Pawn_Forces; // 0x738(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x739(0x7) UNKNOWN PROPERTY
		TMap<FGameplayTag, FFluidForceDynamic> VehicleTypeMap; // 0x740(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Apollo/Water/Blueprints/BP_FluidSim_FN.BP_FluidSim_FN_C");
			return ret;
		}

		void GetFortnitePawnForces(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetLocalPawn(APawn* Pawn); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetPlayerPawnForces(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_FluidSim_FN(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Apollo/Environments/Landscape/Water/FortWaterBodyBP.FortWaterBodyBP_C
	// Inherited from AFortWaterBodyActor -> AWaterBody -> AActor -> UObject
	// Size: 0x10 (0x408 - 0x3F8)
	class AFortWaterBodyBP_C : public AFortWaterBodyActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3F8(0x8)
		ABP_FluidSim_FN_C* FluidSimBP; // 0x400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Apollo/Environments/Landscape/Water/FortWaterBodyBP.FortWaterBodyBP_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnReceivedBulletImpact(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FortWaterBodyBP(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Asteria/Environments/Water/Asteria_Waterbody_Ocean_Parent.Asteria_Waterbody_Ocean_Parent_C
	// Inherited from AFortWaterBodyBP_C -> AFortWaterBodyActor -> AWaterBody -> AActor -> UObject
	// Size: 0x10 (0x418 - 0x408)
	class AAsteria_Waterbody_Ocean_Parent_C : public AFortWaterBodyBP_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x408(0x8)
		UFortSplineWaterAudioComponent* FortSplineWaterAudio; // 0x410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Asteria/Environments/Water/Asteria_Waterbody_Ocean_Parent.Asteria_Waterbody_Ocean_Parent_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Asteria_Waterbody_Ocean_Parent(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/EnvironmentalItems/SCMachine/GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x80 (0xBC0 - 0xB40)
	class UGA_Athena_SCMachine_Passive_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawnAthena* PlayerPawn; // 0xB48(0x8)
		FVector SpawnZOffset; // 0xB50(0x18)
		FGameplayTag BlockChipSpawnTag; // 0xB68(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB6C(0x4) UNKNOWN PROPERTY
		FScalableFloat DropRebootCards; // 0xB70(0x28)
		FScalableFloat ShouldAutoCollectCards; // 0xB98(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/EnvironmentalItems/SCMachine/GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C");
			return ret;
		}

		bool AutoCollectCardsOverride(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AutoCollectCardsOnOceanKill(AFortPlayerPawnAthena* Pawn, double ZPos, bool& Hit Ocean, FTransform& Teamate Transform); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckPlayerChipSpawnEnabled(bool& IsChipSpawnEnabled); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Check Resurrection Active(bool& bEnabled); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SaveOutPlayer(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Spawn(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_SCMachine_Passive(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_SmashParent.GA_Athena_ZipLine_SmashParent_C
	// Inherited from UFortGameplayAbility_ZiplineSmashBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xB8 (0xC10 - 0xB58)
	class UGA_Athena_ZipLine_SmashParent_C : public UFortGameplayAbility_ZiplineSmashBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB58(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB60(0x8)
		double UpdateIntervalForSmashVolume; // 0xB68(0x8)
		UClass* StructureDamageGE; // 0xB70(0x8)
		ABP_ZipLine_Athena_Harness_C* ZiplineHarness; // 0xB78(0x8)
		AFortAthenaZipline* Zipline; // 0xB80(0x8)
		UPrimitiveComponent* ZiplineInteractComponent; // 0xB88(0x8)
		TEnumAsByte<EFortCustomMovement> DrivingCustomMovementMode; // 0xB90(0x1)
		unsigned char UnknownData00_6[0x3]; // 0xB91(0x3) UNKNOWN PROPERTY
		FActiveGameplayEffectHandle FallImmunityGEFX; // 0xB94(0x8)
		FGameplayTag AttachVFXCue; // 0xB9C(0x4)
		FGameplayTag SmashCue; // 0xBA0(0x4)
		FGameplayTag T_Swimming; // 0xBA4(0x4)
		FGameplayTag T_Falling; // 0xBA8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xBAC(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer TagsThatBlockFallImmunityRemoval; // 0xBB0(0x20)
		FTimerHandle TH_DelayFallDamageRemoval; // 0xBD0(0x8)
		FTimerHandle SurroundingsCheckTimerHandle; // 0xBD8(0x8)
		FGameplayTag ZiplineExitTag; // 0xBE0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xBE4(0x4) UNKNOWN PROPERTY
		FVector Smash_Box_Extent; // 0xBE8(0x18)
		double SmashBoxPosAdditionalZ; // 0xC00(0x8)
		UClass* GE_Ziplining_Passive; // 0xC08(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Athena/Items/Consumables/ZipLine/GA_Athena_ZipLine_SmashParent.GA_Athena_ZipLine_SmashParent_C");
			return ret;
		}

		void Get Zipline Motor Offset(FVector& Offset); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetZiplineRotationForMotor(FRotator& Rotation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Get Zipline Pole A Socket Loc(FVector& PoleBSocketLoc); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Get Zipline Pole B Socket Loc(FVector& PoleBSocketLoc); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckForQuestProgress(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckMotor(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Spawn Motor(AActor* PlayerPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BreakNearbyStructures(AFortPlayerPawn* PlayerPawn); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Removed_A0F18316443E5C5267615C9692274B36(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TagCountChanged_746A0F5B4A118C50DFD0AFB393033385(int32_t TagCount); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SurroundingsCheck(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
