#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Characters
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class /Game/Characters/Enemies/Blueprints/EnemyPawn_Interface.EnemyPawn_Interface_C
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEnemyPawn_Interface_C : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Enemies/Blueprints/EnemyPawn_Interface.EnemyPawn_Interface_C");
			return ret;
		}

		void TriggerDeathFX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Orphaned(bool& IsOrphaned, AFortPawn* AttachedPawn); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Default.TeamID_Default_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_Default_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Default.TeamID_Default_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Lime.TeamID_Lime_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_Lime_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Lime.TeamID_Lime_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Orange.TeamID_Orange_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_Orange_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_Orange.TeamID_Orange_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_10_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_10_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_10_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_11_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_11_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_11_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_12_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_12_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_12_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_13_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_13_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_13_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_14_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_14_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_14_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_15_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_15_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_15_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_16_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_16_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_16_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_17_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_17_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_17_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_18_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_18_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_18_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_19_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_19_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_19_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_20_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_20_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_20_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_21_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_21_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_21_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_22_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_22_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_22_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_23_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_23_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_23_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_24_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_24_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_24_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_25_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_25_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_25_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_26_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_26_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_26_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_27_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_27_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_27_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_28_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_28_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_28_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_30_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_30_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_30_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_29_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_29_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_29_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_31_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_31_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_31_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_32_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_32_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_32_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_33_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_33_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_33_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_34_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_34_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_34_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_35_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_35_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_35_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_36_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_36_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_36_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_37_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_37_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_37_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_38_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_38_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_38_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_39_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_39_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_39_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_40_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_40_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_40_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_41_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_41_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_41_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_42_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_42_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_42_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_43_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_43_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_43_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_44_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_44_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_44_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_45_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_45_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_45_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_46_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_46_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_46_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_47_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_47_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_47_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_48_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_48_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_48_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_49_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_49_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_49_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_50_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_50_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP.TeamID_PvP_50_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_03.TeamID_PvP_03_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_03_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_03.TeamID_PvP_03_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_04.TeamID_PvP_04_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_04_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_04.TeamID_PvP_04_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_05.TeamID_PvP_05_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_05_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_05.TeamID_PvP_05_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_06.TeamID_PvP_06_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_06_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_06.TeamID_PvP_06_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_07.TeamID_PvP_07_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_07_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_07.TeamID_PvP_07_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_08.TeamID_PvP_08_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_08_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_08.TeamID_PvP_08_C");
			return ret;
		}
	};


	// Class /Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_09.TeamID_PvP_09_C
	// Inherited from UFortTeamIdentification -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTeamID_PvP_09_C : public UFortTeamIdentification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/CharacterColorSwatches/TeamIdentification/TeamID_PvP_09.TeamID_PvP_09_C");
			return ret;
		}
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/VehicleAnimLayerInterface.VehicleAnimLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVehicleAnimLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/VehicleAnimLayerInterface.VehicleAnimLayerInterface_C");
			return ret;
		}

		void VehicleFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& VehicleFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleSplitBodyOverride(FPoseLink InPoseSplitBody, FPoseLink InPoseUpperAndLowerBody, FPoseLink InPoseUpperAndLowerBodyRemoveRoot, FPoseLink& VehicleSplitBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleLowerBodyOverride(FPoseLink InPoseLowerBodyDefault, FPoseLink InPoseUpperBody, FPoseLink& VehicleLowerBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& VehicleFullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ProceduralLayeringAnimInterface.ProceduralLayeringAnimInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UProceduralLayeringAnimInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ProceduralLayeringAnimInterface.ProceduralLayeringAnimInterface_C");
			return ret;
		}

		void ProceduralAdditivePose(FPoseLink InSourceLocomotionPose, FPoseLink InMotionMatchingPose, FPoseLink InProceduralLayeredPose, FPoseLink& ProceduralAdditivePose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ProceduralLayeredPose(FPoseLink InLocomotionPose, FPoseLink InPassThroughPose, FPoseLink& ProceduralLayeredPose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/SecondMovementModeLayerInterface.SecondMovementModeLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USecondMovementModeLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/SecondMovementModeLayerInterface.SecondMovementModeLayerInterface_C");
			return ret;
		}

		void SecondMovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& SecondMovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/PlayerAnimOverrideLayerInterface.PlayerAnimOverrideLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UPlayerAnimOverrideLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/PlayerAnimOverrideLayerInterface.PlayerAnimOverrideLayerInterface_C");
			return ret;
		}

		void PreLegIK(FPoseLink InPose, FPoseLink& PreLegIK); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ItemAnimLayerInterface.ItemAnimLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UItemAnimLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/ItemAnimLayerInterface.ItemAnimLayerInterface_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C
	// Inherited from UFortPlayerProceduralAdjustmentsAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x75DC (0x849C - 0xEC0)
	class UPlayer_ProceduralAdjustments_AnimBP_C : public UFortPlayerProceduralAdjustmentsAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xEC0(0xC)
		unsigned char UnknownData00_6[0x4]; // 0xECC(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xED0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xED8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0xEE0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xF00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xFB0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xFD0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1080(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x10A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1150(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1170(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1220(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1240(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x12F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1310(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x13C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x13E0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1490(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1560(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1580(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1630(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1650(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1700(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1720(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1740(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1760(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1780(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1830(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1850(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1900(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1920(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1940(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1960(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1980(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A30(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A50(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BB0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1BD0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C80(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CA0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D50(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1D70(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1D90(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1EB8(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1FE0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2000(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2128(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2250(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2378(0x128)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x24A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2550(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2570(0x128)
		FFortAnimNode_SlopeWarping FortAnimGraphNode_SlopeWarping; // 0x2698(0x2E8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2980(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x29A0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x29C0(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2A08(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2A28(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2A48(0x20)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2A68(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2B18(0xC8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2BE0(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2D08(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2E30(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2F18(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3040(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x3168(0xE8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3250(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3300(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3378(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x33A0(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x33C8(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x33E8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x34D0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x35B8(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x36A0(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x37C8(0x128)
		FAnimNode_Root AnimGraphNode_Root; // 0x38F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3910(0xB0)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x39C0(0x128)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3AE8(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3B30(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3B50(0x48)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3B98(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3CC0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3CE0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3D00(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3D20(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3E48(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3F70(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4098(0x128)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x41C0(0x48)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4208(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4330(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4350(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4478(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x45A0(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x45C0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4638(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4660(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4688(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x46B0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x46D8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4720(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x4748(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4768(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4788(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x48B0(0x128)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x49D8(0xB0)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4A88(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x4AA8(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4AC8(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4BF0(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4C10(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4C30(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4D58(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4D78(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4D98(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4DC0(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4EE8(0x128)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5010(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5038(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5080(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5130(0x78)
		FAnimNode_Root AnimGraphNode_Root; // 0x51A8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x51C8(0xB0)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5278(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5298(0xE8)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x5380(0x100)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x5480(0x100)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5580(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5668(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5750(0xE8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5838(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5858(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5940(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5A28(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5B50(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5C38(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5D20(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x5E48(0xE8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5F30(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6058(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6180(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x62A8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6390(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6478(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6560(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6648(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6730(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6818(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6900(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x69E8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6AD0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6BB8(0xE8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6CA0(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6CE8(0x78)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6D60(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6D80(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6DA8(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6DD0(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6DF0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6E10(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6E30(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6E78(0x28)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x6EA0(0x100)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6FA0(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6FC0(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x6FE0(0xE8)
		FAnimNode_Root AnimGraphNode_Root; // 0x70C8(0x20)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x70E8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x7130(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7220(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7298(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7310(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7338(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7380(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x73C8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7440(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7468(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7530(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x75A8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x75D0(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x75F8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x76C0(0xC8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x7788(0x128)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x78B0(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x78D8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x78F8(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7940(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7960(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7988(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7A00(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7A48(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7AF8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7B70(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7B98(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7C60(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7C88(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7D50(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7D78(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x7E40(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F08(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F30(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F58(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7F80(0x78)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x7FF8(0xB0)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x80A8(0x100)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x81A8(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8270(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8290(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x82B8(0xC8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8380(0x20)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x83A0(0xC0)
		bool IsHidingInProp; // 0x8460(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x8461(0x7) UNKNOWN PROPERTY
		FVector RightHandOverride; // 0x8468(0x18)
		FVector LeftHandOverride; // 0x8480(0x18)
		FName EmoteAnimOffsetCurveName; // 0x8498(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C");
			return ret;
		}

		void PreLegIK(FPoseLink InPose, FPoseLink& PreLegIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PostIKAdjustmentsLayer(FPoseLink InPosePostIkAdjustments, FPoseLink& PostIKAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreIKAdjustmentsLayer(FPoseLink InPosePreIKAdjustments, FPoseLink& PreIKAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlevisAndFeetAdjustmentsLayer(FPoseLink InPosePelvisAndFeetAdjustments, FPoseLink& PlevisAndFeetAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PushCannonAdjustmentsLayer(FPoseLink InPosePushCannonAdjustments, FPoseLink& PushCannonAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ParaGliderAdjustmentsLayer(FPoseLink InPoseParaGliderAdjustments, FPoseLink& ParaGliderAdjustmentsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandIKFixUpLayer(FPoseLink InPoseHandIk, FPoseLink& HandIKFixUpLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink InPosePostTurnInPlace, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_RigidBodyPBA_AnimBP_Template.Player_RigidBodyPBA_AnimBP_Template_C
	// Inherited from UAnimInstance -> UObject
	// Size: 0xE8 (0x4A0 - 0x3B8)
	class UPlayer_RigidBodyPBA_AnimBP_Template_C : public UAnimInstance	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x3B8(0x8) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x3C0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x3C8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x3D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3F0(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_RigidBodyPBA_AnimBP_Template.Player_RigidBodyPBA_AnimBP_Template_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x4D0 (0x18F0 - 0x1420)
	class UPlayer_SourcePose_AnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1420(0x88)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14A8(0x8)
		FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x14B0(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1558(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1560(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1580(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x15C8(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1610(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1650(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1690(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16D0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1718(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1760(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17A0(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x17E8(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1828(0x40)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1868(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x18A8(0x48)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetBlendListNode(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/MovementModeLayerInterface.MovementModeLayerInterface_C
	// Inherited from UAnimLayerInterface -> UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UMovementModeLayerInterface_C : public UAnimLayerInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/AnimLayerInterface/MovementModeLayerInterface.MovementModeLayerInterface_C");
			return ret;
		}

		void MovementMode_InAirOverride(FPoseLink InSource_Pose, FPoseLink InAirPose, FPoseLink& MovementMode_InAirOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_FirstPersonAdditives_AnimBP_Template.Player_FirstPersonAdditives_AnimBP_Template_C
	// Inherited from UAnimInstance -> UObject
	// Size: 0xE8 (0x4A0 - 0x3B8)
	class UPlayer_FirstPersonAdditives_AnimBP_Template_C : public UAnimInstance	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x3B8(0x8) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x3C0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x3C8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x3D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3F0(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_FirstPersonAdditives_AnimBP_Template.Player_FirstPersonAdditives_AnimBP_Template_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C
	// Inherited from UFortPlayerDebugAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x40 (0x570 - 0x530)
	class UPlayer_PropertiesDebug_AnimBP_C : public UFortPlayerDebugAnimInstance	
	{
	public:
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x530(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x538(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x540(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x560(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Common/PhysicalRimlight/PhysicalRimlight.PhysicalRimlight_C
	// Inherited from APhysicalRimLight -> AActor -> UObject
	// Size: 0x98 (0x3A8 - 0x310)
	class APhysicalRimlight_C : public APhysicalRimLight	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x8)
		USpotLightComponent* SpotLight; // 0x318(0x8)
		USceneComponent* DefaultSceneRoot; // 0x320(0x8)
		unsigned char UnknownData00_6[0x8]; // 0x328(0x8) UNKNOWN PROPERTY
		FTransform RightSideRim_Transform; // 0x330(0x60)
		FString l_cvarName; // 0x390(0x10)
		double RimlightVerticalOffset; // 0x3A0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Common/PhysicalRimlight/PhysicalRimlight.PhysicalRimlight_C");
			return ret;
		}

		void RimlightAttemptValidation(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PhysicalRimlight_AutoGenFunc(FString CVarName); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Day Phase Update(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PhysicalRimlight(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Blueprints/FortPlayerAnimComponentBP.FortPlayerAnimComponentBP_C
	// Inherited from UFortPlayerAnimationComponent -> UActorComponent -> UObject
	// Size: 0x0 (0x11F0 - 0x11F0)
	class UFortPlayerAnimComponentBP_C : public UFortPlayerAnimationComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Blueprints/FortPlayerAnimComponentBP.FortPlayerAnimComponentBP_C");
			return ret;
		}
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C
	// Inherited from UFortZiplineAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1BD0 (0x22D0 - 0x700)
	class UPlayer_ZipLine_AnimBP_C : public UFortZiplineAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x700(0x70)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x770(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x778(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x780(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x850(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x870(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x920(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x940(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x9F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xA10(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xAC0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xAE0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xB90(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xBB0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xC60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC80(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xD30(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0xD50(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD70(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDB8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xE00(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xE48(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xE90(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0xED8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xEF8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF40(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF88(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xFD0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1018(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x1060(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1080(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1130(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1150(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1200(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1220(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1240(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1260(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1280(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1330(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1350(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1400(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x14B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1580(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1650(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1670(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1698(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16E8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1710(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1738(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1780(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x17C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1810(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1858(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x18A0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18E8(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x19D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1A20(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1A68(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1AB0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1AF8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1B40(0x20)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1B60(0xB0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1C10(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1C38(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1CA8(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1D70(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1E38(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1E80(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x1EA0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1F68(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1FD8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x20A0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x20C0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2188(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2250(0x78)
		double PivotAnimBlendTime; // 0x22C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C
	// Inherited from UFortGoopAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1710 (0x1DF0 - 0x6E0)
	class UPlayer_Goop_AnimBP_C : public UFortGoopAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6E0(0x50)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x730(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x738(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x740(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x760(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x810(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x830(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x8E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x900(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x9B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xA80(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xAA0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xB50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xB70(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xC20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC40(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xCF0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD10(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDA0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDE8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xE30(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0xE78(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xE98(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xEE0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF28(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF70(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xFB8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x1000(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1020(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1040(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x10F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1110(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x11C0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x11E0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1200(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1220(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1240(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x12F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1310(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x13C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1470(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1490(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1540(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1560(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1610(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1630(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1658(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1680(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x16C8(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1790(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x17D8(0x70)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1848(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1870(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1938(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19A8(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x19C8(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1A90(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1B58(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1BC8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1BE8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1CB0(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x1D28(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C
	// Inherited from UFortFirstPersonAdditivesAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x390 (0x17C0 - 0x1430)
	class UPlayer_FirstPersonAdditives_AnimBP_C : public UFortFirstPersonAdditivesAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1430(0xC)
		unsigned char UnknownData00_6[0x4]; // 0x143C(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1440(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1448(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1450(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1470(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1498(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1508(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1550(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15C0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15E0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1628(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1648(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1710(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C
	// Inherited from UFortPlayerInAirAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x34F8 (0x4928 - 0x1430)
	class UPlayer_InAir_AnimBP_C : public UFortPlayerInAirAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1430(0x80)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14B0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14B8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x14C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14E0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1590(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1660(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1680(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1730(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1750(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1800(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1820(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18F0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x19A0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x19C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A70(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A90(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AB0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AD0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1AF0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BA0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1BC0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C70(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C90(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CB0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CD0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CF0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1DA0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1DC0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E70(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F40(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1FF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2010(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x20C0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x20E0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2128(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2170(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x21B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2200(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2248(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2290(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x22A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22E8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2330(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2378(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2398(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23E0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2428(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2470(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24B8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2500(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2548(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2558(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25A0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x25E8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2630(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2650(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2698(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x26E0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2728(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2770(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27B8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2800(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2848(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2890(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x28A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28E8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2930(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2978(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2998(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2A48(0x78)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2AC0(0xF0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C00(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D40(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D68(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D90(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2DD8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2DF8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2E40(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2E60(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2EA8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2EC8(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2F90(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2FB8(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3080(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3120(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3148(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3170(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3198(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x31C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x31E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3210(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3238(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3260(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3328(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3338(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x33F8(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x34C0(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x35B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x35F8(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3618(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x36E0(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x36F0(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x37B0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3878(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x38C0(0xF0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x39B0(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x39D0(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3A98(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3AA8(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x3B68(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3C30(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3D20(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3D68(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3D88(0xC8)
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x3E50(0x420)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4270(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x42E0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x43A8(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x43F0(0x120)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4510(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4600(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4610(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4700(0x10)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4710(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x47D8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4820(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4848(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4890(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x48B8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4900(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void JumpUpAdditive(FPoseLink& JumpUpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void JumpLoopAdditive(FPoseLink& JumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FallAdditive(FPoseLink& FallAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink SourcePose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C
	// Inherited from UFortSprintAnimInstance -> UFortLocomotionAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1470 (0x28E0 - 0x1470)
	class UPlayer_Sprint_AnimBP_C : public UFortSprintAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1470(0x2C)
		unsigned char UnknownData00_6[0x4]; // 0x149C(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14A0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14A8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x14B0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1520(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1548(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1570(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15B8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1600(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1648(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1668(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x16B0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16F8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1740(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1760(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1788(0xC8)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1850(0xB0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1900(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1970(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1A38(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B00(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1B48(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B90(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1BD8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C20(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C68(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1CB0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1D78(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1E40(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1E88(0xC8)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x1F50(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1F98(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1FC0(0xF0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x20B0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2120(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2190(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x21D8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2200(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x2228(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2270(0xF0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2360(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2380(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2448(0x78)
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x24C0(0x420)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C
	// Inherited from UFortLocomotionAdditivesAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x42B0 (0x5750 - 0x14A0)
	class UPlayer_LocomotionAdditives_AnimBP_C : public UFortLocomotionAdditivesAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x14A0(0x188)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1628(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1630(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1638(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1658(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1708(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1728(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17F8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18A8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18C8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1978(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1998(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A48(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A68(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B18(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B38(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BE8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C08(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C28(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C48(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C68(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D18(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D38(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1DE8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E08(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E28(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E48(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E68(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F18(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F38(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FE8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2098(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20B8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2168(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2188(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2238(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2258(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2308(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x23B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x23D8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2488(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2538(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2558(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2608(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2628(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x26D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x26F8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x27A8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x27C8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2878(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2898(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2948(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x29F8(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x2A18(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2AE0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2B28(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2B70(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2B80(0xC0)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2C40(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D00(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D48(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2D90(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2DB0(0xC8)
		FAnimNode_Root AnimGraphNode_Root; // 0x2E78(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2EE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F10(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F38(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2FA8(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3018(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3060(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x30A8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3118(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3138(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x31A8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x31F0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3260(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x32D0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3318(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3388(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x33D0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3440(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x34B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x34F8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3518(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3540(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3608(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3678(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x36E8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3730(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3778(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x37E8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3830(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x38A0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x38E8(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3958(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x39A0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3A10(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3A80(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3AC8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3AE8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3BB0(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3C28(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3C70(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3C98(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3D60(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3D70(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3E60(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3E70(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3F60(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3F70(0xF0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4060(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4088(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4100(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4128(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4150(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4178(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x41A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x41C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x41F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4218(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4240(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4268(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4290(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4308(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4330(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4358(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x43A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x43E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4430(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4478(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x44C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4508(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4550(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4598(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x45E0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4600(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4628(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4670(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4760(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x47A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x47F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4838(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4880(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x48A0(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x48C8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4910(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4A00(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4A48(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4A90(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4AD8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4B20(0x20)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4B40(0x120)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4C60(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C88(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4CD0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4D18(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4D60(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4E50(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4E98(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4EE0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4F28(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4F70(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4F90(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4FB8(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x5000(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x50C0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5108(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x51F8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5240(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5288(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x52D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5318(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5338(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5360(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5380(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x53A8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x53C8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5490(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x54B0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5578(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x55F0(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5668(0xC8)
		bool IsSnowman; // 0x5730(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x5731(0x7) UNKNOWN PROPERTY
		double StartAnimBlendTime; // 0x5738(0x8)
		double PivotAnimBlendTime; // 0x5740(0x8)
		double CrouchPlayRate; // 0x5748(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IdleAdditiveLayer(FPoseLink& IdleAdditiveLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x24E0 (0x3900 - 0x1420)
	class UPlayer_FullBodyAimOffsets_AnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1420(0x18)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1438(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1440(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1448(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1468(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1518(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1538(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x15E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1608(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x16B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x16D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1788(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1858(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1878(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1928(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1948(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x19F8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A18(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A38(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A78(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B48(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C18(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C38(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C78(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D48(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1DF8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1EA8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1EC8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F78(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F98(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2048(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2068(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2118(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x21C8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x21E8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2298(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2348(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2368(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2418(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2438(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x24E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2508(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x25B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x25D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2688(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x26A8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2758(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2808(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2828(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x28D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x28F8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x29A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2A58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2A78(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2B28(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2BD8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2C88(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2CA8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2D58(0x20)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2D78(0x118)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2E90(0x118)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2FA8(0xC0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3068(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x30E0(0xB0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3190(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x31B8(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x31E0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3200(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3228(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x32A0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3368(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3430(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3458(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3480(0x28)
		FAnimNode_ResetRoot AnimGraphNode_ResetRoot; // 0x34A8(0xD8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3580(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x35A0(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x35C0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3638(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3660(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x36A8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x36D0(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3798(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3848(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38C0(0x28)
		double __CustomProperty_Pitch_61C65E4944F5DB18DC8B6496B9622A88; // 0x38E8(0x8)
		double __CustomProperty_Yaw_61C65E4944F5DB18DC8B6496B9622A88; // 0x38F0(0x8)
		double __CustomProperty_AimOffsetAlpha_61C65E4944F5DB18DC8B6496B9622A88; // 0x38F8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& VehicleFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleLowerBodyOverride(FPoseLink InPoseLowerBodyDefault, FPoseLink InPoseUpperBody, FPoseLink& VehicleLowerBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleSplitBodyOverride(FPoseLink InPoseSplitBody, FPoseLink InPoseUpperAndLowerBody, FPoseLink InPoseUpperAndLowerBodyRemoveRoot, FPoseLink& VehicleSplitBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void VehicleFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& VehicleFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FullBodyAimingOffsetsLayer(FPoseLink InFullBodyAimOffsetsBasePose, FPoseLink& FullBodyAimingOffsetsLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C
	// Inherited from UFortWalkAnimInstance -> UFortLocomotionAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x3DD8 (0x52E8 - 0x1510)
	class UPlayer_LowerBodyJog_AnimBP_C : public UFortWalkAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1510(0x130)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1640(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1648(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1650(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1670(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1720(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1740(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1810(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18E0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1990(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x19B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A80(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B30(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B50(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C00(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C20(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C40(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C80(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D30(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D50(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E00(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E20(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E40(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E80(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F30(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F50(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2000(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x20B0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2180(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x21A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2250(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2270(0x70)
		FAnimNode_Root AnimGraphNode_Root; // 0x22E0(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2300(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2348(0xB0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x23F8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2468(0x70)
		FAnimNode_Root AnimGraphNode_Root; // 0x24D8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x24F8(0x70)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2568(0xB0)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x2618(0x200)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2818(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2838(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2858(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x28A0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2910(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2980(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x29C8(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2A38(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2A80(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B40(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2DC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2DE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2E38(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2E60(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2EA8(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2F58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2FA0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2FE8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3030(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3078(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3098(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x30E0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3100(0x20)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x3120(0x200)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3320(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3368(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3418(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x34C8(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3578(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3628(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3670(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x36B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3700(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3720(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3768(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3818(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3860(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x38A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x38F0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3938(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3958(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3978(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3998(0x128)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3AC0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3B08(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B50(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B98(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3BE0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3C28(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3C70(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3CB8(0xF0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3DA8(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3E58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3EA0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3EE8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3F30(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3F50(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3F70(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3F90(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x40B8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x40D8(0x20)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x40F8(0x200)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x42F8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4340(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4388(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x43D0(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4490(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x44D8(0xB0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4588(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x45A8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x45D0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4618(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4660(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x46A8(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4770(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4790(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x47B0(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x48D8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x48F8(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4920(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4940(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4960(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4A88(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4AA8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4B70(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4C38(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x4D00(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4DC8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4E38(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4EA8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4EF0(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4FB8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5000(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5048(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5068(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5130(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x51A8(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5258(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x52A0(0x28)
		double JogStartPosition; // 0x52C8(0x8)
		double CrouchPlayRate; // 0x52D0(0x8)
		double PivotAnimBlendTime; // 0x52D8(0x8)
		double StartAnimBlendTime; // 0x52E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Movement_HeavyWeapon(FPoseLink& Movement_HeavyWeapon); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Movement_Crouching(FPoseLink& Movement_Crouching); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Movement_Standing(FPoseLink& Movement_Standing); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink UpperBody, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C
	// Inherited from UFortPlayerBuildingAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x4D8 (0x9A8 - 0x4D0)
	class UPlayer_BuildingPose_AnimBP_C : public UFortPlayerBuildingAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4D0(0x5)
		unsigned char UnknownData00_6[0x3]; // 0x4D5(0x3) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x4D8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x4E0(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x4E8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x508(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x530(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x558(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x580(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5F0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x638(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x680(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6C8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x710(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x758(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7A0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x808(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x850(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x898(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8B8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8E0(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNO_AnimBP.Player_DBNO_AnimBP_C
	// Inherited from UFortDBNOAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x8C1 (0xDA1 - 0x4E0)
	class UPlayer_DBNO_AnimBP_C : public UFortDBNOAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4E0(0x18)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x4F8(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x500(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x508(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x528(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x550(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x578(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x618(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x640(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x668(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x690(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x700(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x720(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x768(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x788(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7D0(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7F0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x860(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x880(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8C8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8E8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x910(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x9D8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xAA0(0x70)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xB10(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xC38(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xC58(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xC78(0x128)
		bool AdjustLargeBody; // 0xDA0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNO_AnimBP.Player_DBNO_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C
	// Inherited from UFortPlayerDBNOCarriedAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x2078 (0x2638 - 0x5C0)
	class UPlayer_DBNOCarried_AnimBP_C : public UFortPlayerDBNOCarriedAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x5C0(0x4C)
		unsigned char UnknownData00_6[0x4]; // 0x60C(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x610(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x618(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x620(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x640(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x660(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x788(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8F8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x940(0xC8)
		unsigned char UnknownData01_6[0x8]; // 0xA08(0x8) UNKNOWN PROPERTY
		FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xA10(0x260)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xC70(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB8(0x28)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xCE0(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD20(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xD40(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xDB0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xE78(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xF40(0x70)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xFB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xFD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1000(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1028(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1050(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1078(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x10A0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10C8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1110(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x11D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1220(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1240(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1288(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x12D0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1340(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1408(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1450(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1518(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1560(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1580(0x40)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1608(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1650(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1698(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x16D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1720(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1768(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1788(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x17D0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1898(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x18E0(0xC8)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x19A8(0x40)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x19E8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1A30(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1A78(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1AB8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B00(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1B48(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1B90(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1BD8(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C18(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C60(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1CA8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1CF0(0x48)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1D38(0x40)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1D78(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1DC0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1DE0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1E28(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1EF0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1F38(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1F58(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2020(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x2040(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2080(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x20A0(0xC8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2168(0x20)
		unsigned char UnknownData02_6[0x8]; // 0x2188(0x8) UNKNOWN PROPERTY
		FAnimNode_Trail AnimGraphNode_Trail; // 0x2190(0x2A0)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x2430(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x2478(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x24C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2508(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2550(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x25C8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x25F0(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2618(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x6E8 (0x1B08 - 0x1420)
	class UPlayer_FreeFlying_AnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1420(0x48)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1468(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1470(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1478(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1498(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x14C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1508(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1550(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1598(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x15E0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1628(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1698(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1760(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1780(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x17C8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1810(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1858(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x18A0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x18E8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1958(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1A20(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1A40(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C
	// Inherited from UFortSkydivingAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x8B1A (0x93DA - 0x8C0)
	class UPlayer_SkyDiveAndGlide_AnimBP_C : public UFortSkydivingAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x8C0(0x42C)
		unsigned char UnknownData00_6[0x4]; // 0xCEC(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xCF0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xCF8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0xD00(0x20)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xD20(0x10)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD30(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xD78(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xE40(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xF08(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xF78(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xFE8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10B0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10F8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1140(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1208(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1250(0x48)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1298(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x12E0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1300(0xC8)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x13C8(0x10)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x13D8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1420(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1490(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1500(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x15C8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1610(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1680(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1748(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x17B8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1880(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x18F0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1960(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x19D0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1A40(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1AB0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1B20(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1B90(0xC8)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1C58(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1CA0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1CC0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1D88(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1E00(0x78)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F40(0x28)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1F68(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2028(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2098(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2108(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x21D0(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2298(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2358(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x23C8(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2438(0x48)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2480(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x24C8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2538(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x25A8(0x70)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2618(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2660(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26F0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2738(0x20)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2758(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2830(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2878(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2898(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2910(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2938(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2960(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2988(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2A00(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2A28(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2A98(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2B08(0xC0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2BC8(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2C90(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2D50(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2DC0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2E30(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2EF8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2F68(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F88(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2FF8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3040(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x30B0(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x30F8(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x31B8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3228(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3298(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3358(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x33C8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3438(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3500(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x35C8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3638(0x20)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x3658(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3668(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3688(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3750(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3778(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x37E8(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3808(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38D0(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x38F8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3968(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3988(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3A50(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3A70(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3A98(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3B60(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3BD0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3C98(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3D08(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3D78(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3D98(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3E08(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3ED0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3F40(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3F60(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4028(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4050(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x40C0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4130(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x41A0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4210(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4280(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x42F0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4360(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x43A8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x43F0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4438(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x44A8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4518(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4588(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4650(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4718(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4760(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x47A8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x47F0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4860(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4880(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x48F0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4960(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x49D0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4A40(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4AB0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4B20(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4B90(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C00(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C48(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4C90(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4CD8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4D48(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4E10(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4E80(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x4EC8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4F10(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4FD8(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5048(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5090(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x50B0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5178(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x51C0(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5208(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5230(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5258(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5280(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5320(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5348(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5370(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5398(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x53C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x53E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5410(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5438(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5460(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5488(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x54B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x54D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5500(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5528(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5550(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5578(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x55C0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x55E0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5628(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5648(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5690(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x56B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x56F8(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5718(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5728(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5748(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5810(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5830(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5878(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x58C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5908(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5950(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5998(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x59E0(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5A00(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5A70(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5AE0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5B50(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5BC0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5C30(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5C78(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5CC0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5D08(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x5D28(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5D38(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5D58(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5E20(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5E48(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5F10(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5F80(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5FA0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6068(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6130(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x61A0(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6268(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x62D8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6348(0x20)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6368(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x63B0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6420(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6490(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6558(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6620(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6690(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6700(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6720(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x67E8(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x68B0(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6978(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x69A0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6A10(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6A80(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6AF0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6B60(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6BD0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6C40(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6CB0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6D20(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6D90(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6E00(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6E70(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6EE0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6F50(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6FC0(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x7030(0xC0)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x70F0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7138(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7180(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x71C8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7210(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7258(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x72A0(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7368(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7430(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7478(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x74C0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7508(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7578(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7598(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7608(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7678(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x76E8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7758(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x77C8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7838(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x78A8(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7918(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7960(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x79A8(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x79F0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7A60(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7B28(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7B98(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7BE0(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7C28(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7CF0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7D60(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7DA8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x7DC8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7E90(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7EB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7ED8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F00(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7F78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7FA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7FC8(0x28)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x7FF0(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8000(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8020(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8090(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8100(0xC0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x81C0(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8288(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8348(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x83B8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8428(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x84F0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8560(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8580(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x85F0(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8638(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x86A8(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x86F0(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x87B0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8820(0x70)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8890(0xC0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8950(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x89C0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8A30(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8AF8(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8BC0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8C30(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8C50(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8C98(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8D08(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8D78(0xC8)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8E40(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8E88(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8F50(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8F78(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8F98(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x9060(0x70)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x90D0(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x90F8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9118(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x91E0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9200(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x92C8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x92E8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9310(0xC8)
		bool ParaGlide_TriggerAnim; // 0x93D8(0x1)
		bool BlockAnimRule; // 0x93D9(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C
	// Inherited from UFortPlayerLandingAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x25F0 (0x3A20 - 0x1430)
	class UPlayer_Land_AnimBP_C : public UFortPlayerLandingAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1430(0x30)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1460(0x8)
		FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x1468(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1510(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1518(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1538(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x15E8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1608(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x16B8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x16D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1788(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1858(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1878(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1928(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1948(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x19F8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A18(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AC8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AE8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B08(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B48(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C18(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CC8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1CE8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1D30(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1D78(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D88(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1DA8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1DF0(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1E38(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E48(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1E68(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1EB0(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1EF8(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F08(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F28(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1FD8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FF8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x20A8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2158(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2178(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2228(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2248(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x22F8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2318(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2360(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23A8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x23F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2438(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2480(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x24C8(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2510(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2558(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x25A0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x25E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2630(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2678(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2708(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2750(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2798(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27E0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2828(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2870(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2900(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2948(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2990(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29D8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2A20(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2A68(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2AB0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2AF8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2B40(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2B88(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2BD0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2C18(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x2C60(0x120)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2D80(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2DC8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2E10(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2E58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2EA0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2EE8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2F30(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3018(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3040(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3068(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3130(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3150(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3218(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3238(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3300(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3320(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3330(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x33F0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x34B8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3580(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x35C8(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x36B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3700(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3748(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3790(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x37D8(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3820(0xC0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x38E0(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x38F0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3938(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3958(0xC8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FallLandAdditive(FPoseLink& FallLandAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLandingBecomesRelevant(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLandingUpdate(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_Proto_AnimBP.Player_InAir_Proto_AnimBP_C
	// Inherited from UFortPlayerInAirAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x3288 (0x46B8 - 0x1430)
	class UPlayer_InAir_Proto_AnimBP_C : public UFortPlayerInAirAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1430(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1438(0x88)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14C0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14C8(0x8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14D0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1580(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15A0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1650(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1670(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1720(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1740(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x17F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1810(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x18E0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1990(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19B0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19D0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A10(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AC0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1AE0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B90(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BB0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BD0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C10(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CC0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CE0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D90(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E40(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E60(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1F30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1FE0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2000(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2048(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2090(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x20D8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2120(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2168(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x21B0(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x21C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2208(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2250(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2298(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2300(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2348(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2390(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23D8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2420(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2468(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2478(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24C0(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2508(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2550(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2570(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25B8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2600(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2648(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2690(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26D8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2720(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2768(0x48)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x27B0(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x27C0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2808(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2850(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2898(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x28B8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2968(0x78)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x29E0(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2AD0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2AF0(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2B18(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2BE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2CF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2D98(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2DC0(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2E88(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2E98(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2F58(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3020(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3110(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3158(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3178(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3240(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3250(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3310(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x33D8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3420(0xF0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3510(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3530(0xC8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x35F8(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3608(0xC0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x36C8(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3790(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3880(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x38C8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x38E8(0xC8)
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x39B0(0x420)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3DD0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3E80(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3EA0(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3F10(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x3F58(0x120)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4078(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4168(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4178(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4268(0x10)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4278(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x42F0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4318(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4360(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4380(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x43C8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x43E8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4458(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4478(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4540(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4588(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x45B0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x45F8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4620(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4668(0x28)
		bool InAir_Jumping; // 0x4690(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x4691(0x7) UNKNOWN PROPERTY
		AFortPlayerController* FortPlayerController; // 0x4698(0x8)
		float PlayerVelocity; // 0x46A0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x46A4(0x4) UNKNOWN PROPERTY
		double CrappyTempFlaotTarget; // 0x46A8(0x8)
		double CrappyTempFloat; // 0x46B0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_Proto_AnimBP.Player_InAir_Proto_AnimBP_C");
			return ret;
		}

		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void JumpUpAdditive(FPoseLink& JumpUpAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void JumpLoopAdditive(FPoseLink& JumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FallAdditive(FPoseLink& FallAdditive); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink SourcePose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_E40FAFA845278A1E059C6C994794E1D1(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_0CC6851B4F8E3664299328A4F5897FC6(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_3546925B456E275E991CE08EFFBD987A(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_InAir_Proto_AnimBP_AnimGraphNode_TransitionResult_045CF7A54FE6B606710C0488ECF4F4DC(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintInitializeAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Player_InAir_Proto_AnimBP(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C
	// Inherited from UFortPlayerTacticalStateAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x2D80 (0x41D0 - 0x1450)
	class UPlayer_TacticalState_AnimBP_C : public UFortPlayerTacticalStateAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1450(0x2C)
		unsigned char UnknownData00_6[0x4]; // 0x147C(0x4) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1480(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1488(0x8)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x1490(0x10)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1530(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1578(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15C0(0xB0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1670(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x16B8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x1700(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1720(0x70)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1790(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x17B8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1880(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x18A0(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1968(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1990(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x19B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x19E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1A80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1AA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1AD0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1AF8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1B40(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1B60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1B88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1BB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1BD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1C00(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C28(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C70(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1CB8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1D00(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1D20(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1D68(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1DB0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1DF8(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1E18(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1E60(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1EA8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1EF0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1F10(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1F58(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1FA0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1FE8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2008(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2050(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2098(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x20E0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2100(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2128(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x21F0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2210(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2238(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2260(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2288(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22D8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2300(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2328(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2350(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2398(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x23E0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2428(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2448(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2490(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x24D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2520(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2540(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2588(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2618(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2638(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2680(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26C8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2710(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2730(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2778(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27C0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2808(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2828(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2870(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x28B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2900(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2920(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2968(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29F8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2A18(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2A60(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2AA8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2AF0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2B10(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2B38(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2C00(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2C20(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2C48(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2C90(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2CB0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2CF8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D18(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2D60(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2D80(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2E48(0x78)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2EC0(0xB0)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2F70(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2FE0(0xC8)
		unsigned char UnknownData01_6[0x8]; // 0x30A8(0x8) UNKNOWN PROPERTY
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x30B0(0x530)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x35E0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3690(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3708(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3730(0x48)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3778(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x37C0(0xC8)
		FAnimNode_Root AnimGraphNode_Root; // 0x3888(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x38A8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x38C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x38F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3918(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3940(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3968(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3990(0x28)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x39B8(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3AD8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3B20(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3B40(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B68(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3BB0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3BD0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3C18(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3C38(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3D00(0x48)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3D48(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3E10(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3ED8(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3F20(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3F98(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3FC0(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3FE8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4058(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4120(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C");
			return ret;
		}

		void WeaponBoneFixLayer(FPoseLink InPose, FPoseLink& WeaponBoneFixLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TacticalSprintLayer(FPoseLink InPoseTacticalSprint, FPoseLink& TacticalSprintLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink InPoseTacticalState, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C
	// Inherited from UFortSwimmingLayerAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x4788 (0x51B8 - 0xA30)
	class USwimmingAnimBP_C : public UFortSwimmingLayerAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xA30(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0xA38(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0xAE0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0xAE8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0xAF0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xB10(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xBC0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0xC70(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xC90(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xD40(0x48)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xD88(0x118)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xEA0(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xEE8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xF98(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1010(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1038(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x1060(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1080(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1130(0xB0)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x11E0(0x118)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x12F8(0x118)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1410(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1438(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1460(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1488(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x14B0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1520(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1540(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1588(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15F0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1610(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1658(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1678(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1740(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17B8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1800(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1828(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1918(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1940(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1988(0xC0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1A48(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1AC0(0x28)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1AE8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1B30(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1B58(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C20(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C68(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1CB0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CD8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CF8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1DA8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1E20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2000(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2028(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2050(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2078(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x20A0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x20C0(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x21E8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2208(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2230(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2258(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2280(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22A8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x22F0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2338(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2380(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x23A0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2410(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2430(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2478(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2498(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2560(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2580(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25A8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x25F0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2610(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2638(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2658(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2680(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x26A0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2768(0x78)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x27E0(0xC0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2918(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2940(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29B0(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x29D0(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2A40(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2A88(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2AF8(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2B18(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2B88(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2BD0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2C40(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2C60(0xC8)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2D28(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2DD8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2DF8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2EA8(0xB0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2F80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2FF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3020(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3048(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3070(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3098(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x30C0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x30E8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3130(0x20)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3150(0x118)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3268(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3288(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x33B0(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x33D0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3440(0x20)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3460(0x118)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3578(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3598(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x36C0(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x36E0(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3750(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3770(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x37B8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x37D8(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3800(0x128)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3928(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3948(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3968(0x128)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3A90(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3AB0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3AD0(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3BF8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3C18(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3CE0(0x78)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3D58(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3DC8(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3E10(0xC0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3ED0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3EF0(0xB0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3FA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3FC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3FF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4018(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4040(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4068(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4090(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x40E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4108(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4130(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4178(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4198(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4208(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4228(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4270(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4290(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x42D8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4320(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4368(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x43B0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x43F8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4440(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4488(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x44D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4518(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4538(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x45A8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x45C8(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4690(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x46D8(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x47C8(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x47D8(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x48C8(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x48D8(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x49C8(0x10)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x49D8(0xC0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4A98(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4AE0(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4B50(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4BC0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4BE0(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4CA8(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x4D98(0x10)
		FAnimNode_Root AnimGraphNode_Root; // 0x4DA8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4DC8(0xB0)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x4E78(0x40)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x4EB8(0xC0)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x4F78(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4FB8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5000(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5048(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x50C0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x50E8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5110(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5158(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x5180(0x20)
		bool AllowSprintStop; // 0x51A0(0x1)
		bool ChangeMovementToVelocityFromAccel; // 0x51A1(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x51A2(0x6) UNKNOWN PROPERTY
		double LocalAccelYawAngleAtStart; // 0x51A8(0x8)
		double PivotAngle; // 0x51B0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C");
			return ret;
		}

		void MovementMode_AimOffset(FPoseLink InAimOffsetsPose, FPoseLink InSourcePosePreAimOffsets, FPoseLink& MovementMode_AimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FinalPoseOverride(FPoseLink InFinalPose, FPoseLink& MovementMode_FinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_FullBodyOverride(FPoseLink InputPoseFullBody, FPoseLink& MovementMode_FullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LowerBodyOverride(FPoseLink InLowerBodyPose, FPoseLink InSourcePose, FPoseLink& MovementMode_LowerBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_LocomotionAdditives(FPoseLink InLocomotionAdditivesPose, FPoseLink& MovementMode_LocomotionAdditives); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MovementMode_SourcePose(FPoseLink InSourcePoseBase, FPoseLink& MovementMode_SourcePose); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Dive Jump Ground Land Update(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_SwimSprintStart_Entered_Layer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_SwimSprintStart_Exited_Layer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_SwimSprint_Entered_Layer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_SwimSprintSlow_Entered_Layer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_SwimStartAdditive_Entered_Layer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_SwimMovementAccelAdditive_Exited_Layer(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SwimmingAnimBP(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C
	// Inherited from UFortPlayerProceduralLayeringAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x5B1B (0x727B - 0x1760)
	class UPlayer_ProceduralLayering_AnimBP_C : public UFortPlayerProceduralLayeringAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1760(0x28)
		FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x1788(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1790(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1798(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x17A0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17C0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1870(0xB0)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1920(0x40)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1960(0x48)
		FAnimNode_BoneMask AnimGraphNode_BoneMask; // 0x19A8(0xF8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1AA0(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1B90(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1C08(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1C30(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1C58(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1CA0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CC8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CE8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D98(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E48(0xB0)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1EF8(0x20)
		FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x1F18(0x128)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2040(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2128(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2210(0xE8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x22F8(0x20)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2318(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x2400(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x24E8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x25D0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x26B8(0xE8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x27A0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x27C8(0x28)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x27F0(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x28D8(0xE8)
		FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x29C0(0xE8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2AA8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2AD0(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2AF8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2B18(0x20)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x2B38(0x100)
		FAnimNode_LegIK AnimGraphNode_LegIK; // 0x2C38(0x100)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2D38(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2D60(0x48)
		FAnimNode_BlendStackInput AnimGraphNode_BlendStackInput; // 0x2DA8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2DD0(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2DF8(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2EC0(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2EE8(0xC8)
		FAnimNode_Root AnimGraphNode_BlendStackResult; // 0x2FB0(0x20)
		FAnimNode_BlendStack AnimGraphNode_BlendStack; // 0x2FD0(0x130)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3100(0x78)
		FAnimNode_PoseSearchHistoryCollector AnimGraphNode_PoseSearchHistoryCollector; // 0x3178(0x2D8)
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x3450(0x530)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3980(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x39F8(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3A70(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3B38(0x78)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3BB0(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3CA0(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3CE8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3D60(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3D88(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3DB0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3E28(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3E50(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x3E78(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x3E98(0x40)
		FAnimNode_Root AnimGraphNode_Root; // 0x3ED8(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3EF8(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3F70(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3FE8(0x78)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4060(0x120)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4180(0x120)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x42A0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4350(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4400(0xB0)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x44B0(0x1E0)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x4690(0x1E0)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x4870(0x1E0)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4A50(0x20)
		FAnimNode_CopyMotion AnimGraphNode_CopyMotion; // 0x4A70(0x1E0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4C50(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4C98(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4CB8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4CD8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4CF8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4D18(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4D38(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4D58(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4D80(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4DA8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4DC8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4DE8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E10(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E38(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4E60(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E80(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4EA8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4EC8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4EE8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4F10(0x28)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4F38(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4F58(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4F78(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4FA0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4FC8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5010(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x5038(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5058(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x50D0(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5180(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x51C8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x51E8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5208(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5228(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5250(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5278(0x20)
		FAnimNode_CopyBoneAdvanced AnimGraphNode_CopyBoneAdvanced; // 0x5298(0x128)
		FAnimNode_CopyBoneAdvanced AnimGraphNode_CopyBoneAdvanced; // 0x53C0(0x128)
		FAnimNode_CopyBoneAdvanced AnimGraphNode_CopyBoneAdvanced; // 0x54E8(0x128)
		FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x5610(0x128)
		FAnimNode_Root AnimGraphNode_Root; // 0x5738(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5758(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5808(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x58B8(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5980(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5A48(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5A68(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5AE0(0x28)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5B08(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5B28(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5C50(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5D78(0x128)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x5EA0(0xC0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5F60(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5FD8(0x28)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6000(0xB0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x60B0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x60D8(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x60F8(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6170(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x61E8(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6260(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6310(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x63C0(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6470(0xB0)
		FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x6520(0x38)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6558(0x78)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x65D0(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6698(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x66C0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6738(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6760(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x67A8(0x28)
		FAnimNode_BoneMask AnimGraphNode_BoneMask; // 0x67D0(0xF8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x68C8(0xC0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6988(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6A38(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6AB0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6AD8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B00(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B28(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B50(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6B78(0xF0)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6C68(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6D58(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x6D80(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6DA0(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6E18(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6E90(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6F40(0xB0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6FF0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7018(0x28)
		FAnimNode_BoneMask AnimGraphNode_BoneMask; // 0x7040(0xF8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x7138(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7228(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x7250(0x20)
		UCurveVector* HipRemapCurve; // 0x7270(0x8)
		bool IsSwinging; // 0x7278(0x1)
		bool IsCrouchTransition; // 0x7279(0x1)
		bool NonAttachedHandSet; // 0x727A(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C");
			return ret;
		}

		void ProceduralLayeredPose(FPoseLink InLocomotionPose, FPoseLink InPassThroughPose, FPoseLink& ProceduralLayeredPose); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ProceduralAdditivePose(FPoseLink InSourceLocomotionPose, FPoseLink InMotionMatchingPose, FPoseLink InProceduralLayeredPose, FPoseLink& ProceduralAdditivePose); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BasePose(FPoseLink& BasePose); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CopyMotionLayer(FPoseLink CopyMotion_InBaseLocomotionPose, FPoseLink CopyMotion_InBasePose, FPoseLink CopyMotion_InLayeredLocomotionPose, FPoseLink& CopyMotionLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CopyBoneLayer(FPoseLink InCopyBoneLayerPose, FPoseLink& CopyBoneLayer); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ProceduralLayering(FPoseLink ProcLayer_InBaseLocomotionPose, FPoseLink ProcLayer_InLayeredLocomotionPose, FPoseLink ProcLayer_InBasePose, FPoseLink& ProceduralLayering); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AdditiveLayering(FPoseLink AddLayer_InLocomotionPose, FPoseLink AddLayer_InItemPose, FPoseLink AddLayer_InBasePose, FPoseLink AddLayer_InLayeredLocomotionPose, FPoseLink InPoseSourcePose, FPoseLink& AdditiveLayering); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Layering(FPoseLink Layer_InBaseLocomotionPose, FPoseLink Layer_InItemPose, FPoseLink& Layering); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnUpdateBlendStack_PreNativize(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateNoWeaponBasePose_PreNativize(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/Characters/Player/Male/Male_Avg_Base/Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
	// Inherited from UFortPlayerAnimInstance -> UFortAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0xF04C (0x10AFC - 0x1AB0)
	class UFortnite_M_Avg_Player_AnimBlueprint_C : public UFortPlayerAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1AB0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1AB8(0x1B0)
		FAnimSubsystemInstance AnimBlueprintExtension_Tag; // 0x1C68(0x8)
		FAnimSubsystem_SharedLinkedAnimLayers AnimBlueprintExtension_SharedLinkedAnimLayers; // 0x1C70(0x28)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1C98(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1CA0(0x8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1CA8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1D58(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D78(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E28(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1ED8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1EF8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FA8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2058(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2108(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2128(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x21D8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2288(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x22A8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2358(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2408(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2428(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x24D8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x24F8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x25A8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x25C8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2678(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2698(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2748(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2768(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2818(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x28C8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x28E8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2998(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x29B8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2A68(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2A88(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2B38(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2B58(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2C08(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2C28(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2CD8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2CF8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2DA8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2DC8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2E78(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2F28(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2F48(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x2FF8(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3018(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3038(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3058(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3078(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3128(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3148(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x31F8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3218(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x32C8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x32E8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3398(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x33B8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3468(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3488(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3538(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3558(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3578(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3598(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x35B8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3668(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3688(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3738(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3758(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3808(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3828(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x38D8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3988(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3A38(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3A58(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3B08(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x3B28(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3BD8(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3C88(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3CA8(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3CF0(0x20)
		FAnimNode_StrideWarping AnimGraphNode_StrideWarping; // 0x3D10(0x240)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3F50(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3F70(0x78)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3FE8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4098(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4148(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x41F8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4270(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4298(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4310(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4338(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4400(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4428(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4470(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4498(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x44C0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4588(0x48)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x45D0(0x38)
		FAnimNode_Root AnimGraphNode_Root; // 0x4608(0x20)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x4628(0xF0)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x4718(0xB8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x47D0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4880(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x48F8(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x4920(0x20)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4940(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x4A08(0x38)
		FAnimNode_Root AnimGraphNode_Root; // 0x4A40(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4A60(0xB0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x4B10(0xC8)
		FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x4BD8(0x78)
		FAnimNode_Root AnimGraphNode_Root; // 0x4C50(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4C70(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4D20(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4DD0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4E48(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4E70(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x4F38(0x38)
		FAnimNode_Root AnimGraphNode_Root; // 0x4F70(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4F90(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4FD8(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5088(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5100(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x5128(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x51E0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x5208(0x20)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x5228(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5270(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x5298(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5308(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5330(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5358(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5380(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x53A8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x53D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5418(0x20)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5438(0xC8)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x5500(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5510(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5530(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5558(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5580(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x55C8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5610(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5630(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x56F8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5770(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5798(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5860(0x48)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x58A8(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5970(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x59E8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5A10(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5A38(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5A60(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5B50(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5BC8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5BF0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5C18(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x5C40(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5C88(0x78)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x5D00(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x5DC8(0xC8)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x5E90(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5F80(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5FF8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6020(0x28)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6048(0xB0)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x60F8(0xC8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x61C0(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x61E8(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x62D8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x6320(0x20)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6340(0xF0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6430(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x64F8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6540(0xF0)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6630(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6678(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6740(0xC8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6808(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6850(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6898(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x68E0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6928(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6970(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x69B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6A00(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6A48(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6AF8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B70(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6B98(0x28)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6BC0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6C70(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6CE8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6D10(0x28)
		FFortAnimNode_CurveFilterSlot FortAnimGraphNode_CurveFilterSlot; // 0x6D38(0x98)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x6DD0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6E98(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x6EE0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6F90(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7008(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7050(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x70C8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x70F0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x7118(0x20)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7138(0x48)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7180(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x71C8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7210(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7238(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7280(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x72C8(0xF0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x73B8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7400(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7428(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7470(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x74B8(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7500(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x75B0(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7628(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7650(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7678(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x76A0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x76E8(0xF0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x77D8(0x78)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x7850(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7898(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x78C0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x78E8(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x7930(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0x7A20(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7A40(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7AF0(0x48)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x7B38(0xB8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7BF0(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7CB8(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7D30(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7D58(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x7D80(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7DA0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7E50(0x78)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x7EC8(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7F80(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7FA8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7FF0(0x28)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x8018(0x38)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x8050(0xF0)
		FAnimNode_Root AnimGraphNode_Root; // 0x8140(0x20)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x8160(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x8250(0x10)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x8260(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x82A8(0xF0)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x8398(0x10)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x83A8(0x48)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x83F0(0xB8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x84A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x84D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x84F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8520(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8548(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8570(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8598(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x85C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x85E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8610(0x28)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x8638(0x38)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x8670(0xB8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8728(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8748(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x87B8(0x70)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8828(0x70)
		FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8898(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x88E0(0x70)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8950(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8998(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8A60(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x8A80(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8A90(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8AB0(0xC8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x8B78(0xB0)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8C28(0xC8)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8CF0(0x20)
		FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x8D10(0x128)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x8E38(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8E80(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x8EA0(0x78)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x8F18(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8F90(0x28)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x8FB8(0xC0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9078(0x28)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x90A0(0xC0)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x9160(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x91A8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x91D0(0x28)
		FAnimNode_Root AnimGraphNode_Root; // 0x91F8(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9218(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x92C8(0x78)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x9340(0x38)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9378(0x78)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x93F0(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x94A8(0x28)
		FAnimNode_LinkedAnimLayer AnimGraphNode_Layer; // 0x94D0(0xC8)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x9598(0xC8)
		FFortAnimNode_LinkedGraphGate FortAnimGraphNode_LinkedGraphGate; // 0x9660(0x38)
		FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x9698(0xC8)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9760(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x97D8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9800(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9828(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x9850(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9898(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x98E0(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x9908(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9980(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x99A8(0x28)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x99D0(0xB8)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9A88(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9AB0(0x48)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9AF8(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9BA8(0x48)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9BF0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9C88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9CB0(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x9CD8(0x128)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x9E00(0x120)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x9F20(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9F40(0x20)
		FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x9F60(0x200)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA160(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xA1A8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA1F0(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xA238(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA2F8(0x48)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xA340(0xB0)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xA3F0(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA410(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA438(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA480(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xA4C8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xA510(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xA5D8(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA5F8(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xA620(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xA640(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xA708(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA7D0(0x48)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xA818(0xF0)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xA908(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xA928(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA9A0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xA9C8(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xA9F0(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAA38(0x28)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xAA60(0x128)
		FAnimNode_Root AnimGraphNode_Root; // 0xAB88(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xABA8(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xAC58(0xB0)
		FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xAD08(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xADB8(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xAE00(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAE78(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xAEA0(0x28)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xAEC8(0xF0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xAFB8(0x48)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xB000(0x10)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB010(0xF0)
		FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xB100(0xF0)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB1F0(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xB218(0x48)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xB260(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB2D8(0x28)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xB300(0x78)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB378(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB3A0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB3C8(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB3F0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xB418(0x28)
