#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Characters
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x28CF (0x28D0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_167 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		TArray<float> __ArrayProperty; // 0x70(0x10)
		FName __NameProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		EAlphaBlendOption __EnumProperty; // 0x8C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x8D(0x3) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x90(0x10)
		FName __NameProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		TArray<int32_t> __ArrayProperty; // 0xA8(0x10)
		TArray<float> __ArrayProperty; // 0xB8(0x10)
		UBlendProfile* __BlendProfile; // 0xC8(0x8)
		UCurveFloat* __CurveFloat; // 0xD0(0x8)
		EAlphaBlendOption __EnumProperty; // 0xD8(0x1)
		EBlendListTransitionType __EnumProperty; // 0xD9(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xDA(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xE0(0x10)
		bool __BoolProperty; // 0xF0(0x1)
		unsigned char UnknownData03_6[0x7]; // 0xF1(0x7) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0xF8(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x110(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x190(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1A8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x1D8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3C0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3F0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3F8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x428(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x430(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x460(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x468(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x498(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xA10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xA40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess FortAnimGraphNode_SlopeWarping; // 0xA70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xAA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xAD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xB30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xB60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xB90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xBC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xBF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xC20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xC50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0xC80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xCB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xCE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0xD10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xD40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xD70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xDA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xDD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xE00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0xE30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0xE60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0xE90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xEC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xEF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xF20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xF50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xF80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xFE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1010(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1040(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1070(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x10A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x10D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1100(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x11C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x11F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x12B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x12E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x13A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x13D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x14C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x14F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x15B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x15E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x16A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x16D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x17C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x17F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x18B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x18E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x19A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x19D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1A00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1A30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1A60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1A90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1AC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1AF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1B20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1B50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1B80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1BB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1BE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1C10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1C40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1C70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1CA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1CD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1D00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1D30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1D60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x1D90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1DC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1DF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1E20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1E50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1E80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1EB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1EE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1F10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1F70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x1FA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1FD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x2000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x2030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x2090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x20C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x20F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x21B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x21E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x22A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x22D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x2360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x23C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x23F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x2420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x24B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x24E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x25A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x25D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x26C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x26F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x2750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x2780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x27B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x27E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x2840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x2870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x28A0(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0xB (0xC - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_168 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		bool __BoolProperty; // 0x2(0x1)
		bool __BoolProperty; // 0x3(0x1)
		bool __BoolProperty; // 0x4(0x1)
		bool __BoolProperty; // 0x5(0x1)
		bool __BoolProperty; // 0x6(0x1)
		bool __BoolProperty; // 0x7(0x1)
		bool __BoolProperty; // 0x8(0x1)
		char __ByteProperty; // 0x9(0x1)
		bool __BoolProperty; // 0xA(0x1)
		bool __BoolProperty; // 0xB(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_RigidBodyPBA_AnimBP_Template.Player_RigidBodyPBA_AnimBP_Template_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x11F (0x120 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_169 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xF0(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x3D7 (0x3D8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_170 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		TArray<float> __ArrayProperty; // 0x20(0x10)
		TArray<float> __ArrayProperty; // 0x30(0x10)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0x40(0x1)
		bool __BoolProperty; // 0x41(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x42(0x2) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
		EAnimSyncMethod __EnumProperty; // 0x4C(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x4D(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x4E(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x50(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x58(0x18)
		UBlendProfile* __BlendProfile; // 0x70(0x8)
		UCurveFloat* __CurveFloat; // 0x78(0x8)
		bool __BoolProperty; // 0x80(0x1)
		EAlphaBlendOption __EnumProperty; // 0x81(0x1)
		EBlendListTransitionType __EnumProperty; // 0x82(0x1)
		unsigned char UnknownData04_6[0x5]; // 0x83(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x88(0x10)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x98(0x80)
		FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x118(0x8)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x3A8(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x80 (0x81 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_171 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		bool __BoolProperty; // 0x30(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0x38(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x40(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x48(0x8)
		bool __BoolProperty; // 0x50(0x1)
		bool __BoolProperty; // 0x51(0x1)
		unsigned char UnknownData03_6[0x6]; // 0x52(0x6) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0x58(0x8)
		bool __BoolProperty; // 0x60(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x61(0x7) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0x68(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x70(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x78(0x8)
		bool __BoolProperty; // 0x80(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphTemplates/Player_FirstPersonAdditives_AnimBP_Template.Player_FirstPersonAdditives_AnimBP_Template_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0xF7 (0xF8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_172 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0xF0(0x8)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x127 (0x128 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_173 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x28(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x29(0x7) UNKNOWN PROPERTY
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x30(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xB0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0xF8(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0xF7F (0xF80 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_174 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x30(0x10)
		TArray<int32_t> __ArrayProperty; // 0x40(0x10)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x80(0x10)
		FName __NameProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		FName __NameProperty; // 0x98(0x4)
		EAnimSyncMethod __EnumProperty; // 0x9C(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x9D(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xA0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xA4(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0xA8(0x8)
		UCurveFloat* __CurveFloat; // 0xB0(0x8)
		EAlphaBlendOption __EnumProperty; // 0xB8(0x1)
		EBlendListTransitionType __EnumProperty; // 0xB9(0x1)
		unsigned char UnknownData05_6[0x6]; // 0xBA(0x6) UNKNOWN PROPERTY
		TArray<int32_t> __ArrayProperty; // 0xC0(0x10)
		FName __NameProperty; // 0xD0(0x4)
		int32_t __IntProperty; // 0xD4(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xD8(0x2C)
		bool __BoolProperty; // 0x104(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x105(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x108(0x4)
		int32_t __IntProperty; // 0x10C(0x4)
		float __FloatProperty; // 0x110(0x4)
		float __FloatProperty; // 0x114(0x4)
		bool __BoolProperty; // 0x118(0x1)
		EAnimSyncMethod __EnumProperty; // 0x119(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x11A(0x1)
		unsigned char UnknownData07_6[0x1]; // 0x11B(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x11C(0x4)
		FName __NameProperty; // 0x120(0x4)
		FName __NameProperty; // 0x124(0x4)
		int32_t __IntProperty; // 0x128(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x12C(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x130(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x148(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1C8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x300(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x330(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x338(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x368(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x370(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3A0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3D8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xA40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0xB90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xC80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xCB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xCE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xD10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xD40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xD70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xDA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xE30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xE60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xE90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xEC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xEF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xF20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xF50(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x6B (0x6C - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_175 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		char __ByteProperty; // 0x19(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x1A(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		bool __BoolProperty; // 0x30(0x1)
		char __ByteProperty; // 0x31(0x1)
		bool __BoolProperty; // 0x32(0x1)
		unsigned char UnknownData02_6[0x5]; // 0x33(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x38(0x10)
		char __ByteProperty; // 0x48(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x49(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x50(0x10)
		char __ByteProperty; // 0x60(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x64(0x4)
		float __FloatProperty; // 0x68(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0xC77 (0xC78 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_176 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		TArray<float> __ArrayProperty; // 0x28(0x10)
		TArray<int32_t> __ArrayProperty; // 0x38(0x10)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x78(0x2C)
		float __FloatProperty; // 0xA4(0x4)
		UBlendProfile* __BlendProfile; // 0xA8(0x8)
		UCurveFloat* __CurveFloat; // 0xB0(0x8)
		EAlphaBlendOption __EnumProperty; // 0xB8(0x1)
		EBlendListTransitionType __EnumProperty; // 0xB9(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xBA(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		bool __BoolProperty; // 0xD0(0x1)
		unsigned char UnknownData02_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xD4(0x4)
		int32_t __IntProperty; // 0xD8(0x4)
		float __FloatProperty; // 0xDC(0x4)
		float __FloatProperty; // 0xE0(0x4)
		bool __BoolProperty; // 0xE4(0x1)
		EAnimSyncMethod __EnumProperty; // 0xE5(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xE6(0x1)
		unsigned char UnknownData03_6[0x1]; // 0xE7(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0xE8(0x4)
		FName __NameProperty; // 0xEC(0x4)
		FName __NameProperty; // 0xF0(0x4)
		int32_t __IntProperty; // 0xF4(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0xF8(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x110(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x190(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x208(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x238(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x268(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x298(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2C8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2F8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x300(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x330(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x338(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x368(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x370(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3A0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x8B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x8E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x9D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xA38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xA68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xA98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xAC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xAF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xB28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xB58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xBE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xC18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xC48(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x4B (0x4C - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_177 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		char __ByteProperty; // 0x19(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x1A(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		bool __BoolProperty; // 0x30(0x1)
		char __ByteProperty; // 0x31(0x1)
		bool __BoolProperty; // 0x32(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x33(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
		float __FloatProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x31F (0x320 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_178 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		UBlendProfile* __BlendProfile; // 0x8(0x8)
		UCurveFloat* __CurveFloat; // 0x10(0x8)
		EAlphaBlendOption __EnumProperty; // 0x18(0x1)
		EBlendListTransitionType __EnumProperty; // 0x19(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x1A(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		FName __NameProperty; // 0x30(0x4)
		int32_t __IntProperty; // 0x34(0x4)
		bool __BoolProperty; // 0x38(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3C(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x40(0x2C)
		float __FloatProperty; // 0x6C(0x4)
		bool __BoolProperty; // 0x70(0x1)
		EAnimSyncMethod __EnumProperty; // 0x71(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x72(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x73(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		int32_t __IntProperty; // 0x80(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x84(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x88(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xA0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x318(0x8)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0xB (0xC - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_179 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1C3F (0x1C40 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_180 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x64(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x68(0x10)
		TArray<float> __ArrayProperty; // 0x78(0x10)
		TArray<float> __ArrayProperty; // 0x88(0x10)
		TArray<int32_t> __ArrayProperty; // 0x98(0x10)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		int32_t __IntProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		int32_t __IntProperty; // 0xB8(0x4)
		FName __NameProperty; // 0xBC(0x4)
		FName __NameProperty; // 0xC0(0x4)
		int32_t __IntProperty; // 0xC4(0x4)
		bool __BoolProperty; // 0xC8(0x1)
		unsigned char UnknownData02_6[0x3]; // 0xC9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xCC(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xD0(0x2C)
		float __FloatProperty; // 0xFC(0x4)
		EAnimSyncMethod __EnumProperty; // 0x100(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x101(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x102(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x104(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x108(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x109(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x110(0x10)
		EBlendListTransitionType __EnumProperty; // 0x120(0x1)
		unsigned char UnknownData05_6[0x7]; // 0x121(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x128(0x10)
		UBlendProfile* __BlendProfile; // 0x138(0x8)
		UCurveFloat* __CurveFloat; // 0x140(0x8)
		bool __BoolProperty; // 0x148(0x1)
		EAlphaBlendOption __EnumProperty; // 0x149(0x1)
		EBlendListTransitionType __EnumProperty; // 0x14A(0x1)
		unsigned char UnknownData06_6[0x5]; // 0x14B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x150(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x160(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x178(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1F8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x330(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x360(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x368(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x398(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3A0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3D0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x408(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x8C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x8F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x9B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0xB00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xBC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xCB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0xD70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xDA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xE00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xE30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xE60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xE90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0xEC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1010(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1040(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1070(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1100(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x12B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x14C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x14F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x15B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x15E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x16A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x16D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x17C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x17F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Layer; // 0x1850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x18B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x1940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x19A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x19D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1A00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1A30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1A60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1A90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1AC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1AF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1B20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1B50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1B80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1BB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1BE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1C10(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x7A (0x7B - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_181 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		bool __BoolProperty; // 0x19(0x1)
		bool __BoolProperty; // 0x1A(0x1)
		char __ByteProperty; // 0x1B(0x1)
		unsigned char UnknownData01_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		bool __BoolProperty; // 0x30(0x1)
		bool __BoolProperty; // 0x31(0x1)
		bool __BoolProperty; // 0x32(0x1)
		char __ByteProperty; // 0x33(0x1)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		bool __BoolProperty; // 0x3C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x3D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x40(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x44(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x48(0x10)
		bool __BoolProperty; // 0x58(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x59(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x5C(0x4)
		bool __BoolProperty; // 0x60(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x64(0x4)
		bool __BoolProperty; // 0x68(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x6C(0x4)
		char __ByteProperty; // 0x70(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x71(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x74(0x4)
		bool __BoolProperty; // 0x78(0x1)
		bool __BoolProperty; // 0x79(0x1)
		bool __BoolProperty; // 0x7A(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x96F (0x970 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_182 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		EBlendListTransitionType __EnumProperty; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x18(0x10)
		FName __NameProperty; // 0x28(0x4)
		int32_t __IntProperty; // 0x2C(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x30(0x2C)
		float __FloatProperty; // 0x5C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x60(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x61(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x62(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x64(0x4)
		bool __BoolProperty; // 0x68(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x6C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x70(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x71(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x72(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x74(0x4)
		UBlendProfile* __BlendProfile; // 0x78(0x8)
		UCurveFloat* __CurveFloat; // 0x80(0x8)
		bool __BoolProperty; // 0x88(0x1)
		EAlphaBlendOption __EnumProperty; // 0x89(0x1)
		EBlendListTransitionType __EnumProperty; // 0x8A(0x1)
		unsigned char UnknownData05_6[0x5]; // 0x8B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x90(0x10)
		FName __NameProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		int32_t __IntProperty; // 0xA8(0x4)
		unsigned char UnknownData06_6[0x4]; // 0xAC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0xB0(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xC8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x148(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x3A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x4C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x5B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x5E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x6A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x6D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x7F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x8B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x8E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x940(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x28 (0x29 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_183 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		bool __BoolProperty; // 0xC(0x1)
		bool __BoolProperty; // 0xD(0x1)
		unsigned char UnknownData01_6[0x2]; // 0xE(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x10(0x4)
		bool __BoolProperty; // 0x14(0x1)
		bool __BoolProperty; // 0x15(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x16(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x18(0x4)
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		float __FloatProperty; // 0x24(0x4)
		bool __BoolProperty; // 0x28(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x24E7 (0x24E8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_184 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		TArray<float> __ArrayProperty; // 0x78(0x10)
		FName __NameProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		FName __NameProperty; // 0x90(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x94(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x98(0x10)
		TArray<int32_t> __ArrayProperty; // 0xA8(0x10)
		FName __NameProperty; // 0xB8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xBC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		EAlphaBlendOption __EnumProperty; // 0xD0(0x1)
		unsigned char UnknownData03_6[0x7]; // 0xD1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xD8(0x10)
		TArray<float> __ArrayProperty; // 0xE8(0x10)
		TArray<float> __ArrayProperty; // 0xF8(0x10)
		TArray<int32_t> __ArrayProperty; // 0x108(0x10)
		FName __NameProperty; // 0x118(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x11C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x120(0x10)
		FName __NameProperty; // 0x130(0x4)
		EBlendListTransitionType __EnumProperty; // 0x134(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x135(0x3) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x138(0x10)
		TArray<float> __ArrayProperty; // 0x148(0x10)
		TArray<int32_t> __ArrayProperty; // 0x158(0x10)
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		int32_t __IntProperty; // 0x170(0x4)
		FName __NameProperty; // 0x174(0x4)
		int32_t __IntProperty; // 0x178(0x4)
		FName __NameProperty; // 0x17C(0x4)
		FName __NameProperty; // 0x180(0x4)
		int32_t __IntProperty; // 0x184(0x4)
		TArray<float> __ArrayProperty; // 0x188(0x10)
		TArray<float> __ArrayProperty; // 0x198(0x10)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x1A8(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x1A9(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1AC(0x4)
		FName __NameProperty; // 0x1B0(0x4)
		int32_t __IntProperty; // 0x1B4(0x4)
		UBlendProfile* __BlendProfile; // 0x1B8(0x8)
		UCurveFloat* __CurveFloat; // 0x1C0(0x8)
		EAlphaBlendOption __EnumProperty; // 0x1C8(0x1)
		EBlendListTransitionType __EnumProperty; // 0x1C9(0x1)
		unsigned char UnknownData07_6[0x6]; // 0x1CA(0x6) UNKNOWN PROPERTY
		TArray<int32_t> __ArrayProperty; // 0x1D0(0x10)
		bool __BoolProperty; // 0x1E0(0x1)
		EAnimSyncMethod __EnumProperty; // 0x1E1(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x1E2(0x1)
		unsigned char UnknownData08_6[0x1]; // 0x1E3(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1E4(0x4)
		float __FloatProperty; // 0x1E8(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x1EC(0x2C)
		float __FloatProperty; // 0x218(0x4)
		bool __BoolProperty; // 0x21C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x21D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x21E(0x1)
		unsigned char UnknownData09_6[0x1]; // 0x21F(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x220(0x4)
		FName __NameProperty; // 0x224(0x4)
		int32_t __IntProperty; // 0x228(0x4)
		FName __NameProperty; // 0x22C(0x4)
		FName __NameProperty; // 0x230(0x4)
		int32_t __IntProperty; // 0x234(0x4)
		FName __NameProperty; // 0x238(0x4)
		FName __NameProperty; // 0x23C(0x4)
		int32_t __IntProperty; // 0x240(0x4)
		unsigned char UnknownData10_6[0x4]; // 0x244(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x248(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x260(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x2E0(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x328(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x358(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x388(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x418(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x448(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x450(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x480(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x488(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x4B8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4C0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x4F0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x7F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x888(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x8B8(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x8C0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x8C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x8F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x9B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x9E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xA18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xA48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xA78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xAA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xAD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xB08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xB38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xB68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Layer; // 0xB98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0xC28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xC58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xC88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xD18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xD48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xD78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xE68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xE98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xEC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xEF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xF28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xF88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xFE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x10A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x10D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x11C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x11F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x12B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x12E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x13A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x13D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x14C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x14F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x15B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x15E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x16A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x16D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1708(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1738(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1768(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1798(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1828(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1858(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1888(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1918(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1948(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1978(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x19A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x19D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1AC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1AF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1B88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1BB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1BE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1C18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1C48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1C78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1CA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1CD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1D98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1DC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1DF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1E88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1EB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1EE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1F18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1F48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1F78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1FA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1FD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x2008(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2038(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2068(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2098(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x20C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x20F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2128(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2158(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x2188(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x21B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x21E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2218(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x22A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x22D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x23C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x23F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x24B8(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x183 (0x184 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_185 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
		float __FloatProperty; // 0x18(0x4)
		bool __BoolProperty; // 0x1C(0x1)
		bool __BoolProperty; // 0x1D(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x1E(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x20(0x4)
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		bool __BoolProperty; // 0x38(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
		float __FloatProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		bool __BoolProperty; // 0x54(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x55(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		float __FloatProperty; // 0x60(0x4)
		char __ByteProperty; // 0x64(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x65(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x68(0x4)
		float __FloatProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		float __FloatProperty; // 0x74(0x4)
		bool __BoolProperty; // 0x78(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x79(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x7C(0x4)
		float __FloatProperty; // 0x80(0x4)
		float __FloatProperty; // 0x84(0x4)
		float __FloatProperty; // 0x88(0x4)
		float __FloatProperty; // 0x8C(0x4)
		float __FloatProperty; // 0x90(0x4)
		bool __BoolProperty; // 0x94(0x1)
		bool __BoolProperty; // 0x95(0x1)
		unsigned char UnknownData06_6[0x2]; // 0x96(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x98(0x4)
		float __FloatProperty; // 0x9C(0x4)
		float __FloatProperty; // 0xA0(0x4)
		bool __BoolProperty; // 0xA4(0x1)
		unsigned char UnknownData07_6[0x3]; // 0xA5(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xA8(0x4)
		float __FloatProperty; // 0xAC(0x4)
		float __FloatProperty; // 0xB0(0x4)
		bool __BoolProperty; // 0xB4(0x1)
		unsigned char UnknownData08_6[0x3]; // 0xB5(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xB8(0x4)
		float __FloatProperty; // 0xBC(0x4)
		float __FloatProperty; // 0xC0(0x4)
		char __ByteProperty; // 0xC4(0x1)
		unsigned char UnknownData09_6[0x3]; // 0xC5(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xC8(0x4)
		float __FloatProperty; // 0xCC(0x4)
		float __FloatProperty; // 0xD0(0x4)
		float __FloatProperty; // 0xD4(0x4)
		bool __BoolProperty; // 0xD8(0x1)
		bool __BoolProperty; // 0xD9(0x1)
		unsigned char UnknownData10_6[0x2]; // 0xDA(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0xDC(0x4)
		float __FloatProperty; // 0xE0(0x4)
		float __FloatProperty; // 0xE4(0x4)
		float __FloatProperty; // 0xE8(0x4)
		float __FloatProperty; // 0xEC(0x4)
		float __FloatProperty; // 0xF0(0x4)
		float __FloatProperty; // 0xF4(0x4)
		char __ByteProperty; // 0xF8(0x1)
		unsigned char UnknownData11_6[0x3]; // 0xF9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xFC(0x4)
		TArray<float> __ArrayProperty; // 0x100(0x10)
		char __ByteProperty; // 0x110(0x1)
		unsigned char UnknownData12_6[0x3]; // 0x111(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x114(0x4)
		float __FloatProperty; // 0x118(0x4)
		float __FloatProperty; // 0x11C(0x4)
		float __FloatProperty; // 0x120(0x4)
		float __FloatProperty; // 0x124(0x4)
		float __FloatProperty; // 0x128(0x4)
		float __FloatProperty; // 0x12C(0x4)
		float __FloatProperty; // 0x130(0x4)
		unsigned char UnknownData13_6[0x4]; // 0x134(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x138(0x10)
		char __ByteProperty; // 0x148(0x1)
		unsigned char UnknownData14_6[0x3]; // 0x149(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x14C(0x4)
		float __FloatProperty; // 0x150(0x4)
		float __FloatProperty; // 0x154(0x4)
		float __FloatProperty; // 0x158(0x4)
		char __ByteProperty; // 0x15C(0x1)
		bool __BoolProperty; // 0x15D(0x1)
		unsigned char UnknownData15_6[0x2]; // 0x15E(0x2) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x160(0x10)
		char __ByteProperty; // 0x170(0x1)
		unsigned char UnknownData16_6[0x3]; // 0x171(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x174(0x4)
		float __FloatProperty; // 0x178(0x4)
		float __FloatProperty; // 0x17C(0x4)
		float __FloatProperty; // 0x180(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x110F (0x1110 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_186 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		FName __NameProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		float __FloatProperty; // 0x90(0x4)
		bool __BoolProperty; // 0x94(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x95(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x98(0x4)
		EAnimSyncMethod __EnumProperty; // 0x9C(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x9D(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x9E(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0xA0(0x4)
		FName __NameProperty; // 0xA4(0x4)
		UBlendProfile* __BlendProfile; // 0xA8(0x8)
		UCurveFloat* __CurveFloat; // 0xB0(0x8)
		bool __BoolProperty; // 0xB8(0x1)
		EAlphaBlendOption __EnumProperty; // 0xB9(0x1)
		EBlendListTransitionType __EnumProperty; // 0xBA(0x1)
		unsigned char UnknownData03_6[0x5]; // 0xBB(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0xD0(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xE8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x168(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2D0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2D8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x308(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x310(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x340(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x348(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x378(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x4A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x710(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x740(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x748(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x7B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x8A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x8D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x9C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x9F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xA20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xA50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xA80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xAB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xAE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xB10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xB40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xB70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xBA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xBD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0xC30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0xC60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xC90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xCC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xCF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xD20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xD50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xD80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xDB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xDE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xE10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xE40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xE70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xEA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ResetRoot; // 0xF00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xF30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xF90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xFC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x10B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x10E0(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x14 (0x15 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_187 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		bool __BoolProperty; // 0x14(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x20DF (0x20E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_188 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		TArray<float> __ArrayProperty; // 0x60(0x10)
		TArray<float> __ArrayProperty; // 0x70(0x10)
		TArray<float> __ArrayProperty; // 0x80(0x10)
		FName __NameProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		int32_t __IntProperty; // 0x98(0x4)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x9C(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9D(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xA0(0x4)
		int32_t __IntProperty; // 0xA4(0x4)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xA8(0x1)
		unsigned char UnknownData02_6[0x3]; // 0xA9(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		int32_t __IntProperty; // 0xB4(0x4)
		TArray<float> __ArrayProperty; // 0xB8(0x10)
		TArray<int32_t> __ArrayProperty; // 0xC8(0x10)
		FName __NameProperty; // 0xD8(0x4)
		FName __NameProperty; // 0xDC(0x4)
		int32_t __IntProperty; // 0xE0(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xE4(0x2C)
		FInputScaleBiasClampConstants __StructProperty; // 0x110(0x2C)
		FInputScaleBiasClampConstants __StructProperty; // 0x13C(0x2C)
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		int32_t __IntProperty; // 0x170(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x174(0x2C)
		float __FloatProperty; // 0x1A0(0x4)
		EAnimSyncMethod __EnumProperty; // 0x1A4(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x1A5(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x1A6(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1A8(0x4)
		FName __NameProperty; // 0x1AC(0x4)
		int32_t __IntProperty; // 0x1B0(0x4)
		FName __NameProperty; // 0x1B4(0x4)
		int32_t __IntProperty; // 0x1B8(0x4)
		bool __BoolProperty; // 0x1BC(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x1BD(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C0(0x4)
		EAnimSyncMethod __EnumProperty; // 0x1C4(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x1C5(0x1)
		unsigned char UnknownData05_6[0x2]; // 0x1C6(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1C8(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x1CC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x1D0(0x10)
		TArray<int32_t> __ArrayProperty; // 0x1E0(0x10)
		EAlphaBlendOption __EnumProperty; // 0x1F0(0x1)
		EBlendListTransitionType __EnumProperty; // 0x1F1(0x1)
		unsigned char UnknownData07_6[0x6]; // 0x1F2(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x1F8(0x10)
		FName __NameProperty; // 0x208(0x4)
		FName __NameProperty; // 0x20C(0x4)
		int32_t __IntProperty; // 0x210(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x214(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x218(0x8)
		UCurveFloat* __CurveFloat; // 0x220(0x8)
		bool __BoolProperty; // 0x228(0x1)
		EAlphaBlendOption __EnumProperty; // 0x229(0x1)
		EBlendListTransitionType __EnumProperty; // 0x22A(0x1)
		unsigned char UnknownData09_6[0x5]; // 0x22B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x230(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x240(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x258(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x2D8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x410(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x440(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x448(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x478(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x480(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x4B0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4B8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x4E8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x7C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x7F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x8B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x8E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x9A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x9D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xA00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0xA30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess FortAnimGraphNode_SpeedWarping; // 0xA60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xA90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xAC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xBB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x10C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x10F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess FortAnimGraphNode_SpeedWarping; // 0x12A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x12D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x13F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x14B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x15A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x15D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x16C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x16F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x17B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x17E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x18D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess FortAnimGraphNode_SpeedWarping; // 0x19C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x19F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1A20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1A80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1AB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1AE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1B40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1BA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1BD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1C00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1C30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1C60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1C90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1CC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1CF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1D20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1D50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1D80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1DB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1DE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1E10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1E40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Layer; // 0x1E70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1EA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1ED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1F30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1F60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1F90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1FC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1FF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x20B0(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x12F (0x130 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_189 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		bool __BoolProperty; // 0x14(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x15(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x18(0x4)
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		bool __BoolProperty; // 0x40(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x41(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		float __FloatProperty; // 0x60(0x4)
		bool __BoolProperty; // 0x64(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x65(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x68(0x4)
		float __FloatProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		float __FloatProperty; // 0x74(0x4)
		bool __BoolProperty; // 0x78(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x80(0x10)
		char __ByteProperty; // 0x90(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x91(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x94(0x4)
		float __FloatProperty; // 0x98(0x4)
		float __FloatProperty; // 0x9C(0x4)
		float __FloatProperty; // 0xA0(0x4)
		float __FloatProperty; // 0xA4(0x4)
		float __FloatProperty; // 0xA8(0x4)
		float __FloatProperty; // 0xAC(0x4)
		float __FloatProperty; // 0xB0(0x4)
		unsigned char UnknownData06_6[0x4]; // 0xB4(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xB8(0x10)
		char __ByteProperty; // 0xC8(0x1)
		unsigned char UnknownData07_6[0x3]; // 0xC9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xCC(0x4)
		float __FloatProperty; // 0xD0(0x4)
		float __FloatProperty; // 0xD4(0x4)
		float __FloatProperty; // 0xD8(0x4)
		unsigned char UnknownData08_6[0x4]; // 0xDC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xE0(0x10)
		char __ByteProperty; // 0xF0(0x1)
		unsigned char UnknownData09_6[0x3]; // 0xF1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xF4(0x4)
		float __FloatProperty; // 0xF8(0x4)
		float __FloatProperty; // 0xFC(0x4)
		float __FloatProperty; // 0x100(0x4)
		char __ByteProperty; // 0x104(0x1)
		char __ByteProperty; // 0x105(0x1)
		unsigned char UnknownData10_6[0x2]; // 0x106(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x108(0x4)
		bool __BoolProperty; // 0x10C(0x1)
		unsigned char UnknownData11_6[0x3]; // 0x10D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x110(0x4)
		float __FloatProperty; // 0x114(0x4)
		bool __BoolProperty; // 0x118(0x1)
		unsigned char UnknownData12_6[0x3]; // 0x119(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x11C(0x4)
		float __FloatProperty; // 0x120(0x4)
		float __FloatProperty; // 0x124(0x4)
		float __FloatProperty; // 0x128(0x4)
		bool __BoolProperty; // 0x12C(0x1)
		char __ByteProperty; // 0x12D(0x1)
		bool __BoolProperty; // 0x12E(0x1)
		bool __BoolProperty; // 0x12F(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x4E7 (0x4E8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_190 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		TArray<float> __ArrayProperty; // 0x8(0x10)
		TArray<int32_t> __ArrayProperty; // 0x18(0x10)
		FName __NameProperty; // 0x28(0x4)
		int32_t __IntProperty; // 0x2C(0x4)
		bool __BoolProperty; // 0x30(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x31(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x34(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x38(0x2C)
		float __FloatProperty; // 0x64(0x4)
		EAnimSyncMethod __EnumProperty; // 0x68(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x69(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x6A(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x6C(0x4)
		UBlendProfile* __BlendProfile; // 0x70(0x8)
		UCurveFloat* __CurveFloat; // 0x78(0x8)
		bool __BoolProperty; // 0x80(0x1)
		EAlphaBlendOption __EnumProperty; // 0x81(0x1)
		EBlendListTransitionType __EnumProperty; // 0x82(0x1)
		unsigned char UnknownData03_6[0x5]; // 0x83(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x88(0x10)
		FName __NameProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		int32_t __IntProperty; // 0xA0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xA4(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0xA8(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xC0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x140(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x158(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x188(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x218(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x248(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x278(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x428(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x458(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x488(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x4B8(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_BuildingPose_AnimBP.Player_BuildingPose_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x4 (0x5 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_191 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		char __ByteProperty; // 0x2(0x1)
		char __ByteProperty; // 0x3(0x1)
		bool __BoolProperty; // 0x4(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNO_AnimBP.Player_DBNO_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x6A7 (0x6A8 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_192 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		int32_t __IntProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		int32_t __IntProperty; // 0x18(0x4)
		float __FloatProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		int32_t __IntProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		int32_t __IntProperty; // 0x2C(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x30(0x2C)
		float __FloatProperty; // 0x5C(0x4)
		EAnimSyncMethod __EnumProperty; // 0x60(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x61(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x62(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		int32_t __IntProperty; // 0x70(0x4)
		bool __BoolProperty; // 0x74(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x78(0x4)
		bool __BoolProperty; // 0x7C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x7D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x7E(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x7F(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x80(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x84(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x88(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xA0(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x3D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x5B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x5E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x678(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNO_AnimBP.Player_DBNO_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x17 (0x18 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_193 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x117F (0x1180 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_194 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		UAnimSequenceBase* __AnimSequenceBase; // 0x8(0x8)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		int32_t __IntProperty; // 0x18(0x4)
		float __FloatProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		int32_t __IntProperty; // 0x24(0x4)
		UAnimSequenceBase* __AnimSequenceBase; // 0x28(0x8)
		TArray<float> __ArrayProperty; // 0x30(0x10)
		UAnimSequenceBase* __AnimSequenceBase; // 0x40(0x8)
		FName __NameProperty; // 0x48(0x4)
		int32_t __IntProperty; // 0x4C(0x4)
		UAnimSequenceBase* __AnimSequenceBase; // 0x50(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x58(0x8)
		TArray<float> __ArrayProperty; // 0x60(0x10)
		UAnimSequenceBase* __AnimSequenceBase; // 0x70(0x8)
		TArray<float> __ArrayProperty; // 0x78(0x10)
		UAnimSequenceBase* __AnimSequenceBase; // 0x88(0x8)
		EAnimSyncMethod __EnumProperty; // 0x90(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x91(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x92(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x94(0x4)
		FName __NameProperty; // 0x98(0x4)
		float __FloatProperty; // 0x9C(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xA0(0x2C)
		float __FloatProperty; // 0xCC(0x4)
		FName __NameProperty; // 0xD0(0x4)
		FName __NameProperty; // 0xD4(0x4)
		int32_t __IntProperty; // 0xD8(0x4)
		float __FloatProperty; // 0xDC(0x4)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0xE0(0x1)
		bool __BoolProperty; // 0xE1(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xE2(0x6) UNKNOWN PROPERTY
		UAnimSequenceBase* __AnimSequenceBase; // 0xE8(0x8)
		EAnimSyncMethod __EnumProperty; // 0xF0(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xF1(0x1)
		unsigned char UnknownData03_6[0x2]; // 0xF2(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0xF4(0x4)
		FName __NameProperty; // 0xF8(0x4)
		FName __NameProperty; // 0xFC(0x4)
		int32_t __IntProperty; // 0x100(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x104(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x108(0x10)
		UBlendProfile* __BlendProfile; // 0x118(0x8)
		UCurveFloat* __CurveFloat; // 0x120(0x8)
		bool __BoolProperty; // 0x128(0x1)
		EAlphaBlendOption __EnumProperty; // 0x129(0x1)
		EBlendListTransitionType __EnumProperty; // 0x12A(0x1)
		unsigned char UnknownData05_6[0x5]; // 0x12B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x130(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x140(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x158(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1D8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoBoneIK; // 0x340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x4C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x4F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x6A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x7C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x8B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x9A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xA60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xAC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xAF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xB80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xC70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xCA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xCD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xD60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xDC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xE20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xEB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xEE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xF10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xF70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xFA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Trail; // 0xFD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x1000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot; // 0x1030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x10C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x10F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1150(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_DBNOCarried_AnimBP.Player_DBNOCarried_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x49 (0x4A - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_195 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		bool __BoolProperty; // 0x10(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x14(0x4)
		float __FloatProperty; // 0x18(0x4)
		bool __BoolProperty; // 0x1C(0x1)
		bool __BoolProperty; // 0x1D(0x1)
		unsigned char UnknownData02_6[0x2]; // 0x1E(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x20(0x4)
		bool __BoolProperty; // 0x24(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x25(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x28(0x4)
		bool __BoolProperty; // 0x2C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x30(0x4)
		bool __BoolProperty; // 0x34(0x1)
		bool __BoolProperty; // 0x35(0x1)
		bool __BoolProperty; // 0x36(0x1)
		unsigned char UnknownData05_6[0x1]; // 0x37(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x38(0x4)
		bool __BoolProperty; // 0x3C(0x1)
		bool __BoolProperty; // 0x3D(0x1)
		bool __BoolProperty; // 0x3E(0x1)
		unsigned char UnknownData06_6[0x1]; // 0x3F(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x40(0x4)
		float __FloatProperty; // 0x44(0x4)
		bool __BoolProperty; // 0x48(0x1)
		bool __BoolProperty; // 0x49(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x4CF (0x4D0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_196 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		TArray<float> __ArrayProperty; // 0x10(0x10)
		TArray<int32_t> __ArrayProperty; // 0x20(0x10)
		FInputScaleBiasClampConstants __StructProperty; // 0x30(0x2C)
		unsigned char UnknownData01_6[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x60(0x8)
		UCurveFloat* __CurveFloat; // 0x68(0x8)
		bool __BoolProperty; // 0x70(0x1)
		EAlphaBlendOption __EnumProperty; // 0x71(0x1)
		EBlendListTransitionType __EnumProperty; // 0x72(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x73(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x74(0x4)
		float __FloatProperty; // 0x78(0x4)
		bool __BoolProperty; // 0x7C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x7D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x7E(0x1)
		unsigned char UnknownData03_6[0x1]; // 0x7F(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		int32_t __IntProperty; // 0x8C(0x4)
		FAnimNodeFunctionRef __StructProperty; // 0x90(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xA8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x128(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x3E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x4A0(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_FreeFlying_AnimBP.Player_FreeFlying_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x43 (0x44 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_197 : public FAnimBlueprintMutableData	
	{
	public:
		char __ByteProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x19(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		char __ByteProperty; // 0x24(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x25(0x3) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x28(0x10)
		bool __BoolProperty; // 0x38(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x43DF (0x43E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_198 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		TArray<float> __ArrayProperty; // 0x8(0x10)
		FName __NameProperty; // 0x18(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		EBlendListTransitionType __EnumProperty; // 0x38(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		TArray<float> __ArrayProperty; // 0x50(0x10)
		TArray<int32_t> __ArrayProperty; // 0x60(0x10)
		FName __NameProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		FName __NameProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		FName __NameProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		TArray<float> __ArrayProperty; // 0x88(0x10)
		TArray<int32_t> __ArrayProperty; // 0x98(0x10)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xB8(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xB9(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xBC(0x4)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0xC0(0x1)
		unsigned char UnknownData04_6[0x3]; // 0xC1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xC4(0x4)
		FName __NameProperty; // 0xC8(0x4)
		unsigned char UnknownData05_6[0x4]; // 0xCC(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xD0(0x10)
		TArray<int32_t> __ArrayProperty; // 0xE0(0x10)
		TArray<float> __ArrayProperty; // 0xF0(0x10)
		FName __NameProperty; // 0x100(0x4)
		FName __NameProperty; // 0x104(0x4)
		FName __NameProperty; // 0x108(0x4)
		FName __NameProperty; // 0x10C(0x4)
		int32_t __IntProperty; // 0x110(0x4)
		EAnimSyncMethod __EnumProperty; // 0x114(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x115(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x118(0x4)
		int32_t __IntProperty; // 0x11C(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x120(0x2C)
		unsigned char UnknownData07_6[0x4]; // 0x14C(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x150(0x8)
		UCurveFloat* __CurveFloat; // 0x158(0x8)
		EAlphaBlendOption __EnumProperty; // 0x160(0x1)
		EBlendListTransitionType __EnumProperty; // 0x161(0x1)
		unsigned char UnknownData08_6[0x6]; // 0x162(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x168(0x10)
		TArray<int32_t> __ArrayProperty; // 0x178(0x10)
		FName __NameProperty; // 0x188(0x4)
		int32_t __IntProperty; // 0x18C(0x4)
		float __FloatProperty; // 0x190(0x4)
		bool __BoolProperty; // 0x194(0x1)
		unsigned char UnknownData09_6[0x3]; // 0x195(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x198(0x4)
		bool __BoolProperty; // 0x19C(0x1)
		EAnimSyncMethod __EnumProperty; // 0x19D(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x19E(0x1)
		unsigned char UnknownData10_6[0x1]; // 0x19F(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x1A0(0x4)
		FName __NameProperty; // 0x1A4(0x4)
		FName __NameProperty; // 0x1A8(0x4)
		int32_t __IntProperty; // 0x1AC(0x4)
		FName __NameProperty; // 0x1B0(0x4)
		FName __NameProperty; // 0x1B4(0x4)
		int32_t __IntProperty; // 0x1B8(0x4)
		unsigned char UnknownData11_6[0x4]; // 0x1BC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x1C0(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1D8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x258(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x3F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x4E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x5A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x5D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x6C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x6F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x7B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x7E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x8A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0x8D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x9F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xA80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xAB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xAE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xB40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xB70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xBA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0xBD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xC00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xC30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0xC90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xCC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xCF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0xD20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0xD50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt; // 0xE40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1110(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x11A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x11D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x12C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x12F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x13B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x13E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x14D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x1590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x15C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x15F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x16B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x16E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x17A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x18C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1950(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1980(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x19B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x19E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1A10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1A40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1A70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1AA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1AD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1B00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1B30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1B60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1B90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1BC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1BF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1C20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1C50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1C80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1CB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1CE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1D10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1D40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1D70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1DA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1DD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1E90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1EC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1EF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1F20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1F50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1F80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1FB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1FE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2010(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2040(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2070(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x20A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x20D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2100(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2130(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2160(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2190(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x21C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x21F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2220(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x22B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x22E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x23A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x23D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x24C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x24F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x25B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x25E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x26A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x26D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x27C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x27F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x28B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x28E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x29A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x29D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2A00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2A30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2A60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2A90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2AC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2AF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2B20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2B50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2B80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x2BB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2BE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2C10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2C40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2C70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2CA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2CD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2D00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2D30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2D60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2D90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2DC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2DF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2E20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x2E50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2E80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2EB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2EE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x2F10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2F40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2F70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2FA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2FD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x30C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x30F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x31B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x31E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x32A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x32D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x3360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x33C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x33F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x34B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x34E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x35A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x35D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x36C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x36F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x37B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x37E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x38A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x38D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x3990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x39C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x39F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3A20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3A50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3A80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3AB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3AE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3B10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3B40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x3B70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x3BA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x3BD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3C00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3C30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x3C60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3C90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x3CC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3CF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3D20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3D50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3D80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x3DB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3DE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3E10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3E40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x3E70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x3EA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3ED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3F00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x3F30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3F60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x3F90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3FC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3FF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x4020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x4080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x40B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x40E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x4110(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x4140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x4170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x41A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x41D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x4200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x4230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x4260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x42C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x42F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x4320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x4350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x43B0(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_SkyDiveAndGlide_AnimBP.Player_SkyDiveAndGlide_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x42B (0x42C - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_199 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		int32_t __IntProperty; // 0x14(0x4)
		char __ByteProperty; // 0x18(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x19(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		float __FloatProperty; // 0x20(0x4)
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		char __ByteProperty; // 0x2C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x2D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x30(0x4)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		float __FloatProperty; // 0x40(0x4)
		float __FloatProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		float __FloatProperty; // 0x60(0x4)
		float __FloatProperty; // 0x64(0x4)
		float __FloatProperty; // 0x68(0x4)
		float __FloatProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		float __FloatProperty; // 0x74(0x4)
		float __FloatProperty; // 0x78(0x4)
		float __FloatProperty; // 0x7C(0x4)
		float __FloatProperty; // 0x80(0x4)
		float __FloatProperty; // 0x84(0x4)
		float __FloatProperty; // 0x88(0x4)
		float __FloatProperty; // 0x8C(0x4)
		int32_t __IntProperty; // 0x90(0x4)
		float __FloatProperty; // 0x94(0x4)
		float __FloatProperty; // 0x98(0x4)
		float __FloatProperty; // 0x9C(0x4)
		float __FloatProperty; // 0xA0(0x4)
		float __FloatProperty; // 0xA4(0x4)
		float __FloatProperty; // 0xA8(0x4)
		float __FloatProperty; // 0xAC(0x4)
		float __FloatProperty; // 0xB0(0x4)
		bool __BoolProperty; // 0xB4(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xB5(0x3) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0xB8(0x4)
		float __FloatProperty; // 0xBC(0x4)
		float __FloatProperty; // 0xC0(0x4)
		float __FloatProperty; // 0xC4(0x4)
		float __FloatProperty; // 0xC8(0x4)
		float __FloatProperty; // 0xCC(0x4)
		float __FloatProperty; // 0xD0(0x4)
		int32_t __IntProperty; // 0xD4(0x4)
		int32_t __IntProperty; // 0xD8(0x4)
		float __FloatProperty; // 0xDC(0x4)
		float __FloatProperty; // 0xE0(0x4)
		float __FloatProperty; // 0xE4(0x4)
		float __FloatProperty; // 0xE8(0x4)
		float __FloatProperty; // 0xEC(0x4)
		float __FloatProperty; // 0xF0(0x4)
		float __FloatProperty; // 0xF4(0x4)
		float __FloatProperty; // 0xF8(0x4)
		float __FloatProperty; // 0xFC(0x4)
		float __FloatProperty; // 0x100(0x4)
		float __FloatProperty; // 0x104(0x4)
		float __FloatProperty; // 0x108(0x4)
		char __ByteProperty; // 0x10C(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x10D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x110(0x4)
		float __FloatProperty; // 0x114(0x4)
		char __ByteProperty; // 0x118(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x119(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x11C(0x4)
		float __FloatProperty; // 0x120(0x4)
		float __FloatProperty; // 0x124(0x4)
		float __FloatProperty; // 0x128(0x4)
		float __FloatProperty; // 0x12C(0x4)
		float __FloatProperty; // 0x130(0x4)
		float __FloatProperty; // 0x134(0x4)
		float __FloatProperty; // 0x138(0x4)
		float __FloatProperty; // 0x13C(0x4)
		float __FloatProperty; // 0x140(0x4)
		float __FloatProperty; // 0x144(0x4)
		float __FloatProperty; // 0x148(0x4)
		float __FloatProperty; // 0x14C(0x4)
		float __FloatProperty; // 0x150(0x4)
		float __FloatProperty; // 0x154(0x4)
		float __FloatProperty; // 0x158(0x4)
		float __FloatProperty; // 0x15C(0x4)
		float __FloatProperty; // 0x160(0x4)
		float __FloatProperty; // 0x164(0x4)
		float __FloatProperty; // 0x168(0x4)
		float __FloatProperty; // 0x16C(0x4)
		float __FloatProperty; // 0x170(0x4)
		float __FloatProperty; // 0x174(0x4)
		float __FloatProperty; // 0x178(0x4)
		float __FloatProperty; // 0x17C(0x4)
		float __FloatProperty; // 0x180(0x4)
		float __FloatProperty; // 0x184(0x4)
		float __FloatProperty; // 0x188(0x4)
		float __FloatProperty; // 0x18C(0x4)
		float __FloatProperty; // 0x190(0x4)
		float __FloatProperty; // 0x194(0x4)
		float __FloatProperty; // 0x198(0x4)
		float __FloatProperty; // 0x19C(0x4)
		float __FloatProperty; // 0x1A0(0x4)
		float __FloatProperty; // 0x1A4(0x4)
		float __FloatProperty; // 0x1A8(0x4)
		float __FloatProperty; // 0x1AC(0x4)
		float __FloatProperty; // 0x1B0(0x4)
		char __ByteProperty; // 0x1B4(0x1)
		char __ByteProperty; // 0x1B5(0x1)
		char __ByteProperty; // 0x1B6(0x1)
		unsigned char UnknownData06_6[0x1]; // 0x1B7(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1B8(0x4)
		float __FloatProperty; // 0x1BC(0x4)
		float __FloatProperty; // 0x1C0(0x4)
		float __FloatProperty; // 0x1C4(0x4)
		float __FloatProperty; // 0x1C8(0x4)
		float __FloatProperty; // 0x1CC(0x4)
		char __ByteProperty; // 0x1D0(0x1)
		char __ByteProperty; // 0x1D1(0x1)
		char __ByteProperty; // 0x1D2(0x1)
		unsigned char UnknownData07_6[0x1]; // 0x1D3(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1D4(0x4)
		float __FloatProperty; // 0x1D8(0x4)
		float __FloatProperty; // 0x1DC(0x4)
		float __FloatProperty; // 0x1E0(0x4)
		float __FloatProperty; // 0x1E4(0x4)
		float __FloatProperty; // 0x1E8(0x4)
		float __FloatProperty; // 0x1EC(0x4)
		float __FloatProperty; // 0x1F0(0x4)
		float __FloatProperty; // 0x1F4(0x4)
		float __FloatProperty; // 0x1F8(0x4)
		float __FloatProperty; // 0x1FC(0x4)
		float __FloatProperty; // 0x200(0x4)
		float __FloatProperty; // 0x204(0x4)
		float __FloatProperty; // 0x208(0x4)
		float __FloatProperty; // 0x20C(0x4)
		float __FloatProperty; // 0x210(0x4)
		float __FloatProperty; // 0x214(0x4)
		float __FloatProperty; // 0x218(0x4)
		char __ByteProperty; // 0x21C(0x1)
		char __ByteProperty; // 0x21D(0x1)
		char __ByteProperty; // 0x21E(0x1)
		unsigned char UnknownData08_6[0x1]; // 0x21F(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x220(0x4)
		float __FloatProperty; // 0x224(0x4)
		float __FloatProperty; // 0x228(0x4)
		float __FloatProperty; // 0x22C(0x4)
		char __ByteProperty; // 0x230(0x1)
		char __ByteProperty; // 0x231(0x1)
		unsigned char UnknownData09_6[0x2]; // 0x232(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x234(0x4)
		float __FloatProperty; // 0x238(0x4)
		char __ByteProperty; // 0x23C(0x1)
		char __ByteProperty; // 0x23D(0x1)
		char __ByteProperty; // 0x23E(0x1)
		unsigned char UnknownData10_6[0x1]; // 0x23F(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x240(0x4)
		float __FloatProperty; // 0x244(0x4)
		float __FloatProperty; // 0x248(0x4)
		float __FloatProperty; // 0x24C(0x4)
		float __FloatProperty; // 0x250(0x4)
		float __FloatProperty; // 0x254(0x4)
		float __FloatProperty; // 0x258(0x4)
		float __FloatProperty; // 0x25C(0x4)
		float __FloatProperty; // 0x260(0x4)
		float __FloatProperty; // 0x264(0x4)
		char __ByteProperty; // 0x268(0x1)
		char __ByteProperty; // 0x269(0x1)
		unsigned char UnknownData11_6[0x2]; // 0x26A(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x26C(0x4)
		float __FloatProperty; // 0x270(0x4)
		float __FloatProperty; // 0x274(0x4)
		float __FloatProperty; // 0x278(0x4)
		float __FloatProperty; // 0x27C(0x4)
		float __FloatProperty; // 0x280(0x4)
		float __FloatProperty; // 0x284(0x4)
		float __FloatProperty; // 0x288(0x4)
		char __ByteProperty; // 0x28C(0x1)
		unsigned char UnknownData12_6[0x3]; // 0x28D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x290(0x4)
		float __FloatProperty; // 0x294(0x4)
		float __FloatProperty; // 0x298(0x4)
		float __FloatProperty; // 0x29C(0x4)
		float __FloatProperty; // 0x2A0(0x4)
		float __FloatProperty; // 0x2A4(0x4)
		float __FloatProperty; // 0x2A8(0x4)
		float __FloatProperty; // 0x2AC(0x4)
		float __FloatProperty; // 0x2B0(0x4)
		float __FloatProperty; // 0x2B4(0x4)
		float __FloatProperty; // 0x2B8(0x4)
		float __FloatProperty; // 0x2BC(0x4)
		float __FloatProperty; // 0x2C0(0x4)
		float __FloatProperty; // 0x2C4(0x4)
		float __FloatProperty; // 0x2C8(0x4)
		float __FloatProperty; // 0x2CC(0x4)
		float __FloatProperty; // 0x2D0(0x4)
		float __FloatProperty; // 0x2D4(0x4)
		float __FloatProperty; // 0x2D8(0x4)
		float __FloatProperty; // 0x2DC(0x4)
		float __FloatProperty; // 0x2E0(0x4)
		float __FloatProperty; // 0x2E4(0x4)
		float __FloatProperty; // 0x2E8(0x4)
		float __FloatProperty; // 0x2EC(0x4)
		float __FloatProperty; // 0x2F0(0x4)
		float __FloatProperty; // 0x2F4(0x4)
		float __FloatProperty; // 0x2F8(0x4)
		float __FloatProperty; // 0x2FC(0x4)
		float __FloatProperty; // 0x300(0x4)
		float __FloatProperty; // 0x304(0x4)
		float __FloatProperty; // 0x308(0x4)
		float __FloatProperty; // 0x30C(0x4)
		float __FloatProperty; // 0x310(0x4)
		float __FloatProperty; // 0x314(0x4)
		float __FloatProperty; // 0x318(0x4)
		float __FloatProperty; // 0x31C(0x4)
		float __FloatProperty; // 0x320(0x4)
		float __FloatProperty; // 0x324(0x4)
		char __ByteProperty; // 0x328(0x1)
		char __ByteProperty; // 0x329(0x1)
		char __ByteProperty; // 0x32A(0x1)
		char __ByteProperty; // 0x32B(0x1)
		char __ByteProperty; // 0x32C(0x1)
		char __ByteProperty; // 0x32D(0x1)
		char __ByteProperty; // 0x32E(0x1)
		char __ByteProperty; // 0x32F(0x1)
		char __ByteProperty; // 0x330(0x1)
		unsigned char UnknownData13_6[0x3]; // 0x331(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x334(0x4)
		float __FloatProperty; // 0x338(0x4)
		float __FloatProperty; // 0x33C(0x4)
		float __FloatProperty; // 0x340(0x4)
		float __FloatProperty; // 0x344(0x4)
		float __FloatProperty; // 0x348(0x4)
		float __FloatProperty; // 0x34C(0x4)
		float __FloatProperty; // 0x350(0x4)
		float __FloatProperty; // 0x354(0x4)
		float __FloatProperty; // 0x358(0x4)
		float __FloatProperty; // 0x35C(0x4)
		float __FloatProperty; // 0x360(0x4)
		float __FloatProperty; // 0x364(0x4)
		float __FloatProperty; // 0x368(0x4)
		float __FloatProperty; // 0x36C(0x4)
		float __FloatProperty; // 0x370(0x4)
		float __FloatProperty; // 0x374(0x4)
		float __FloatProperty; // 0x378(0x4)
		float __FloatProperty; // 0x37C(0x4)
		char __ByteProperty; // 0x380(0x1)
		char __ByteProperty; // 0x381(0x1)
		char __ByteProperty; // 0x382(0x1)
		unsigned char UnknownData14_6[0x1]; // 0x383(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x384(0x4)
		float __FloatProperty; // 0x388(0x4)
		float __FloatProperty; // 0x38C(0x4)
		float __FloatProperty; // 0x390(0x4)
		float __FloatProperty; // 0x394(0x4)
		char __ByteProperty; // 0x398(0x1)
		char __ByteProperty; // 0x399(0x1)
		unsigned char UnknownData15_6[0x2]; // 0x39A(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x39C(0x4)
		float __FloatProperty; // 0x3A0(0x4)
		char __ByteProperty; // 0x3A4(0x1)
		unsigned char UnknownData16_6[0x3]; // 0x3A5(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3A8(0x4)
		float __FloatProperty; // 0x3AC(0x4)
		float __FloatProperty; // 0x3B0(0x4)
		float __FloatProperty; // 0x3B4(0x4)
		float __FloatProperty; // 0x3B8(0x4)
		float __FloatProperty; // 0x3BC(0x4)
		float __FloatProperty; // 0x3C0(0x4)
		float __FloatProperty; // 0x3C4(0x4)
		float __FloatProperty; // 0x3C8(0x4)
		float __FloatProperty; // 0x3CC(0x4)
		float __FloatProperty; // 0x3D0(0x4)
		float __FloatProperty; // 0x3D4(0x4)
		char __ByteProperty; // 0x3D8(0x1)
		unsigned char UnknownData17_6[0x3]; // 0x3D9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3DC(0x4)
		float __FloatProperty; // 0x3E0(0x4)
		char __ByteProperty; // 0x3E4(0x1)
		unsigned char UnknownData18_6[0x3]; // 0x3E5(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x3E8(0x4)
		float __FloatProperty; // 0x3EC(0x4)
		float __FloatProperty; // 0x3F0(0x4)
		float __FloatProperty; // 0x3F4(0x4)
		float __FloatProperty; // 0x3F8(0x4)
		float __FloatProperty; // 0x3FC(0x4)
		float __FloatProperty; // 0x400(0x4)
		float __FloatProperty; // 0x404(0x4)
		float __FloatProperty; // 0x408(0x4)
		float __FloatProperty; // 0x40C(0x4)
		float __FloatProperty; // 0x410(0x4)
		float __FloatProperty; // 0x414(0x4)
		float __FloatProperty; // 0x418(0x4)
		float __FloatProperty; // 0x41C(0x4)
		char __ByteProperty; // 0x420(0x1)
		unsigned char UnknownData19_6[0x3]; // 0x421(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x424(0x4)
		float __FloatProperty; // 0x428(0x4)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1737 (0x1738 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_200 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		TArray<int32_t> __ArrayProperty; // 0x60(0x10)
		TArray<int32_t> __ArrayProperty; // 0x70(0x10)
		TArray<int32_t> __ArrayProperty; // 0x80(0x10)
		TArray<float> __ArrayProperty; // 0x90(0x10)
		TArray<int32_t> __ArrayProperty; // 0xA0(0x10)
		TArray<int32_t> __ArrayProperty; // 0xB0(0x10)
		TArray<float> __ArrayProperty; // 0xC0(0x10)
		TArray<int32_t> __ArrayProperty; // 0xD0(0x10)
		TArray<float> __ArrayProperty; // 0xE0(0x10)
		TArray<float> __ArrayProperty; // 0xF0(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x100(0x18)
		FName __NameProperty; // 0x118(0x4)
		FName __NameProperty; // 0x11C(0x4)
		int32_t __IntProperty; // 0x120(0x4)
		FName __NameProperty; // 0x124(0x4)
		int32_t __IntProperty; // 0x128(0x4)
		FName __NameProperty; // 0x12C(0x4)
		int32_t __IntProperty; // 0x130(0x4)
		EAnimSyncMethod __EnumProperty; // 0x134(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x135(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x138(0x4)
		bool __BoolProperty; // 0x13C(0x1)
		EAlphaBlendOption __EnumProperty; // 0x13D(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x13E(0x2) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x140(0x10)
		TArray<int32_t> __ArrayProperty; // 0x150(0x10)
		float __FloatProperty; // 0x160(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0x164(0x2C)
		float __FloatProperty; // 0x190(0x4)
		EAnimSyncMethod __EnumProperty; // 0x194(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x195(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x196(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x198(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x19C(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x19D(0x3) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x1A0(0x8)
		UCurveFloat* __CurveFloat; // 0x1A8(0x8)
		bool __BoolProperty; // 0x1B0(0x1)
		EAlphaBlendOption __EnumProperty; // 0x1B1(0x1)
		EBlendListTransitionType __EnumProperty; // 0x1B2(0x1)
		unsigned char UnknownData06_6[0x5]; // 0x1B3(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x1B8(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x1C8(0x18)
		FName __NameProperty; // 0x1E0(0x4)
		FName __NameProperty; // 0x1E4(0x4)
		int32_t __IntProperty; // 0x1E8(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x1EC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x1F0(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x208(0x80)
		FAnimSubsystem AnimBlueprintExtension_NodeRelevancy; // 0x288(0x8)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x290(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x308(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x338(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x368(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x398(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3C8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x3F8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x400(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x430(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x438(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x468(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x470(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x4A0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x8C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x8F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x9B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x9E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xC58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xCB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xD78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xDA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xE68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xEC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xF88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x11F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1228(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1258(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1288(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x12E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1318(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1348(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1378(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x13D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1408(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1438(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1468(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1498(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Layer; // 0x14C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1528(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1558(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1588(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x15B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x15E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1618(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1648(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1678(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x16A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x16D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1708(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_Land_AnimBP.Player_Land_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x2D (0x2E - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_201 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		bool __BoolProperty; // 0x2(0x1)
		bool __BoolProperty; // 0x3(0x1)
		bool __BoolProperty; // 0x4(0x1)
		char __ByteProperty; // 0x5(0x1)
		char __ByteProperty; // 0x6(0x1)
		char __ByteProperty; // 0x7(0x1)
		bool __BoolProperty; // 0x8(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x10(0x10)
		bool __BoolProperty; // 0x20(0x1)
		char __ByteProperty; // 0x21(0x1)
		bool __BoolProperty; // 0x22(0x1)
		char __ByteProperty; // 0x23(0x1)
		bool __BoolProperty; // 0x24(0x1)
		char __ByteProperty; // 0x25(0x1)
		bool __BoolProperty; // 0x26(0x1)
		bool __BoolProperty; // 0x27(0x1)
		bool __BoolProperty; // 0x28(0x1)
		bool __BoolProperty; // 0x29(0x1)
		bool __BoolProperty; // 0x2A(0x1)
		bool __BoolProperty; // 0x2B(0x1)
		char __ByteProperty; // 0x2C(0x1)
		bool __BoolProperty; // 0x2D(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_Proto_AnimBP.Player_InAir_Proto_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1A7F (0x1A80 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_202 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		FName __NameProperty; // 0xC(0x4)
		FName __NameProperty; // 0x10(0x4)
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		FName __NameProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		FName __NameProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		TArray<float> __ArrayProperty; // 0x58(0x10)
		TArray<float> __ArrayProperty; // 0x68(0x10)
		TArray<float> __ArrayProperty; // 0x78(0x10)
		TArray<int32_t> __ArrayProperty; // 0x88(0x10)
		FName __NameProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		FName __NameProperty; // 0xA0(0x4)
		int32_t __IntProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		FName __NameProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		FName __NameProperty; // 0xB4(0x4)
		TArray<float> __ArrayProperty; // 0xB8(0x10)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0xC8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xC9(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xCC(0x4)
		int32_t __IntProperty; // 0xD0(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xD4(0x2C)
		EAnimSyncMethod __EnumProperty; // 0x100(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x101(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x104(0x4)
		FName __NameProperty; // 0x108(0x4)
		int32_t __IntProperty; // 0x10C(0x4)
		bool __BoolProperty; // 0x110(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x111(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x114(0x4)
		float __FloatProperty; // 0x118(0x4)
		EAnimSyncMethod __EnumProperty; // 0x11C(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x11D(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x11E(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x120(0x4)
		FName __NameProperty; // 0x124(0x4)
		int32_t __IntProperty; // 0x128(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x12C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x130(0x10)
		EBlendListTransitionType __EnumProperty; // 0x140(0x1)
		unsigned char UnknownData06_6[0x7]; // 0x141(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x148(0x10)
		UBlendProfile* __BlendProfile; // 0x158(0x8)
		UCurveFloat* __CurveFloat; // 0x160(0x8)
		bool __BoolProperty; // 0x168(0x1)
		EAlphaBlendOption __EnumProperty; // 0x169(0x1)
		EBlendListTransitionType __EnumProperty; // 0x16A(0x1)
		unsigned char UnknownData07_6[0x5]; // 0x16B(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x170(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x180(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x198(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x218(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2C0(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2F0(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2F8(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x328(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x330(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x360(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x368(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x398(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x3D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x4C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x4F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x5B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x5E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x6A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x6D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x8B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x9D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0xA90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xB20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xB50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xBB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xBE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xC40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xC70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xCA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xCD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0xD00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xD30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0xD90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xDC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xDF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xE20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0xE50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xE80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xEB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xEE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xFD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x10F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x11B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x11E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x12A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x12D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x13F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Layer; // 0x1480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x14B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization; // 0x1570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x15A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x15D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x1660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x1690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x16C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x16F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x18A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x18D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x19C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x19F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1A20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1A50(0x30)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_InAir_Proto_AnimBP.Player_InAir_Proto_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x82 (0x83 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_203 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x8(0x10)
		bool __BoolProperty; // 0x18(0x1)
		bool __BoolProperty; // 0x19(0x1)
		bool __BoolProperty; // 0x1A(0x1)
		char __ByteProperty; // 0x1B(0x1)
		unsigned char UnknownData01_6[0x4]; // 0x1C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x20(0x10)
		bool __BoolProperty; // 0x30(0x1)
		bool __BoolProperty; // 0x31(0x1)
		bool __BoolProperty; // 0x32(0x1)
		char __ByteProperty; // 0x33(0x1)
		float __FloatProperty; // 0x34(0x4)
		float __FloatProperty; // 0x38(0x4)
		bool __BoolProperty; // 0x3C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x3D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x40(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x44(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x48(0x10)
		bool __BoolProperty; // 0x58(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x59(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x5C(0x4)
		bool __BoolProperty; // 0x60(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x64(0x4)
		bool __BoolProperty; // 0x68(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x6C(0x4)
		char __ByteProperty; // 0x70(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x71(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x74(0x4)
		bool __BoolProperty; // 0x78(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x79(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x7C(0x4)
		bool __BoolProperty; // 0x80(0x1)
		bool __BoolProperty; // 0x81(0x1)
		bool __BoolProperty; // 0x82(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1C5F (0x1C60 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_204 : public FAnimBlueprintConstantData	
	{
	public:
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		int32_t __IntProperty; // 0xC(0x4)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x10(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x11(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x14(0x4)
		FName __NameProperty; // 0x18(0x4)
		FName __NameProperty; // 0x1C(0x4)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FName __NameProperty; // 0x28(0x4)
		FName __NameProperty; // 0x2C(0x4)
		FName __NameProperty; // 0x30(0x4)
		int32_t __IntProperty; // 0x34(0x4)
		FName __NameProperty; // 0x38(0x4)
		int32_t __IntProperty; // 0x3C(0x4)
		FName __NameProperty; // 0x40(0x4)
		int32_t __IntProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		int32_t __IntProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		FName __NameProperty; // 0x54(0x4)
		FName __NameProperty; // 0x58(0x4)
		FName __NameProperty; // 0x5C(0x4)
		FName __NameProperty; // 0x60(0x4)
		int32_t __IntProperty; // 0x64(0x4)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		FName __NameProperty; // 0x70(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x78(0x10)
		TArray<int32_t> __ArrayProperty; // 0x88(0x10)
		FName __NameProperty; // 0x98(0x4)
		FName __NameProperty; // 0x9C(0x4)
		EAnimSyncMethod __EnumProperty; // 0xA0(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xA1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0xA4(0x4)
		FName __NameProperty; // 0xA8(0x4)
		int32_t __IntProperty; // 0xAC(0x4)
		FName __NameProperty; // 0xB0(0x4)
		int32_t __IntProperty; // 0xB4(0x4)
		FInputScaleBiasClampConstants __StructProperty; // 0xB8(0x2C)
		FName __NameProperty; // 0xE4(0x4)
		FName __NameProperty; // 0xE8(0x4)
		int32_t __IntProperty; // 0xEC(0x4)
		UBlendProfile* __BlendProfile; // 0xF0(0x8)
		UCurveFloat* __CurveFloat; // 0xF8(0x8)
		EAlphaBlendOption __EnumProperty; // 0x100(0x1)
		EBlendListTransitionType __EnumProperty; // 0x101(0x1)
		unsigned char UnknownData04_6[0x6]; // 0x102(0x6) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x108(0x10)
		float __FloatProperty; // 0x118(0x4)
		bool __BoolProperty; // 0x11C(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x11D(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x120(0x4)
		bool __BoolProperty; // 0x124(0x1)
		EAnimSyncMethod __EnumProperty; // 0x125(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x126(0x1)
		unsigned char UnknownData06_6[0x1]; // 0x127(0x1) UNKNOWN PROPERTY
		FName __NameProperty; // 0x128(0x4)
		unsigned char UnknownData07_6[0x4]; // 0x12C(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x130(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x148(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1C8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x3C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x3F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x4E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x6F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x7B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x7E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x9C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x9F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xA80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xAB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xAE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xB10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xB40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xB70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0xBA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xBD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xD80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xDB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xDE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xE10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xE40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xE70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xEA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xF00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xF60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0xF90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x10B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1110(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x12C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x12F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x13B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x13E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x14A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x14D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x15C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x15F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_DeadBlending; // 0x1650(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x1680(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x16B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x16E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x17A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0x18F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x19B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x19E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1A18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1A48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1A78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1AA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1AD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x1B08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1B38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1B68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1B98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1BC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1BF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0x1C28(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x1C58(0x8)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0x2B (0x2C - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_205 : public FAnimBlueprintMutableData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		float __FloatProperty; // 0x8(0x4)
		bool __BoolProperty; // 0xC(0x1)
		bool __BoolProperty; // 0xD(0x1)
		bool __BoolProperty; // 0xE(0x1)
		bool __BoolProperty; // 0xF(0x1)
		bool __BoolProperty; // 0x10(0x1)
		bool __BoolProperty; // 0x11(0x1)
		bool __BoolProperty; // 0x12(0x1)
		bool __BoolProperty; // 0x13(0x1)
		bool __BoolProperty; // 0x14(0x1)
		bool __BoolProperty; // 0x15(0x1)
		bool __BoolProperty; // 0x16(0x1)
		bool __BoolProperty; // 0x17(0x1)
		bool __BoolProperty; // 0x18(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x19(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		bool __BoolProperty; // 0x20(0x1)
		char __ByteProperty; // 0x21(0x1)
		bool __BoolProperty; // 0x22(0x1)
		bool __BoolProperty; // 0x23(0x1)
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
	};


	// Struct /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x297F (0x2980 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_206 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		TArray<int32_t> __ArrayProperty; // 0x10(0x10)
		FName __NameProperty; // 0x20(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x24(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x28(0x18)
		FName __NameProperty; // 0x40(0x4)
		FName __NameProperty; // 0x44(0x4)
		FName __NameProperty; // 0x48(0x4)
		FName __NameProperty; // 0x4C(0x4)
		FName __NameProperty; // 0x50(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x54(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x58(0x10)
		FName __NameProperty; // 0x68(0x4)
		FName __NameProperty; // 0x6C(0x4)
		float __FloatProperty; // 0x70(0x4)
		FName __NameProperty; // 0x74(0x4)
		float __FloatProperty; // 0x78(0x4)
		FName __NameProperty; // 0x7C(0x4)
		FName __NameProperty; // 0x80(0x4)
		FName __NameProperty; // 0x84(0x4)
		FName __NameProperty; // 0x88(0x4)
		FName __NameProperty; // 0x8C(0x4)
		FName __NameProperty; // 0x90(0x4)
		FName __NameProperty; // 0x94(0x4)
		TArray<float> __ArrayProperty; // 0x98(0x10)
		TArray<int32_t> __ArrayProperty; // 0xA8(0x10)
		FName __NameProperty; // 0xB8(0x4)
		FName __NameProperty; // 0xBC(0x4)
		FName __NameProperty; // 0xC0(0x4)
		FName __NameProperty; // 0xC4(0x4)
		FName __NameProperty; // 0xC8(0x4)
		FName __NameProperty; // 0xCC(0x4)
		FName __NameProperty; // 0xD0(0x4)
		FName __NameProperty; // 0xD4(0x4)
		FName __NameProperty; // 0xD8(0x4)
		FName __NameProperty; // 0xDC(0x4)
		int32_t __IntProperty; // 0xE0(0x4)
		FName __NameProperty; // 0xE4(0x4)
		int32_t __IntProperty; // 0xE8(0x4)
		FName __NameProperty; // 0xEC(0x4)
		FName __NameProperty; // 0xF0(0x4)
		int32_t __IntProperty; // 0xF4(0x4)
		EBlendListTransitionType __EnumProperty; // 0xF8(0x1)
		unsigned char UnknownData04_6[0x7]; // 0xF9(0x7) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x100(0x10)
		FInputScaleBiasClampConstants __StructProperty; // 0x110(0x2C)
		FName __NameProperty; // 0x13C(0x4)
		FName __NameProperty; // 0x140(0x4)
		int32_t __IntProperty; // 0x144(0x4)
		TArray<float> __ArrayProperty; // 0x148(0x10)
		float __FloatProperty; // 0x158(0x4)
		FName __NameProperty; // 0x15C(0x4)
		float __FloatProperty; // 0x160(0x4)
		EAnimSyncMethod __EnumProperty; // 0x164(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x165(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x168(0x4)
		FName __NameProperty; // 0x16C(0x4)
		FName __NameProperty; // 0x170(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x174(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x175(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x178(0x4)
		FName __NameProperty; // 0x17C(0x4)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0x180(0x1)
		unsigned char UnknownData07_6[0x3]; // 0x181(0x3) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x184(0x4)
		float __FloatProperty; // 0x188(0x4)
		EAnimSyncMethod __EnumProperty; // 0x18C(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x18D(0x1)
		bool __BoolProperty; // 0x18E(0x1)
		unsigned char UnknownData08_6[0x1]; // 0x18F(0x1) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0x190(0x8)
		UCurveFloat* __CurveFloat; // 0x198(0x8)
		bool __BoolProperty; // 0x1A0(0x1)
		EAlphaBlendOption __EnumProperty; // 0x1A1(0x1)
		EBlendListTransitionType __EnumProperty; // 0x1A2(0x1)
		unsigned char UnknownData09_6[0x5]; // 0x1A3(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x1A8(0x10)
		FAnimNodeFunctionRef __StructProperty; // 0x1B8(0x18)
		FName __NameProperty; // 0x1D0(0x4)
		FName __NameProperty; // 0x1D4(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x1D8(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x258(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x270(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2A0(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x2A8(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x3A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x3D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x400(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x430(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x460(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x490(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x4C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x4F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x520(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x550(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x580(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x5E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x610(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x640(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x670(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x6A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x6D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x700(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x730(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x760(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x790(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x7C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x7F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x820(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x850(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x880(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x8B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x8E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x910(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x940(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x970(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x9A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x9D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive; // 0xA00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xA30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xA60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xA90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xAC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xAF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xB20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xB50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xB80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xBB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xBE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xC70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xCD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xD90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xDF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xE20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xE50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0xE80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xEB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xEE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0xF70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0xFA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1000(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1030(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1060(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1090(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x10C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x10F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x11B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x11E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x12A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x12D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x13F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x14B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x14E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum; // 0x1570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x15A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x15D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1600(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone; // 0x1630(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1660(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1690(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x16C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x16F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1720(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1750(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1780(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x17E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1810(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1840(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1870(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x18A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x18D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1900(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1930(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1960(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1990(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x19C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x19F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1A20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x1A50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1A80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1AB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1AE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1B10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1B40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x1B70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1BA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1BD0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1C00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1C30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1C60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1C90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1CC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1CF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1D20(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x1D50(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x1D80(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x1DB0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x1DE0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x1E10(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x1E40(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1E70(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x1EA0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1ED0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F00(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F30(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F60(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1F90(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1FC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x1FF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2020(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2050(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult; // 0x2080(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x20B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x20E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2110(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2140(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2170(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x21A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x21D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2200(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2230(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2260(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2290(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x22C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x22F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2320(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer; // 0x2350(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2380(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x23B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x23E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2410(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2440(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x2470(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x24A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x24D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x2500(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x2530(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x2560(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x2590(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x25C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x25F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer; // 0x2620(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult; // 0x2650(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine; // 0x2680(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x26B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose; // 0x26E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2710(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0x2740(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x2770(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend; // 0x27A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x27D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2800(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x2830(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x2860(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2890(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x28C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x28F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x2920(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x2950(0x30)
	};


	// Struct /Game/Characters/Player/Male/Male_Avg_Base/LayerAnimBP/SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedMutableData
	// Inherited from FAnimBlueprintMutableData
	// Size: 0xA2 (0xA3 - 0x1)
	struct FAnimBlueprintGeneratedMutableDatadup_207 : public FAnimBlueprintMutableData	
	{
	public:
		bool __BoolProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x4(0x4)
		char __ByteProperty; // 0x8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x9(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0xC(0x4)
		float __FloatProperty; // 0x10(0x4)
		float __FloatProperty; // 0x14(0x4)
		bool __BoolProperty; // 0x18(0x1)
		char __ByteProperty; // 0x19(0x1)
		bool __BoolProperty; // 0x1A(0x1)
		unsigned char UnknownData02_6[0x1]; // 0x1B(0x1) UNKNOWN PROPERTY
		float __FloatProperty; // 0x1C(0x4)
		bool __BoolProperty; // 0x20(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x21(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x24(0x4)
		float __FloatProperty; // 0x28(0x4)
		float __FloatProperty; // 0x2C(0x4)
		float __FloatProperty; // 0x30(0x4)
		char __ByteProperty; // 0x34(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x35(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x38(0x4)
		float __FloatProperty; // 0x3C(0x4)
		char __ByteProperty; // 0x40(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x41(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x44(0x4)
		float __FloatProperty; // 0x48(0x4)
		float __FloatProperty; // 0x4C(0x4)
		float __FloatProperty; // 0x50(0x4)
		float __FloatProperty; // 0x54(0x4)
		float __FloatProperty; // 0x58(0x4)
		float __FloatProperty; // 0x5C(0x4)
		bool __BoolProperty; // 0x60(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float __FloatProperty; // 0x64(0x4)
		bool __BoolProperty; // 0x68(0x1)
		bool __BoolProperty; // 0x69(0x1)
		bool __BoolProperty; // 0x6A(0x1)
		bool __BoolProperty; // 0x6B(0x1)
		float __FloatProperty; // 0x6C(0x4)
		bool __BoolProperty; // 0x70(0x1)
		bool __BoolProperty; // 0x71(0x1)
		unsigned char UnknownData07_6[0x2]; // 0x72(0x2) UNKNOWN PROPERTY
		float __FloatProperty; // 0x74(0x4)
		float __FloatProperty; // 0x78(0x4)
		float __FloatProperty; // 0x7C(0x4)
		UAnimSequenceBase* __AnimSequenceBase; // 0x80(0x8)
		UAnimSequenceBase* __AnimSequenceBase; // 0x88(0x8)
		TArray<float> __ArrayProperty; // 0x90(0x10)
		bool __BoolProperty; // 0xA0(0x1)
		bool __BoolProperty; // 0xA1(0x1)
		bool __BoolProperty; // 0xA2(0x1)
	};


	// Struct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x2197 (0x2198 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_208 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		TArray<float> __ArrayProperty; // 0x8(0x10)
		TArray<float> __ArrayProperty; // 0x18(0x10)
		FName __NameProperty; // 0x28(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0x30(0x10)
		FName __NameProperty; // 0x40(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x44(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x48(0x18)
		TArray<float> __ArrayProperty; // 0x60(0x10)
		FName __NameProperty; // 0x70(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x78(0x18)
		TEnumAsByte<ESequenceEvalReinit> __ByteProperty; // 0x90(0x1)
		bool __BoolProperty; // 0x91(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x92(0x2) UNKNOWN PROPERTY
		int32_t __IntProperty; // 0x94(0x4)
		float __FloatProperty; // 0x98(0x4)
		EAnimSyncMethod __EnumProperty; // 0x9C(0x1)
		TEnumAsByte<EAnimGroupRole> __ByteProperty; // 0x9D(0x1)
		unsigned char UnknownData05_6[0x2]; // 0x9E(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0xA0(0x4)
		unsigned char UnknownData06_6[0x4]; // 0xA4(0x4) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xA8(0x10)
		FName __NameProperty; // 0xB8(0x4)
		FName __NameProperty; // 0xBC(0x4)
		FName __NameProperty; // 0xC0(0x4)
		unsigned char UnknownData07_6[0x4]; // 0xC4(0x4) UNKNOWN PROPERTY
		UBlendProfile* __BlendProfile; // 0xC8(0x8)
		UCurveFloat* __CurveFloat; // 0xD0(0x8)
		bool __BoolProperty; // 0xD8(0x1)
		EAlphaBlendOption __EnumProperty; // 0xD9(0x1)
		EBlendListTransitionType __EnumProperty; // 0xDA(0x1)
		unsigned char UnknownData08_6[0x5]; // 0xDB(0x5) UNKNOWN PROPERTY
		TArray<float> __ArrayProperty; // 0xE0(0x10)
		FName __NameProperty; // 0xF0(0x4)
		unsigned char UnknownData09_6[0x4]; // 0xF4(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0xF8(0x18)
		FName __NameProperty; // 0x110(0x4)
		FName __NameProperty; // 0x114(0x4)
		FAnimSubsystem_Tag AnimBlueprintExtension_Tag; // 0x118(0x60)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x178(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1F8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x210(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x240(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x248(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0x250(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x280(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BoneMask; // 0x2B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0x2E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0x310(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x340(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x370(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x3A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x3D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x400(0x30)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x430(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x438(0x8)
		FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose; // 0x440(0x8)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x448(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_HandIKRetargeting; // 0x478(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x4A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x4D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x508(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x538(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x568(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x598(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x5C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x5F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x628(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x658(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x688(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x6B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x6E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone; // 0x718(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x748(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x778(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x7A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x7D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x808(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK; // 0x838(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x868(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0x898(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendStackInput; // 0x8C8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x8F8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x928(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x958(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0x988(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendStackResult; // 0x9B8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendStack; // 0x9E8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xA18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSearchHistoryCollector; // 0xA48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_DeadBlending; // 0xA78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xAA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xAD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer; // 0xB08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xB38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend; // 0xB68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xB98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xBC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xBF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xC28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xC58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xC88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0xCB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xCE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator; // 0xD18(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xD48(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xD78(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xDA8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose; // 0xDD8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0xE08(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve; // 0xE38(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xE68(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xE98(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose; // 0xEC8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyMotion; // 0xEF8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyMotion; // 0xF28(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyMotion; // 0xF58(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xF88(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyMotion; // 0xFB8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool; // 0xFE8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1018(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x1048(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1078(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x10A8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x10D8(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1108(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1138(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose; // 0x1168(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x1198(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x11C8(0x30)
