#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Gadgets
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Struct /Game/Gadgets/Assets/Fish/Stink_Fish/Meshes/Stink_Fish_AnimBP.Stink_Fish_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1DF (0x1E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_244 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1B0(0x30)
	};


	// Struct /Game/Gadgets/Assets/ChillBronco/Meshes/SK_ChillBronco_AnimBP.SK_ChillBronco_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x20F (0x210 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_245 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SubInput; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0x1B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1E0(0x30)
	};


	// Struct /Game/Gadgets/Assets/Fish/Catfish/Meshes/Catfish_AnimBP.Catfish_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1AF (0x1B0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_246 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x180(0x30)
	};


	// Struct /Game/Gadgets/Assets/Fish/Holiday_Fish/Meshes/Holiday_Fish_AnimBP.Holiday_Fish_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1AF (0x1B0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_247 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x180(0x30)
	};


	// Struct /Game/Gadgets/Assets/Bucket_Old/Meshes/Bucket_Old_Gadget_Skeleton_AnimBP.Bucket_Old_Gadget_Skeleton_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1DF (0x1E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_248 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SubInput; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1B0(0x30)
	};


	// Struct /Game/Gadgets/Assets/Fish/Kev_Fish/Meshes/Kev_Fish_Gadget_AnimBP.Kev_Fish_Gadget_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1DF (0x1E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_249 : public FAnimBlueprintConstantData	
	{
	public:
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Trail; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Trail; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1B0(0x30)
	};


	// Struct /Game/Gadgets/Assets/Flopper/Meshes/Flopper_Gadget_AnimBP.Flopper_Gadget_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1DF (0x1E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_250 : public FAnimBlueprintConstantData	
	{
	public:
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x8(0x18)
		FName __NameProperty; // 0x20(0x4)
		FName __NameProperty; // 0x24(0x4)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Trail; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Trail; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x1B0(0x30)
	};


	// Struct /Game/Gadgets/Assets/Fish/Slurp_Jellyfish/Meshes/Slurp_Jellyfish_AnimBP.Slurp_Jellyfish_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1AF (0x1B0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_251 : public FAnimBlueprintConstantData	
	{
	public:
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0x1(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x2(0x2) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0x180(0x30)
	};


	// Struct /Game/Gadgets/Assets/Happy_Ghost/Meshes/Happy_Ghost_Gadget_AnimBP.Happy_Ghost_Gadget_AnimBP_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x1DF (0x1E0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_252 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData00_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		TEnumAsByte<ERefPoseType> __ByteProperty; // 0xC(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody; // 0x1B0(0x30)
	};

}
