#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: Items
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class /SpecialSurfaceCoverage/Items/SnowSurfaceCoverageMap_GSC.SnowSurfaceCoverageMap_GSC_C
	// Inherited from UFortGameStateComponent_SurfaceCoverageMap -> UFortGameStateComponent_SurfaceOverride -> UFortGameStateComponent -> UGameStateComponent -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x0 (0x110 - 0x110)
	class USnowSurfaceCoverageMap_GSC_C : public UFortGameStateComponent_SurfaceCoverageMap	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SpecialSurfaceCoverage/Items/SnowSurfaceCoverageMap_GSC.SnowSurfaceCoverageMap_GSC_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression.B_CosmeticStatObject_HabaneroProgression_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xD8 - 0xD8)
	class UB_CosmeticStatObject_HabaneroProgression_C : public UFortCosmeticStatObject_HabaneroProgression	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression.B_CosmeticStatObject_HabaneroProgression_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season31.B_CosmeticStatObject_HabaneroProgression_Season31_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgressionSeasonal -> UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UB_CosmeticStatObject_HabaneroProgression_Season31_C : public UFortCosmeticStatObject_HabaneroProgressionSeasonal	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season31.B_CosmeticStatObject_HabaneroProgression_Season31_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season29.B_CosmeticStatObject_HabaneroProgression_Season29_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgressionSeasonal -> UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UB_CosmeticStatObject_HabaneroProgression_Season29_C : public UFortCosmeticStatObject_HabaneroProgressionSeasonal	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season29.B_CosmeticStatObject_HabaneroProgression_Season29_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season26.B_CosmeticStatObject_HabaneroProgression_Season26_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgressionSeasonal -> UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UB_CosmeticStatObject_HabaneroProgression_Season26_C : public UFortCosmeticStatObject_HabaneroProgressionSeasonal	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season26.B_CosmeticStatObject_HabaneroProgression_Season26_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season27.B_CosmeticStatObject_HabaneroProgression_Season27_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgressionSeasonal -> UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UB_CosmeticStatObject_HabaneroProgression_Season27_C : public UFortCosmeticStatObject_HabaneroProgressionSeasonal	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season27.B_CosmeticStatObject_HabaneroProgression_Season27_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season30.B_CosmeticStatObject_HabaneroProgression_Season30_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgressionSeasonal -> UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UB_CosmeticStatObject_HabaneroProgression_Season30_C : public UFortCosmeticStatObject_HabaneroProgressionSeasonal	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season30.B_CosmeticStatObject_HabaneroProgression_Season30_C");
			return ret;
		}
	};


	// Class /RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season28.B_CosmeticStatObject_HabaneroProgression_Season28_C
	// Inherited from UFortCosmeticStatObject_HabaneroProgressionSeasonal -> UFortCosmeticStatObject_HabaneroProgression -> UFortCosmeticStatObject -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UB_CosmeticStatObject_HabaneroProgression_Season28_C : public UFortCosmeticStatObject_HabaneroProgressionSeasonal	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/RankedPermanentQuests/Items/B_CosmeticStatObject_HabaneroProgression_Season28.B_CosmeticStatObject_HabaneroProgression_Season28_C");
			return ret;
		}
	};


	// Class /ChapWormGameplay/Items/ChapWorm/GameplayCues/GCNL_ChapWorm_Loop_Parent.GCNL_ChapWorm_Loop_Parent_C
	// Inherited from AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x48 (0x9F8 - 0x9B0)
	class AGCNL_ChapWorm_Loop_Parent_C : public AFortGameplayCueNotify_Loop	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x9B0(0x8)
		bool bSpawnRadialForce; // 0x9B8(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x9B9(0x7) UNKNOWN PROPERTY
		double RadialForcePlayRate; // 0x9C0(0x8)
		double RadialForceTimeDecay; // 0x9C8(0x8)
		double RadialForceImpactRadius; // 0x9D0(0x8)
		double RadialForceStrength; // 0x9D8(0x8)
		float RadialForceDelayTime; // 0x9E0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x9E4(0x4) UNKNOWN PROPERTY
		UForceFeedbackEffect* LocalPlayerForceFeedbackEffect_Default; // 0x9E8(0x8)
		UForceFeedbackEffect* LocalPlayerForceFeedbackEffect_Overpower; // 0x9F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ChapWormGameplay/Items/ChapWorm/GameplayCues/GCNL_ChapWorm_Loop_Parent.GCNL_ChapWorm_Loop_Parent_C");
			return ret;
		}

		void PlayCameraShake(AActor* TargetActor, UClass* ShakeClass, float Scale); // Flags: Public|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool PreferPerformance(); // Flags: Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayForceFeedback(AActor* TargetActor, UForceFeedbackEffect* ForceFeedbackEffect); // Flags: Protected|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnApplicationGeneric(AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UFXSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, ULegacyCameraShake* BurstCameraShakeInstance, ADecalActor* BurstDecalInstance); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GCNL_ChapWorm_Loop_Parent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ChapWormGameplay/Items/ChapWorm/GameplayCues/GCNL_ChapWorm_KineticEnergy_Maxed.GCNL_ChapWorm_KineticEnergy_Maxed_C
	// Inherited from AGCNL_ChapWorm_Loop_Parent_C -> AFortGameplayCueNotify_Loop -> AFortGameplayCueNotify_Actor -> AGameplayCueNotify_Actor -> AActor -> UObject
	// Size: 0x18 (0xA10 - 0x9F8)
	class AGCNL_ChapWorm_KineticEnergy_Maxed_C : public AGCNL_ChapWorm_Loop_Parent_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x9F8(0x8)
		bool Loop; // 0xA00(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xA01(0x7) UNKNOWN PROPERTY
		AFortPlayerPawn* PlayerPawn; // 0xA08(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ChapWormGameplay/Items/ChapWorm/GameplayCues/GCNL_ChapWorm_KineticEnergy_Maxed.GCNL_ChapWorm_KineticEnergy_Maxed_C");
			return ret;
		}

		void Initialize FX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnApplicationGeneric(AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UFXSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, ULegacyCameraShake* BurstCameraShakeInstance, ADecalActor* BurstDecalInstance); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoopingStartGeneric(AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UFXSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Enter Water(AFortPlayerPawn* FortPlayerPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Exit Water(AFortPlayerPawn* FortPlayerPawn, bool bPawnIsOutsideOfAllWaterBodies); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Looping in water(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRemovalGeneric(AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UFXSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, ULegacyCameraShake* BurstCameraShakeInstance, ADecalActor* BurstDecalInstance); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GCNL_ChapWorm_KineticEnergy_Maxed(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SupplyDropRadioGameplay/Items/SupplyDropRadio_Handheld/BP_SupplyDropRadioFlareActor.BP_SupplyDropRadioFlareActor_C
	// Inherited from AActor -> UObject
	// Size: 0x160 (0x3F0 - 0x290)
	class ABP_SupplyDropRadioFlareActor_C : public AActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x290(0x8)
		UFortCollisionAudioComponent* FortCollisionAudio; // 0x298(0x8)
		UFortWaterInteractionComponent* FortWaterInteraction; // 0x2A0(0x8)
		UStaticMeshComponent* Mesh; // 0x2A8(0x8)
		UFortProjectileMovementComponent* FortProjectileMovement; // 0x2B0(0x8)
		float Timeline_ThrowRotation_Alpha_0C5D02CA4737C6F55E978CAA17038410; // 0x2B8(0x4)
		TEnumAsByte<ETimelineDirection> Timeline_ThrowRotation__Direction_0C5D02CA4737C6F55E978CAA17038410; // 0x2BC(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x2BD(0x3) UNKNOWN PROPERTY
		UTimelineComponent* Timeline_ThrowRotation; // 0x2C0(0x8)
		bool bThrown; // 0x2C8(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x2C9(0x3) UNKNOWN PROPERTY
		int32_t Bounces; // 0x2CC(0x4)
		FTimerHandle ProjectileSimulationTimerHandle; // 0x2D0(0x8)
		FScalableFloat MaxProjectileSimulationTime; // 0x2D8(0x28)
		FScalableFloat MaxAllowedBounces; // 0x300(0x28)
		bool bSupplyDropSpawned; // 0x328(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x329(0x7) UNKNOWN PROPERTY
		FTimerHandle SpawnSupplyDropTimerHandle; // 0x330(0x8)
		bool bPopped; // 0x338(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x339(0x7) UNKNOWN PROPERTY
		FRotator ThrowRotation; // 0x340(0x18)
		FRotator InitialRotation; // 0x358(0x18)
		double ThrowRotationLerpDuration; // 0x370(0x8)
		FScalableFloat LifespanAfterSupplyDropSpawn; // 0x378(0x28)
		FScalableFloat DurationAfterPrjStopToSpawnSupplyDrop; // 0x3A0(0x28)
		int32_t ConversationIndex; // 0x3C8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x3CC(0x4) UNKNOWN PROPERTY
		UNiagaraSystem* NS_WaterSplash; // 0x3D0(0x8)
		USoundBase* WaterSplashSoundCue; // 0x3D8(0x8)
		UNiagaraComponent* FXSystemComponent; // 0x3E0(0x8)
		UFortCollisionAudioComponent* FortFlareIgniteAudio; // 0x3E8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SupplyDropRadioGameplay/Items/SupplyDropRadio_Handheld/BP_SupplyDropRadioFlareActor.BP_SupplyDropRadioFlareActor_C");
			return ret;
		}

		void OnRep_bThrown(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_bPopped(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopFlare(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetSupplyDropRadioData(FSupplyDropRadioDataStruct& Data); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartSpawnSupplyDropTimer(); // Flags: Protected|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnSupplyDrop(); // Flags: Protected|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSupplyDropRadioConversationIndex(int32_t Index); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleProjectileSimulationTimerEnded(); // Flags: Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ThrowFlare(FVector Velocity); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ThrowRotation__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ThrowRotation__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_SupplyDropRadioFlareActor_FortProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature(FHitResult& ImpactResult, FVector& ImpactVelocity); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_SupplyDropRadioFlareActor_FortProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature(FHitResult& ImpactResult); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_ThrowRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_SupplyDropRadioFlareActor_FortWaterInteraction_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(AFortWaterBodyActor* WaterBody, UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecutePopCosmetic(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_SupplyDropRadioFlareActor(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SupplyDropRadioGameplay/Items/SupplyDropRadio_Handheld/B_SupplyDropRadio_Handheld_Item.B_SupplyDropRadio_Handheld_Item_C
	// Inherited from AB_UtilityItem_Generic_Athena_C -> AB_UtilityItem_Generic_C -> AFortWeapon -> AActor -> UObject
	// Size: 0xA7 (0x16A8 - 0x1601)
	class AB_SupplyDropRadio_Handheld_Item_C : public AB_UtilityItem_Generic_Athena_C	
	{
	public:
		unsigned char UnknownData00_3[0x7]; // 0x1601(0x7) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1608(0x8)
		UNonPlayerConversationComponent_C* NonPlayerConversationComponent; // 0x1610(0x8)
		ABP_SupplyDropRadioFlareActor_C* FlareActor; // 0x1618(0x8)
		bool bFlareThrown; // 0x1620(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1621(0x7) UNKNOWN PROPERTY
		FVector ServerThrowStartRelativeLocation; // 0x1628(0x18)
		FScalableFloat FlareThrowForwardDistance; // 0x1640(0x28)
		FScalableFloat FlareThrowSpeed; // 0x1668(0x28)
		FVector ServerThrowStartRelativeLocationCrouched; // 0x1690(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SupplyDropRadioGameplay/Items/SupplyDropRadio_Handheld/B_SupplyDropRadio_Handheld_Item.B_SupplyDropRadio_Handheld_Item_C");
			return ret;
		}

		void GetFlareActor(ABP_SupplyDropRadioFlareActor_C* FlareActor); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponAttached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponDetached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ThrowFlare(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PopFlare(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_SupplyDropRadio_Handheld_Item(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /WeaponMods/Items/WeaponMods/ModGE/GE_ModWeaponAttributes.GE_ModWeaponAttributes_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ModWeaponAttributes_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/WeaponMods/Items/WeaponMods/ModGE/GE_ModWeaponAttributes.GE_ModWeaponAttributes_C");
			return ret;
		}
	};


	// Class /Game/Items/Traps/Blueprints/Toys/ToyOptionsComponent.ToyOptionsComponent_C
	// Inherited from UFortActorOptionsComponent -> UActorComponent -> UObject
	// Size: 0x38 (0x230 - 0x1F8)
	class UToyOptionsComponent_C : public UFortActorOptionsComponent	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1F8(0x8)
		TWeakObjectPtr<UClass*> PropertyEditorWidgetClass; // 0x200(0x20)
		bool bLoadingAssets; // 0x220(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x221(0x7) UNKNOWN PROPERTY
		UCommonActivatableWidget* CachedPropertyEditorWidget; // 0x228(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/Items/Traps/Blueprints/Toys/ToyOptionsComponent.ToyOptionsComponent_C");
			return ret;
		}

		bool BlueprintOnLocalInteract(AFortPlayerPawn* InteractingPawn); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPrimaryContentPushed_9812DE614035D1CEA30A25A4EB60BBE8(UCommonActivatableWidget* ActivatableWidget); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DisplayPropertyEditor(APlayerController* InteractingPlayer); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePropertyEditorDeactivated(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ToyOptionsComponent(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/GE_Athena_SunRose_Wings_EnergyDrain_FlyingUpThroughCeiling.GE_Athena_SunRose_Wings_EnergyDrain_FlyingUpThroughCeiling_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_SunRose_Wings_EnergyDrain_FlyingUpThroughCeiling_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/GE_Athena_SunRose_Wings_EnergyDrain_FlyingUpThroughCeiling.GE_Athena_SunRose_Wings_EnergyDrain_FlyingUpThroughCeiling_C");
			return ret;
		}
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/Camera/CameraMod_Wings_Walking.CameraMod_Wings_Walking_C
	// Inherited from UAthena_PlayerCameraModeBase_C -> UFortCameraMode_ThirdPerson -> UFortCameraMode -> UObject
	// Size: 0x0 (0x1E30 - 0x1E30)
	class UCameraMod_Wings_Walking_C : public UAthena_PlayerCameraModeBase_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/Camera/CameraMod_Wings_Walking.CameraMod_Wings_Walking_C");
			return ret;
		}
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/GE_Athena_SunRose_Wings_Landing.GE_Athena_SunRose_Wings_Landing_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_SunRose_Wings_Landing_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/GE_Athena_SunRose_Wings_Landing.GE_Athena_SunRose_Wings_Landing_C");
			return ret;
		}
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_Procedural_AnimBP.SunRose_Wings_Procedural_AnimBP_C
	// Inherited from UAnimInstance -> UObject
	// Size: 0x7408 (0x77C0 - 0x3B8)
	class USunRose_Wings_Procedural_AnimBP_C : public UAnimInstance	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x3B8(0x8) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x3C0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x3C8(0x8)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3D0(0x510)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8E0(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x900(0x20)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x920(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xE30(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1340(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1850(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1D60(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2270(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2780(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2C90(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x31A0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x36B0(0x510)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3BC0(0xB0)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3C70(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4180(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4690(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4BA0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x50B0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x55C0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x5AD0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x5FE0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x64F0(0x510)
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x6A00(0x510)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6F10(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x7038(0x128)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x7160(0x128)
		unsigned char UnknownData01_6[0x8]; // 0x7288(0x8) UNKNOWN PROPERTY
		FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x7290(0x510)
		FAnimNode_Root AnimGraphNode_Root; // 0x77A0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_Procedural_AnimBP.SunRose_Wings_Procedural_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/GE_Athena_SunRose_Wings_RelayDamage.GE_Athena_SunRose_Wings_RelayDamage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_SunRose_Wings_RelayDamage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/GE_Athena_SunRose_Wings_RelayDamage.GE_Athena_SunRose_Wings_RelayDamage_C");
			return ret;
		}
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Player_AnimBP.SunRose_Player_AnimBP_C
	// Inherited from USunRoseFlying_PlayerAnimInstance -> UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x2B00 (0x3FA0 - 0x14A0)
	class USunRose_Player_AnimBP_C : public USunRoseFlying_PlayerAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x14A0(0x40)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x14E0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x14E8(0x8)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x14F0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x15A0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x15C0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1670(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1690(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1740(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1760(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1810(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1830(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x18E0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1900(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x19B0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19D0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x19F0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1AE0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1B00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BB0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BD0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1BF0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C10(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1CE0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D00(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1DB0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1E60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E80(0xB0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1F30(0x48)
		unsigned char UnknownData00_6[0x8]; // 0x1F78(0x8) UNKNOWN PROPERTY
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x1F80(0x530)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x24B0(0x78)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2528(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2550(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2578(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x25A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x25C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x25F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2618(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2640(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2668(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2690(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x26B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x26E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2708(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2730(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2758(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2780(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x27A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x27D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x27F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2820(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2848(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2870(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2898(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28E8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2910(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2958(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2978(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29C0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29E0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2A28(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2A48(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2A90(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2AB0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2AD0(0x128)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2BF8(0x70)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2C68(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2CB0(0x70)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D20(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2D68(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2DB0(0xC0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2E70(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2EB8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2F80(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2FC8(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3010(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3030(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3078(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3098(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x30E0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3100(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3148(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3168(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x31B0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x31D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3218(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3238(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3280(0x20)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x32A0(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x32E8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3330(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3378(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3398(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x33C0(0xC8)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x3488(0x120)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x35A8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3618(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x36E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3708(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3730(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3758(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3780(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x37A8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x37D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3818(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3838(0x28)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3860(0x20)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3880(0x28)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x38A8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3970(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x39B8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x39D8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3A00(0xC8)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3AC8(0xC0)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3B88(0x48)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3BD0(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3C40(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3D08(0x70)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3D78(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x3DC0(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x3DE0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3E00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3EB0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3ED0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x3F80(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Player_AnimBP.SunRose_Player_AnimBP_C");
			return ret;
		}

		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/FlyingPawnComponent.FlyingPawnComponent_C
	// Inherited from UFortPawnComponent_WingedFlying -> UFortPawnComponent -> UPawnComponent -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x238 (0x440 - 0x208)
	class UFlyingPawnComponent_C : public UFortPawnComponent_WingedFlying	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x208(0x8)
		AFortPlayerPawn* OwnerPawn; // 0x210(0x8)
		FScalableFloat Row_HeightCheckInterval; // 0x218(0x28)
		FScalableFloat Row_HeightForMaxCeilingDecay; // 0x240(0x28)
		FGameplayTag Tag_Flying; // 0x268(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x26C(0x4) UNKNOWN PROPERTY
		FTimerHandle TimerHandle_HeightCheck; // 0x270(0x8)
		bool AscendPressed; // 0x278(0x1)
		bool BoostPressed; // 0x279(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x27A(0x6) UNKNOWN PROPERTY
		FGameplayTagContainer Tags_ClippingCheckActive; // 0x280(0x20)
		USkeletalMeshComponentBudgeted* WeaponMesh; // 0x2A0(0x8)
		FVector Skim_Location_Left; // 0x2A8(0x18)
		FVector Skim_Normal_Left; // 0x2C0(0x18)
		double Skim_Distance_Left; // 0x2D8(0x8)
		FVector Skim_Location_Right; // 0x2E0(0x18)
		FVector Skim_Normal_Right; // 0x2F8(0x18)
		double Skim_Distance_Right; // 0x310(0x8)
		FGameplayTagContainer Tags_RequiredToCrash; // 0x318(0x20)
		FScalableFloat Row_MinHeightToActivateWhileFalling; // 0x338(0x28)
		FGameplayTag Tag_LeapCooldown; // 0x360(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x364(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_LeapAmmoCost; // 0x368(0x28)
		FScalableFloat Row_ForwardInputThresholdToTriggerMiniBoost; // 0x390(0x28)
		double ReplicatedForwardSpeed; // 0x3B8(0x8)
		double ReplicatedAddedDownZVelocity; // 0x3C0(0x8)
		double CurrentFlyingEnergyRemaining; // 0x3C8(0x8)
		FMulticastInlineDelegate BoostAction_Started; // 0x3D0(0x10)
		FMulticastInlineDelegate BoostAction_Ended; // 0x3E0(0x10)
		FMulticastInlineDelegate AscendAction_Started; // 0x3F0(0x10)
		FMulticastInlineDelegate AscendAction_Ended; // 0x400(0x10)
		FMulticastInlineDelegate CrashAction_Triggered; // 0x410(0x10)
		FMulticastInlineDelegate RollLeftAction_Triggered; // 0x420(0x10)
		FMulticastInlineDelegate RollRightAction_Triggered; // 0x430(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/FlyingPawnComponent.FlyingPawnComponent_C");
			return ret;
		}

		void UpdateMoveXInput(double NewMoveInputX); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_ReplicatedAddedDownZVelocity(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_ReplicatedForwardSpeed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetAddedDownZVelocity(double NewAddedDownZVelocity); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetForwardSpeed(double NewForwardSpeed); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryStartCrashing(bool ForcedCrash); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetInputStatus(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingBoostAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingBoostAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingBoostAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingAscendAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingAscendAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingAscendAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingCrashAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingRollLeftAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InpActEvt_WingedFlyingRollRightAction_K2Node_EnhancedInputActionEvent(FInputActionValue ActionValue, float ElapsedTime, float TriggeredTime, UInputAction* SourceAction); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_2E51287A41117ABDD9828CAFDF729E8F(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnASCReady(UFortAbilitySystemComponent* AbilitySystemComponent, AFortPlayerPawn* AffectedPawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateCurrentFlyingEnergyRemaining(double NewEnergyRemaining, bool bForceUpdate); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleFlyingMoveStatusUpdated(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleAddedDownZVelocityUpdated(float NewAddedDownZVelocity); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleForwardSpeedUpdated(float NewForwardSpeed); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleLeftSkimCheckComplete(FHitResult& HitResult); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleRightSkimCheckComplete(FHitResult& HitResult); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FlyingPawnComponent(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RollRightAction_Triggered__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RollLeftAction_Triggered__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CrashAction_Triggered__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AscendAction_Ended__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AscendAction_Started__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BoostAction_Ended__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BoostAction_Started__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/FlyingExtLogic.FlyingExtLogic_C
	// Inherited from UFortMovementMode_ExtLogicFlyingWinged -> UFortMovementMode_ExtLogicFlying -> UFortMovementMode_BaseExtLogic -> UObject
	// Size: 0x10A0 (0x2338 - 0x1298)
	class UFlyingExtLogic_C : public UFortMovementMode_ExtLogicFlyingWinged	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1298(0x8)
		USunRose_Player_AnimBP_C* FlyingPlayerAnim; // 0x12A0(0x8)
		double DistanceFromCeilingHeight; // 0x12A8(0x8)
		FScalableFloat Row_CeilingHeightIncreasePerSecondWhileBoosting_Min; // 0x12B0(0x28)
		FScalableFloat Row_CeilingHeightMinDecreasePerSecondWhileFlying; // 0x12D8(0x28)
		FScalableFloat Row_CeilingHeightDecreasePerSecondWhileFlyingAsPctDistanceFromMaxHeight; // 0x1300(0x28)
		FGameplayTag EventTag_CrashImpact; // 0x1328(0x4)
		bool CrashEnabled; // 0x132C(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x132D(0x3) UNKNOWN PROPERTY
		FGameplayTag GC_CrashEnabled; // 0x1330(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1334(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_DistanceFromCeilingHeightForMaxFlyingSpeedAdded; // 0x1338(0x28)
		FScalableFloat Row_FlyingSpeed_AddedAtMaxDistanceFromCeilingHeight; // 0x1360(0x28)
		FScalableFloat Row_FlyingSpeed_Base; // 0x1388(0x28)
		FScalableFloat Row_DefaultLookPitchAngleOffset; // 0x13B0(0x28)
		FScalableFloat Row_Flying_LookPitchClamp_Min; // 0x13D8(0x28)
		FScalableFloat Row_Flying_LookPitchClamp_Max; // 0x1400(0x28)
		FScalableFloat Row_Flying_InputWeight_LookDirection; // 0x1428(0x28)
		FScalableFloat Row_Flying_InputWeight_Horizontal; // 0x1450(0x28)
		FRotator FlyingInputRotation; // 0x1478(0x18)
		FScalableFloat Row_CeilingHeightIncreasePerSecondWhileBoosting_Max; // 0x1490(0x28)
		FScalableFloat Row_PercentMaxLookPitchForMaxBoostCeilingHeightIncrease; // 0x14B8(0x28)
		FScalableFloat Row_CeilingHeightMinDecreasePerSecondWhileBoosting; // 0x14E0(0x28)
		FScalableFloat Row_CeilingHeightDecreasePerSecondWhileBoostingAsPctDistanceFromMaxHeight; // 0x1508(0x28)
		FScalableFloat Row_FlyingDownZSpeedAddedWhileFalling; // 0x1530(0x28)
		FScalableFloat Row_CeilingHeightMinDecreasePerSecondWhileAscending; // 0x1558(0x28)
		FScalableFloat Row_CeilingHeightDecreasePerSecondWhileAscendingAsPctDistanceFromMaxHeight; // 0x1580(0x28)
		FScalableFloat Row_CeilingHeightIncreasePerSecondWhileAscending_Min; // 0x15A8(0x28)
		FScalableFloat Row_CeilingHeightIncreasePerSecondWhileAscending_Max; // 0x15D0(0x28)
		FScalableFloat Row_AscendingSpeed_ZUpAdded_Min; // 0x15F8(0x28)
		FScalableFloat Row_AscendingSpeed_ZUpAdded_Max; // 0x1620(0x28)
		FScalableFloat Row_Ascending_LookPitchClamp_Min; // 0x1648(0x28)
		FScalableFloat Row_CrashingSpeed_Base; // 0x1670(0x28)
		FScalableFloat Row_CrashingSpeed_AddedAtMaxDistanceFromCeilingHeight; // 0x1698(0x28)
		FScalableFloat Row_DistanceFromCeilingHeightForMaxCrashingSpeedAdded; // 0x16C0(0x28)
		FScalableFloat Row_Crashing_LookPitchClamp_Min; // 0x16E8(0x28)
		FScalableFloat Row_Crashing_LookPitchClamp_Max; // 0x1710(0x28)
		FScalableFloat Row_Crashing_InputWeight_LookDirection; // 0x1738(0x28)
		FScalableFloat Row_PreCrashingSpeed_Base; // 0x1760(0x28)
		FScalableFloat Row_PreCrashing_InterpToSpeedMod; // 0x1788(0x28)
		UFlyingPawnComponent_C* FlyingPawnComponent; // 0x17B0(0x8)
		bool EnergyDrainEnabled; // 0x17B8(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x17B9(0x3) UNKNOWN PROPERTY
		FGameplayTag GC_EnergyDrain; // 0x17BC(0x4)
		double ForwardSpeed; // 0x17C0(0x8)
		double TotalUnpaidCeilingHeightAdded; // 0x17C8(0x8)
		double AscendHeightPer1Cost; // 0x17D0(0x8)
		FGameplayTag Tag_EnergyDrain_FlyingUpThroughCeiling; // 0x17D8(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x17DC(0x4) UNKNOWN PROPERTY
		double CeilingHeightToAddThisTick; // 0x17E0(0x8)
		FScalableFloat Row_HeightIncreasePer1Cost; // 0x17E8(0x28)
		double PotentialCeilingHeightDecayThisTickFromFlying; // 0x1810(0x8)
		double ActualCeilingHeightDecayThisTick; // 0x1818(0x8)
		FScalableFloat Row_GlobalCeilingHeight_Max; // 0x1820(0x28)
		FScalableFloat Row_GlobalCeilingHeight_DiminishingReturnsRange; // 0x1848(0x28)
		FScalableFloat Row_GlobalCeilingHeight_DiminishingReturnsExponent; // 0x1870(0x28)
		double FlyingDownSpeedToAdd; // 0x1898(0x8)
		FScalableFloat Row_PercentMaxCeilingHeightToAddFromDefaultForwardFlyingInput; // 0x18A0(0x28)
		FScalableFloat Row_CeilingHeightIncreasePerSecondWhileHoldingForward_Min; // 0x18C8(0x28)
		FScalableFloat Row_CeilingHeightIncreasePerSecondWhileHoldingForward_Max; // 0x18F0(0x28)
		FScalableFloat Row_ForwardInputThresholdToTriggerMiniBoost; // 0x1918(0x28)
		FScalableFloat Row_HeightAboveWorldInterpSpeed_Increasing; // 0x1940(0x28)
		FScalableFloat Row_HeightForMinAddedCeilingDecay; // 0x1968(0x28)
		FScalableFloat Row_HeightForMaxAddedCeilingDecay; // 0x1990(0x28)
		FScalableFloat Row_MaxAddedCeilingDecayFromHeight; // 0x19B8(0x28)
		double AddedCeilingHeightDecayThisTickFromHeightAboveWorld; // 0x19E0(0x8)
		FScalableFloat Row_EnergyThresholdForAddedCeilingDecay; // 0x19E8(0x28)
		FScalableFloat Row_MaxAddedCeilingDecayFromEnergy; // 0x1A10(0x28)
		double AddedCeilingHeightDecayThisTickFromEnergy; // 0x1A38(0x8)
		FVector DodgeVelocity; // 0x1A40(0x18)
		FScalableFloat Row_PreCrashWindupDuration; // 0x1A58(0x28)
		FScalableFloat Row_AirBraking_DefaultMult_Min; // 0x1A80(0x28)
		FScalableFloat Row_AirBraking_DownSpeedMult_Min; // 0x1AA8(0x28)
		UFortInputMappingContext* FlyingInputContext; // 0x1AD0(0x8)
		FScalableFloat Row_Dodge_Speed_Max; // 0x1AD8(0x28)
		FScalableFloat Row_Dodge_Speed_Min; // 0x1B00(0x28)
		FScalableFloat Row_Dodge_Duration; // 0x1B28(0x28)
		FScalableFloat Row_Dodge_SpeedDecay_InitialDelay; // 0x1B50(0x28)
		FScalableFloat Row_Dodge_SpeedRamp_Exponent; // 0x1B78(0x28)
		FScalableFloat Row_Dodge_SpeedDecay_Exponent; // 0x1BA0(0x28)
		FScalableFloat Row_Pitch_InterpSpeed_AtBaseSpeed; // 0x1BC8(0x28)
		FScalableFloat Row_Pitch_InterpSpeed_AtMaxLateralSpeed; // 0x1BF0(0x28)
		FScalableFloat Row_Pitch_InterpSpeed_AtMaxTotalSpeed; // 0x1C18(0x28)
		FScalableFloat Row_Pitch_InterpSpeed_WhileCrashing; // 0x1C40(0x28)
		FScalableFloat Row_Yaw_InterpSpeed_AtMinBrakeSpeed; // 0x1C68(0x28)
		FScalableFloat Row_Yaw_InterpSpeed_AtBaseSpeed; // 0x1C90(0x28)
		FScalableFloat Row_Yaw_InterpSpeed_AtMaxLateralSpeed; // 0x1CB8(0x28)
		FScalableFloat Row_Yaw_InterpSpeed_WhileCrashing; // 0x1CE0(0x28)
		FScalableFloat Row_Crashing_MovementInterpSpeed; // 0x1D08(0x28)
		FScalableFloat Row_HeightAboveWorldInterpSpeed_Decreasing; // 0x1D30(0x28)
		FScalableFloat Row_Crashing_LookPitchClamp_FinalMax; // 0x1D58(0x28)
		FScalableFloat Row_Crashing_LookPitchClamp_DelayBeforeLerpToFinalMax; // 0x1D80(0x28)
		FScalableFloat Row_Crashing_LookPitchClamp_DurationToLerpToFinalMax; // 0x1DA8(0x28)
		FScalableFloat Row_Ascend_MinDuration; // 0x1DD0(0x28)
		UFortAbilitySystemComponent* OwnerASC; // 0x1DF8(0x8)
		FScalableFloat Row_Boost_MinDuration; // 0x1E00(0x28)
		FScalableFloat Row_DistanceFromCeilingHeightForCrashMode; // 0x1E28(0x28)
		FScalableFloat Row_MaxCeilingHeightAddLimit_FromAscend; // 0x1E50(0x28)
		FScalableFloat Row_MaxCeilingHeightAddLimit_FromBoost; // 0x1E78(0x28)
		FScalableFloat Row_Skimming_MinRequiredAngle; // 0x1EA0(0x28)
		FScalableFloat Row_Skimming_MinRequiredVelocityAlongSurface; // 0x1EC8(0x28)
		FScalableFloat Row_Skimming_MinRequiredHeightAboveWorld; // 0x1EF0(0x28)
		FGameplayTag GC_Dodge_Left; // 0x1F18(0x4)
		FGameplayTag GC_Dodge_Right; // 0x1F1C(0x4)
		FGameplayTag GC_Bonk; // 0x1F20(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x1F24(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_InputInterpSpeed_Horizontal; // 0x1F28(0x28)
		FScalableFloat Row_StartedFlying_TransitionDuration; // 0x1F50(0x28)
		FScalableFloat Row_StartedFlying_VelocityInterpSpeed_AtMinSpeed; // 0x1F78(0x28)
		FScalableFloat Row_VelocityClampOnBonk; // 0x1FA0(0x28)
		FScalableFloat Row_StartedFlying_VelocityInterpSpeed_AtMaxSpeed; // 0x1FC8(0x28)
		FScalableFloat Row_StartedFlying_SpeedBoundForInterp_Min; // 0x1FF0(0x28)
		FScalableFloat Row_StartedFlying_SpeedBoundForInterp_Max; // 0x2018(0x28)
		FScalableFloat Row_MaxAngleForGroundHit; // 0x2040(0x28)
		UClass* GE_Landing_LowFriction; // 0x2068(0x8)
		FGameplayTagContainer Tags_PreventApplyingLandingLowFriction; // 0x2070(0x20)
		FScalableFloat Row_MaxAngleForLowFrictionLanding; // 0x2090(0x28)
		FScalableFloat Row_ImpactAngleForMinLowFrictionDuration; // 0x20B8(0x28)
		FScalableFloat Row_ImpactAngleForMaxLowFrictionDuration; // 0x20E0(0x28)
		FScalableFloat Row_LowFrictionMultFromImpactAngle_Min; // 0x2108(0x28)
		FScalableFloat Row_LowFrictionMultFromImpactAngle_Max; // 0x2130(0x28)
		FScalableFloat Row_SpeedForMinLowFrictionMult; // 0x2158(0x28)
		FScalableFloat Row_LowFrictionMultFromSpeed_Min; // 0x2180(0x28)
		FScalableFloat Row_LowFrictionMultFromSpeed_Max; // 0x21A8(0x28)
		FScalableFloat Row_LowFrictionDuration_Scalar; // 0x21D0(0x28)
		FScalableFloat Row_LowFrictionDuration_Min; // 0x21F8(0x28)
		FScalableFloat Row_LowFrictionDuration_Max; // 0x2220(0x28)
		double SurfaceImpactDOTProduct; // 0x2248(0x8)
		double SpeedAlongSurface; // 0x2250(0x8)
		FScalableFloat Row_SpeedForMaxLowFrictionMult; // 0x2258(0x28)
		double SurfaceImpactAngle; // 0x2280(0x8)
		FScalableFloat Row_MinAngleToPreventCrash; // 0x2288(0x28)
		FScalableFloat Row_CrashImpact_IgnoreWaterDuration; // 0x22B0(0x28)
		FGameplayTag Tag_RequiredToContinueFlying; // 0x22D8(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x22DC(0x4) UNKNOWN PROPERTY
		UAbilityAsync_WaitGameplayTagRemoved* Task_WaitRemoveTagRequiredToContinueFlying; // 0x22E0(0x8)
		FScalableFloat Row_StartFlying_DisplayUnableText; // 0x22E8(0x28)
		FGameplayTagContainer Tags_ToAllowUnableText; // 0x2310(0x20)
		APlayerController* CachedPlayerController; // 0x2330(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/FlyingExtLogic.FlyingExtLogic_C");
			return ret;
		}

		void BlueprintUpdateForMovement(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, float DeltaTime, FVector& InVelocity, FVector& InAcceleration, FVector& OutNewVelocity, FVector& OutNewAcceleration); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InputConditionChanged(bool InventoryActive); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ToggleInputMappingContext(bool Enable); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CanContinueFlyingStatus(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, EWingedFlyingStatus StatusToContinue, float ElapsedDuration, bool& bOutCanContinue, FGameplayTag& OutFailureTag); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CanStartFlyingStatus(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, EWingedFlyingStatus StatusToStart, bool& bOutCanStart, FGameplayTag& OutFailureTag); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool CanEndFlyingStatus(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, EWingedFlyingStatus StatusToEnd, float ElapsedDuration); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateForRotation(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, float DeltaTime, FRotator& OutNewMoveOrientation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateForHitResponse(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, float DeltaTime, FVector& InVelocity, FVector& OldPosition, FVector& Adjustment, FHitResult& Hit, EFortMovementModeExt_PhysUpdateResult& OutHitResult, bool& bOutWantToSlide); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool CanBeginFlying(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Removed_1BD51F3C4A0DC3BA09425EBBF4FA3899(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetMoveInputValues(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleFlyingStatusChanged(UFortMovementMode_WingedFlyingRuntimeData* MoveStatus, EWingedFlyingStatus NewStatus, bool bIsActive, FGameplayTag& FailureTag); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnExtensionDeactivate(FMMERuntimeContext& RuntimeContext); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnExtensionActivate(FMMERuntimeContext& RuntimeContext); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleFlyingStatusActivationFailed(EWingedFlyingStatus FailedStatus, FGameplayTag& FailureTag); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Bind Input Actions(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BoostAction_Started(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BoostAction_Ended(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AscendAction_Started(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AscendAction_Ended(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CrashAction_Triggered(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RollLeftAction_Triggered(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RollRightAction_Triggered(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Unbind Input Actions(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FlyingExtLogic(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_AnimBP.SunRose_Wings_AnimBP_C
	// Inherited from USunRoseFlying_WingsAnimInstance -> UFortItemLayerAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x34C0 (0x3C60 - 0x7A0)
	class USunRose_Wings_AnimBP_C : public USunRoseFlying_WingsAnimInstance	
	{
	public:
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x7A0(0x30)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x7D0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x7D8(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x7E0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x800(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x828(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x850(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x878(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8A0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x918(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x940(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x968(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x990(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9B8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xAA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xAD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xAF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB70(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB98(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xBC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xBE8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD00(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD50(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xD78(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xDA0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xDC8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xDF0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xE18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xE40(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xE68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xE90(0x28)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xEB8(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xF28(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF48(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xF90(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xFB0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xFF8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1018(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1060(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1080(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x10C8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10E8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1130(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1150(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1198(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x11B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1200(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1220(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1268(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1288(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x12D0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x12F0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1338(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1358(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x13A0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x13C0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1408(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1428(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1470(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1490(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x14D8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x14F8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1540(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1560(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1588(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15D0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15F0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1638(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1658(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1720(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1740(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1768(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x17B0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x17D0(0xC8)
		unsigned char UnknownData00_6[0x8]; // 0x1898(0x8) UNKNOWN PROPERTY
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x18A0(0x530)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1DD0(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E18(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E40(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1E90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1EE0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F08(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F30(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F58(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1F80(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FA8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FD0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1FF8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2020(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2048(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2070(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2098(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2110(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2138(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2160(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2188(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x21B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x21D8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2200(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2248(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2268(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x22B0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x22D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2318(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2338(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2380(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23A0(0x48)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x23E8(0x120)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2508(0x20)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x2528(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2648(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2690(0x20)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x26B0(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x27D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2818(0x20)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x2838(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2958(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x29A0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x29C0(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2A08(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2A50(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2A98(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2AE0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2B08(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2B50(0x20)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2B70(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2BE0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2C00(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2CC8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2D10(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2D58(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2E20(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2E68(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2EB0(0x48)
		FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2EF8(0xC0)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2FB8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3000(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3048(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3110(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3158(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x31A0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x31C0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x31E8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3230(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3250(0xC8)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3318(0xC8)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x33E0(0x120)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3500(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x35C8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x35F0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3618(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3640(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3668(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x36B0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x36D0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3718(0x20)
		FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3738(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3748(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3768(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3830(0x70)
		FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x38A0(0xB8)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x3958(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x39A0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x39C0(0x20)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x39E0(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3A58(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3AA0(0x28)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3AC8(0x28)
		FAnimNode_Slot AnimGraphNode_Slot; // 0x3AF0(0x48)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3B38(0x128)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/SunRose_Wings_AnimBP.SunRose_Wings_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/Blueprints/B_Athena_SunRose_Wings.B_Athena_SunRose_Wings_C
	// Inherited from AFortWeaponWings -> AFortWeapon -> AActor -> UObject
	// Size: 0x111 (0x1839 - 0x1728)
	class AB_Athena_SunRose_Wings_C : public AFortWeaponWings	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1728(0x8)
		UMaterialInstanceDynamic* MaterialInstance; // 0x1730(0x8)
		FGameplayTag GC_Replenish; // 0x1738(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x173C(0x4) UNKNOWN PROPERTY
		UAbilityAsync_WaitGameplayTagRemoved* Task_WaitCooldownEnded; // 0x1740(0x8)
		FGameplayTag GC_Removal; // 0x1748(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x174C(0x4) UNKNOWN PROPERTY
		double PctEnergyRemaining; // 0x1750(0x8)
		FGameplayTagContainer Tags_LeapingOrFlying; // 0x1758(0x20)
		FMulticastInlineDelegate WingsRegenerating; // 0x1778(0x10)
		UAbilityAsync_WaitGameplayTagCountChanged* Task_WaitFlyingChanged; // 0x1788(0x8)
		UAbilityAsync_WaitGameplayTagCountChanged* Task_CrashingChanged; // 0x1790(0x8)
		UFlyingPawnComponent_C* FlyingPawnComponent; // 0x1798(0x8)
		FScalableFloat Row_PreCrashWindupDuration; // 0x17A0(0x28)
		FScalableFloat Row_CollisionEnabled; // 0x17C8(0x28)
		FGameplayTag Tag_PendingReplenishFX; // 0x17F0(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x17F4(0x4) UNKNOWN PROPERTY
		UAbilityAsync_WaitGameplayTagAdded* Task_HandlePendingReplenishFX; // 0x17F8(0x8)
		UAbilityAsync_WaitGameplayTagRemoved* Task_WaitLeapingEnded; // 0x1800(0x8)
		UAbilityAsync_WaitGameplayTagAdded* Task_WaitCooldownStarted; // 0x1808(0x8)
		FScalableFloat Row_DestroyNoEnergy; // 0x1810(0x28)
		bool bCachedDestroyNoEnergy; // 0x1838(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/Blueprints/B_Athena_SunRose_Wings.B_Athena_SunRose_Wings_C");
			return ret;
		}

		void BP_ModifyIncomingDamage(float Damage, FGameplayTagContainer& DamageTags, FHitResult& DamageHit, AController* EventInstigator, AActor* DamageCauser, float& OutNewDamage); // Flags: BlueprintAuthorityOnly|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Removed_8B6239C44EAD4F83140126A91E74613D(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Removed_A330E75C438B1E7C11B66B85321A58B2(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_0B3F5770480254B61FA88DAF4DDBD29B(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TagCountChanged_61C17615446B3CE0FF668EBA8438022F(int32_t TagCount); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TagCountChanged_E238930A4116A9AF7C2143ADBB0913E9(int32_t TagCount); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_B06E6FB6474D58FB2A3C0A92CC743111(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryReload(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckRemoveWeaponOnEmpty(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateLowEnergyAudio(bool EnergyIsFalling, double Energy); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleSecondaryFirePressed(AFortWeapon* Weapon); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAmmoCountChanged(); // Flags: BlueprintCosmetic|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__B_Athena_SunRose_Wings_WeaponMesh_K2Node_ComponentBoundEvent_0_OnAnimInitialized__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponDetached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponAttached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateAmmoCountFromCurrentMagazine(bool bForceUpdate); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePendingReplenishFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleLocalAmmoChanged(int32_t LocalCount, int32_t LocalRemaining); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_Athena_SunRose_Wings(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WingsRegenerating__DelegateSignature(bool bState); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_AutoPickup.GA_ScoutDrone_AutoPickup_C
	// Inherited from UFortGameplayAbility_ScoutDrone_TargetingBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x58 (0xBE0 - 0xB88)
	class UGA_ScoutDrone_AutoPickup_C : public UFortGameplayAbility_ScoutDrone_TargetingBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB88(0x8)
		FScalableFloat AutoCollectRebootCardHotfix; // 0xB90(0x28)
		FScalableFloat AutoCollectGoldBarsHotfix; // 0xBB8(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_AutoPickup.GA_ScoutDrone_AutoPickup_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnTargetsFound(FTargetingRequestHandle& TargetingHandle); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_AutoPickup(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/BP_ScoutDrone_TPCamera.BP_ScoutDrone_TPCamera_C
	// Inherited from UFortScoutDroneCameraMode -> UFort3PCameraMode -> UFortCameraMode -> UObject
	// Size: 0x0 (0x1F8 - 0x1F8)
	class UBP_ScoutDrone_TPCamera_C : public UFortScoutDroneCameraMode	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/BP_ScoutDrone_TPCamera.BP_ScoutDrone_TPCamera_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_Default3PCamera.GA_ScoutDrone_Default3PCamera_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x10 (0xB50 - 0xB40)
	class UGA_ScoutDrone_Default3PCamera_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		UClass* Camera_Mode_Class; // 0xB48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_Default3PCamera.GA_ScoutDrone_Default3PCamera_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_Default3PCamera(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_Dive.GA_ScoutDrone_Dive_C
	// Inherited from UFortGameplayAbility_ScoutDrone_Dive -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xC (0xCEC - 0xCE0)
	class UGA_ScoutDrone_Dive_C : public UFortGameplayAbility_ScoutDrone_Dive	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xCE0(0x8)
		FGameplayTag Looping_Diving_Gameplay_Cue_Tag; // 0xCE8(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_Dive.GA_ScoutDrone_Dive_C");
			return ret;
		}

		void BP_OnDroneStartedDiving(); // Flags: BlueprintAuthorityOnly|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDroneStoppedDiving(); // Flags: BlueprintAuthorityOnly|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_Dive(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_General.GE_ScoutDrone_General_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ScoutDrone_General_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_General.GE_ScoutDrone_General_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_MarkPotentialTargets.GA_ScoutDrone_MarkPotentialTargets_C
	// Inherited from UFortGameplayAbility_ScoutDrone_MarkPotentialTargets -> UFortGameplayAbility_ScoutDrone_TargetingBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xCC0 - 0xCB8)
	class UGA_ScoutDrone_MarkPotentialTargets_C : public UFortGameplayAbility_ScoutDrone_MarkPotentialTargets	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xCB8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_MarkPotentialTargets.GA_ScoutDrone_MarkPotentialTargets_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_MarkPotentialTargets(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_Tethering.GA_ScoutDrone_Tethering_C
	// Inherited from UFortGameplayAbility_ScoutDrone_Tether -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xBC0 - 0xBB8)
	class UGA_ScoutDrone_Tethering_C : public UFortGameplayAbility_ScoutDrone_Tether	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xBB8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_Tethering.GA_ScoutDrone_Tethering_C");
			return ret;
		}

		void OnEnterWarningRange(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitWarningRange(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnterSignalLossRange(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_Tethering(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_AttachedPawn.GE_ScoutDrone_AttachedPawn_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ScoutDrone_AttachedPawn_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_AttachedPawn.GE_ScoutDrone_AttachedPawn_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_EnergyDepletion.GE_ScoutDrone_EnergyDepletion_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ScoutDrone_EnergyDepletion_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_EnergyDepletion.GE_ScoutDrone_EnergyDepletion_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_PickUp.GA_ScoutDrone_PickUp_C
	// Inherited from UFortGameplayAbility_ScoutDrone_PickUp -> UFortGameplayAbility_ScoutDrone_TargetingBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xC08 - 0xC00)
	class UGA_ScoutDrone_PickUp_C : public UFortGameplayAbility_ScoutDrone_PickUp	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xC00(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_PickUp.GA_ScoutDrone_PickUp_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_PickUp(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_DamageDroneOnBoostImpact.GE_ScoutDrone_DamageDroneOnBoostImpact_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ScoutDrone_DamageDroneOnBoostImpact_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_DamageDroneOnBoostImpact.GE_ScoutDrone_DamageDroneOnBoostImpact_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/BP_ScoutDrone_TPCamera_SpeedBoost.BP_ScoutDrone_TPCamera_SpeedBoost_C
	// Inherited from UFortScoutDroneCameraMode -> UFort3PCameraMode -> UFortCameraMode -> UObject
	// Size: 0x0 (0x1F8 - 0x1F8)
	class UBP_ScoutDrone_TPCamera_SpeedBoost_C : public UFortScoutDroneCameraMode	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/BP_ScoutDrone_TPCamera_SpeedBoost.BP_ScoutDrone_TPCamera_SpeedBoost_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_DamageOnBoost.GE_ScoutDrone_DamageOnBoost_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_ScoutDrone_DamageOnBoost_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GameplayEffects/GE_ScoutDrone_DamageOnBoost.GE_ScoutDrone_DamageOnBoost_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/Camera/ScoutDroneSpectateCameraMode.ScoutDroneSpectateCameraMode_C
	// Inherited from UFort3PCameraMode -> UFortCameraMode -> UObject
	// Size: 0x0 (0x1F0 - 0x1F0)
	class UScoutDroneSpectateCameraMode_C : public UFort3PCameraMode	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/Camera/ScoutDroneSpectateCameraMode.ScoutDroneSpectateCameraMode_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/ScoutDrone_CameraModifier_Idle_Drift.ScoutDrone_CameraModifier_Idle_Drift_C
	// Inherited from UCameraModifier -> UObject
	// Size: 0xB0 (0xF8 - 0x48)
	class UScoutDrone_CameraModifier_Idle_Drift_C : public UCameraModifier	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x48(0x8)
		double RightOffset; // 0x50(0x8)
		double HeightOffset; // 0x58(0x8)
		double ForwardOffset; // 0x60(0x8)
		double Interp_Speed; // 0x68(0x8)
		double CameraOffsetBlendInSeconds; // 0x70(0x8)
		double CameraOffsetAlpha; // 0x78(0x8)
		bool BlendIn; // 0x80(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x81(0x7) UNKNOWN PROPERTY
		double MinAdditionalFOV; // 0x88(0x8)
		double MaxAdditionalFOV; // 0x90(0x8)
		double CameraOffsetBlendOutSeconds; // 0x98(0x8)
		double FovOffsetAlpha; // 0xA0(0x8)
		double FovOffsetBlendOutSeconds; // 0xA8(0x8)
		double FovOffsetBlendInSeconds; // 0xB0(0x8)
		double TargetingAlpha; // 0xB8(0x8)
		double TargetingBlendInSeconds; // 0xC0(0x8)
		double TargetingBlendOutSeconds; // 0xC8(0x8)
		bool Offset_change; // 0xD0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xD1(0x3) UNKNOWN PROPERTY
		int32_t Offset_Corner_Int; // 0xD4(0x4)
		double Offset_Max; // 0xD8(0x8)
		double Offset_Min; // 0xE0(0x8)
		double Bass_Offset; // 0xE8(0x8)
		double Offset_Increment; // 0xF0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/ScoutDrone_CameraModifier_Idle_Drift.ScoutDrone_CameraModifier_Idle_Drift_C");
			return ret;
		}

		void BlueprintModifyCamera(float DeltaTime, FVector ViewLocation, FRotator ViewRotation, float FOV, FVector& NewViewLocation, FRotator& NewViewRotation, float& NewFOV); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlendOut(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ScoutDrone_CameraModifier_Idle_Drift(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/ScoutDrone_CameraModifier_Pickup.ScoutDrone_CameraModifier_Pickup_C
	// Inherited from UCameraModifier -> UObject
	// Size: 0x88 (0xD0 - 0x48)
	class UScoutDrone_CameraModifier_Pickup_C : public UCameraModifier	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x48(0x8)
		double RightOffset; // 0x50(0x8)
		double HeightOffset; // 0x58(0x8)
		double Interp_Speed; // 0x60(0x8)
		double CameraOffsetBlendInSeconds; // 0x68(0x8)
		double CameraOffsetAlpha; // 0x70(0x8)
		bool BlendIn; // 0x78(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x79(0x7) UNKNOWN PROPERTY
		double MinAdditionalFOV; // 0x80(0x8)
		double MaxAdditionalFOV; // 0x88(0x8)
		double CameraOffsetBlendOutSeconds; // 0x90(0x8)
		double FovOffsetAlpha; // 0x98(0x8)
		double FovOffsetBlendOutSeconds; // 0xA0(0x8)
		double FovOffsetBlendInSeconds; // 0xA8(0x8)
		double ForwardOffset; // 0xB0(0x8)
		double TargetingAlpha; // 0xB8(0x8)
		double TargetingBlendInSeconds; // 0xC0(0x8)
		double TargetingBlendOutSeconds; // 0xC8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/ScoutDrone_CameraModifier_Pickup.ScoutDrone_CameraModifier_Pickup_C");
			return ret;
		}

		void BlueprintModifyCamera(float DeltaTime, FVector ViewLocation, FRotator ViewRotation, float FOV, FVector& NewViewLocation, FRotator& NewViewRotation, float& NewFOV); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlendOut(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ScoutDrone_CameraModifier_Pickup(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_LongInteract.GA_ScoutDrone_LongInteract_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_ScoutDrone_LongInteract_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_LongInteract.GA_ScoutDrone_LongInteract_C");
			return ret;
		}

		void OnCancelled_C3D2D6004D52087C171FCF9C2255EBE6(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInterrupted_C3D2D6004D52087C171FCF9C2255EBE6(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendOut_C3D2D6004D52087C171FCF9C2255EBE6(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendedIn_C3D2D6004D52087C171FCF9C2255EBE6(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCompleted_C3D2D6004D52087C171FCF9C2255EBE6(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_LongInteract(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_ShortInteract.GA_ScoutDrone_ShortInteract_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xB48 - 0xB40)
	class UGA_ScoutDrone_ShortInteract_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_ShortInteract.GA_ScoutDrone_ShortInteract_C");
			return ret;
		}

		void OnCancelled_C79629454968FD9D1B8976938D945297(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInterrupted_C79629454968FD9D1B8976938D945297(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendOut_C79629454968FD9D1B8976938D945297(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendedIn_C79629454968FD9D1B8976938D945297(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCompleted_C79629454968FD9D1B8976938D945297(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_ShortInteract(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/BP_ScoutDroneController_Camera.BP_ScoutDroneController_Camera_C
	// Inherited from UAthena_PlayerCameraModeBase_C -> UFortCameraMode_ThirdPerson -> UFortCameraMode -> UObject
	// Size: 0x0 (0x1E30 - 0x1E30)
	class UBP_ScoutDroneController_Camera_C : public UAthena_PlayerCameraModeBase_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/BP_ScoutDroneController_Camera.BP_ScoutDroneController_Camera_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/BP_ScoutDroneController.BP_ScoutDroneController_C
	// Inherited from AFortWeapon -> AActor -> UObject
	// Size: 0x38 (0x1630 - 0x15F8)
	class ABP_ScoutDroneController_C : public AFortWeapon	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x15F8(0x8)
		UFXSystemComponent* GloveHoloVFXSystemComponent; // 0x1600(0x8)
		USkeletalMeshComponent* GloveSkeletalMeshRef; // 0x1608(0x8)
		UFXSystemAsset* GloveActivateDroneFX; // 0x1610(0x8)
		FName Attach_Point_Name; // 0x1618(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x161C(0x4) UNKNOWN PROPERTY
		UAudioComponent* EquipSoundComp; // 0x1620(0x8)
		USoundBase* EquipSound; // 0x1628(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/BP_ScoutDroneController.BP_ScoutDroneController_C");
			return ret;
		}

		void Set Drone HUDAction Keys(bool bHideDeploy); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponAttached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponDetached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartGloveHoloFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopGloveHoloFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnDroneActivateGloveFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnVehicle(AFortPlayerPawn* FortPlayerPawn, AActor* NewVehicle, AActor* OldVehicle); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_ScoutDroneController(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_SpeedBoost.GA_ScoutDrone_SpeedBoost_C
	// Inherited from UFortGameplayAbility_ScoutDrone_SpeedBoost -> UFortGameplayAbility_ScoutDrone_TargetingBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x180 (0xDF8 - 0xC78)
	class UGA_ScoutDrone_SpeedBoost_C : public UFortGameplayAbility_ScoutDrone_SpeedBoost	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xC78(0x8)
		FScalableFloat SpeedBoostDuration; // 0xC80(0x28)
		FScalableFloat SpeedBoostCooldown; // 0xCA8(0x28)
		FGameplayTag SpeedBoost_Gameplay_Cue_Tag; // 0xCD0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xCD4(0x4) UNKNOWN PROPERTY
		ABP_ScoutDrone_C* As_BP_Scout_Drone; // 0xCD8(0x8)
		FScalableFloat SpeedBoostMaxSpeedIncrease; // 0xCE0(0x28)
		FScalableFloat SpeedBoostForceBoost; // 0xD08(0x28)
		FScalableFloat SpeedBoostForceBoostVelocity; // 0xD30(0x28)
		ABP_ScoutDroneController_C* As_BP_Scout_Drone_Controller; // 0xD58(0x8)
		FGameplayTag Looping_Diving_Gameplay_Cue_Tag; // 0xD60(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xD64(0x4) UNKNOWN PROPERTY
		UFortScoutDroneMovementComponent* FortScoutDroneMovementComponent; // 0xD68(0x8)
		FGameplayTag Gameplay_Cue_Tag_Boost_Impact_Default; // 0xD70(0x4)
		FGameplayTag Gameplay_Cue_Tag_Boost_Impact_Wood; // 0xD74(0x4)
		FGameplayTag Gameplay_Cue_Tag_Boost_Impact_Stone; // 0xD78(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xD7C(0x4) UNKNOWN PROPERTY
		ABuildingActor* As_Building_Actor; // 0xD80(0x8)
		UClass* Damage_Drone_on_Impact_GE_Class; // 0xD88(0x8)
		bool FirstTimeThroughBoostedIntoActor; // 0xD90(0x1)
		bool SetDeltaTime; // 0xD91(0x1)
		unsigned char UnknownData03_6[0x6]; // 0xD92(0x6) UNKNOWN PROPERTY
		double ServerTimeForAnimDelta; // 0xD98(0x8)
		FScalableFloat DamageOnceOnBoost; // 0xDA0(0x28)
		double TimePassedForAnimMontage; // 0xDC8(0x8)
		FGameplayTag Gameplay_Cue_Tag_Boost_Impact_Metal; // 0xDD0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xDD4(0x4) UNKNOWN PROPERTY
		FGameplayTagContainer PreventBoostFX_TagContainer; // 0xDD8(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_SpeedBoost.GA_ScoutDrone_SpeedBoost_C");
			return ret;
		}

		void PlayGameplayCueBasedonMaterialHit(TEnumAsByte<EPhysicalSurface> Selection, FGameplayCueParameters InputPin); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetFlySpeedCameraAndStopTargeting(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ContinualDamageOnBoost(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DoSpeedBoost(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EndSpeedBoost(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDoorBashed(FHitResult& HitResult, UFortBuildingWallDoorComponent* BashedDoor); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBoostedIntoActor(FHitResult& HitResult); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_SpeedBoost(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/BP_ScoutDrone.BP_ScoutDrone_C
	// Inherited from AFortScoutDrone -> ACharacter -> APawn -> AActor -> UObject
	// Size: 0x2C8 (0xA98 - 0x7D0)
	class ABP_ScoutDrone_C : public AFortScoutDrone	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x7D0(0x8)
		UFortMiniMapComponent* FortMiniMapComponent; // 0x7D8(0x8)
		UNiagaraComponent* NS_ScoutDrone_Destroyed; // 0x7E0(0x8)
		UFortSoundIndicatorComponent* FortSoundIndicator; // 0x7E8(0x8)
		UNiagaraComponent* NS_ScoutDrone_Damage; // 0x7F0(0x8)
		UBP_DronePickUpIndicator_C* DronePickUpIndicator; // 0x7F8(0x8)
		USceneComponent* ItemSlot; // 0x800(0x8)
		UNiagaraComponent* NS_ScoutDrone_Idle; // 0x808(0x8)
		UAudioComponent* Sound_Flying_Loop; // 0x810(0x8)
		USoundLibraryComponent* SoundLibrary_Component; // 0x818(0x8)
		UBP_FortScoutDronePickupManagerComponent_C* PickupManagerComponent; // 0x820(0x8)
		AFortPlayerPawn* OwningPawn; // 0x828(0x8)
		AFortWeapon* WID_Controller; // 0x830(0x8)
		double AudioCawSpamTimer; // 0x838(0x8)
		bool bAllowAudioCaw; // 0x840(0x1)
		bool bIgnoreDiveSpeedChecks; // 0x841(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x842(0x6) UNKNOWN PROPERTY
		double IncrementDiveFlySpeed; // 0x848(0x8)
		double DiveTimeResetSpeedServerTime; // 0x850(0x8)
		double DiveTimeResetSpeedDeltaTime; // 0x858(0x8)
		bool bSetDiveTimeDeltaBaseTime; // 0x860(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x861(0x7) UNKNOWN PROPERTY
		double SpeedBoostTimeResetSpeedServerTime; // 0x868(0x8)
		FScalableFloat SpeedBoostDuration; // 0x870(0x28)
		bool bIgnoreSpeedBoostChecks; // 0x898(0x1)
		bool bCanUseSpeedBoost; // 0x899(0x1)
		bool bAllowImpactDamage; // 0x89A(0x1)
		bool bDebug; // 0x89B(0x1)
		unsigned char UnknownData02_6[0x4]; // 0x89C(0x4) UNKNOWN PROPERTY
		FScalableFloat DiveSpeedMaxIncrease; // 0x8A0(0x28)
		FScalableFloat BaseMaxFlySpeedHotfix; // 0x8C8(0x28)
		FVector PreviousVelocity; // 0x8F0(0x18)
		bool bThrustSoundCanPlay; // 0x908(0x1)
		bool bStartGCNL; // 0x909(0x1)
		unsigned char UnknownData03_6[0x2]; // 0x90A(0x2) UNKNOWN PROPERTY
		FGameplayTag Looping_Diving_Gameplay_Cue_Tag; // 0x90C(0x4)
		FScalableFloat RadiusMarkEnabled; // 0x910(0x28)
		FGameplayTagContainer SpeedBoostDisabledGameplayTag; // 0x938(0x20)
		FScalableFloat SpeedBoostEnabled; // 0x958(0x28)
		FScalableFloat PickUpEnabled; // 0x980(0x28)
		FGameplayTagContainer RadiusMarkDisabledGameplayTag; // 0x9A8(0x20)
		FGameplayTagContainer PickUpDisabledGameplayTag; // 0x9C8(0x20)
		FGameplayTag CameraDefaultTag; // 0x9E8(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x9EC(0x4) UNKNOWN PROPERTY
		double RotorWashForceStrength; // 0x9F0(0x8)
		FScalableFloat DiveTimeResetSpeedDeltaTime_HF; // 0x9F8(0x28)
		UClass* In_Camera_Modifier_Class; // 0xA20(0x8)
		UCameraModifier* CameraModRef; // 0xA28(0x8)
		FScalableFloat HFCameraMod; // 0xA30(0x28)
		double HealthPctMissingToShowDmgCrinkle; // 0xA58(0x8)
		double MaxCrinkleSeverity; // 0xA60(0x8)
		double SavedDamageValueForMID; // 0xA68(0x8)
		FGameplayTagContainer HideSelfIconTag; // 0xA70(0x20)
		AFN_WashForce_C* Physical_Wash_Force; // 0xA90(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/BP_ScoutDrone.BP_ScoutDrone_C");
			return ret;
		}

		bool IsValidAutoFireTarget(AActor* Attacker); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		TArray GetAffiliationsToShowFor(); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldShowSoundIndicator(AFortPlayerController* PlayerController); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SendDamageValueToMaterials(double ParameterValue); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetQuickbarVisibility(bool IsVisible); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckHotfixAbilitiesAndShowHUDKeyBindings(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMovementDefaultsHotfixable(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DebugPrintSpeed(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetPlayerPawnVariables_Internal(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChangeMaxSpeedWhenDIving(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DebugEvents(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DebugSpeedPrint(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_ScoutDrone(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_RadiusMark.GA_ScoutDrone_RadiusMark_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x22C (0xD6C - 0xB40)
	class UGA_ScoutDrone_RadiusMark_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FIndicatedActorData IndicatorSettings; // 0xB48(0xF8)
		FStenciledActorData Stenciled_Actor_Settings; // 0xC40(0x80)
		FGameplayTag RadiusMark_Gameplay_Cue_Tag; // 0xCC0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xCC4(0x4) UNKNOWN PROPERTY
		FScalableFloat MarkingDurationHotFix; // 0xCC8(0x28)
		FGameplayTag Flare_Gun_Reveal_Gameplay_Cue_Tag; // 0xCF0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xCF4(0x4) UNKNOWN PROPERTY
		FScalableFloat Radius_Mark_Radius_Hot_Fix; // 0xCF8(0x28)
		UAnimMontage* Anim_Montage; // 0xD20(0x8)
		FGameplayTag Event_Tag; // 0xD28(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xD2C(0x4) UNKNOWN PROPERTY
		TArray<FIndicatedActorDataWithFilter> ChestFilters; // 0xD30(0x10)
		FScalableFloat Radius_Mark_Mark_Chests; // 0xD40(0x28)
		FGameplayTag Marked_Enemy_Gameplay_Cue_Tag; // 0xD68(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_RadiusMark.GA_ScoutDrone_RadiusMark_C");
			return ret;
		}

		void GA_ScoutDrone_RadiusMark_Func(AActor* IndicatedActor); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Mark Chests(float duration); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SendMarkEvent(TArray<AActor*>& Array); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Quest Check Marked Enemy Player(TArray<AActor*>& TargetArray); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Cancelled_FF85E30646440D3ADA633C828BCD6277(FGameplayAbilityTargetDataHandle& TargetData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Targeted_FF85E30646440D3ADA633C828BCD6277(FGameplayAbilityTargetDataHandle& TargetData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PerformTargeting(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_RadiusMark(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /ScoutDrone/Items/Blueprints/GA_ScoutDrone_MarkTargets.GA_ScoutDrone_MarkTargets_C
	// Inherited from UFortGameplayAbility_ScoutDrone_PassiveMark -> UFortGameplayAbility_ScoutDrone_TargetingBase -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xC (0xD8C - 0xD80)
	class UGA_ScoutDrone_MarkTargets_C : public UFortGameplayAbility_ScoutDrone_PassiveMark	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xD80(0x8)
		FGameplayTag PassiveMarkCueTag; // 0xD88(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/GA_ScoutDrone_MarkTargets.GA_ScoutDrone_MarkTargets_C");
			return ret;
		}

		void Quest Check Marked Enemy Player(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnTargetStatusChanged(AActor* ActiveTarget); // Flags: BlueprintAuthorityOnly|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_ScoutDrone_MarkTargets(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_AtLimit.GE_Athena_Sentry_Turret_Deployable_AtLimit_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_AtLimit_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_AtLimit.GE_Athena_Sentry_Turret_Deployable_AtLimit_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Immunity_Gas.GE_Athena_Sentry_Turret_Deployable_Immunity_Gas_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_Immunity_Gas_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Immunity_Gas.GE_Athena_Sentry_Turret_Deployable_Immunity_Gas_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Immunity_InsectSwarm.GE_Athena_Sentry_Turret_Deployable_Immunity_InsectSwarm_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_Immunity_InsectSwarm_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Immunity_InsectSwarm.GE_Athena_Sentry_Turret_Deployable_Immunity_InsectSwarm_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Passive.GE_Athena_Sentry_Turret_Deployable_Passive_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_Passive_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Passive.GE_Athena_Sentry_Turret_Deployable_Passive_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/UI/BP_DeployableTurret_TurretMessageDataType.BP_DeployableTurret_TurretMessageDataType_C
	// Inherited from UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x54 (0x84 - 0x30)
	class UBP_DeployableTurret_TurretMessageDataType_C : public UPrimaryDataAsset	
	{
	public:
		TEnumAsByte<E_TurretMessageStyle> DisplayStyle; // 0x30(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x31(0x7) UNKNOWN PROPERTY
		FText Headline; // 0x38(0x10)
		FText Detail; // 0x48(0x10)
		double duration; // 0x58(0x8)
		FGameplayTagContainer MessageIdentifier; // 0x60(0x20)
		int32_t Priority; // 0x80(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/UI/BP_DeployableTurret_TurretMessageDataType.BP_DeployableTurret_TurretMessageDataType_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Immunity_Fire.GE_Athena_Sentry_Turret_Deployable_Immunity_Fire_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_Immunity_Fire_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Immunity_Fire.GE_Athena_Sentry_Turret_Deployable_Immunity_Fire_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Damage.GE_Athena_Sentry_Turret_Deployable_Damage_C
	// Inherited from UGET_DirectBallisticDamage_C -> UGET_DirectPhysicalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_Damage_C : public UGET_DirectBallisticDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Damage.GE_Athena_Sentry_Turret_Deployable_Damage_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/DeployableTurretFunctionLibrary.DeployableTurretFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDeployableTurretFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/DeployableTurretFunctionLibrary.DeployableTurretFunctionLibrary_C");
			return ret;
		}

		void GetAimLocationForTargetActor(AActor* TargetActor, UObject* __WorldContext, FVector& AimLocation); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TurretHasLineOfSightToActor(AActor* TargetActor, AActor* Turret, UObject* __WorldContext, bool& HasLineOfSight); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsAtPersonalTurretLimit(AFortPlayerPawn* PlayerPawn, UObject* __WorldContext, bool& AtLimit); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckTurretsInArea(FVector Location, UObject* __WorldContext, int32_t& NumTurrets); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsValidForTurretPlacement(FHitResult SurfaceHit, AFortPlayerPawn* PersonalLimitPawn, UObject* __WorldContext, bool& IsValid, TEnumAsByte<E_TurretDeployTestOutcome>& Reason); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/BGA_Athena_Sentry_Turret_Deployable_V2.BGA_Athena_Sentry_Turret_Deployable_V2_C
	// Inherited from ABGA_LinkedActorWithGravity_Parent_C -> ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0xAF9 (0x14B1 - 0x9B8)
	class ABGA_Athena_Sentry_Turret_Deployable_V2_C : public ABGA_LinkedActorWithGravity_Parent_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x9B8(0x8)
		UStaticMeshComponent* ScannerRays; // 0x9C0(0x8)
		UNiagaraComponent* NS_DT_BeaconLight; // 0x9C8(0x8)
		UBP_DeployableTurret_AlliedWidgetComponent_C* BP_DeployableTurret_AlliedWidgetComponent; // 0x9D0(0x8)
		USkeletalMeshComponentBudgeted* SkeletalMesh; // 0x9D8(0x8)
		UBoxComponent* TargetingCollision; // 0x9E0(0x8)
		UAudioComponent* ScanningLoopAudio; // 0x9E8(0x8)
		UFortMiniMapComponent* FortMiniMapComponent; // 0x9F0(0x8)
		UAudioComponent* RotationAudio; // 0x9F8(0x8)
		UBoxComponent* NavmeshCollision; // 0xA00(0x8)
		UFortNavModifierComponent* FortNavModifier; // 0xA08(0x8)
		USoundLibraryComponent* SoundLibrary; // 0xA10(0x8)
		USphereComponent* ScanningVolume; // 0xA18(0x8)
		UStaticMeshComponent* ScannerRays_V; // 0xA20(0x8)
		UFortActorComponent_Affiliation* FortActorComponent_Affiliation; // 0xA28(0x8)
		UAthenaAIPerceptionStimuliSourceComponent* AthenaAIPerceptionStimuliSource; // 0xA30(0x8)
		UNiagaraComponent* NS_DT_Laser_Endpoint; // 0xA38(0x8)
		float Timeline_ScannerRays_Active_Emissive_E47F66CF4FD1F06143510D8AE537A7DB; // 0xA40(0x4)
		float Timeline_ScannerRays_Active_Blades_E47F66CF4FD1F06143510D8AE537A7DB; // 0xA44(0x4)
		float Timeline_ScannerRays_Active_RayAngle_E47F66CF4FD1F06143510D8AE537A7DB; // 0xA48(0x4)
		float Timeline_ScannerRays_Active_RayLength_E47F66CF4FD1F06143510D8AE537A7DB; // 0xA4C(0x4)
		float Timeline_ScannerRays_Active_Animation_E47F66CF4FD1F06143510D8AE537A7DB; // 0xA50(0x4)
		TEnumAsByte<ETimelineDirection> Timeline_ScannerRays_Active__Direction_E47F66CF4FD1F06143510D8AE537A7DB; // 0xA54(0x1)
		unsigned char UnknownData00_6[0x3]; // 0xA55(0x3) UNKNOWN PROPERTY
		UTimelineComponent* Timeline_ScannerRays_Active; // 0xA58(0x8)
		float Timeline_ScannerRays_Targeting_EmissiveScale_0B3D36A24D80C38DCF916483BE0CDC8E; // 0xA60(0x4)
		float Timeline_ScannerRays_Targeting_Alpha_0B3D36A24D80C38DCF916483BE0CDC8E; // 0xA64(0x4)
		TEnumAsByte<ETimelineDirection> Timeline_ScannerRays_Targeting__Direction_0B3D36A24D80C38DCF916483BE0CDC8E; // 0xA68(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xA69(0x7) UNKNOWN PROPERTY
		UTimelineComponent* Timeline_ScannerRays_Targeting; // 0xA70(0x8)
		bool Debug; // 0xA78(0x1)
		EDeployableTurretState CurrentState; // 0xA79(0x1)
		EDeployableTurretState PreviousState; // 0xA7A(0x1)
		unsigned char UnknownData02_6[0x5]; // 0xA7B(0x5) UNKNOWN PROPERTY
		AActor* SentryOwner; // 0xA80(0x8)
		AActor* PreviousOwner; // 0xA88(0x8)
		TArray<AActor*> ActorsInScanRange; // 0xA90(0x10)
		FScalableFloat Row_ScanningRange; // 0xAA0(0x28)
		TArray<AActor*> PlayersInScanRange; // 0xAC8(0x10)
		TArray<AActor*> NonPlayersInScanRange; // 0xAD8(0x10)
		FGameplayTagContainer Tags_DeactivatedReasons; // 0xAE8(0x20)
		FScalableFloat Row_DeployTime; // 0xB08(0x28)
		AActor* TrackedActor; // 0xB30(0x8)
		bool HasBoundOwnerDied; // 0xB38(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xB39(0x3) UNKNOWN PROPERTY
		float TimeSinceLastTick; // 0xB3C(0x4)
		FRotator TargetAimRotation; // 0xB40(0x18)
		double ScanningRotationYawIncrement; // 0xB58(0x8)
		FScalableFloat Row_WindupTime; // 0xB60(0x28)
		FScalableFloat Row_WindDownTime; // 0xB88(0x28)
		FScalableFloat Row_YawSpeed_Scanning; // 0xBB0(0x28)
		FScalableFloat Row_PitchSpeed_Scanning; // 0xBD8(0x28)
		FScalableFloat Row_YawSpeed_Tracking; // 0xC00(0x28)
		FScalableFloat Row_PitchSpeed_Tracking; // 0xC28(0x28)
		FTimerHandle TimerHandle_Windup; // 0xC50(0x8)
		FTimerHandle TimerHandle_Deploy; // 0xC58(0x8)
		float ScannerRays_ConeAngle; // 0xC60(0x4)
		float ScannerRays_LaserEdgeWidthEnd; // 0xC64(0x4)
		float ScannerRays_LaserFalloff; // 0xC68(0x4)
		float ScannerRays_LaserEdgeWidthFront; // 0xC6C(0x4)
		FLinearColor ScannerRays_EdgeColor_Scanning; // 0xC70(0x10)
		FLinearColor ScannerRays_CenterColor_Scanning; // 0xC80(0x10)
		double ScannerRays_SecondaryRaysSpeed; // 0xC90(0x8)
		double ScannerRays_SecondaryRaysOpacity; // 0xC98(0x8)
		FLinearColor BeaconParticles_Color_Hostile; // 0xCA0(0x10)
		FLinearColor BeaconParticles_Color_Friendly; // 0xCB0(0x10)
		float BeaconParticle_LightOpacity; // 0xCC0(0x4)
		FLinearColor SeekingColor_Hostile; // 0xCC4(0x10)
		FLinearColor SeekingColor_Friendly; // 0xCD4(0x10)
		FLinearColor TrackingColor_Hostile; // 0xCE4(0x10)
		unsigned char UnknownData04_6[0x4]; // 0xCF4(0x4) UNKNOWN PROPERTY
		FVector ScannerRays_StartingScale; // 0xCF8(0x18)
		double ScannerRays_Laser_Falloff; // 0xD10(0x8)
		FVector ScannerRays_TargetingScale; // 0xD18(0x18)
		double ScannerRays_LaserEdgeWidthEnd_Targeting; // 0xD30(0x8)
		double ScannerRays_LaserEdgeWidthFront_Targeting; // 0xD38(0x8)
		double ScannerRays_LaserFalloff_Targeting; // 0xD40(0x8)
		FLinearColor ScannerRays_EdgeColor_Attacking; // 0xD48(0x10)
		FLinearColor ScannerRays_CenterColor_Attacking; // 0xD58(0x10)
		double ScannerRays_TargetingLaserDistanceMult; // 0xD68(0x8)
		double ScannerRays_ScaleUpdateInterval; // 0xD70(0x8)
		double ScannerRays_ScaleUpdateInterpSpeed; // 0xD78(0x8)
		double ScannerRays_LastScaleUpdateTime; // 0xD80(0x8)
		FGameplayTag GC_Windup; // 0xD88(0x4)
		unsigned char UnknownData05_6[0x4]; // 0xD8C(0x4) UNKNOWN PROPERTY
		USoundBase* Sound_Scanning_Start; // 0xD90(0x8)
		USoundBase* Sound_Scanning_Loop; // 0xD98(0x8)
		bool ScanningSoundsPlaying; // 0xDA0(0x1)
		bool TrackingSoundsPlaying; // 0xDA1(0x1)
		unsigned char UnknownData06_6[0x6]; // 0xDA2(0x6) UNKNOWN PROPERTY
		USoundBase* Sound_Tracking_Loop; // 0xDA8(0x8)
		UAudioComponent* Target; // 0xDB0(0x8)
		USoundBase* Sound_Tracking_Stop; // 0xDB8(0x8)
		USoundBase* Sound_WindDown; // 0xDC0(0x8)
		USoundBase* Sound_LaserFocus; // 0xDC8(0x8)
		USoundBase* Sound_LostTarget; // 0xDD0(0x8)
		USoundBase* Sound_Rotation_Start; // 0xDD8(0x8)
		USoundBase* Sound_Rotation_Stop; // 0xDE0(0x8)
		FGameplayTag EventTag_Scan_Start; // 0xDE8(0x4)
		FGameplayTag EventTag_Attack_Start; // 0xDEC(0x4)
		FGameplayTag EventTag_Deactivate; // 0xDF0(0x4)
		FGameplayTag GC_WindDown; // 0xDF4(0x4)
		FGameplayTag GC_Transform; // 0xDF8(0x4)
		unsigned char UnknownData07_6[0x4]; // 0xDFC(0x4) UNKNOWN PROPERTY
		double WindupSoundOffsetDuration; // 0xE00(0x8)
		FTimerHandle TimerHandle_PlayWindupGC; // 0xE08(0x8)
		FGameplayTag GC_Deactivate; // 0xE10(0x4)
		FGameplayTag GC_TargetAcquired; // 0xE14(0x4)
		FGameplayTag GC_TargetActorWarning; // 0xE18(0x4)
		FGameplayTag GC_Damaged; // 0xE1C(0x4)
		FGameplayTag GC_Death_NonCombat; // 0xE20(0x4)
		unsigned char UnknownData08_6[0x4]; // 0xE24(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_InteractTime_Primary; // 0xE28(0x28)
		FScalableFloat Row_TurretsInAreaCheck_MaxCount; // 0xE50(0x28)
		UFortWorldItemDefinition* ItemDefinitionToSpawn; // 0xE78(0x8)
		double ItemPickupTossZComponent; // 0xE80(0x8)
		FGameplayTag EventTag_UpdateActiveTurrets; // 0xE88(0x4)
		FGameplayTag Tag_EMPApplied; // 0xE8C(0x4)
		FGameplayTag EventTag_Activate_ActiveCount; // 0xE90(0x4)
		FGameplayTag EventTag_DeActivate_ActiveCount; // 0xE94(0x4)
		FScalableFloat Row_MaxLeashTime; // 0xE98(0x28)
		float CurrentLeashTimeRemaining; // 0xEC0(0x4)
		unsigned char UnknownData09_6[0x4]; // 0xEC4(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_LeashRange; // 0xEC8(0x28)
		double CheckLeashTimeInterval; // 0xEF0(0x8)
		FTimerHandle TimerHandle_CheckLeash; // 0xEF8(0x8)
		FGameplayTag Tag_TurretTracker; // 0xF00(0x4)
		FGameplayTag EventTag_AddOwnedTurret; // 0xF04(0x4)
		FGameplayTag EventTag_RemoveOwnedTurret; // 0xF08(0x4)
		unsigned char UnknownData10_6[0x4]; // 0xF0C(0x4) UNKNOWN PROPERTY
		UClass* GE_TurretTracker; // 0xF10(0x8)
		bool AimRotationFromTrackedTarget; // 0xF18(0x1)
		unsigned char UnknownData11_6[0x3]; // 0xF19(0x3) UNKNOWN PROPERTY
		FGameplayTag EventTag_Tracking_Start; // 0xF1C(0x4)
		FLinearColor ScannerRays_EdgeColor_Scanning_Hostile; // 0xF20(0x10)
		FLinearColor ScannerRays_CenterColor_Scanning_Hostile; // 0xF30(0x10)
		FLinearColor ScannerRays_EdgeColor_Scanning_Friendly; // 0xF40(0x10)
		FLinearColor ScannerRays_CenterColor_Scanning_Friendly; // 0xF50(0x10)
		FName Socket_AimRotationSource; // 0xF60(0x4)
		FName Socket_AimRotationRoot; // 0xF64(0x4)
		double AimRotationSourceYawOffset; // 0xF68(0x8)
		FRotator CurrentAimRotation; // 0xF70(0x18)
		FVector SurfaceNormal; // 0xF88(0x18)
		double SurfacePitchDegrees; // 0xFA0(0x8)
		double SurfaceRollDegrees; // 0xFA8(0x8)
		FTimerHandle TimerHandle_WindDown; // 0xFB0(0x8)
		bool IsLeashTimerActive; // 0xFB8(0x1)
		unsigned char UnknownData12_6[0x7]; // 0xFB9(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnLeashTimerActiveUpdated; // 0xFC0(0x10)
		FMarkerID MarkerID; // 0xFD0(0x8)
		bool TargetObstructed; // 0xFD8(0x1)
		unsigned char UnknownData13_6[0x7]; // 0xFD9(0x7) UNKNOWN PROPERTY
		FVector TrackedActorLastLocation; // 0xFE0(0x18)
		FScalableFloat Row_MaxRange; // 0xFF8(0x28)
		FLinearColor TrackingColor_Friendly; // 0x1020(0x10)
		FLinearColor ScannerRays_EdgeColor_Attacking_Hostile; // 0x1030(0x10)
		FLinearColor ScannerRays_CenterColor_Attacking_Hostile; // 0x1040(0x10)
		FLinearColor ScannerRays_EdgeColor_Attacking_Friendly; // 0x1050(0x10)
		FLinearColor ScannerRays_CenterColor_Attacking_Friendly; // 0x1060(0x10)
		FGameplayTagContainer Tags_Deactivated_OwnerDied; // 0x1070(0x20)
		FScalableFloat Row_DeactivateOnOwnerDied; // 0x1090(0x28)
		FScalableFloat Row_LifetimeAfterOwnerDied; // 0x10B8(0x28)
		FTimerHandle TimerHandle_PlayWindDownGC; // 0x10E0(0x8)
		FTimerHandle TimerHandle_LifetimeAfterOwnerDied; // 0x10E8(0x8)
		UFXSystemComponent* FX_BeaconLightFlash; // 0x10F0(0x8)
		double WindDownSoundOffsetDuration; // 0x10F8(0x8)
		bool MarkItem_IncludeSquad; // 0x1100(0x1)
		bool MarkItem_UseHoveredMarkerDetail; // 0x1101(0x1)
		unsigned char UnknownData14_6[0x2]; // 0x1102(0x2) UNKNOWN PROPERTY
		FLinearColor BeaconParticles_Attacking_Color; // 0x1104(0x10)
		FLinearColor BeaconParticles_Scaning_Color; // 0x1114(0x10)
		unsigned char UnknownData15_6[0x4]; // 0x1124(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_GravityScale; // 0x1128(0x28)
		FScalableFloat Row_MaxBounces; // 0x1150(0x28)
		FScalableFloat Row_ZVelocityOnLinkedActorDestroyed; // 0x1178(0x28)
		int32_t BounceCount; // 0x11A0(0x4)
		TEnumAsByte<E_TurretDeployTestOutcome> SimulationStoppedReason; // 0x11A4(0x1)
		unsigned char UnknownData16_6[0x3]; // 0x11A5(0x3) UNKNOWN PROPERTY
		FGameplayCueTag BounceGC; // 0x11A8(0x4)
		FGameplayCueTag HitGC; // 0x11AC(0x4)
		FGameplayCueTag HitWaterGC; // 0x11B0(0x4)
		int32_t RandomScanRotationIndex; // 0x11B4(0x4)
		float RandomScanRotationSelectionInterval; // 0x11B8(0x4)
		unsigned char UnknownData17_6[0x4]; // 0x11BC(0x4) UNKNOWN PROPERTY
		FTimerHandle TimerHandle_PickRandomScanRotationIndex; // 0x11C0(0x8)
		bool SuppressScanning; // 0x11C8(0x1)
		unsigned char UnknownData18_6[0x7]; // 0x11C9(0x7) UNKNOWN PROPERTY
		FScalableFloat Row_DelayResumeScanningOnReActivate; // 0x11D0(0x28)
		bool IsMovingToNewScanRotation; // 0x11F8(0x1)
		unsigned char UnknownData19_6[0x7]; // 0x11F9(0x7) UNKNOWN PROPERTY
		FScalableFloat Row_NewScanRotationSelectionInterval_Min; // 0x1200(0x28)
		FTimerHandle TimerHandle_MoveToNewScanRotation; // 0x1228(0x8)
		FRotator NextScanRotationTarget; // 0x1230(0x18)
		bool TrackingRotationPaused; // 0x1248(0x1)
		unsigned char UnknownData20_6[0x7]; // 0x1249(0x7) UNKNOWN PROPERTY
		FScalableFloat Row_NewScanRotationSelectionInterval_Max; // 0x1250(0x28)
		FScalableFloat Row_TrackingPauseDuration; // 0x1278(0x28)
		FTimerHandle TimerHandle_ResumeTrackingRotation; // 0x12A0(0x8)
		FScalableFloat Row_PitchSpeed_Attacking; // 0x12A8(0x28)
		FScalableFloat Row_YawSpeed_Attacking; // 0x12D0(0x28)
		FScalableFloat RowUseServerAnimOptimization; // 0x12F8(0x28)
		USoundBase* Sound_Scanning_Stop; // 0x1320(0x8)
		bool AnalyticsSubmitted; // 0x1328(0x1)
		unsigned char UnknownData21_6[0x7]; // 0x1329(0x7) UNKNOWN PROPERTY
		FUniqueNetIdRepl Analytics_OwnerId; // 0x1330(0x30)
		FVector Analytics_DeployLocation; // 0x1360(0x18)
		FVector Analytics_EndLocation; // 0x1378(0x18)
		double Analytics_DeployMatchTime; // 0x1390(0x8)
		double Analytics_EndMatchTime; // 0x1398(0x8)
		double Analytics_TotalDeactivatedTime; // 0x13A0(0x8)
		double Analytics_FirstShotFiredMatchTime; // 0x13A8(0x8)
		int32_t Analytics_NumShotsFired; // 0x13B0(0x4)
		int32_t Analytics_NumShotsMissed; // 0x13B4(0x4)
		int32_t Analytics_NumShotsHit; // 0x13B8(0x4)
		unsigned char UnknownData22_6[0x4]; // 0x13BC(0x4) UNKNOWN PROPERTY
		double Analytics_DamageTaken; // 0x13C0(0x8)
		TEnumAsByte<E_DeployableTurretEndReason> Analytics_EndReason; // 0x13C8(0x1)
		unsigned char UnknownData23_6[0x7]; // 0x13C9(0x7) UNKNOWN PROPERTY
		double EnterDeactivatedMatchTime; // 0x13D0(0x8)
		FGameplayTag GC_Death_SpawnPickup; // 0x13D8(0x4)
		unsigned char UnknownData24_6[0x4]; // 0x13DC(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_NewScanRotation_MaxLevelForRotationOptions; // 0x13E0(0x28)
		FScalableFloat Row_NewScanRotation_RotationOptions; // 0x1408(0x28)
		FScalableFloat Row_NewScanRotation_ChanceNegativeRotation; // 0x1430(0x28)
		FScalableFloat CanBeTargeted; // 0x1458(0x28)
		FGameplayTag TurretTargeting; // 0x1480(0x4)
		unsigned char UnknownData25_6[0x4]; // 0x1484(0x4) UNKNOWN PROPERTY
		FScalableFloat RowUseSkeletalMeshBudgeting; // 0x1488(0x28)
		bool CurrentlyUsingSkeletalMeshBudgeting; // 0x14B0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/BGA_Athena_Sentry_Turret_Deployable_V2.BGA_Athena_Sentry_Turret_Deployable_V2_C");
			return ret;
		}

		void UpdateUseSkeletalMeshBudgeting(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetTrackedActorLocationMaybeObstructed(FVector& Location); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Init Sentry Target Status(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_IsMovingToNewScanRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MaybeTrackDeactivatedTime(bool OnEndPlay); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetEndAnalyticsOnce(TEnumAsByte<E_DeployableTurretEndReason> EndReason); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetDeployAnalytics(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SubmitAnalytics(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldStopSimulationOnEnterWater(AWaterBody* WaterBody, bool& ShouldStop); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldStopSimulationOnHit(FHitResult HitResult, bool& ShouldStop); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TrySetTrackedActorFromDamageCauser(AActor* DamageCauser); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FName GetMarkerDetailsId(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMarkerActive(bool IsMarkerActive); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetMaxLeashTime(double& MaxLeashTime); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_SurfaceNormal(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSurfaceSlopeData(FVector InSurfaceNormal); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Get Current Aim Source Transform(FVector& CurrentAimSourceLocation, FRotator& CurrentAimSourceRotation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintGetInteractionTime(AFortPawn* InteractingPawn, float& OutInteractionTime, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText BlueprintGetInteractionString(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool BlueprintCanInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted, TEnumAsByte<TInteractionType> InteractionType); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NormalizeRotator(FRotator Rotator, FRotator& NormalizedRotator); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitVars(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScannerRays_Targeting__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScannerRays_Targeting__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScannerRays_Active__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScannerRays_Active__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline_ScannerRays_Active__SetRayHidden__EventFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Added_EBECB87749193A02ADC373BDE3F54711(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Removed_D3E8DC4341C71C0FCC852192F4F30E3F(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_7B1642FD4253E3CDEBC021B784912C75(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_B094A1CD4C0B324E096D5E82604DBF09(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetScannerRaysTargeting(bool IsTargeting); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTargetingLaserActive(bool bIsActive); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeScanningRaysParameters(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetScannerRaysActive(bool SetActive); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateLightColor(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayScanningSounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayTrackingSounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopLoopingSounds_ScanningAndTracking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayLaserFocusSound(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayWindDownSound(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayWindupGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayLostTargetSound(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopRotationSounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayRotationSounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayTransformGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayDeactivateGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopAllSoundsAndVFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopLoopingSounds_Rotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayTargetAcquiredGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateScannerRays(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayCollapsedGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateBeaconParticles(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayWindDownGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayTargetedActorWarningGC(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTargetingLaserScale(bool SetMeshScale, bool CalculateNow); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveTick(float DeltaSeconds); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitEventManager(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetEMPState(bool EMPApplied); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetNewOwner(AActor* NewOwner); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_SentryOwner(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetNewState(Server)(EDeployableTurretState NewState); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamageServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRep_CurrentState(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Deactivated(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Transforming(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Scanning(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Tracking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Attacking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FinishedTransforming(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BGA_Athena_Sentry_Turret_Deployable_V2_ScanningVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BGA_Athena_Sentry_Turret_Deployable_V2_ScanningVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSimulationResumed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSimulationStopped(FHitResult StoppedHit); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRotation_Scanning(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRotation_Tracking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRotation_Attacking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTrackedActor(AActor* NewTrackedActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WindUp(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WindupComplete(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAbilitySystemComponentInitialized_Event(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, AFortPawn* InstigatedBy, AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnPickupThenDie(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Deactivate_ActiveCount(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Activate_ActiveCount(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckLeash(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LeashExpired(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetLeashCheck(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintOnInteract(AFortPawn* InteractingPawn, TEnumAsByte<EInteractionBeingAttempted> InteractionBeingAttempted); // Flags: BlueprintAuthorityOnly|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PickUpTurret(AFortPawn* Pawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DieAfterSpawnPickup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryReactivate(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Collapsed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelWindup(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WindDown(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelTransform(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelInvalidTimers(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WindDownComplete(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelWindDown(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOwnerDied(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NonCombatDie(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Mark(AActor* ActorToBeMarked); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BroadcastTurretMessage(bool ShowMessage, UBP_DeployableTurret_TurretMessageDataType_C* MessageData); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SendTurretMessage(bool ShowMessage, UBP_DeployableTurret_TurretMessageDataType_C* MessageData); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NotifyIsLeashTimerActive(bool IsTimerActive); // Flags: Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelAllTimers(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelLeashCheck(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UnSuppressScanning(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateScanningTargetRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMoveToNewScanRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelMoveToNewScanRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResumeTrackingRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTrackingRotationPaused(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelResumeTrackingRotation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTargetObstructed(bool SetTargetIsObstructed); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Owner Team Changed(AFortPlayerState* PlayerState, char TeamID, char OldTeamId, bool bTeamChangedWithoutRespawn); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BGA_Athena_Sentry_Turret_Deployable_V2(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLeashTimerActiveUpdated__DelegateSignature(bool IsTimerActive); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GA_Athena_Sentry_Turret_Deployable_Passive.GA_Athena_Sentry_Turret_Deployable_Passive_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x4B0 (0xFF0 - 0xB40)
	class UGA_Athena_Sentry_Turret_Deployable_Passive_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		ABGA_Athena_Sentry_Turret_Deployable_V2_C* Turret; // 0xB48(0x8)
		FGameplayTagContainer Tags_ExcludeTargeting; // 0xB50(0x20)
		FFortTargetFilter TargetFilter; // 0xB70(0x40)
		FTimerHandle TimerHandle_Scan; // 0xBB0(0x8)
		FTimerHandle TimerHandle_TryFire; // 0xBB8(0x8)
		FScalableFloat Row_MaxRange; // 0xBC0(0x28)
		FScalableFloat Row_FireInterval; // 0xBE8(0x28)
		bool Debug; // 0xC10(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xC11(0x7) UNKNOWN PROPERTY
		AActor* HitActor; // 0xC18(0x8)
		FGameplayTag EventTag_Scan_Start; // 0xC20(0x4)
		FGameplayTag EventTag_Attack_Start; // 0xC24(0x4)
		FGameplayTag EventTag_Deactivate; // 0xC28(0x4)
		FGameplayTag GC_Fire; // 0xC2C(0x4)
		FGameplayEffectContextHandle HitEffectContext; // 0xC30(0x18)
		FGameplayTag EventTag_Tracking_Start; // 0xC48(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xC4C(0x4) UNKNOWN PROPERTY
		FTimerHandle TimerHandle_CheckTrackedTarget; // 0xC50(0x8)
		FScalableFloat Row_TurretTargetingConeAngle; // 0xC58(0x28)
		FScalableFloat Row_ScanningInterval; // 0xC80(0x28)
		FScalableFloat Row_CheckTrackedTargetInterval; // 0xCA8(0x28)
		FScalableFloat Row_MaxTrackingTime; // 0xCD0(0x28)
		FTimerHandle TimerHandle_StopTrackingTimedOut; // 0xCF8(0x8)
		FGameplayTag EventTag_Attack_Fired; // 0xD00(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xD04(0x4) UNKNOWN PROPERTY
		double CurrentHeat; // 0xD08(0x8)
		FScalableFloat Row_Heat_Max; // 0xD10(0x28)
		FScalableFloat Row_Heat_AddPerHit; // 0xD38(0x28)
		FScalableFloat Row_Heat_RemovePerMiss; // 0xD60(0x28)
		FScalableFloat Row_AimOffset_Pitch_Min; // 0xD88(0x28)
		FScalableFloat Row_AimOffset_Pitch_Max; // 0xDB0(0x28)
		FScalableFloat Row_AimOffset_Yaw_Min; // 0xDD8(0x28)
		FScalableFloat Row_AimOffset_Yaw_Max; // 0xE00(0x28)
		FHitResult HitResult; // 0xE28(0xF8)
		UClass* GE_ApplyOnHit; // 0xF20(0x8)
		FScalableFloat Row_FireDurationWithObstructedTarget; // 0xF28(0x28)
		FTimerHandle TimerHandle_StopFiringDueToObstructedTarget; // 0xF50(0x8)
		int32_t ConsecutiveMissCount; // 0xF58(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xF5C(0x4) UNKNOWN PROPERTY
		FScalableFloat Row_ConsecutiveMissesToLoseTarget; // 0xF60(0x28)
		FScalableFloat Row_CanTargetSentryActors; // 0xF88(0x28)
		FGameplayTag Tag_SentryActor; // 0xFB0(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xFB4(0x4) UNKNOWN PROPERTY
		APlayerPawn_Athena_C* HitPlayerPawnRef; // 0xFB8(0x8)
		UWeaponHitNotifyAudioBank* DefaultHitNotifyAudioBank; // 0xFC0(0x8)
		FScalableFloat Row_CanTargetDBNOCarried; // 0xFC8(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GA_Athena_Sentry_Turret_Deployable_Passive.GA_Athena_Sentry_Turret_Deployable_Passive_C");
			return ret;
		}

		void GetAimAdjustFromCurrentHeat(FRotator& AimAdjust); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsTurretFacingActor(bool& IsWithinTargetingAngle); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CanTargetActor(AActor* ActorToCheck, bool& CanTarget); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Sort Actors By Priority(TArray<AActor*>& ActorsToSort, TArray<AActor*>& SortedActors); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_2A2590E749A296EFADC7FFADC3DEF2DA(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_0879764742A65CB8B5F42AB5BFD681CF(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_740AFC2441FE1AD4D04EDC82C78CBADE(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_90D63DF04CC69D64B935C7B9D5A6E372(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SelectTarget(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TargetSelectionComplete(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TrySetTrackedActor(TArray<AActor*>& ActorsToCheck); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BeginTargetSelection(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BeginAttacking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TryFire(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopScanning(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopAttacking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Deactivate(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayFireGC(FHitResult HitResult); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BeginTracking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckTrackedTarget(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopTracking(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopTracking_TimedOut(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddHeat(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveHeat(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HitTrackedActor(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MissedTrackedActor(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopAttackingAndClearTrackedActor(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IncrementMissCount(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ResetMissCount(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Remove2DHitNotifySounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Add2DHitNotifySounds(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Sentry_Turret_Deployable_Passive(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GA_Athena_Sentry_Turret_Deployable_Tracker.GA_Athena_Sentry_Turret_Deployable_Tracker_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x118 (0xC58 - 0xB40)
	class UGA_Athena_Sentry_Turret_Deployable_Tracker_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		FScalableFloat Row_MaxActiveTurrets; // 0xB48(0x28)
		int32_t MaxActiveTurrets; // 0xB70(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xB74(0x4) UNKNOWN PROPERTY
		TMap<AActor*, double> OwnedTurretsOwnedTime; // 0xB78(0x50)
		FGameplayTag EventTag_AddOwnedTurret; // 0xBC8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xBCC(0x4) UNKNOWN PROPERTY
		UAbilityTask_WaitGameplayEvent* Task_WaitAddOwnedTurret; // 0xBD0(0x8)
		FGameplayTag EventTag_RemoveOwnedTurret; // 0xBD8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0xBDC(0x4) UNKNOWN PROPERTY
		UAbilityTask_WaitGameplayEvent* Task_WaitRemoveOwnedTurret; // 0xBE0(0x8)
		double OldestTurretTime; // 0xBE8(0x8)
		AActor* OldestTurret; // 0xBF0(0x8)
		FGameplayTag EventTag_DeActivate_ActiveCount; // 0xBF8(0x4)
		FGameplayTag EventTag_Activate_ActiveCount; // 0xBFC(0x4)
		FGameplayTag EventTag_UpdateActiveTurrets; // 0xC00(0x4)
		unsigned char UnknownData03_6[0x4]; // 0xC04(0x4) UNKNOWN PROPERTY
		UAbilityTask_WaitGameplayEvent* Task_WaitUpdateActiveTurrets; // 0xC08(0x8)
		FScalableFloat Row_LeashRange; // 0xC10(0x28)
		bool CanTryRemoveActiveTurret; // 0xC38(0x1)
		unsigned char UnknownData04_6[0x7]; // 0xC39(0x7) UNKNOWN PROPERTY
		TArray<AActor*> InvalidTurrets; // 0xC40(0x10)
		UClass* GE_AtPersonalLimit; // 0xC50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GA_Athena_Sentry_Turret_Deployable_Tracker.GA_Athena_Sentry_Turret_Deployable_Tracker_C");
			return ret;
		}

		void Actor Valid to Re Activate(AActor* ActorToCheck, bool& IsValidToReactivate); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_4C4A53524466E78E47010F8F0DC8E8DA(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EventReceived_2DE27CD542F8BBAF6C2596A4171D9106(FGameplayEventData Payload); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddOwnedTurret(AActor* Turret); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveOwnedTurret(AActor* Turret); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateActiveTurrets(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearInvalidTurrets(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_Sentry_Turret_Deployable_Tracker(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Tracker.GE_Athena_Sentry_Turret_Deployable_Tracker_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_Sentry_Turret_Deployable_Tracker_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/GE_Athena_Sentry_Turret_Deployable_Tracker.GE_Athena_Sentry_Turret_Deployable_Tracker_C");
			return ret;
		}
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Meshes/DeployableTurret_Gadget_Skeleton_AnimBP.DeployableTurret_Gadget_Skeleton_AnimBP_C
	// Inherited from UDeployableTurretAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1D64 (0x2164 - 0x400)
	class UDeployableTurret_Gadget_Skeleton_AnimBP_C : public UDeployableTurretAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x400(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x408(0x2)
		unsigned char UnknownData00_6[0x6]; // 0x40A(0x6) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x410(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x418(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x420(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x440(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x460(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x480(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x4F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x520(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x548(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x570(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x598(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x610(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x638(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x660(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x688(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6D8(0x28)
		FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x700(0x10)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x710(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x730(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x750(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x770(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x898(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8E0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x900(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x928(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x970(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x990(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x9D8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x9F8(0xC8)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xAC0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xAE0(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xB00(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xC28(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xC48(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xC68(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xC88(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xDB0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xDF8(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xE18(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xE38(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xE58(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF80(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xFC8(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xFE8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1008(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1028(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1150(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1198(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x11B8(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x11D8(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x11F8(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1320(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1368(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1388(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x13A8(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x13C8(0x128)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x14F0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15B8(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1600(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1648(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1690(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x16D8(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x17A0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x17E8(0x20)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1808(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1828(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1848(0x128)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1970(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x19B8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x19D8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1A20(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1A40(0xC8)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1B08(0x128)
		FAnimNode_DeadBlending AnimGraphNode_DeadBlending; // 0x1C30(0x530)
		bool IsAttached; // 0x2160(0x1)
		bool IsFirstScan; // 0x2161(0x1)
		bool IsExitFire; // 0x2162(0x1)
		bool IsDestroyed; // 0x2163(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Meshes/DeployableTurret_Gadget_Skeleton_AnimBP.DeployableTurret_Gadget_Skeleton_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStateExit_ScanState(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStateExit_FireState(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStateExit(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStateEntry(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_DeployableTurret_Gadget_Skeleton_AnimBP(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/UI/BP_DeployableTurret_AlliedWidgetComponent.BP_DeployableTurret_AlliedWidgetComponent_C
	// Inherited from UFortWidgetComponent -> UWidgetComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x10 (0x6C8 - 0x6B8)
	class UBP_DeployableTurret_AlliedWidgetComponent_C : public UFortWidgetComponent	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x6B8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x6C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/UI/BP_DeployableTurret_AlliedWidgetComponent.BP_DeployableTurret_AlliedWidgetComponent_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RefreshTeamAfflilation(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_DeployableTurret_AlliedWidgetComponent(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/UI/WBP_DeployableTurret_AlliedIndicator.WBP_DeployableTurret_AlliedIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x2C8 - 0x2B0)
	class UWBP_DeployableTurret_AlliedIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UImage* Image_AllyIndicator; // 0x2B8(0x8)
		ABGA_Athena_Sentry_Turret_Deployable_V2_C* TurretActor; // 0x2C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/UI/WBP_DeployableTurret_AlliedIndicator.WBP_DeployableTurret_AlliedIndicator_C");
			return ret;
		}

		void UpdateVisuals(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RefreshTeamAffliation(ABGA_Athena_Sentry_Turret_Deployable_V2_C* TurretActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_WBP_DeployableTurret_AlliedIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DeployableTurretGameplay/Items/DeployableTurret/Blueprints/Prj_Athena_Sentry_Turret_Deployable.Prj_Athena_Sentry_Turret_Deployable_C
	// Inherited from AB_Prj_Athena_BGASpawner_C -> AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x98 (0xCAC - 0xC14)
	class APrj_Athena_Sentry_Turret_Deployable_C : public AB_Prj_Athena_BGASpawner_C	
	{
	public:
		unsigned char UnknownData00_3[0x4]; // 0xC14(0x4) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0xC18(0x8)
		UStaticMeshComponent* StaticMesh; // 0xC20(0x8)
		USceneComponent* RotationAnchor; // 0xC28(0x8)
		double RotationRate; // 0xC30(0x8)
		FScalableFloat Row_MaxBounces; // 0xC38(0x28)
		int32_t BounceCount; // 0xC60(0x4)
		int32_t MaxBounces; // 0xC64(0x4)
		TEnumAsByte<E_TurretDeployTestOutcome> TrajectoryValidityReason; // 0xC68(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC69(0x7) UNKNOWN PROPERTY
		USoundBase* ThrowSound; // 0xC70(0x8)
		double WobbleCycleTime; // 0xC78(0x8)
		double MaxWobbleAngle; // 0xC80(0x8)
		FRotator InitialRotationAnchorRelativeRotation; // 0xC88(0x18)
		double WobbleDirection; // 0xCA0(0x8)
		float TickDeltaSeconds; // 0xCA8(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DeployableTurretGameplay/Items/DeployableTurret/Blueprints/Prj_Athena_Sentry_Turret_Deployable.Prj_Athena_Sentry_Turret_Deployable_C");
			return ret;
		}

		void IsHitValidForSpawn(UPrimitiveComponent* HitOtherComp, AActor* HitOther, FHitResult HitResult, bool& ValidSpawn, bool& RevertToPickup); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		AActor SpawnBGA_(FVector Normal, AActor* HitActor, UPrimitiveComponent* HitComp, FVector Pos, bool FromWater, FHitResult Hit); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeployFailedFeedback(TEnumAsByte<E_TurretDeployTestOutcome> FailedReason); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveTick(float DeltaSeconds); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RevertThrownObjectToPickup(FHitResult HitResult); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Prj_Athena_Sentry_Turret_Deployable(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/FX/BP_NS_CameraEffect_SunRose_Wings.BP_NS_CameraEffect_SunRose_Wings_C
	// Inherited from ABP_NS_ExampleCameraEffect_C -> ANiagaraLensEffectBase -> ANiagaraActor -> AActor -> UObject
	// Size: 0x0 (0x330 - 0x330)
	class ABP_NS_CameraEffect_SunRose_Wings_C : public ABP_NS_ExampleCameraEffect_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/FX/BP_NS_CameraEffect_SunRose_Wings.BP_NS_CameraEffect_SunRose_Wings_C");
			return ret;
		}
	};


	// Class /SunRoseFlyingGameplay/Items/Wings/FX/BP_NS_CameraEffect_SunRose_Wings_DustMost.BP_NS_CameraEffect_SunRose_Wings_DustMost_C
	// Inherited from ABP_NS_ExampleCameraEffect_C -> ANiagaraLensEffectBase -> ANiagaraActor -> AActor -> UObject
	// Size: 0x0 (0x330 - 0x330)
	class ABP_NS_CameraEffect_SunRose_Wings_DustMost_C : public ABP_NS_ExampleCameraEffect_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseFlyingGameplay/Items/Wings/FX/BP_NS_CameraEffect_SunRose_Wings_DustMost.BP_NS_CameraEffect_SunRose_Wings_DustMost_C");
			return ret;
		}
	};


	// Class /ScoutDrone/Items/Blueprints/BP_ScoutDrone_Camera_Lens_Speedlines.BP_ScoutDrone_Camera_Lens_Speedlines_C
	// Inherited from ABP_NS_ExampleCameraEffect_C -> ANiagaraLensEffectBase -> ANiagaraActor -> AActor -> UObject
	// Size: 0x0 (0x330 - 0x330)
	class ABP_ScoutDrone_Camera_Lens_Speedlines_C : public ABP_NS_ExampleCameraEffect_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/ScoutDrone/Items/Blueprints/BP_ScoutDrone_Camera_Lens_Speedlines.BP_ScoutDrone_Camera_Lens_Speedlines_C");
			return ret;
		}
	};


	// Class /DryBox/Items/FeyCrab/GE_FeyCrab_FallImmunityAndForceHolster.GE_FeyCrab_FallImmunityAndForceHolster_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_FeyCrab_FallImmunityAndForceHolster_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/GE_FeyCrab_FallImmunityAndForceHolster.GE_FeyCrab_FallImmunityAndForceHolster_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_RefuelGas_NyxGlass.GE_RefuelGas_NyxGlass_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_RefuelGas_NyxGlass_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_RefuelGas_NyxGlass.GE_RefuelGas_NyxGlass_C");
			return ret;
		}
	};


	// Class /DryBox/Items/FeyCrab/GE_FeyCrab_ImpactDamage.GE_FeyCrab_ImpactDamage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_FeyCrab_ImpactDamage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/GE_FeyCrab_ImpactDamage.GE_FeyCrab_ImpactDamage_C");
			return ret;
		}
	};


	// Class /DryBox/Items/FeyCrab/GE_Feycrab_LowGrav.GE_Feycrab_LowGrav_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Feycrab_LowGrav_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/GE_Feycrab_LowGrav.GE_Feycrab_LowGrav_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_NyxGlass_AttachDamage.GE_NyxGlass_AttachDamage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NyxGlass_AttachDamage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_NyxGlass_AttachDamage.GE_NyxGlass_AttachDamage_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_NyxGlass_AttackDamage.GE_NyxGlass_AttackDamage_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NyxGlass_AttackDamage_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_NyxGlass_AttackDamage.GE_NyxGlass_AttackDamage_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_UseGas_Attack_OverTime.GE_UseGas_Attack_OverTime_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UseGas_Attack_OverTime_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_UseGas_Attack_OverTime.GE_UseGas_Attack_OverTime_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_UseGas_Attack_Instant.GE_UseGas_Attack_Instant_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UseGas_Attack_Instant_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_UseGas_Attack_Instant.GE_UseGas_Attack_Instant_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_UseGas_Hover_OverTime.GE_UseGas_Hover_OverTime_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UseGas_Hover_OverTime_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_UseGas_Hover_OverTime.GE_UseGas_Hover_OverTime_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_NyxGlass_BlockAttackUntilReady.GE_NyxGlass_BlockAttackUntilReady_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NyxGlass_BlockAttackUntilReady_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_NyxGlass_BlockAttackUntilReady.GE_NyxGlass_BlockAttackUntilReady_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_UseGas_Swing_Instant.GE_UseGas_Swing_Instant_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UseGas_Swing_Instant_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_UseGas_Swing_Instant.GE_UseGas_Swing_Instant_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GE_UseGas_Swing_OverTime.GE_UseGas_Swing_OverTime_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_UseGas_Swing_OverTime_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_UseGas_Swing_OverTime.GE_UseGas_Swing_OverTime_C");
			return ret;
		}
	};


	// Class /DryBox/Items/FeyCrab/NEW_GE_FeyCrab_ExplosiveDamage.NEW_GE_FeyCrab_ExplosiveDamage_C
	// Inherited from UGE_Damage_Explosive_LineOfSight_C -> UGE_Ranged_GenericDamage_Explosive_C -> UGET_DirectPhysicalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UNEW_GE_FeyCrab_ExplosiveDamage_C : public UGE_Damage_Explosive_LineOfSight_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/NEW_GE_FeyCrab_ExplosiveDamage.NEW_GE_FeyCrab_ExplosiveDamage_C");
			return ret;
		}
	};


	// Class /DryBox/Items/FeyCrab/GA_FeyCrab_TillLandFallImmunityAndHolster.GA_FeyCrab_TillLandFallImmunityAndHolster_C
	// Inherited from UGA_Athena_TillLandFallDamageImmunity_NoFX_ApplyInAirOnly_C -> UGA_Athena_TillLandFallDamageImmunity_NoFX_Parent_C -> UGA_Athena_TillLandFallDamageImmunity_Parent_C -> UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x8 (0xBB8 - 0xBB0)
	class UGA_FeyCrab_TillLandFallImmunityAndHolster_C : public UGA_Athena_TillLandFallDamageImmunity_NoFX_ApplyInAirOnly_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xBB0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/GA_FeyCrab_TillLandFallImmunityAndHolster.GA_FeyCrab_TillLandFallImmunityAndHolster_C");
			return ret;
		}

		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_FeyCrab_TillLandFallImmunityAndHolster(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/FeyCrab/GE_FeyCrab_TillLandFallImmunityAndForceHolster.GE_FeyCrab_TillLandFallImmunityAndForceHolster_C
	// Inherited from UGE_Athena_TillLandFallDamageImmunity_NoFX_Grant_Parent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_FeyCrab_TillLandFallImmunityAndForceHolster_C : public UGE_Athena_TillLandFallDamageImmunity_NoFX_Grant_Parent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/GE_FeyCrab_TillLandFallImmunityAndForceHolster.GE_FeyCrab_TillLandFallImmunityAndForceHolster_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GA_NyxGlass_Refuel.GA_NyxGlass_Refuel_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0xF0 (0xC30 - 0xB40)
	class UGA_NyxGlass_Refuel_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		APlayerPawn_Athena_C* Player; // 0xB48(0x8)
		FScalableFloat SF_TimeBeforeRefuelingStarts; // 0xB50(0x28)
		FScalableFloat SF_RefuelingSpeedAtEmpty; // 0xB78(0x28)
		FScalableFloat SF_RefuelingSpeedAtFull; // 0xBA0(0x28)
		FGameplayTag Refueling_Gameplay_Tag; // 0xBC8(0x4)
		unsigned char UnknownData00_6[0x4]; // 0xBCC(0x4) UNKNOWN PROPERTY
		FScalableFloat SF_MaxLocalFuel; // 0xBD0(0x28)
		FEventMessageTag Cooldown_Update_Tag; // 0xBF8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xBFC(0x4) UNKNOWN PROPERTY
		FTimerHandle UpdateRefueling_TimerHandle; // 0xC00(0x8)
		FScalableFloat SF_UpdateRefuelingInterval; // 0xC08(0x28)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GA_NyxGlass_Refuel.GA_NyxGlass_Refuel_C");
			return ret;
		}

		void Update Cooldown UI(double Local Fuel Percent); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Tick Refueling Function(bool& ShouldContinueRefuelingNextTick); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsFuelFull(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyVariableRefuel(float Magnitude); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRefueling(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ScheduleUpdate(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_NyxGlass_Refuel(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/GE_RefuelingBlockFire_NyxGlass.GE_RefuelingBlockFire_NyxGlass_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_RefuelingBlockFire_NyxGlass_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_RefuelingBlockFire_NyxGlass.GE_RefuelingBlockFire_NyxGlass_C");
			return ret;
		}
	};


	// Class /SunRoseZeusGameplay/Items/Lightning/Targeting/TargetingFilterTask_ZeusLightningExplosionAOE.TargetingFilterTask_ZeusLightningExplosionAOE_C
	// Inherited from USimpleTargetingFilterTask -> UTargetingFilterTask_BasicFilterTemplate -> UTargetingTask -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTargetingFilterTask_ZeusLightningExplosionAOE_C : public USimpleTargetingFilterTask	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseZeusGameplay/Items/Lightning/Targeting/TargetingFilterTask_ZeusLightningExplosionAOE.TargetingFilterTask_ZeusLightningExplosionAOE_C");
			return ret;
		}

		bool BP_ShouldFilterTarget(FTargetingRequestHandle& TargetingHandle, FTargetingDefaultResultData& TargetData); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseZeusGameplay/Items/Lightning/Blueprints/GA_Athena_SunRose_Zeus_Lightning_Shock.GA_Athena_SunRose_Zeus_Lightning_Shock_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x10 (0xB50 - 0xB40)
	class UGA_Athena_SunRose_Zeus_Lightning_Shock_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		AFortPlayerPawn* PlayerPawn; // 0xB48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseZeusGameplay/Items/Lightning/Blueprints/GA_Athena_SunRose_Zeus_Lightning_Shock.GA_Athena_SunRose_Zeus_Lightning_Shock_C");
			return ret;
		}

		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDied(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_Athena_SunRose_Zeus_Lightning_Shock(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseZeusGameplay/Items/Lightning/Blueprints/GE_Athena_SunRose_Zeus_Lightning_Shock.GE_Athena_SunRose_Zeus_Lightning_Shock_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_SunRose_Zeus_Lightning_Shock_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseZeusGameplay/Items/Lightning/Blueprints/GE_Athena_SunRose_Zeus_Lightning_Shock.GE_Athena_SunRose_Zeus_Lightning_Shock_C");
			return ret;
		}
	};


	// Class /SunRoseZeusGameplay/Items/Lightning/Blueprints/GE_Athena_SunRose_Zeus_Lightning_Throw_Damage_ProjectileExplosion_Light.GE_Athena_SunRose_Zeus_Lightning_Throw_Damage_ProjectileExplosion_Light_C
	// Inherited from UGET_DirectLightningDamage_C -> UGET_DirectElementalDamage_C -> UGet_DirectDamageParent_C -> UGET_DamageParent_C -> UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_Athena_SunRose_Zeus_Lightning_Throw_Damage_ProjectileExplosion_Light_C : public UGET_DirectLightningDamage_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseZeusGameplay/Items/Lightning/Blueprints/GE_Athena_SunRose_Zeus_Lightning_Throw_Damage_ProjectileExplosion_Light.GE_Athena_SunRose_Zeus_Lightning_Throw_Damage_ProjectileExplosion_Light_C");
			return ret;
		}
	};


	// Class /DryBox/Items/NyxGlass/GA_NyxGlass_InSwingingMovementMode.GA_NyxGlass_InSwingingMovementMode_C
	// Inherited from UFortGameplayAbility -> UGameplayAbility -> UObject
	// Size: 0x20 (0xB60 - 0xB40)
	class UGA_NyxGlass_InSwingingMovementMode_C : public UFortGameplayAbility	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB40(0x8)
		UCameraModifier_GrappleParent_C* Mod; // 0xB48(0x8)
		AB_Weapon_GrappleParent_C* Weapon; // 0xB50(0x8)
		APlayerCameraManager* CameraManager; // 0xB58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GA_NyxGlass_InSwingingMovementMode.GA_NyxGlass_InSwingingMovementMode_C");
			return ret;
		}

		void K2_ActivateAbility(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnEndAbility(bool bWasCancelled); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GA_NyxGlass_InSwingingMovementMode(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/GE_NyxGlass_InSwingingMovementMode.GE_NyxGlass_InSwingingMovementMode_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_NyxGlass_InSwingingMovementMode_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/GE_NyxGlass_InSwingingMovementMode.GE_NyxGlass_InSwingingMovementMode_C");
			return ret;
		}
	};


	// Class /EMPGameplay/Items/EMPGrenade/Sound/Settings/EMPGrenade_WhipTracker.EMPGrenade_WhipTracker_C
	// Inherited from UBulletWhipTrackerComponent_Default_C -> UBulletWhipTrackerComponentBase -> UActorComponent -> UObject
	// Size: 0x0 (0xF8 - 0xF8)
	class UEMPGrenade_WhipTracker_C : public UBulletWhipTrackerComponent_Default_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EMPGameplay/Items/EMPGrenade/Sound/Settings/EMPGrenade_WhipTracker.EMPGrenade_WhipTracker_C");
			return ret;
		}
	};


	// Class /EMPGameplay/Items/EMPGrenade/Blueprints/Prj_Athena_Grenade_EMP.Prj_Athena_Grenade_EMP_C
	// Inherited from AB_Prj_Athena_Grenade_Base_C -> AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x32 (0xCE0 - 0xCAE)
	class APrj_Athena_Grenade_EMP_C : public AB_Prj_Athena_Grenade_Base_C	
	{
	public:
		unsigned char UnknownData00_3[0x2]; // 0xCAE(0x2) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0xCB0(0x8)
		USkeletalMeshComponent* Grenade_EMP_Explosive; // 0xCB8(0x8)
		UNiagaraComponent* NS_HandHeldFX; // 0xCC0(0x8)
		FRotator RotationRate; // 0xCC8(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EMPGameplay/Items/EMPGrenade/Blueprints/Prj_Athena_Grenade_EMP.Prj_Athena_Grenade_EMP_C");
			return ret;
		}

		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExploded(TArray<AActor*>& HitActors, TArray<FHitResult>& HitResults); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStoppedOnServer(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStop(FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveTick(float DeltaSeconds); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__Prj_Athena_Grenade_EMP_WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(AFortWaterBodyActor* WaterBody, UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Prj_Athena_Grenade_EMP(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /SunRoseZeusGameplay/Items/Lightning/Blueprints/Prj_Athena_SunRose_Zeus_Lightning_Light.Prj_Athena_SunRose_Zeus_Lightning_Light_C
	// Inherited from AFortProjectileSunRoseLightning -> AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0xB0 (0xEE8 - 0xE38)
	class APrj_Athena_SunRose_Zeus_Lightning_Light_C : public AFortProjectileSunRoseLightning	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xE38(0x8)
		UAudioComponent* Audio; // 0xE40(0x8)
		UNiagaraComponent* NS_Trail; // 0xE48(0x8)
		FVector AdjustedImpactLocation; // 0xE50(0x18)
		bool HasTriggeredExplosion; // 0xE68(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xE69(0x7) UNKNOWN PROPERTY
		FScalableFloat Row_ProjectileMaxDistance; // 0xE70(0x28)
		FScalableFloat Row_ProjectileSpeed; // 0xE98(0x28)
		float LifespanAfterExplosion; // 0xEC0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0xEC4(0x4) UNKNOWN PROPERTY
		double DecalDistanceOffset; // 0xEC8(0x8)
		UNiagaraSystem* DecalFX; // 0xED0(0x8)
		bool ShouldExplosionFXAttach; // 0xED8(0x1)
		unsigned char UnknownData02_6[0x7]; // 0xED9(0x7) UNKNOWN PROPERTY
		UPrimitiveComponent* ExplosionFXAttachTarget; // 0xEE0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/SunRoseZeusGameplay/Items/Lightning/Blueprints/Prj_Athena_SunRose_Zeus_Lightning_Light.Prj_Athena_SunRose_Zeus_Lightning_Light_C");
			return ret;
		}

		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CallDoExplosion(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExplosionFinished(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Prj_Athena_SunRose_Zeus_Lightning_Light(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_WEP_AnimBP.FeyCrab_Launcher_WEP_AnimBP_C
	// Inherited from UFortWeaponAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x9BC (0xE74 - 0x4B8)
	class UFeyCrab_Launcher_WEP_AnimBP_C : public UFortWeaponAnimInstance	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x4B8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x4C0(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x4C8(0x2)
		unsigned char UnknownData01_6[0x6]; // 0x4CA(0x6) UNKNOWN PROPERTY
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x4D0(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x4D8(0x8)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4E0(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x528(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x548(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x570(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x598(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x610(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x638(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x660(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x688(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6B0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6D8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x700(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x748(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x768(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7B0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7D0(0x28)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x7F8(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x838(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x858(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x898(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8B8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x900(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x920(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA10(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA38(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA60(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA88(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xAB0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xAD8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB00(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB28(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xB50(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xB78(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xBC0(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xBE0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xC28(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC48(0x28)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xC70(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xCB0(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xCD0(0x40)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD10(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD30(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD78(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xD98(0xC8)
		bool IsRightHand; // 0xE60(0x1)
		unsigned char UnknownData02_6[0x3]; // 0xE61(0x3) UNKNOWN PROPERTY
		int32_t Magazine_Ammo_Count; // 0xE64(0x4)
		bool IsWeaponFired; // 0xE68(0x1)
		bool IsLeftFire; // 0xE69(0x1)
		bool IsRightFire; // 0xE6A(0x1)
		bool IsReloading; // 0xE6B(0x1)
		bool IsLeftReloded; // 0xE6C(0x1)
		bool IsStopLeftFire; // 0xE6D(0x1)
		bool IsStopRightFire; // 0xE6E(0x1)
		bool IsEquipping; // 0xE6F(0x1)
		int32_t RemainingAmmo; // 0xE70(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_WEP_AnimBP.FeyCrab_Launcher_WEP_AnimBP_C");
			return ret;
		}

		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_AC5AD6554520EE1CF099A7AACF2E9970(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_ED48E5464F5A1EC00CF1CF8704C12800(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_36649F6B4789319F77AE1E9FE04D1EC9(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_1C10EA35407D613D8CDDECB9576162E2(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_F83DEE224FF490589C1A4C919F52DF7F(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_9248AC02476C9948B0BE5188A030CDFA(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_D4D1F7AC454558557D5AA6A1325A1B1E(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_9338F44F4CFDA70E8E60468C01E19E8F(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_A50756894D91C9317CC790A642FB47A8(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_5410D78A41315195350645B360092943(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_CFE431F643299DD079C409B4649338C2(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP_AnimGraphNode_TransitionResult_4F814F1946409D0E433539AED157AA95(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintInitializeAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FeyCrab_Launcher_WEP_AnimBP(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/FeyCrab/B_FeyCrab_Launcher.B_FeyCrab_Launcher_C
	// Inherited from AB_Ranged_Dual_Generic_Athena_C -> AFortWeaponRangedDual -> AFortWeaponRanged -> AFortWeapon -> AActor -> UObject
	// Size: 0x230 (0x2380 - 0x2150)
	class AB_FeyCrab_Launcher_C : public AB_Ranged_Dual_Generic_Athena_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2150(0x8)
		UNiagaraComponent* FX_Muzzle_LHS; // 0x2158(0x8)
		UNiagaraComponent* FX_Muzzle_RHS; // 0x2160(0x8)
		USkeletalMeshComponent* Weapon_Mesh_TEMP; // 0x2168(0x8)
		USkeletalMeshComponent* Weapon_Mesh_Offhand; // 0x2170(0x8)
		float GravityScalar_GravityRate_6DE2383A49A2C4085D7EDFA74D1C6DD6; // 0x2178(0x4)
		TEnumAsByte<ETimelineDirection> GravityScalar__Direction_6DE2383A49A2C4085D7EDFA74D1C6DD6; // 0x217C(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x217D(0x3) UNKNOWN PROPERTY
		UTimelineComponent* GravityScalar; // 0x2180(0x8)
		FName Offhand_Socket_Name; // 0x2188(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x218C(0x4) UNKNOWN PROPERTY
		AFortPlayerPawn* As_Fort_Player_Pawn; // 0x2190(0x8)
		APlayerCameraManager* CameraManager; // 0x2198(0x8)
		AB_Prj_Ranged_FeyCrab_C* As_B_Prj_Ranged_Fey_Crab; // 0x21A0(0x8)
		FRotator Spawn_Aim_Rotation; // 0x21A8(0x18)
		FVector SpawnLocation; // 0x21C0(0x18)
		FScalableFloat LaunchStrength; // 0x21D8(0x28)
		UAnimMontage* FireLeftGroundMontage; // 0x2200(0x8)
		UAnimMontage* Montage_to_Play; // 0x2208(0x8)
		UAnimMontage* FireRightGroundMontage; // 0x2210(0x8)
		int32_t MagazineAmmoCount; // 0x2218(0x4)
		bool HasFired; // 0x221C(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x221D(0x3) UNKNOWN PROPERTY
		FGameplayTag OnFireInAirKnockbackCueTag; // 0x2220(0x4)
		unsigned char UnknownData03_6[0x4]; // 0x2224(0x4) UNKNOWN PROPERTY
		UAnimMontage* FireRightInAirMontage; // 0x2228(0x8)
		UAnimMontage* FireLeftInAirMontage; // 0x2230(0x8)
		FGameplayTagContainer Play_Upper_Body_Only_Tags; // 0x2238(0x20)
		UAnimMontage* UpperBodyOnly_LeftFire; // 0x2258(0x8)
		UAnimMontage* UpperBodyOnly_RightFire; // 0x2260(0x8)
		FScalableFloat ProjectileInitialSpeed; // 0x2268(0x28)
		FScalableFloat InAirFireRecoilEnabled; // 0x2290(0x28)
		UNiagaraComponent* NS_WeaponGlow; // 0x22B8(0x8)
		bool IsRightHand; // 0x22C0(0x1)
		bool LeftHand; // 0x22C1(0x1)
		unsigned char UnknownData04_6[0x2]; // 0x22C2(0x2) UNKNOWN PROPERTY
		int32_t ProjectileInWorld; // 0x22C4(0x4)
		UClass* GE_FallImmunity; // 0x22C8(0x8)
		FScalableFloat LaunchStrengthIndoorMultiplier; // 0x22D0(0x28)
		FGameplayTag KnockbagTag; // 0x22F8(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x22FC(0x4) UNKNOWN PROPERTY
		FScalableFloat LaunchStrengthSwingingMultiplier; // 0x2300(0x28)
		FGameplayTag SwingingTag; // 0x2328(0x4)
		bool JumpFromGround; // 0x232C(0x1)
		unsigned char UnknownData06_6[0x3]; // 0x232D(0x3) UNKNOWN PROPERTY
		FScalableFloat InAirVelocityMulitiplier; // 0x2330(0x28)
		FGameplayTagContainer Failed_Reason; // 0x2358(0x20)
		USoundBase* CantDoThatSound; // 0x2378(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/B_FeyCrab_Launcher.B_FeyCrab_Launcher_C");
			return ret;
		}

		void PlayCannotDoSound(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InAirOrSwinging(bool& TRUE); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReloadCheck(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyLowGrav(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveWeaponFromInventory(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetFiringHand(int32_t AmmoCount); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void KnockbackCharacter(bool bInsideBuilding); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyLowEndOutlines(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Select Montage to Play(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVector CalculateSpawnLocation(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GravityScalar__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GravityScalar__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNotifyEnd_D59D3B8D448807CDBE825F98F087B6C4(FName NotifyName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNotifyBegin_D59D3B8D448807CDBE825F98F087B6C4(FName NotifyName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInterrupted_D59D3B8D448807CDBE825F98F087B6C4(FName NotifyName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBlendOut_D59D3B8D448807CDBE825F98F087B6C4(FName NotifyName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCompleted_D59D3B8D448807CDBE825F98F087B6C4(FName NotifyName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FeycrabLauncher_FireMuzzleFlashFX(bool IsRH); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FX_OnReload(bool bHasOneWeapon, bool bIsEmpty); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFired(UFortGameplayAbility* GA REf); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponAttached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponDetached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void K2_OnUnEquip(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPlayReloadFX(TEnumAsByte<EFortReloadFXState> ReloadStage); // Flags: BlueprintCosmetic|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFiredMulticast(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Muzzle Flash FX(bool Persistent Fire, bool Offhand); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApexGravityMulti(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveProjectileFromWorld(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddProjectileToWorld(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveWeapon(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReloadAmmo(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayFailedReason(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_FeyCrab_Launcher(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/BGA_WaistAttachment_NyxGlass.BGA_WaistAttachment_NyxGlass_C
	// Inherited from ABuildingGameplayActor -> ABuildingActor -> AActor -> UObject
	// Size: 0x109 (0xA91 - 0x988)
	class ABGA_WaistAttachment_NyxGlass_C : public ABuildingGameplayActor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x988(0x8)
		UStaticMeshComponent* RopeLeft; // 0x990(0x8)
		UStaticMeshComponent* RopeRight; // 0x998(0x8)
		USceneComponent* RopeLeftAnchorPoint; // 0x9A0(0x8)
		USceneComponent* RopeRightAnchorPoint; // 0x9A8(0x8)
		UNiagaraComponent* NS_GasParticles_NyxGlass; // 0x9B0(0x8)
		USceneComponent* DefaultSceneRoot; // 0x9B8(0x8)
		bool WhenAttached_LeftPointArrive; // 0x9C0(0x1)
		bool WhenAttached_RightPointArrive; // 0x9C1(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x9C2(0x6) UNKNOWN PROPERTY
		AFortPlayerPawn* ThePlayer; // 0x9C8(0x8)
		double RopeWidth; // 0x9D0(0x8)
		UCurveFloat* RopeDrawCurve; // 0x9D8(0x8)
		FTimerHandle Handle; // 0x9E0(0x8)
		UNiagaraComponent* NS_PushForwardFX; // 0x9E8(0x8)
		int32_t IsRandomSwing_; // 0x9F0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x9F4(0x4) UNKNOWN PROPERTY
		FVector CacheLeftEndPos; // 0x9F8(0x18)
		FVector CacheRightEndPos; // 0xA10(0x18)
		UNiagaraComponent* CurrentHoverParticle; // 0xA28(0x8)
		AFortPlayerPawn* PlayerFromWeaponBP; // 0xA30(0x8)
		bool FixShotFXIssue_L; // 0xA38(0x1)
		bool FixShotFXIssue_R; // 0xA39(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xA3A(0x6) UNKNOWN PROPERTY
		UNiagaraComponent* tmpPhysicsRope_R; // 0xA40(0x8)
		UNiagaraComponent* tmpPhysicsRope_L; // 0xA48(0x8)
		FVector REPLAY_CacheLeftEndPos; // 0xA50(0x18)
		FVector REPLAY_CacheRightEndPos; // 0xA68(0x18)
		AB_Weapon_NyxGlass_C* WeaponBP; // 0xA80(0x8)
		FTimerHandle HandleB; // 0xA88(0x8)
		bool CanPhysicsRopeSpawn; // 0xA90(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/BGA_WaistAttachment_NyxGlass.BGA_WaistAttachment_NyxGlass_C");
			return ret;
		}

		void RopeVisual_Destroy(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_DeactivePushForwardFX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_SpawnPushForwardFX(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_SpawnReleaseSmokeFX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_SpawnReleaseFX(FVector LeftEndPos, FVector RightEndPos); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_SpawnShotAirBreakFX(AB_Weapon_NyxGlass_C* WeaponBP); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_SpawnShotBurstFX(FRotator Rotation, bool bIsRight); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_SetARopeVisibility(bool bIsRight, bool bVisibility); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_UpdateARopeVisual(FVector AttachPoint, AB_Weapon_NyxGlass_C* WeaponBP, bool bIsRight, bool bIsAttacking); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_TickExecute(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_StageChecker(bool Arrive, bool bIsRight, FVector AttachPoint, bool bIsAttacking); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TickExecute_FXSpawn(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RopeVisual_RopeReleaseVisuals(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Turn On Rope Visuals(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void REPLAY_FixReleaseDelay(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TickExecute_ODMGearValidCheck(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BGA_WaistAttachment_NyxGlass(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/B_Weapon_NyxGlass.B_Weapon_NyxGlass_C
	// Inherited from AB_Weapon_GrappleParent_C -> AFortWeaponRangedDualSwing -> AFortWeaponRangedDual -> AFortWeaponRanged -> AFortWeapon -> AActor -> UObject
	// Size: 0xAC0 (0x32B8 - 0x27F8)
	class AB_Weapon_NyxGlass_C : public AB_Weapon_GrappleParent_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x27F8(0x8)
		UB_Component_NyxGlassWeaponSwinging_C* NyxGlass_Weapon_Swinging_BP_Comp; // 0x2800(0x8)
		UAudioComponent* DanglingLoop; // 0x2808(0x8)
		FTimerHandle ForgivenessTimer_BP; // 0x2810(0x8)
		FScalableFloat SF_TriggerCooldownOnUnequip; // 0x2818(0x28)
		FScalableFloat SF_WaitTimeBeforeCooldownTrigger; // 0x2840(0x28)
		TEnumAsByte<State_NyxGlass> State; // 0x2868(0x1)
		bool DisableFiring; // 0x2869(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x286A(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnStateChanged; // 0x2870(0x10)
		UAudioComponent* TimeoutAudioComponent; // 0x2880(0x8)
		USoundBase* SwingSound; // 0x2888(0x8)
		FMulticastInlineDelegate UpdateGraceUI; // 0x2890(0x10)
		FTimerHandle TimeoutTickAudioTimerHandle; // 0x28A0(0x8)
		FTimerHandle TimeoutAudioDelayTimerHandle; // 0x28A8(0x8)
		FScalableFloat SF_BeepMultiplier; // 0x28B0(0x28)
		int32_t TimeoutBeepNumber; // 0x28D8(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x28DC(0x4) UNKNOWN PROPERTY
		UAudioComponent* TimeoutLoopComponent; // 0x28E0(0x8)
		USoundBase* Timeout_StartWarning; // 0x28E8(0x8)
		USoundBase* Timeout_Start; // 0x28F0(0x8)
		USoundBase* Timeout_Loop; // 0x28F8(0x8)
		USoundBase* Timeout_Tick; // 0x2900(0x8)
		USoundBase* Timeout_Stop; // 0x2908(0x8)
		FScalableFloat SF_MaxLocalFuel; // 0x2910(0x28)
		TEnumAsByte<SubState_Slash_NyxGlass> SubState_Slashing; // 0x2938(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x2939(0x7) UNKNOWN PROPERTY
		FVector SlashingTarget; // 0x2940(0x18)
		double Slashing_Timer; // 0x2958(0x8)
		double Slashing_LastDistance; // 0x2960(0x8)
		UClass* GE_AttackDamage; // 0x2968(0x8)
		FVector SlashingVector; // 0x2970(0x18)
		bool AttackOnNextAttach; // 0x2988(0x1)
		bool AutoAttacking; // 0x2989(0x1)
		unsigned char UnknownData03_6[0x6]; // 0x298A(0x6) UNKNOWN PROPERTY
		FVector HoveringGoalLocation; // 0x2990(0x18)
		double StartedAttackingTime; // 0x29A8(0x8)
		double StartedHoveringTime; // 0x29B0(0x8)
		FMulticastInlineDelegate DoubleReticleUpdate; // 0x29B8(0x10)
		double LastFirePressedTime; // 0x29C8(0x8)
		bool UsingDirectRaycast; // 0x29D0(0x1)
		unsigned char UnknownData04_6[0x7]; // 0x29D1(0x7) UNKNOWN PROPERTY
		ABGA_WaistAttachment_NyxGlass_C* WaistGear; // 0x29D8(0x8)
		bool LaunchBackwardOnNextDetach; // 0x29E0(0x1)
		unsigned char UnknownData05_6[0x3]; // 0x29E1(0x3) UNKNOWN PROPERTY
		FGameplayTag Tag_PushForward; // 0x29E4(0x4)
		FGameplayTag GC_Swinging; // 0x29E8(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x29EC(0x4) UNKNOWN PROPERTY
		double LastSlingshotTime; // 0x29F0(0x8)
		bool UsingGas; // 0x29F8(0x1)
		unsigned char UnknownData07_6[0x7]; // 0x29F9(0x7) UNKNOWN PROPERTY
		FVector GoalGasVec; // 0x2A00(0x18)
		FVector CurrentGasVec; // 0x2A18(0x18)
		double CurrentMaxSpeedMultiplier; // 0x2A30(0x8)
		double GoalMaxSpeedMultiplier; // 0x2A38(0x8)
		double MaxSpeedChangeAlpha; // 0x2A40(0x8)
		UCurveFloat* InitialAccelerationCurve; // 0x2A48(0x8)
		FScalableFloat SF_AttackStartSlashDistance; // 0x2A50(0x28)
		FScalableFloat SF_AttackRadius; // 0x2A78(0x28)
		FScalableFloat SF_AttackStartSpeed; // 0x2AA0(0x28)
		FScalableFloat SF_AttackMaxSpeed; // 0x2AC8(0x28)
		FScalableFloat SF_AttackLeadInTime; // 0x2AF0(0x28)
		FScalableFloat SF_MinAttachTime; // 0x2B18(0x28)
		FScalableFloat SF_TimeToFullyAttachGrounded; // 0x2B40(0x28)
		FScalableFloat SF_TimeToFullyAttachSwinging; // 0x2B68(0x28)
		FText CurrentErrorMessage; // 0x2B90(0x10)
		double ErrorMessageSetTime; // 0x2BA0(0x8)
		double TimeSpentInCurrentSwingingSession; // 0x2BA8(0x8)
		FScalableFloat SF_SlashLeapBackSpeed; // 0x2BB0(0x28)
		FScalableFloat SF_SlashLeapBackHeightModifier; // 0x2BD8(0x28)
		FScalableFloat SF_SlashLeapBackTime; // 0x2C00(0x28)
		FScalableFloat SF_InitialAccelerationTime; // 0x2C28(0x28)
		double TimeStartedRefueling; // 0x2C50(0x8)
		bool Refueling; // 0x2C58(0x1)
		unsigned char UnknownData08_6[0x7]; // 0x2C59(0x7) UNKNOWN PROPERTY
		double LastFreeFallTime; // 0x2C60(0x8)
		bool ClientForgivenessTimerElapsed; // 0x2C68(0x1)
		unsigned char UnknownData09_6[0x7]; // 0x2C69(0x7) UNKNOWN PROPERTY
		FVector LeapBackDirection; // 0x2C70(0x18)
		bool ADSPressed; // 0x2C88(0x1)
		unsigned char UnknownData10_6[0x3]; // 0x2C89(0x3) UNKNOWN PROPERTY
		int32_t TimesAttackedSinceLanded; // 0x2C8C(0x4)
		double ShowKeepHoldingTipTimer; // 0x2C90(0x8)
		bool DisableFiringAfterSlash; // 0x2C98(0x1)
		unsigned char UnknownData11_6[0x7]; // 0x2C99(0x7) UNKNOWN PROPERTY
		double LastUnequippedTime; // 0x2CA0(0x8)
		FGameplayTag GC_Attacking; // 0x2CA8(0x4)
		FGameplayTag GC_AttackPlayer; // 0x2CAC(0x4)
		FGameplayTag GC_AttackHookImpact; // 0x2CB0(0x4)
		FGameplayTag GC_AttackSlash; // 0x2CB4(0x4)
		UClass* GE_AttachDamage; // 0x2CB8(0x8)
		bool bServerWaitingForTargetData; // 0x2CC0(0x1)
		bool bHasAttached; // 0x2CC1(0x1)
		unsigned char UnknownData12_6[0x6]; // 0x2CC2(0x6) UNKNOWN PROPERTY
		USoundBase* GasBoostSound; // 0x2CC8(0x8)
		double LastStoppedHoveringTime; // 0x2CD0(0x8)
		double LastStartedHoveringTime; // 0x2CD8(0x8)
		bool BlockSwingEndOnLand; // 0x2CE0(0x1)
		bool AlreadyDidSlashDamage; // 0x2CE1(0x1)
		bool ServerTriedToAttachWhileWaiting; // 0x2CE2(0x1)
		bool AttackingFromGround; // 0x2CE3(0x1)
		unsigned char UnknownData13_6[0x4]; // 0x2CE4(0x4) UNKNOWN PROPERTY
		FTimerHandle AttachTimerHandle; // 0x2CE8(0x8)
		double AttackDistance; // 0x2CF0(0x8)
		bool InSlowPartOfAttack; // 0x2CF8(0x1)
		bool bAttachTimerNotSetDueToInput; // 0x2CF9(0x1)
		unsigned char UnknownData14_6[0x6]; // 0x2CFA(0x6) UNKNOWN PROPERTY
		double AttachTime; // 0x2D00(0x8)
		FGuid CapeSwapId; // 0x2D08(0x10)
		bool ShouldShowAttackAgainPrompt; // 0x2D18(0x1)
		bool PlayerLearnedToAttackFromAir; // 0x2D19(0x1)
		unsigned char UnknownData15_6[0x6]; // 0x2D1A(0x6) UNKNOWN PROPERTY
		USoundBase* RefuelCompleteSound; // 0x2D20(0x8)
		bool IsBlockingChangingWeapons; // 0x2D28(0x1)
		unsigned char UnknownData16_6[0x7]; // 0x2D29(0x7) UNKNOWN PROPERTY
		FScalableFloat SF_AllowUsingThunderSpears; // 0x2D30(0x28)
		FScalableFloat SF_HoverAfterEquippingThunderSpears; // 0x2D58(0x28)
		FScalableFloat AttackEnabled; // 0x2D80(0x28)
		FScalableFloat ApplyFixToExitAttackWhenDetachedFromHittingWall; // 0x2DA8(0x28)
		FScalableFloat CancelSwingingMovementOnUnequip; // 0x2DD0(0x28)
		FScalableFloat CancelSwingingMovementOnUnequip_EvenIfThunderSpears; // 0x2DF8(0x28)
		FScalableFloat CancelSwingingMovementOnUnequip_WhenAttacking; // 0x2E20(0x28)
		FScalableFloat CancelSwingingMovementOnStuck_HitWall; // 0x2E48(0x28)
		FScalableFloat CancelSwingingMovementOnStuck_TooSlow; // 0x2E70(0x28)
		FScalableFloat CancelSwingingMovementOnStuck_MaxTime; // 0x2E98(0x28)
		double LastStartedAttackingTime; // 0x2EC0(0x8)
		double LastStartedSlashingTime; // 0x2EC8(0x8)
		FScalableFloat TimedFailSafe_Attack_Enabled; // 0x2ED0(0x28)
		FScalableFloat TimedFailSafe_Attack_MaxTime; // 0x2EF8(0x28)
		FScalableFloat TimedFailSafe_Slash_Enabled; // 0x2F20(0x28)
		FScalableFloat TimedFailSafe_Slash_MaxTime; // 0x2F48(0x28)
		FScalableFloat TimedFailSafe_SlashMoveTowardTarget_Enabled; // 0x2F70(0x28)
		FScalableFloat TimedFailSafe_SlashMoveTowardTarget_MaxTime; // 0x2F98(0x28)
		bool Cached_SF_TimedFailsafe_Attack_Enabled; // 0x2FC0(0x1)
		bool Cached_SF_TimedFailsafe_Slash_Enabled; // 0x2FC1(0x1)
		bool Cached_SF_TimedFailsafe_SlashMoveTowardTarget_Enabled; // 0x2FC2(0x1)
		unsigned char UnknownData17_6[0x5]; // 0x2FC3(0x5) UNKNOWN PROPERTY
		FScalableFloat SF_DetachmentUpForceMultiplier; // 0x2FC8(0x28)
		FScalableFloat SF_UseOriginalWebShootersDetachmentForce; // 0x2FF0(0x28)
		int32_t TimesAttackedBeforeLanded; // 0x3018(0x4)
		bool Consume_Fuel; // 0x301C(0x1)
		unsigned char UnknownData18_6[0x3]; // 0x301D(0x3) UNKNOWN PROPERTY
		FScalableFloat SF_AllowThunderSpearHoverEvenWhenAttackDisabled; // 0x3020(0x28)
		FScalableFloat SF_AttackEnabledOnMobile; // 0x3048(0x28)
		bool bIsTouchControls; // 0x3070(0x1)
		unsigned char UnknownData19_6[0x7]; // 0x3071(0x7) UNKNOWN PROPERTY
		FScalableFloat SF_FixMobileReplication; // 0x3078(0x28)
		FScalableFloat SF_FixMobileADSSynchronicity; // 0x30A0(0x28)
		FScalableFloat TimedFailSafe_Attack_EnabledOnClient; // 0x30C8(0x28)
		bool Cached_SF_TimedFailsafe_Attack_EnabledOnClient; // 0x30F0(0x1)
		unsigned char UnknownData20_6[0x7]; // 0x30F1(0x7) UNKNOWN PROPERTY
		FScalableFloat TimedFailSafe_Slash_EnabledOnClient; // 0x30F8(0x28)
		bool Cached_SF_TimedFailsafe_Slash_EnabledOnClient; // 0x3120(0x1)
		unsigned char UnknownData21_6[0x7]; // 0x3121(0x7) UNKNOWN PROPERTY
		FScalableFloat TimedFailSafe_SlashMoveTowardTarget_EnabledOnClient; // 0x3128(0x28)
		bool Cached_SF_TimedFailsafe_SlashMoveTowardTarget_EnabledOnClient; // 0x3150(0x1)
		unsigned char UnknownData22_6[0x7]; // 0x3151(0x7) UNKNOWN PROPERTY
		FScalableFloat TimedFailSafe_Attack_ClientTime; // 0x3158(0x28)
		FScalableFloat TimedFailSafe_Slash_ClientTimeBuffer; // 0x3180(0x28)
		FScalableFloat TimedFailSafe_SlashMovingTowardTarget_ClientTime; // 0x31A8(0x28)
		FScalableFloat ExitSwingingOnItemDropped; // 0x31D0(0x28)
		bool CachedFixedStoredAttackState; // 0x31F8(0x1)
		unsigned char UnknownData23_6[0x7]; // 0x31F9(0x7) UNKNOWN PROPERTY
		FScalableFloat SF_FixedStoredAttackState; // 0x3200(0x28)
		FScalableFloat SF_FixADSSpriteSwap; // 0x3228(0x28)
		FScalableFloat SF_UseADSOverhaul; // 0x3250(0x28)
		bool Cached_SF_UseADSOverhaul; // 0x3278(0x1)
		bool ForceADSForFeyCrabHover; // 0x3279(0x1)
		bool Cached_SF_AttackEnabled; // 0x327A(0x1)
		unsigned char UnknownData24_6[0x5]; // 0x327B(0x5) UNKNOWN PROPERTY
		FGameplayEffectContextHandle Context; // 0x3280(0x18)
		FGameplayTagContainer AttackDamageSourceTags; // 0x3298(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/B_Weapon_NyxGlass.B_Weapon_NyxGlass_C");
			return ret;
		}

		void Apply Damage GE(AActor* Target, UClass* DamageGE); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DelayBetweenRopeAttachAndMovement(bool& Any Delay, double& Delay); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Any Weapon Equip(AFortWeapon* NewWeapon, AFortWeapon* PrevWeapon); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupCachedScalableFloats(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On ADSExit(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set State Hovering(bool bUseFuel); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnADSEnter(bool bUseFuel); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRefueling(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HasLocalFuel(bool& Has Fuel); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayReplenishedAudio(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UnhideBuiltInCapes(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideBuiltInCapes(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNativizedVelocityCalculated(FNyxGlassVelocityMetadata VelocityData); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BroadcastCooldownMessage(double CooldownPercent); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetState_Attacking(TEnumAsByte<State_NyxGlass> New State); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Rope FX(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoveGearIfOutOfFuel(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopForgivenessTimer_Client(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetState_Off(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNativeForgivenessTimerCanceled(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnNativeForgivenessTimerEnded(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartForgivenessTimer(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldShowGotShotWarning(bool& Show, bool& Show Text); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CheckWhichSidePointsAreOn(FVector PointOne, FVector PointTwo, bool PointOneValid, bool PointTwoValid, FVector& Left Point, FVector& RightPoint, bool& LeftPointValid, bool& RightPointValid); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsAimingAttack(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetActorsFromHitArray(TArray<FHitResult>& Hits, TArray<AActor*>& Actors); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool Fuel Is Usable(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldBlockDetachment(bool& Result); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Initial Acceleration Alpha(double& Output); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldDetachIfTooSlow(bool& Result); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldUpdateTargeting(bool& UpdateTargeting); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FVector CalculateDetachmentForce(FVector VectorToAttachPoint, bool Launch_, FVector LaunchVector_); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsAttackingBool(bool& Attacking); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetTargetingResult(bool GettingFireTarget, FHitResult& TargetingHitResult); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShouldDisableFiring(bool& Result); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set State(TEnumAsByte<State_NyxGlass> New State); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitialJumpMultiplier(double& OutputPin); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Removed_18CEC77244D2783FAAD565BB92B2BAD4(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ForgivenessTimerStarted(); // Flags: Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ForgivenessTimerFinished(); // Flags: Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ForgivenessTimerCanceled(); // Flags: Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Server_OnTargetDataReceived(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RemoteClients_SetState(TEnumAsByte<State_NyxGlass> New State); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Server_OutOfFuel(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Multicast_OutOfFuel(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSwingingEnded(bool SkipRemovingSwingingGE); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCooldownApplied(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyCooldown(bool Force); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateReticleFromNative(bool HitSomething, bool BlockedUse, bool IsTargetAtAimLocation, FVector TargetPosition); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSpawnProjectile(AFortProjectileBase* SpawnProjectile); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ApplyCooldown_Server(); // Flags: Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponDetached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SpawnAttachment(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CleanUpTimeOutAudio(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTimeoutAudio(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TickTimeoutSound(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartTimeoutAudio(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTimeoutAudioStopped(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWeaponAttached(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAttach(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDetach(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SlowerUpdate(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleDangleAudio(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ADS_Pressed(bool ConsumeFuel); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ADS_Released(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ConsumeResourcesFromFiring(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDestroy(AActor* DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FireReleased(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DamageActors_Multicast(TArray<AActor*>& Array); // Flags: Net|NetReliableNetMulticast|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DamageActors_Server(TArray<AActor*>& Array); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FirePressed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ForceFirePressed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowErrorMessage(FText ErrorMessage); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartAttack(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Native Targeting Complete(FNyxGlassTargetingData TargetingData); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LandAttack(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AfterSlashEvents(FVector New Velocity); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPlayerHitWhileSwinging(FHitResult& Hit); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Fall_Client(); // Flags: Net|NetClient|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Fall(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnForgivenessTimerElapsed_BPClientOnly(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateKeepHoldingTip(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopRefueling_Multicast(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRopeUpdated(FVector RopeDirection, float RopeLength); // Flags: BlueprintCosmetic|Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play Attack Hit FX(UObject* Object); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlockSwingingEnd(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EndLandingBlock(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EndLandingBlockAfterDelay(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SlashDamageAndFX(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Attach After Server Finished Waiting For Target Data(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AttachTimerElapsed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CancelAttackIfAttacking(bool CancelAttackByExitingSwingingMovement); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDetachedFromTooSlow (Owning Client Only)(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Detached From Too Slow (Server)(); // Flags: Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Detached From Too Slow (Multicast)(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Rope Release Visuals (Multicast Remote Clients)(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StartHoveringAndConsumeFuel(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDetachWhenHitWall (Server)(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Detach When Hit Wall (Multicast)(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExitSwinging (Multicast)(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HoverFromThunderSpears(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Event IsTouchControlsServer(); // Flags: Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExitSwinging (To Server)(); // Flags: Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnClientTargetingChanged(bool bIsTargeting); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSetTargeting(bool bNewIsTargeting); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_Weapon_NyxGlass(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DoubleReticleUpdate__DelegateSignature(bool IsLockedOn, bool IsSwingAttached, bool AbleToUse, bool IsFiringBlocked, FVector LeftPosition, bool LeftPositionValid, FVector RightPosition, bool RightPositionValid, bool IsTargetAtAimLocation, bool IsAttacking, double CurrentGas, bool UsingGas, bool UsingExtraGas, int32_t CurrentSwordAmmo); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateGraceUI__DelegateSignature(bool ShowGraceUI, double ForgivenessProgress); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStateChanged__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/Animation/NyxGlass_AnimBP.NyxGlass_AnimBP_C
	// Inherited from UFortSwingingLayerAnimInstance -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x21CB (0x282B - 0x660)
	class UNyxGlass_AnimBP_C : public UFortSwingingLayerAnimInstance	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x660(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x668(0x20)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x688(0x8)
		FAnimSubsystemInstance_NodeRelevancy AnimBlueprintExtension_NodeRelevancy; // 0x690(0xA8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x738(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x740(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x760(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x810(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x830(0xB0)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8E0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x908(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x930(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x958(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x980(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9A8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9D0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9F8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA20(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA48(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xA70(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xA98(0x48)
		FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xAE0(0x20)
		FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xB00(0x20)
		FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xB20(0x128)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xC48(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC68(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xC90(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCB8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xCE0(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD08(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xD50(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xD70(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xDB8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xDD8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xEA0(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xEC0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xEE8(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF10(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0xF58(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xF78(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xFC0(0x48)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1008(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1050(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1098(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x10B8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x10E0(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x11A8(0x20)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x11C8(0x40)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1208(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1278(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1340(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1360(0xC8)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1428(0x40)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1468(0xC8)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1530(0x70)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15A0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x15C0(0xC8)
		FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1688(0x40)
		FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x16C8(0x70)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1738(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1800(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1820(0xC8)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x18E8(0x48)
		FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1930(0xC8)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x19F8(0x28)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x1A20(0x120)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B40(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1B88(0x48)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1BD0(0x48)
		FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1C18(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1C60(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1C80(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1CC8(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1CE8(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1DB0(0x20)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1DD0(0xC8)
		FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x1E98(0x120)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1FB8(0x48)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2000(0x48)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2048(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2070(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2098(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20C0(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20E8(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2110(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2138(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2160(0x28)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2188(0x28)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x21B0(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x21F8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2218(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2260(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2280(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x22C8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x22E8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2310(0xC8)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x23D8(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x23F8(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2440(0x20)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2460(0x48)
		FAnimNode_StateResult AnimGraphNode_StateResult; // 0x24A8(0x20)
		FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x24C8(0x28)
		FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x24F0(0xC8)
		FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x25B8(0x48)
		FAnimNode_Root AnimGraphNode_Root; // 0x2600(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2620(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x26D0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x26F0(0xB0)
		AB_Weapon_GrappleParent_C* Weapon; // 0x27A0(0x8)
		bool IsWallHit; // 0x27A8(0x1)
		bool Bound; // 0x27A9(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x27AA(0x2) UNKNOWN PROPERTY
		int32_t CurrentReleaseAnims; // 0x27AC(0x4)
		bool AllowNonRelease; // 0x27B0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x27B1(0x3) UNKNOWN PROPERTY
		int32_t CurrentReleaseAnims; // 0x27B4(0x4)
		int32_t CurrentReleaseAnims; // 0x27B8(0x4)
		int32_t CurrentReleaseAnims__90; // 0x27BC(0x4)
		TEnumAsByte<State_NyxGlass> State; // 0x27C0(0x1)
		bool IsHovering; // 0x27C1(0x1)
		bool IsZipAttack; // 0x27C2(0x1)
		bool IsRopeAttached; // 0x27C3(0x1)
		unsigned char UnknownData02_6[0x4]; // 0x27C4(0x4) UNKNOWN PROPERTY
		TArray<UAnimSequenceBase*> CurrentReleaseZipAnim; // 0x27C8(0x10)
		int32_t CurrentZipReleaseAnim; // 0x27D8(0x4)
		bool IsSlashingPastTarget; // 0x27DC(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x27DD(0x3) UNKNOWN PROPERTY
		double ZipLean; // 0x27E0(0x8)
		bool IsLeapingBack; // 0x27E8(0x1)
		bool IsMovingToTarget; // 0x27E9(0x1)
		bool IsAttackStart; // 0x27EA(0x1)
		bool IsAttackRelease; // 0x27EB(0x1)
		unsigned char UnknownData04_6[0x4]; // 0x27EC(0x4) UNKNOWN PROPERTY
		TArray<UAnimSequenceBase*> ZipCast; // 0x27F0(0x10)
		int32_t CurrentZipCastAnim; // 0x2800(0x4)
		unsigned char UnknownData05_6[0x4]; // 0x2804(0x4) UNKNOWN PROPERTY
		TArray<UAnimSequenceBase*> AttackIntroSelection; // 0x2808(0x10)
		int32_t CurrentAttackIntroAnim; // 0x2818(0x4)
		unsigned char UnknownData06_6[0x4]; // 0x281C(0x4) UNKNOWN PROPERTY
		double ZipLeanAlpha; // 0x2820(0x8)
		bool IsAttackFall; // 0x2828(0x1)
		bool IsHoverRelease; // 0x2829(0x1)
		bool ThunderSpearsEquipped; // 0x282A(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/Animation/NyxGlass_AnimBP.NyxGlass_AnimBP_C");
			return ret;
		}

		void FullBodyOverride(FPoseLink PassThroughFullBodyPose, FPoseLink& FullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CharacterSkeletalControlPostLegIK(FPoseLink InPosePostLegIK, FPoseLink& CharacterSkeletalControlPostLegIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ZipAttackSelection(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ZipCastSelection(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ZipReleaseSelection(FAnimUpdateContext& Context, FAnimNodeReference& Node); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SplitVector(FVector Vec, double& Magnitude, FVector& Direction); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_NyxGlass_AnimBP_AnimGraphNode_TransitionResult_B44649F14D0FCB5FC83F4D9279542FA5(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_NyxGlass_AnimBP_AnimGraphNode_TransitionResult_EDB1AD404AFD393755B3FDAF9A15F26E(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_NyxGlass_AnimBP_AnimGraphNode_TransitionResult_BF36491C46885D95EB9F4A9E61E3D829(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EvaluateGraphExposedInputs_ExecuteUbergraph_NyxGlass_AnimBP_AnimGraphNode_TransitionResult_C5AE41484905164A5FAD3AA3179795AF(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_EnterWebCast(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_EnterSwingNearGround(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_EnterSwingInAir(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimNotify_EnterNearGroundToPull(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintProcessAnimInputEvent(UFortAnimInputEvent* AnimInputEvent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintPostEvaluateAnimation(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void JustLanded(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NyxGlass_AnimBP(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/CameraModifier_NyxGlass.CameraModifier_NyxGlass_C
	// Inherited from UCameraModifier_GrappleParent_C -> UFortCameraModifier_Swinging -> UCameraModifier -> UObject
	// Size: 0x140 (0x3D0 - 0x290)
	class UCameraModifier_NyxGlass_C : public UCameraModifier_GrappleParent_C	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x290(0x8)
		double SpeedBoundsMultiplier; // 0x298(0x8)
		double SpeedBoundsWhileSlidingOverride; // 0x2A0(0x8)
		double ForwardScaledOffsetAtMaxSpeed; // 0x2A8(0x8)
		double ForwardScaledOffsetAtNormalSpeed; // 0x2B0(0x8)
		double FOVMultiplier_Sliding; // 0x2B8(0x8)
		double FOVMultiplier_MaxSpeed; // 0x2C0(0x8)
		double FOVMultiplier_NormalSpeed; // 0x2C8(0x8)
		double BoostMultiplier_MaxSpeed; // 0x2D0(0x8)
		double BoostMultiplier_NormalSpeed; // 0x2D8(0x8)
		double CurrForwardOffset; // 0x2E0(0x8)
		double CurrFOVOffset; // 0x2E8(0x8)
		double CurrRightOffset; // 0x2F0(0x8)
		float StartingRightSpeedScaledOffset; // 0x2F8(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x2FC(0x4) UNKNOWN PROPERTY
		double CurrentSlingshotBoost; // 0x300(0x8)
		double SF_SlingshotBoostDuration; // 0x308(0x8)
		UCurveFloat* Curve_SlingshotBoost; // 0x310(0x8)
		double SlingshotBoost_ForwardOffset; // 0x318(0x8)
		bool IsUsingCameraAnchor; // 0x320(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x321(0x7) UNKNOWN PROPERTY
		FVector AnchorStartLocation; // 0x328(0x18)
		FVector PosOffset; // 0x340(0x18)
		FVector FocalPoint; // 0x358(0x18)
		FVector CameraCurrentPosition; // 0x370(0x18)
		double AnchorAlpha; // 0x388(0x8)
		double StartingLength; // 0x390(0x8)
		UCurveFloat* AttackRightFleurishCurve; // 0x398(0x8)
		FVector AttachLocation; // 0x3A0(0x18)
		double StoppedAttackTime; // 0x3B8(0x8)
		UCurveFloat* AttackZoomCurve; // 0x3C0(0x8)
		AB_Weapon_NyxGlass_C* Weapon; // 0x3C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/CameraModifier_NyxGlass.CameraModifier_NyxGlass_C");
			return ret;
		}

		double GetAttackPercentage(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CalcAlpha(AB_Weapon_NyxGlass_C* Target, float& Alpha); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		double [DEPRECATED] GetAttackPercentage(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCameraAnchorAlpha(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateForwardOffsetData(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintModifyCamera(float DeltaTime, FVector ViewLocation, FRotator ViewRotation, float FOV, FVector& NewViewLocation, FRotator& NewViewRotation, float& NewFOV); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Turn On(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_CameraModifier_NyxGlass(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/NyxGlass/B_Component_NyxGlassWeaponSwinging.B_Component_NyxGlassWeaponSwinging_C
	// Inherited from UNyxGlassWeaponComponent_Swinging -> UFortWeaponComponent_Swinging -> UFortWeaponComponent -> UGameFrameworkComponent -> UActorComponent -> UObject
	// Size: 0x8 (0x1270 - 0x1268)
	class UB_Component_NyxGlassWeaponSwinging_C : public UNyxGlassWeaponComponent_Swinging	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1268(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/NyxGlass/B_Component_NyxGlassWeaponSwinging.B_Component_NyxGlassWeaponSwinging_C");
			return ret;
		}

		void BPNyxGlassStateToNativeState(TEnumAsByte<State_NyxGlass> BPState, ENyxGlassState& NativeState); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		ENyxGlassSlashSubstate GetNyxGlassSlashSubstate(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		ENyxGlassState GetNyxGlassState(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnVelocityCalculated(FNyxGlassVelocityMetadata& VelocityMetadata); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsAttacking(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool ShouldUpdateTargeting(); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateReticle(bool bHitSomething, bool bUseBlocked, bool bIsWeaponAimingAtTarget, FVector& TargetPos); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitGround(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTargetingComplete(FNyxGlassTargetingData& TargetingData); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnForgivenessTimerFinished(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnForgivenessTimerCanceled(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnServerTargetingDataReceived(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_Component_NyxGlassWeaponSwinging(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/FeyCrab/B_Prj_Ranged_FeyCrab.B_Prj_Ranged_FeyCrab_C
	// Inherited from AFortProjectileBase -> AFortGameplayEffectDeliveryActor -> AActor -> UObject
	// Size: 0x490 (0xFB8 - 0xB28)
	class AB_Prj_Ranged_FeyCrab_C : public AFortProjectileBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB28(0x8)
		USceneComponent* TargetingBack; // 0xB30(0x8)
		USceneComponent* TargetingFront; // 0xB38(0x8)
		USceneComponent* ExplosionPointFront; // 0xB40(0x8)
		USceneComponent* ExplosionPointBack; // 0xB48(0x8)
		UFortAttachableProjectileComponent* FortAttachableProjectile; // 0xB50(0x8)
		UStaticMeshComponent* FeyCrab_Projectile; // 0xB58(0x8)
		UNiagaraComponent* NS_FeycrabLauncher_Prj_SurfImpact; // 0xB60(0x8)
		UNiagaraComponent* NS_FeycrabLauncher_Prj_Idle; // 0xB68(0x8)
		UNiagaraComponent* NS_TetherWire; // 0xB70(0x8)
		USceneComponent* ProtoMesh; // 0xB78(0x8)
		UStaticMeshComponent* Mesh; // 0xB80(0x8)
		UCapsuleComponent* Collision; // 0xB88(0x8)
		UStaticMeshComponent* Wire; // 0xB90(0x8)
		UBP_SurfaceTypeSoundComponent_C* BP_SurfaceTypeSoundComponent; // 0xB98(0x8)
		UAudioComponent* Rocket_AudioComponent; // 0xBA0(0x8)
		UPostProcessComponent* PP_Explode; // 0xBA8(0x8)
		TEnumAsByte<ETimelineDirection> Timeline__Direction_1AE4BB1745E3DCE12F22B08F33ED6E13; // 0xBB0(0x1)
		unsigned char UnknownData00_6[0x7]; // 0xBB1(0x7) UNKNOWN PROPERTY
		UTimelineComponent* Timeline; // 0xBB8(0x8)
		float PPFader_PPFade_8DFB40F94F3DFCB8ED9F31A302F47F30; // 0xBC0(0x4)
		TEnumAsByte<ETimelineDirection> PPFader__Direction_8DFB40F94F3DFCB8ED9F31A302F47F30; // 0xBC4(0x1)
		unsigned char UnknownData01_6[0x3]; // 0xBC5(0x3) UNKNOWN PROPERTY
		UTimelineComponent* PPFader; // 0xBC8(0x8)
		UParticleSystemComponent* Ribbon_Trail_PSC; // 0xBD0(0x8)
		UParticleSystem* Ribbon_Trail_PS; // 0xBD8(0x8)
		UParticleSystemComponent* Explosion_Generic_PSC; // 0xBE0(0x8)
		USoundBase* Rocket_Projectile_Explosion_Sound; // 0xBE8(0x8)
		FVector StopLocation; // 0xBF0(0x18)
		UParticleSystem* Explosion_Flesh_Damage_PS; // 0xC08(0x8)
		FRotator StopRotZ; // 0xC10(0x18)
		UParticleSystemComponent* Explosion_Flesh_Damage_PSC; // 0xC28(0x8)
		USoundBase* Rocket_Projectile_Explosion_Water_Sound; // 0xC30(0x8)
		UParticleSystemComponent* RocketTrailPS; // 0xC38(0x8)
		double RocketSpinRate; // 0xC40(0x8)
		double Explosion_Impact_Offset; // 0xC48(0x8)
		FVector RocketScale; // 0xC50(0x18)
		FVector DecalLocation; // 0xC68(0x18)
		TEnumAsByte<EPhysicalSurface> SurfaceType; // 0xC80(0x1)
		unsigned char UnknownData02_6[0x3]; // 0xC81(0x3) UNKNOWN PROPERTY
		FGameplayTag FeedbackCue; // 0xC84(0x4)
		UNiagaraComponent* RocketTrailPS_Niagara; // 0xC88(0x8)
		UFXSystemAsset* Explosion_Asset; // 0xC90(0x8)
		FFortPortableSoftParticles Rocket_Trail_Asset; // 0xC98(0x48)
		UFXSystemAsset* Rocket_Trial_Asset; // 0xCE0(0x8)
		double PlayRate; // 0xCE8(0x8)
		double Radius; // 0xCF0(0x8)
		double Strength; // 0xCF8(0x8)
		double Time_Decay; // 0xD00(0x8)
		UFXSystemAsset* Explosion_Asset_Water; // 0xD08(0x8)
		UFXSystemAsset* NewNiagaraExplosionAsset; // 0xD10(0x8)
		UFXSystemAsset* NewNiagaraRocketTrailAsset; // 0xD18(0x8)
		bool bTriggeredExplosion; // 0xD20(0x1)
		bool HitWall; // 0xD21(0x1)
		unsigned char UnknownData03_6[0x6]; // 0xD22(0x6) UNKNOWN PROPERTY
		FTimerHandle WireUpdateTimer; // 0xD28(0x8)
		int32_t FXState; // 0xD30(0x4)
		unsigned char UnknownData04_6[0x4]; // 0xD34(0x4) UNKNOWN PROPERTY
		AFortPlayerPawnAthena* As_Fort_Player_Pawn_Athena; // 0xD38(0x8)
		bool IsLeftHanded; // 0xD40(0x1)
		bool WirePulled; // 0xD41(0x1)
		bool SurfaceImpacted; // 0xD42(0x1)
		unsigned char UnknownData05_6[0x5]; // 0xD43(0x5) UNKNOWN PROPERTY
		FTimerHandle FuseWarningTimer; // 0xD48(0x8)
		bool FusePrimed; // 0xD50(0x1)
		unsigned char UnknownData06_6[0x7]; // 0xD51(0x7) UNKNOWN PROPERTY
		UNiagaraComponent* NS_FuseFX; // 0xD58(0x8)
		APawn* StuckPawn; // 0xD60(0x8)
		FScalableFloat StickToPlayers; // 0xD68(0x28)
		double OffsetDistanceFromPhysicsMesh; // 0xD90(0x8)
		double OffsetDistanceFromBone; // 0xD98(0x8)
		bool StickToAllies; // 0xDA0(0x1)
		unsigned char UnknownData07_6[0x3]; // 0xDA1(0x3) UNKNOWN PROPERTY
		FName offset_socket; // 0xDA4(0x4)
		bool Has_Stopped; // 0xDA8(0x1)
		unsigned char UnknownData08_6[0x7]; // 0xDA9(0x7) UNKNOWN PROPERTY
		FScalableFloat FuseTimerMaxDuration; // 0xDB0(0x28)
		FScalableFloat ExplosionTargetingRadius; // 0xDD8(0x28)
		FScalableFloat FuseActivatedTimer; // 0xE00(0x28)
		FHitResult Water_Hit; // 0xE28(0xF8)
		bool Is_Underwater; // 0xF20(0x1)
		unsigned char UnknownData09_6[0x7]; // 0xF21(0x7) UNKNOWN PROPERTY
		UNiagaraSystem* OnEnterWaterFX; // 0xF28(0x8)
		ATriggerSphere* DummyFrontSphere; // 0xF30(0x8)
		TArray<AActor*> CurrentTargets; // 0xF38(0x10)
		ATriggerSphere* DummyRearSphere; // 0xF48(0x8)
		FScalableFloat InAirExplosionTimer; // 0xF50(0x28)
		AActor* InitialHitActor; // 0xF78(0x8)
		UClass* GE_ExplosiveDamage; // 0xF80(0x8)
		float DelayRetryReload; // 0xF88(0x4)
		unsigned char UnknownData10_6[0x4]; // 0xF8C(0x4) UNKNOWN PROPERTY
		FTimerHandle TH_InairExplosion; // 0xF90(0x8)
		float ServerWorldTime; // 0xF98(0x4)
		bool HasHitEnemyAlready; // 0xF9C(0x1)
		unsigned char UnknownData11_6[0x3]; // 0xF9D(0x3) UNKNOWN PROPERTY
		ABuildingActor* StuckBuildingActor; // 0xFA0(0x8)
		FGuid HitPlayer; // 0xFA8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/B_Prj_Ranged_FeyCrab.B_Prj_Ranged_FeyCrab_C");
			return ret;
		}

		void InitialHitEnemyCheck(AActor* Actor stuck ); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlastHitEnemyCheck(TArray<AActor*>& List of Hit Actors, bool Final run); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FX_GetExplosionTransform(FTransform& OutXfm); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DealExplosiveDamage(UAbilitySystemComponent* Target); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FX_OnSpawnExplosion(UFXSystemComponent* Explosion); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetWaterSurfaceLocationForExplosion(FVector PrjLoc, FHitResult WaterHitResult, FVector& OutWaterPosition); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update FXWire(UNiagaraComponent* Target, FVector Location); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Rope FXState(UNiagaraComponent* Target, int32_t State); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateWire(FVector AttachPoint, FVector BasePoint, USceneComponent* Wire); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UserConstructionScript(); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PPFader__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PPFader__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline__FinishedFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline__UpdateFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline__Playcue__EventFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Timeline__ToggleMaterial__EventFunc(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateFXState(int32_t State); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FX_OnFuseCountdown(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FX_CreateFuseFX(int32_t State); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnProjectileWaterHit(FHitResult& WaterHit, AFortWaterBodyActor* WaterBody); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FX_OnExplodeInWater(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveBeginPlay(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FuseTimerMax(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExploded(TArray<AActor*>& HitActors, TArray<FHitResult>& HitResults); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ReceiveDestroyed(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTouched(AActor* OtherActor, UPrimitiveComponent* OtherComp, FHitResult& HitResult, bool bIsOverlap); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnDisableForKill(); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerExplosion(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTheWire(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PulledWire(AB_Prj_Ranged_FeyCrab_C* Target); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DetachWire(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ManualExplode(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FuseActivated(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayerDiedEvent(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AIDiedEvent(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BindEventTo PlayerDeath(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTouched: No Bounce(FHitResult Hit Result); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Impact and Explosion Effects(FHitResult Hit Result); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Activate Fuse(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__B_Prj_Ranged_FeyCrab_FortAttachableProjectile_K2Node_ComponentBoundEvent_0_OnFinalizeAttachmentDelegate__DelegateSignature(FVector& WorldLocation, FRotator& WorldRotation, FName& SocketName); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__B_Prj_Ranged_FeyCrab_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature(FHitResult& ImpactResult); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPawnDestroyed(AActor* DestroyedActor); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SecondTargetingDamage(FTargetingRequestHandle TargetingRequestHandle); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SecondTarget(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FirstTargeting(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FirstTargetingDamage(FTargetingRequestHandle TargetingRequestHandle); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InAirExplosion(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SendExplodeEvent(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBuilldingActorDeath(AActor* DamagedActor, float Damage, AController* InstigatedBy, AActor* DamageCauser, FVector HitLocation, UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayPreExplosionSound(); // Flags: Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HitPlayer_Sound(); // Flags: Net|NetMulticast|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_B_Prj_Ranged_FeyCrab(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_LayerAnimBP.FeyCrab_Launcher_LayerAnimBP_C
	// Inherited from UFortPlayerAnimInstanceProxy -> UFortBaseLayerAnimInstance -> UFortBaseAnimInstance -> UAnimInstance -> UObject
	// Size: 0x1422 (0x2842 - 0x1420)
	class UFeyCrab_Launcher_LayerAnimBP_C : public UFortPlayerAnimInstanceProxy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1428(0x18)
		FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x1440(0x8)
		FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x1448(0x8)
		FAnimNode_Root AnimGraphNode_Root; // 0x1450(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1470(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1520(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1540(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x15F0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1610(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x16C0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x16E0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1790(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x17B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1860(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1880(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1930(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1950(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1970(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1990(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x19B0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1A60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1A80(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B30(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B50(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B70(0x20)
		FAnimNode_Root AnimGraphNode_Root; // 0x1B90(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1BB0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1C60(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1C80(0xB0)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1D30(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1DE0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1E00(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1EB0(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1ED0(0xB0)
		FAnimNode_Root AnimGraphNode_Root; // 0x1F80(0x20)
		FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1FA0(0xB0)
		FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2050(0x78)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x20C8(0x48)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2110(0x28)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2138(0x118)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2250(0x28)
		FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2278(0x48)
		FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x22C0(0x118)
		FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x23D8(0x28)
		FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x2400(0x420)
		FAnimNode_Root AnimGraphNode_Root; // 0x2820(0x20)
		bool Is_Right_Hand; // 0x2840(0x1)
		bool IsUseAimoffset; // 0x2841(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/DryBox/Items/FeyCrab/Animation/AnimBP/FeyCrab_Launcher_LayerAnimBP.FeyCrab_Launcher_LayerAnimBP_C");
			return ret;
		}

		void ItemUpperBody(FPoseLink InPoseUpperBody, FFortAnimInput_AdjustedAim InputParam, FPoseLink& ItemUpperBody); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemIdleAdditive(FPoseLink InPoseIdleAdditive, FPoseLink& ItemIdleAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpUpAdditive(FPoseLink InPoseItemJumpUpAdditive, FPoseLink& ItemJumpUpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJumpLoopAdditive(FPoseLink InPoseItemJumpLoopAdditive, FPoseLink& ItemJumpLoopAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallAdditive(FPoseLink InPoseItemFallAdditive, FPoseLink& ItemFallAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFallLandAdditive(FPoseLink InPoseItemFallLandAdditive, FPoseLink& ItemFallLandAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackStartAdditive(FPoseLink& ItemJetPackStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemJetPackJumpAdditive(FPoseLink& ItemJetPackJumpAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemZipLineStartAdditive(FPoseLink& ItemZipLineStartAdditive); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemLowerBodyMovement(FPoseLink InPoseLowerBodyMovement, FPoseLink& ItemLowerBodyMovement); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemRelaxedEntry(FPoseLink InPoseRelaxedEntry, FPoseLink& ItemRelaxedEntry); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpFallLoop(FPoseLink& ItemSwimJumpFallLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceLoop(FPoseLink& ItemSwimJumpSurfaceLoop); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSwimJumpSurfaceEnd(FPoseLink& ItemSwimJumpSurfaceEnd); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemSkeletalControl(FPoseLink InPose, FPoseLink& ItemSkeletalControl); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemAimOffset(FPoseLink InPose_AimOffset, double AimOffsetAlpha, double Yaw, double pitch, FPoseLink InPose_UpperLowerPreMeleeAO, FPoseLink& ItemAimOffset); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFullBodyOverride(FPoseLink InPoseFullBody, FPoseLink& ItemFullBodyOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemPreIK(FPoseLink InPose_PreIK, FPoseLink& ItemPreIK); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ItemFinalPoseOverride(FPoseLink InFinalPose, FPoseLink& ItemFinalPoseOverride); // Flags: HasOutParms|BlueprintCallable, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AnimGraph(FPoseLink& AnimGraph); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FeyCrab_Launcher_LayerAnimBP(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /GrappleGloves/Items/GrappleGloves/GE_GrappleGloves_IsHot.GE_GrappleGloves_IsHot_C
	// Inherited from UGameplayEffect -> UObject
	// Size: 0x0 (0xA68 - 0xA68)
	class UGE_GrappleGloves_IsHot_C : public UGameplayEffect	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/GrappleGloves/Items/GrappleGloves/GE_GrappleGloves_IsHot.GE_GrappleGloves_IsHot_C");
			return ret;
		}
	};


