#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: OptimusCore
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class OptimusCore.OptimusAlternativeSelectedObjectProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusAlternativeSelectedObjectProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusAlternativeSelectedObjectProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComponentBindingProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusComponentBindingProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComponentBindingProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComponentBindingReceiver
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusComponentBindingReceiver : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComponentBindingReceiver");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComputeKernelDataInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusComputeKernelDataInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComputeKernelDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComputeKernelProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusComputeKernelProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComputeKernelProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDataInterfaceProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusDataInterfaceProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDataInterfaceProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDeformerInstanceAccessor
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusDeformerInstanceAccessor : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDeformerInstanceAccessor");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDeprecatedExecutionDataInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusDeprecatedExecutionDataInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDeprecatedExecutionDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusExecutionDomainProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusExecutionDomainProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusExecutionDomainProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusGeneratedClassDefiner
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusGeneratedClassDefiner : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusGeneratedClassDefiner");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodeAdderPinProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodeAdderPinProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeAdderPinProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodeFunctionLibraryOwner
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodeFunctionLibraryOwner : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeFunctionLibraryOwner");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodeGraphCollectionOwner
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodeGraphCollectionOwner : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeGraphCollectionOwner");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodeGraphProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodeGraphProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeGraphProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodePairProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodePairProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodePairProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodePinRouter
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodePinRouter : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodePinRouter");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodeSubGraphReferencer
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNodeSubGraphReferencer : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeSubGraphReferencer");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNonCollapsibleNode
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNonCollapsibleNode : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNonCollapsibleNode");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNonCopyableNode
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusNonCopyableNode : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNonCopyableNode");
			return ret;
		}
	};


	// Class OptimusCore.OptimusOutputBufferWriter
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusOutputBufferWriter : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusOutputBufferWriter");
			return ret;
		}
	};


	// Class OptimusCore.OptimusParameterBindingProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusParameterBindingProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusParameterBindingProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusPathResolver
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusPathResolver : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusPathResolver");
			return ret;
		}
	};


	// Class OptimusCore.OptimusPersistentBufferProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusPersistentBufferProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusPersistentBufferProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusPinMutabilityDefiner
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusPinMutabilityDefiner : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusPinMutabilityDefiner");
			return ret;
		}
	};


	// Class OptimusCore.OptimusShaderTextProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusShaderTextProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusShaderTextProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusUnnamedNodePinProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusUnnamedNodePinProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusUnnamedNodePinProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusValueProvider
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusValueProvider : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusValueProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComputeDataInterface
	// Inherited from UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusComputeDataInterface : public UComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComputeDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusSkinnedMeshVertexAttributeDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		FName AttributeName; // 0x28(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshVertexAttributeDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusSkinnedMeshVertexAttributeDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMeshComponent; // 0x28(0x8)
		FName AttributeName; // 0x30(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshVertexAttributeDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusKernelSource
	// Inherited from UComputeKernelSource -> UObject
	// Size: 0x10 (0xA8 - 0x98)
	class UOptimusKernelSource : public UComputeKernelSource	
	{
	public:
		FString Source; // 0x98(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusKernelSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComponentSource
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusComponentSource : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComponentSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSceneComponentSource
	// Inherited from UOptimusComponentSource -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusSceneComponentSource : public UOptimusComponentSource	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSceneComponentSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshComponentSource
	// Inherited from UOptimusComponentSource -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusSkinnedMeshComponentSource : public UOptimusComponentSource	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshComponentSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkeletalMeshComponentSource
	// Inherited from UOptimusSkinnedMeshComponentSource -> UOptimusComponentSource -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusSkeletalMeshComponentSource : public UOptimusSkinnedMeshComponentSource	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkeletalMeshComponentSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusAnimAttributeDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x30 (0x58 - 0x28)
	class UOptimusAnimAttributeDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		FOptimusAnimAttributeArray AttributeArray; // 0x28(0x10)
		unsigned char UnknownData00_7[0x20]; // 0x38(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusAnimAttributeDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusAnimAttributeDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x20 (0x48 - 0x28)
	class UOptimusAnimAttributeDataProvider : public UComputeDataProvider	
	{
	public:
		USkeletalMeshComponent* SkeletalMesh; // 0x28(0x8)
		unsigned char UnknownData00_7[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusAnimAttributeDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusClothDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusClothDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusClothDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusClothDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusClothDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusClothDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusConnectivityDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusConnectivityDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusConnectivityDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusConnectivityDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x18 (0x40 - 0x28)
	class UOptimusConnectivityDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)
		unsigned char UnknownData00_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusConnectivityDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusCopyKernelDataInterface
	// Inherited from UComputeDataInterface -> UObject
	// Size: 0x20 (0x48 - 0x28)
	class UOptimusCopyKernelDataInterface : public UComputeDataInterface	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr<UOptimusComponentSourceBinding*> ComponentSourceBinding; // 0x30(0x8)
		FString NumThreadsExpression; // 0x38(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusCopyKernelDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusCopyKernelDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusCopyKernelDataProvider : public UComputeDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusCopyKernelDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusCustomComputeKernelDataInterface
	// Inherited from UComputeDataInterface -> UObject
	// Size: 0x30 (0x58 - 0x28)
	class UOptimusCustomComputeKernelDataInterface : public UComputeDataInterface	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr<UOptimusComponentSourceBinding*> ComponentSourceBinding; // 0x30(0x8)
		FString NumThreadsExpression; // 0x38(0x10)
		FOptimusConstantIdentifier ExecutionDomainConstantIdentifier; // 0x48(0xC)
		unsigned char UnknownData01_7[0x4]; // 0x54(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusCustomComputeKernelDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusCustomComputeKernelDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusCustomComputeKernelDataProvider : public UComputeDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusCustomComputeKernelDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDebugDrawDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x18 (0x40 - 0x28)
	class UOptimusDebugDrawDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		bool bIsSupported; // 0x28(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x29(0x3) UNKNOWN PROPERTY
		FOptimusDebugDrawParameters DebugDrawParameters; // 0x2C(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDebugDrawDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDebugDrawDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x20 (0x48 - 0x28)
	class UOptimusDebugDrawDataProvider : public UComputeDataProvider	
	{
	public:
		UPrimitiveComponent* PrimitiveComponent; // 0x28(0x8)
		FOptimusDebugDrawParameters DebugDrawParameters; // 0x30(0x14)
		unsigned char UnknownData00_7[0x4]; // 0x44(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDebugDrawDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDuplicateVerticesDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusDuplicateVerticesDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDuplicateVerticesDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDuplicateVerticesDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusDuplicateVerticesDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDuplicateVerticesDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusGraphDataInterface
	// Inherited from UComputeDataInterface -> UObject
	// Size: 0x18 (0x40 - 0x28)
	class UOptimusGraphDataInterface : public UComputeDataInterface	
	{
	public:
		TArray<FOptimusGraphVariableDescription> Variables; // 0x28(0x10)
		int32_t ParameterBufferSize; // 0x38(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusGraphDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusGraphDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x40 (0x68 - 0x28)
	class UOptimusGraphDataProvider : public UComputeDataProvider	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		UMeshComponent* MeshComponent; // 0x30(0x8)
		TArray<FOptimusGraphVariableDescription> Variables; // 0x38(0x10)
		unsigned char UnknownData01_6[0x18]; // 0x48(0x18) UNKNOWN PROPERTY
		UOptimusDeformerInstance* DeformerInstance; // 0x60(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusGraphDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusHalfEdgeDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusHalfEdgeDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusHalfEdgeDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusHalfEdgeDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x20 (0x48 - 0x28)
	class UOptimusHalfEdgeDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)
		unsigned char UnknownData00_7[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusHalfEdgeDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusLoopTerminalDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusLoopTerminalDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		uint32_t Index; // 0x28(0x4)
		uint32_t Count; // 0x2C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusLoopTerminalDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusLoopTerminalDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusLoopTerminalDataProvider : public UComputeDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusLoopTerminalDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusMorphTargetDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusMorphTargetDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusMorphTargetDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusMorphTargetDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusMorphTargetDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusMorphTargetDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusRawBufferDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x60 (0x88 - 0x28)
	class UOptimusRawBufferDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		FShaderValueTypeHandle ValueType; // 0x28(0x8)
		FOptimusDataDomain DataDomain; // 0x30(0x40)
		TWeakObjectPtr<UOptimusComponentSourceBinding*> ComponentSourceBinding; // 0x70(0x8)
		FOptimusConstantIdentifier DomainConstantIdentifier; // 0x78(0xC)
		unsigned char UnknownData00_7[0x4]; // 0x84(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusRawBufferDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusTransientBufferDataInterface
	// Inherited from UOptimusRawBufferDataInterface -> UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x8 (0x90 - 0x88)
	class UOptimusTransientBufferDataInterface : public UOptimusRawBufferDataInterface	
	{
	public:
		bool bZeroInitForAtomicWrites; // 0x88(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x89(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusTransientBufferDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusImplicitPersistentBufferDataInterface
	// Inherited from UOptimusRawBufferDataInterface -> UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x8 (0x90 - 0x88)
	class UOptimusImplicitPersistentBufferDataInterface : public UOptimusRawBufferDataInterface	
	{
	public:
		bool bZeroInitForAtomicWrites; // 0x88(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x89(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusImplicitPersistentBufferDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusPersistentBufferDataInterface
	// Inherited from UOptimusRawBufferDataInterface -> UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x8 (0x90 - 0x88)
	class UOptimusPersistentBufferDataInterface : public UOptimusRawBufferDataInterface	
	{
	public:
		FName ResourceName; // 0x88(0x4)
		unsigned char UnknownData00_7[0x4]; // 0x8C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusPersistentBufferDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusRawBufferDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x58 (0x80 - 0x28)
	class UOptimusRawBufferDataProvider : public UComputeDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x58]; // 0x28(0x58) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusRawBufferDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusTransientBufferDataProvider
	// Inherited from UOptimusRawBufferDataProvider -> UComputeDataProvider -> UObject
	// Size: 0x8 (0x88 - 0x80)
	class UOptimusTransientBufferDataProvider : public UOptimusRawBufferDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x80(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusTransientBufferDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusImplicitPersistentBufferDataProvider
	// Inherited from UOptimusRawBufferDataProvider -> UComputeDataProvider -> UObject
	// Size: 0x20 (0xA0 - 0x80)
	class UOptimusImplicitPersistentBufferDataProvider : public UOptimusRawBufferDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x20]; // 0x80(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusImplicitPersistentBufferDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusPersistentBufferDataProvider
	// Inherited from UOptimusRawBufferDataProvider -> UComputeDataProvider -> UObject
	// Size: 0x20 (0xA0 - 0x80)
	class UOptimusPersistentBufferDataProvider : public UOptimusRawBufferDataProvider	
	{
	public:
		unsigned char UnknownData00_1[0x20]; // 0x80(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusPersistentBufferDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSceneDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusSceneDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSceneDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSceneDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusSceneDataProvider : public UComputeDataProvider	
	{
	public:
		USceneComponent* SceneComponent; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSceneDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkeletonDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusSkeletonDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkeletonDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkeletonDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusSkeletonDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkeletonDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusSkinnedMeshDataInterface : public UOptimusComputeDataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusSkinnedMeshDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshExecDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusSkinnedMeshExecDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		EOptimusSkinnedMeshExecDomain Domain; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshExecDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshExecDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusSkinnedMeshExecDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)
		EOptimusSkinnedMeshExecDomain Domain; // 0x30(0x1)
		unsigned char UnknownData00_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshExecDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshWriteDataInterface
	// Inherited from UOptimusComputeDataInterface -> UComputeDataInterface -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UOptimusSkinnedMeshWriteDataInterface : public UOptimusComputeDataInterface	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshWriteDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSkinnedMeshWriteDataProvider
	// Inherited from UComputeDataProvider -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusSkinnedMeshWriteDataProvider : public UComputeDataProvider	
	{
	public:
		USkinnedMeshComponent* SkinnedMesh; // 0x28(0x8)
		unsigned char UnknownData00_7[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSkinnedMeshWriteDataProvider");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode
	// Inherited from UObject
	// Size: 0xE0 (0x108 - 0x28)
	class UOptimusNode : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FText DisplayName; // 0x30(0x10)
		FVector2D GraphPosition; // 0x40(0x10)
		TArray<UOptimusNodePin*> Pins; // 0x50(0x10)
		TSet<FName> ExpandedPins; // 0x60(0x50)
		EOptimusDiagnosticLevel DiagnosticLevel; // 0xB0(0x1)
		unsigned char UnknownData01_7[0x57]; // 0xB1(0x57) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode");
			return ret;
		}

		bool SetGraphPosition(FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144F6F8(relative to base address)
		FName GetNodeName(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EB10(relative to base address)
		FName GetNodeCategory(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EAE0(relative to base address)
		FVector2D GetGraphPosition(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EA88(relative to base address)
		FText GetDisplayName(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF7502F7290(relative to base address)
	};


	// Class OptimusCore.OptimusNode_DataInterface
	// Inherited from UOptimusNode -> UObject
	// Size: 0x28 (0x130 - 0x108)
	class UOptimusNode_DataInterface : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x108(0x18) UNKNOWN PROPERTY
		UClass* DataInterfaceClass; // 0x120(0x8)
		UOptimusComputeDataInterface* DataInterfaceData; // 0x128(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_DataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_AnimAttributeDataInterface
	// Inherited from UOptimusNode_DataInterface -> UOptimusNode -> UObject
	// Size: 0x0 (0x130 - 0x130)
	class UOptimusNode_AnimAttributeDataInterface : public UOptimusNode_DataInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_AnimAttributeDataInterface");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ComponentSource
	// Inherited from UOptimusNode -> UObject
	// Size: 0x28 (0x130 - 0x108)
	class UOptimusNode_ComponentSource : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x10]; // 0x108(0x10) UNKNOWN PROPERTY
		UOptimusComponentSourceBinding* Binding; // 0x118(0x8)
		FOptimusNode_ComponentSource_DuplicationInfo DuplicationInfo; // 0x120(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ComponentSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ComputeKernelBase
	// Inherited from UOptimusNode -> UObject
	// Size: 0x8 (0x110 - 0x108)
	class UOptimusNode_ComputeKernelBase : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_1[0x8]; // 0x108(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ComputeKernelBase");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ComputeKernelFunctionGeneratorClass
	// Inherited from UClass -> UStruct -> UField -> UObject
	// Size: 0x60 (0x260 - 0x200)
	class UOptimusNode_ComputeKernelFunctionGeneratorClass : public UClass	
	{
	public:
		FName category; // 0x200(0x4)
		FName KernelName; // 0x204(0x4)
		FOptimusExecutionDomain ExecutionDomain; // 0x208(0x18)
		FIntVector GroupSize; // 0x220(0xC)
		unsigned char UnknownData00_6[0x4]; // 0x22C(0x4) UNKNOWN PROPERTY
		TArray<FOptimusParameterBinding> InputBindings; // 0x230(0x10)
		TArray<FOptimusParameterBinding> OutputBindings; // 0x240(0x10)
		FString ShaderSource; // 0x250(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ComputeKernelFunctionGeneratorClass");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ComputeKernelFunction
	// Inherited from UOptimusNode_ComputeKernelBase -> UOptimusNode -> UObject
	// Size: 0x0 (0x110 - 0x110)
	class UOptimusNode_ComputeKernelFunction : public UOptimusNode_ComputeKernelBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ComputeKernelFunction");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ConstantValueGeneratorClass
	// Inherited from UClass -> UStruct -> UField -> UObject
	// Size: 0x10 (0x210 - 0x200)
	class UOptimusNode_ConstantValueGeneratorClass : public UClass	
	{
	public:
		FOptimusDataTypeRef DataType; // 0x200(0xC)
		unsigned char UnknownData00_7[0x4]; // 0x20C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ConstantValueGeneratorClass");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ConstantValue
	// Inherited from UOptimusNode -> UObject
	// Size: 0x18 (0x120 - 0x108)
	class UOptimusNode_ConstantValue : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_1[0x18]; // 0x108(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ConstantValue");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_CustomComputeKernel
	// Inherited from UOptimusNode_ComputeKernelBase -> UOptimusNode -> UObject
	// Size: 0xE0 (0x1F0 - 0x110)
	class UOptimusNode_CustomComputeKernel : public UOptimusNode_ComputeKernelBase	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x110(0x20) UNKNOWN PROPERTY
		FName category; // 0x130(0x4)
		FOptimusValidatedName KernelName; // 0x134(0x4)
		FOptimusExecutionDomain ExecutionDomain; // 0x138(0x18)
		FIntVector GroupSize; // 0x150(0xC)
		unsigned char UnknownData01_6[0x4]; // 0x15C(0x4) UNKNOWN PROPERTY
		TArray<FOptimus_ShaderBinding> Parameters; // 0x160(0x10)
		TArray<FOptimusParameterBinding> InputBindings; // 0x170(0x10)
		TArray<FOptimusParameterBinding> OutputBindings; // 0x180(0x10)
		FOptimusParameterBindingArray InputBindingArray; // 0x190(0x10)
		FOptimusParameterBindingArray OutputBindingArray; // 0x1A0(0x10)
		TArray<FOptimusSecondaryInputBindingsGroup> SecondaryInputBindingGroups; // 0x1B0(0x10)
		TArray<UComputeSource*> AdditionalSources; // 0x1C0(0x10)
		FOptimusShaderText ShaderSource; // 0x1D0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_CustomComputeKernel");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_FunctionReference
	// Inherited from UOptimusNode -> UObject
	// Size: 0x40 (0x148 - 0x108)
	class UOptimusNode_FunctionReference : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x108(0x18) UNKNOWN PROPERTY
		TWeakObjectPtr<UOptimusFunctionNodeGraph*> FunctionGraph; // 0x120(0x20)
		TWeakObjectPtr<UOptimusNodePin*> DefaultComponentPin; // 0x140(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_FunctionReference");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_ResourceAccessorBase
	// Inherited from UOptimusNode -> UObject
	// Size: 0x80 (0x188 - 0x108)
	class UOptimusNode_ResourceAccessorBase : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x108(0x20) UNKNOWN PROPERTY
		TWeakObjectPtr<UOptimusResourceDescription*> ResourceDesc; // 0x128(0x8)
		EOptimusBufferWriteType WriteType; // 0x130(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x131(0x7) UNKNOWN PROPERTY
		FOptimusNode_ResourceAccessorBase_DuplicationInfo DuplicationInfo; // 0x138(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_ResourceAccessorBase");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_GetResource
	// Inherited from UOptimusNode_ResourceAccessorBase -> UOptimusNode -> UObject
	// Size: 0x0 (0x188 - 0x188)
	class UOptimusNode_GetResource : public UOptimusNode_ResourceAccessorBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_GetResource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_GetVariable
	// Inherited from UOptimusNode -> UObject
	// Size: 0x40 (0x148 - 0x108)
	class UOptimusNode_GetVariable : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x108(0x18) UNKNOWN PROPERTY
		TWeakObjectPtr<UOptimusVariableDescription*> VariableDesc; // 0x120(0x8)
		FOptimusNode_GetVariable_DuplicationInfo DuplicationInfo; // 0x128(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_GetVariable");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_GraphTerminal
	// Inherited from UOptimusNode -> UObject
	// Size: 0x38 (0x140 - 0x108)
	class UOptimusNode_GraphTerminal : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x108(0x20) UNKNOWN PROPERTY
		EOptimusTerminalType TerminalType; // 0x128(0x4)
		TWeakObjectPtr<UOptimusNodePin*> DefaultComponentPin; // 0x12C(0x8)
		unsigned char UnknownData01_7[0xC]; // 0x134(0xC) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_GraphTerminal");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_LoopTerminal
	// Inherited from UOptimusNode -> UObject
	// Size: 0x68 (0x170 - 0x108)
	class UOptimusNode_LoopTerminal : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x28]; // 0x108(0x28) UNKNOWN PROPERTY
		EOptimusTerminalType TerminalType; // 0x130(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x134(0x4) UNKNOWN PROPERTY
		FOptimusLoopTerminalInfo LoopInfo; // 0x138(0x18)
		UOptimusNodePin* IndexPin; // 0x150(0x8)
		UOptimusNodePin* CountPin; // 0x158(0x8)
		TArray<FOptimusPinPairInfo> PinPairInfos; // 0x160(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_LoopTerminal");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_Resource
	// Inherited from UOptimusNode_ResourceAccessorBase -> UOptimusNode -> UObject
	// Size: 0x0 (0x188 - 0x188)
	class UOptimusNode_Resource : public UOptimusNode_ResourceAccessorBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_Resource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_SetResource
	// Inherited from UOptimusNode_ResourceAccessorBase -> UOptimusNode -> UObject
	// Size: 0x0 (0x188 - 0x188)
	class UOptimusNode_SetResource : public UOptimusNode_ResourceAccessorBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_SetResource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNode_SubGraphReference
	// Inherited from UOptimusNode -> UObject
	// Size: 0x30 (0x138 - 0x108)
	class UOptimusNode_SubGraphReference : public UOptimusNode	
	{
	public:
		unsigned char UnknownData00_3[0x18]; // 0x108(0x18) UNKNOWN PROPERTY
		FName SubgraphName; // 0x120(0x4)
		TWeakObjectPtr<UOptimusNodePin*> DefaultComponentPin; // 0x124(0x8)
		unsigned char UnknownData01_7[0xC]; // 0x12C(0xC) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNode_SubGraphReference");
			return ret;
		}
	};


	// Class OptimusCore.OptimusActionStack
	// Inherited from UObject
	// Size: 0xB8 (0xE0 - 0x28)
	class UOptimusActionStack : public UObject	
	{
	public:
		int32_t TransactedActionIndex; // 0x28(0x4)
		unsigned char UnknownData00_7[0xB4]; // 0x2C(0xB4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusActionStack");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComponentSourceBinding
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UOptimusComponentSourceBinding : public UObject	
	{
	public:
		FName BindingName; // 0x28(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		UClass* ComponentType; // 0x30(0x8)
		TArray<FName> ComponentTags; // 0x38(0x10)
		bool bIsPrimaryBinding; // 0x48(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComponentSourceBinding");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComputeGraph
	// Inherited from UComputeGraph -> UObject
	// Size: 0x10 (0xF0 - 0xE0)
	class UOptimusComputeGraph : public UComputeGraph	
	{
	public:
		TArray<TWeakObjectPtr> KernelToNode; // 0xE0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComputeGraph");
			return ret;
		}
	};


	// Class OptimusCore.OptimusComponentSourceBindingContainer
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusComponentSourceBindingContainer : public UObject	
	{
	public:
		TArray<UOptimusComponentSourceBinding*> Bindings; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusComponentSourceBindingContainer");
			return ret;
		}
	};


	// Class OptimusCore.OptimusVariableContainer
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusVariableContainer : public UObject	
	{
	public:
		TArray<UOptimusVariableDescription*> Descriptions; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusVariableContainer");
			return ret;
		}
	};


	// Class OptimusCore.OptimusResourceContainer
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusResourceContainer : public UObject	
	{
	public:
		TArray<UOptimusResourceDescription*> Descriptions; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusResourceContainer");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDeformer
	// Inherited from UMeshDeformer -> UObject
	// Size: 0x100 (0x128 - 0x28)
	class UOptimusDeformer : public UMeshDeformer	
	{
	public:
		unsigned char UnknownData00_3[0x20]; // 0x28(0x20) UNKNOWN PROPERTY
		USkeletalMesh* Mesh; // 0x48(0x8)
		TArray<FOptimusComputeGraphInfo> ComputeGraphs; // 0x50(0x10)
		UOptimusActionStack* ActionStack; // 0x60(0x8)
		EOptimusDeformerStatus Status; // 0x68(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x6C(0x4) UNKNOWN PROPERTY
		TArray<UOptimusNodeGraph*> Graphs; // 0x70(0x10)
		UOptimusComponentSourceBindingContainer* Bindings; // 0x80(0x8)
		UOptimusVariableContainer* Variables; // 0x88(0x8)
		UOptimusResourceContainer* Resources; // 0x90(0x8)
		unsigned char UnknownData02_7[0x90]; // 0x98(0x90) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDeformer");
			return ret;
		}

		TArray GetVariables(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EBC4(relative to base address)
		TArray GetResources(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EB48(relative to base address)
		UOptimusComponentSourceBinding GetPrimaryComponentBinding(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EB28(relative to base address)
		TArray GetComponentBindings(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144E9E8(relative to base address)
	};


	// Class OptimusCore.OptimusDeformerInstanceSettings
	// Inherited from UMeshDeformerInstanceSettings -> UObject
	// Size: 0x18 (0x40 - 0x28)
	class UOptimusDeformerInstanceSettings : public UMeshDeformerInstanceSettings	
	{
	public:
		TWeakObjectPtr<UOptimusDeformer*> Deformer; // 0x28(0x8)
		TArray<FOptimusDeformerInstanceComponentBinding> Bindings; // 0x30(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDeformerInstanceSettings");
			return ret;
		}
	};


	// Class OptimusCore.OptimusDeformerInstance
	// Inherited from UMeshDeformerInstance -> UObject
	// Size: 0xE0 (0x108 - 0x28)
	class UOptimusDeformerInstance : public UMeshDeformerInstance	
	{
	public:
		TWeakObjectPtr<UMeshComponent*> MeshComponent; // 0x28(0x8)
		TWeakObjectPtr<UOptimusDeformerInstanceSettings*> InstanceSettings; // 0x30(0x8)
		TArray<FOptimusDeformerInstanceExecInfo> ComputeGraphExecInfos; // 0x38(0x10)
		UOptimusVariableContainer* Variables; // 0x48(0x8)
		TArray<TWeakObjectPtr> WeakBoundComponents; // 0x50(0x10)
		TArray<TWeakObjectPtr> WeakComponentSources; // 0x60(0x10)
		unsigned char UnknownData00_7[0x98]; // 0x70(0x98) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusDeformerInstance");
			return ret;
		}

		bool SetVectorVariable(FName InVariableName, FVector& InValue); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144FAB8(relative to base address)
		bool SetVector4Variable(FName InVariableName, FVector4& InValue); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144F9CC(relative to base address)
		bool SetTransformVariable(FName InVariableName, FTransform& InValue); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144F874(relative to base address)
		bool SetIntVariable(FName InVariableName, int32_t InValue); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F7A0(relative to base address)
		bool SetFloatVariable(FName InVariableName, double InValue); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F630(relative to base address)
		bool SetBoolVariable(FName InVariableName, bool InValue); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F558(relative to base address)
		TArray GetVariables(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EBE4(relative to base address)
		bool EnqueueTriggerGraph(FName InTriggerGraphName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144E7FC(relative to base address)
	};


	// Class OptimusCore.OptimusNodeGraph
	// Inherited from UObject
	// Size: 0x68 (0x90 - 0x28)
	class UOptimusNodeGraph : public UObject	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		EOptimusNodeGraphType GraphType; // 0x30(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		TArray<UOptimusNode*> Nodes; // 0x38(0x10)
		TArray<UOptimusNodeLink*> Links; // 0x48(0x10)
		TArray<UOptimusNodePair*> NodePairs; // 0x58(0x10)
		TArray<UOptimusNodeGraph*> Subgraphs; // 0x68(0x10)
		unsigned char UnknownData02_7[0x18]; // 0x78(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeGraph");
			return ret;
		}

		bool RenameGraphDirect(UOptimusNodeGraph* InGraph, FString InNewName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F470(relative to base address)
		bool RenameGraph(UOptimusNodeGraph* InGraph, FString InNewName); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F388(relative to base address)
		bool RemoveNodes(TArray<UOptimusNode*>& InNodes); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF75144F2DC(relative to base address)
		bool RemoveNode(UOptimusNode* InNode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F21C(relative to base address)
		bool RemoveLink(UOptimusNodePin* InNodeOutputPin, UOptimusNodePin* InNodeInputPin); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144F0FC(relative to base address)
		bool RemoveAllLinks(UOptimusNodePin* InNodePin); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144EF4C(relative to base address)
		bool MoveGraphDirect(UOptimusNodeGraph* InGraph, int32_t InInsertBefore); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144EE88(relative to base address)
		bool IsSubGraphReference(UOptimusNode* InNode); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EDF0(relative to base address)
		bool IsKernelFunction(UOptimusNode* InNode); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144ED58(relative to base address)
		bool IsFunctionReference(UOptimusNode* InNode); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144ECCC(relative to base address)
		bool IsFunctionGraph(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144ECB4(relative to base address)
		bool IsExecutionGraph(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EC9C(relative to base address)
		bool IsCustomKernel(UOptimusNode* InNode); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EC04(relative to base address)
		EOptimusNodeGraphType GetGraphType(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF74C3345F8(relative to base address)
		TArray GetGraphs(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EAA0(relative to base address)
		int32_t GetGraphIndex(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const, Memory Exec: 0x7FF75144EA64(relative to base address)
		TArray ExpandCollapsedNodes(UOptimusNode* InGraphReferenceNode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144E8D4(relative to base address)
		bool DuplicateNodes(TArray<UOptimusNode*>& InNodes, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144E6C8(relative to base address)
		UOptimusNode DuplicateNode(UOptimusNode* InNode, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144E504(relative to base address)
		bool ConvertToSubGraph(UOptimusNode* InFunctionNode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144E474(relative to base address)
		bool ConvertToFunction(UOptimusNode* InSubGraphNode); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144E3E4(relative to base address)
		UOptimusNode ConvertFunctionToCustomKernel(UOptimusNode* InKernelFunction); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144E354(relative to base address)
		UOptimusNode ConvertCustomKernelToFunction(UOptimusNode* InCustomKernel); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144E2C4(relative to base address)
		UOptimusNode CollapseNodesToSubGraph(TArray<UOptimusNode*>& InNodes); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF75144E218(relative to base address)
		UOptimusNode CollapseNodesToFunction(TArray<UOptimusNode*>& InNodes); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable, Memory Exec: 0x7FF75144E18C(relative to base address)
		UOptimusNode AddVariableGetNode(UOptimusVariableDescription* InVariableDesc, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144E068(relative to base address)
		UOptimusNode AddValueNode(FOptimusDataTypeRef InDataTypeRef, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144DEDC(relative to base address)
		UOptimusNode AddResourceSetNode(UOptimusResourceDescription* InResourceDesc, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144DDB8(relative to base address)
		UOptimusNode AddResourceNode(UOptimusResourceDescription* InResourceDesc, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144DC94(relative to base address)
		UOptimusNode AddResourceGetNode(UOptimusResourceDescription* InResourceDesc, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144DB70(relative to base address)
		UOptimusNode AddNode(UClass* InNodeClass, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144DA6C(relative to base address)
		TArray AddLoopTerminalNodes(FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144D9C0(relative to base address)
		bool AddLink(UOptimusNodePin* InNodeOutputPin, UOptimusNodePin* InNodeInputPin); // Flags: Final|Native|Public|BlueprintCallable, Memory Exec: 0x7FF75144D8FC(relative to base address)
		UOptimusNode AddFunctionReferenceNode(TWeakObjectPtr<UOptimusFunctionNodeGraph*> InFunctionGraph, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144D7B4(relative to base address)
		UOptimusNode AddDataInterfaceNode(UClass* InDataInterfaceClass, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144D6C4(relative to base address)
		UOptimusNode AddComponentBindingGetNode(UOptimusComponentSourceBinding* InComponentBinding, FVector2D& InPosition); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable, Memory Exec: 0x7FF75144D5E8(relative to base address)
	};


	// Class OptimusCore.OptimusNodeSubGraph
	// Inherited from UOptimusNodeGraph -> UObject
	// Size: 0xB8 (0x148 - 0x90)
	class UOptimusNodeSubGraph : public UOptimusNodeGraph	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x90(0x8) UNKNOWN PROPERTY
		FOptimusParameterBindingArray InputBindings; // 0x98(0x10)
		FOptimusParameterBindingArray OutputBindings; // 0xA8(0x10)
		unsigned char UnknownData01_7[0x90]; // 0xB8(0x90) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeSubGraph");
			return ret;
		}
	};


	// Class OptimusCore.OptimusFunctionNodeGraph
	// Inherited from UOptimusNodeSubGraph -> UOptimusNodeGraph -> UObject
	// Size: 0x8 (0x150 - 0x148)
	class UOptimusFunctionNodeGraph : public UOptimusNodeSubGraph	
	{
	public:
		FName category; // 0x148(0x4)
		FName AccessSpecifier; // 0x14C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusFunctionNodeGraph");
			return ret;
		}

		TArray GetAccessSpecifierOptions(); // Flags: Final|Native|Public|Const, Memory Exec: 0x7FF75144E97C(relative to base address)
	};


	// Class OptimusCore.OptimusNodeLink
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusNodeLink : public UObject	
	{
	public:
		UOptimusNodePin* NodeOutputPin; // 0x28(0x8)
		UOptimusNodePin* NodeInputPin; // 0x30(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodeLink");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodePair
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UOptimusNodePair : public UObject	
	{
	public:
		UOptimusNode* First; // 0x28(0x8)
		UOptimusNode* Second; // 0x30(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodePair");
			return ret;
		}
	};


	// Class OptimusCore.OptimusNodePin
	// Inherited from UObject
	// Size: 0x68 (0x90 - 0x28)
	class UOptimusNodePin : public UObject	
	{
	public:
		bool bIsGroupingPin; // 0x28(0x1)
		EOptimusNodePinDirection Direction; // 0x29(0x1)
		EOptimusNodePinStorageType StorageType; // 0x2A(0x1)
		unsigned char UnknownData00_6[0x5]; // 0x2B(0x5) UNKNOWN PROPERTY
		FOptimusDataDomain DataDomain; // 0x30(0x40)
		FOptimusDataTypeRef DataType; // 0x70(0xC)
		unsigned char UnknownData01_6[0x4]; // 0x7C(0x4) UNKNOWN PROPERTY
		TArray<UOptimusNodePin*> SubPins; // 0x80(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusNodePin");
			return ret;
		}
	};


	// Class OptimusCore.OptimusResourceDescription
	// Inherited from UObject
	// Size: 0x60 (0x88 - 0x28)
	class UOptimusResourceDescription : public UObject	
	{
	public:
		FName ResourceName; // 0x28(0x4)
		FOptimusDataTypeRef DataType; // 0x2C(0xC)
		TWeakObjectPtr<UOptimusComponentSourceBinding*> ComponentBinding; // 0x38(0x8)
		FOptimusDataDomain DataDomain; // 0x40(0x40)
		UOptimusPersistentBufferDataInterface* DataInterface; // 0x80(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusResourceDescription");
			return ret;
		}
	};


	// Class OptimusCore.OptimusSource
	// Inherited from UComputeSource -> UObject
	// Size: 0x18 (0x50 - 0x38)
	class UOptimusSource : public UComputeSource	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x38(0x8) UNKNOWN PROPERTY
		FString SourceText; // 0x40(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusSource");
			return ret;
		}
	};


	// Class OptimusCore.OptimusValueContainerGeneratorClass
	// Inherited from UClass -> UStruct -> UField -> UObject
	// Size: 0x10 (0x210 - 0x200)
	class UOptimusValueContainerGeneratorClass : public UClass	
	{
	public:
		FOptimusDataTypeRef DataType; // 0x200(0xC)
		unsigned char UnknownData00_7[0x4]; // 0x20C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusValueContainerGeneratorClass");
			return ret;
		}
	};


	// Class OptimusCore.OptimusValueContainer
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UOptimusValueContainer : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusValueContainer");
			return ret;
		}
	};


	// Class OptimusCore.OptimusVariableDescription
	// Inherited from UObject
	// Size: 0x68 (0x90 - 0x28)
	class UOptimusVariableDescription : public UObject	
	{
	public:
		FGuid Guid; // 0x28(0x10)
		FName VariableName; // 0x38(0x4)
		FOptimusDataTypeRef DataType; // 0x3C(0xC)
		FOptimusValueContainerStruct DefaultValueStruct; // 0x48(0x10)
		FShaderValueContainer CachedShaderValue; // 0x58(0x20)
		TArray<char> ValueData; // 0x78(0x10)
		UOptimusValueContainer* DefaultValue; // 0x88(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/OptimusCore.OptimusVariableDescription");
			return ret;
		}
	};

}
