#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.10-CL-35815136
// Package: UI
// Current Base: 0x7FF745A60000, UFunctions offsets will be relative to this base address

namespace SDK
{

	// Class /Game/UI/Foundation/SoftwareCursors/ArrowCursorWidget.ArrowCursorWidget_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B0 - 0x2B0)
	class UArrowCursorWidget_C : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/SoftwareCursors/ArrowCursorWidget.ArrowCursorWidget_C");
			return ret;
		}

		FSlateBrush GetBackground(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/RichTextData/CommonUIRichTextData.CommonUIRichTextData_C
	// Inherited from UCommonUIRichTextData -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UCommonUIRichTextData_C : public UCommonUIRichTextData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/RichTextData/CommonUIRichTextData.CommonUIRichTextData_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base.TextStyle-Base_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base.TextStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-HeaderParent.TextStyle-HeaderParent_C
	// Inherited from UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-HeaderParent_C : public UTextStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-HeaderParent.TextStyle-HeaderParent_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M.TextStyle-Header-M_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M.TextStyle-Header-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-NavyBlue.TextStyle-Header-M-NavyBlue_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-NavyBlue_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-NavyBlue.TextStyle-Header-M-NavyBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Base.ButtonStyle-Base_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Base_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Base.ButtonStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-TextOnlyBase_Empty.ButtonStyle-TextOnlyBase_Empty_C
	// Inherited from UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-TextOnlyBase_Empty_C : public UButtonStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-TextOnlyBase_Empty.ButtonStyle-TextOnlyBase_Empty_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextScrollStyle-Base.TextScrollStyle-Base_C
	// Inherited from UCommonTextScrollStyle -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UTextScrollStyle-Base_C : public UCommonTextScrollStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextScrollStyle-Base.TextScrollStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Shell/windowchromebuttons.windowchromebuttons_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x2F8 - 0x2D8)
	class Uwindowchromebuttons_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UWidgetAnimation* FadeOut; // 0x2E0(0x8)
		UWidgetAnimation* FadeIn; // 0x2E8(0x8)
		UWindowTitleBarArea* WindowTitleBarArea; // 0x2F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Shell/windowchromebuttons.windowchromebuttons_C");
			return ret;
		}

		void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMouseLeave(FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_windowchromebuttons(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Lightbox/Lightbox.Lightbox_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x98 (0x370 - 0x2D8)
	class ULightbox_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UWidgetAnimation* FadeOut; // 0x2E0(0x8)
		UWidgetAnimation* FadeIn; // 0x2E8(0x8)
		UBorder* Border_Darken; // 0x2F0(0x8)
		UButton* ClickCatcher; // 0x2F8(0x8)
		UNamedSlot* Content; // 0x300(0x8)
		UBorder* Dimmer; // 0x308(0x8)
		USafeZone* SafeZone; // 0x310(0x8)
		UCommonVisibilityWidgetLegacy* WindowButtons; // 0x318(0x8)
		UOverlay* WindowsOverlay; // 0x320(0x8)
		Uwindowchromebuttons_C* WindowTitleBar; // 0x328(0x8)
		FMulticastInlineDelegate IntroEnded; // 0x330(0x10)
		FMulticastInlineDelegate OutroEnded; // 0x340(0x10)
		bool ShowWindowControlButtons; // 0x350(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x351(0x7) UNKNOWN PROPERTY
		double DimAmount; // 0x358(0x8)
		FLinearColor BackgroundColor; // 0x360(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Lightbox/Lightbox.Lightbox_C");
			return ret;
		}

		void RemoveContent(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AddContent(UCommonUserWidget* Content); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Outro(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Intro(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WidgetAnimationEvt_FadeIn_K2Node_WidgetAnimationEvent(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Lightbox(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OutroEnded__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IntroEnded__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Input/CommonUI_HoldData_Base.CommonUI_HoldData_Base_C
	// Inherited from UCommonUIHoldData -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UCommonUI_HoldData_Base_C : public UCommonUIHoldData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Input/CommonUI_HoldData_Base.CommonUI_HoldData_Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Utilities/EditableTextUtilities.EditableTextUtilities_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEditableTextUtilities_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Utilities/EditableTextUtilities.EditableTextUtilities_C");
			return ret;
		}

		void CheckIfNeedsTrimming(FText Text, int32_t Limit, UObject* __WorldContext, FText& TrimmedText, bool& WasTrimmed); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void LimitTextLength(UWidget* EditableTextWidget, int32_t Length, UObject* __WorldContext, bool& WasTrimmed); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/CloseButton.CloseButton_C
	// Inherited from UBacchusCloseButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x49 (0x1439 - 0x13F0)
	class UCloseButton_C : public UBacchusCloseButton	
	{
	public:
		UBorder* Border_Container; // 0x13F0(0x8)
		UImage* CloseIcon; // 0x13F8(0x8)
		USizeBox* SizeBox_Control; // 0x1400(0x8)
		UCommonTextBlock* Text_ButtonAction; // 0x1408(0x8)
		FText Button_Description; // 0x1410(0x10)
		bool FontSizeOveride; // 0x1420(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x1421(0x3) UNKNOWN PROPERTY
		int32_t FontSize; // 0x1424(0x4)
		FMargin Padding_Overide; // 0x1428(0x10)
		bool PaddingOveride; // 0x1438(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/CloseButton.CloseButton_C");
			return ret;
		}

		void SetText(FText Text); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleSize(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Modals/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C
	// Inherited from UFortConfirmationWindow -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x798 - 0x750)
	class UConfirmationWindow_C : public UFortConfirmationWindow	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x750(0x8)
		UWidgetAnimation* Intro; // 0x758(0x8)
		USizeBox* SizeBox; // 0x760(0x8)
		UCommonBorder* TapToCloseZone; // 0x768(0x8)
		UWBP_CaptureForPostBufferUpdate_C* WBP_CaptureForPostBufferUpdate; // 0x770(0x8)
		FLinearColor ButtonIconColor; // 0x778(0x10)
		USoundBase* IntroSound; // 0x788(0x8)
		USoundBase* OutroSound; // 0x790(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Modals/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C");
			return ret;
		}

		void Handle Configure Decline Button(UCommonButtonBase* New Button); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ConfigureConfirmationButton(UCommonButtonBase* Button, FConfirmationDialogAction& Action, bool bSimpleConfirm); // Flags: Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PlayShowSound(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEventReply TapToClose(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupNonInteractiveContent(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FDataTableRowHandle GetInputAction(FName RowName, bool UseInputAction); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Initialize(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginOutro(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ConfigureDeclineButton(UCommonButtonBase* Button); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ConfirmationWindow(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/MessageCenter/BasicNotification.BasicNotification_C
	// Inherited from UFortUINotification -> UObject
	// Size: 0x0 (0xF0 - 0xF0)
	class UBasicNotification_C : public UFortUINotification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MessageCenter/BasicNotification.BasicNotification_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/MessageCenter/BattlePassPageUnlockNotification.BattlePassPageUnlockNotification_C
	// Inherited from UFortUIBattlePassPageUnlockNotification -> UFortUINotification -> UObject
	// Size: 0x0 (0x110 - 0x110)
	class UBattlePassPageUnlockNotification_C : public UFortUIBattlePassPageUnlockNotification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MessageCenter/BattlePassPageUnlockNotification.BattlePassPageUnlockNotification_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/MessageCenter/FriendNotification.FriendNotification_C
	// Inherited from UFortUIFriendNotification -> UFortUINotification -> UObject
	// Size: 0x0 (0x138 - 0x138)
	class UFriendNotification_C : public UFortUIFriendNotification	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MessageCenter/FriendNotification.FriendNotification_C");
			return ret;
		}

		void JoinPartyInvite(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowFriendInvites(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-TabM.Border-TabM_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-TabM_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-TabM.Border-TabM_C");
			return ret;
		}
	};


	// Class /Game/UI/DamageText/Base/ImpactNumbers.ImpactNumbers_C
	// Inherited from AFortDamageNumbersActor -> AFortClientOnlyActor -> AActor -> UObject
	// Size: 0x8 (0x628 - 0x620)
	class AImpactNumbers_C : public AFortDamageNumbersActor	
	{
	public:
		USceneComponent* DefaultSceneRoot; // 0x620(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/DamageText/Base/ImpactNumbers.ImpactNumbers_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BaseParent.TextStyle-BaseParent_C
	// Inherited from UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BaseParent_C : public UTextStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BaseParent.TextStyle-BaseParent_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XXS-B.TextStyle-Base-XXS-B_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XXS-B_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XXS-B.TextStyle-Base-XXS-B_C");
			return ret;
		}
	};


	// Class /Game/UI/InGame/Mission/SpeechBubbleWidget.SpeechBubbleWidget_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2E8 - 0x2D8)
	class USpeechBubbleWidget_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UCommonTextBlock* BubbleText; // 0x2E0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/InGame/Mission/SpeechBubbleWidget.SpeechBubbleWidget_C");
			return ret;
		}

		void InitFromObject(UObject* InitObject); // Flags: Event|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SpeechBubbleWidget(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Items/ItemUIFunctionLibrary.ItemUIFunctionLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UItemUIFunctionLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Items/ItemUIFunctionLibrary.ItemUIFunctionLibrary_C");
			return ret;
		}

		void IsNullItem(UObject* ItemObject, UObject* __WorldContext, bool& Is Null Item); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Truncate Integer Value(int32_t Value, int32_t Min Fractional Digits, int32_t Max Fractional Digits, UObject* __WorldContext, FText& Formatted Value); // Flags: Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Convert Tier To Integer(EFortItemTier Tier, UObject* __WorldContext, int32_t& Numeric Tier); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ParseLevelRequiredFromString(FString InString, UObject* __WorldContext, int32_t& OutInt); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M.TextStyle-Base-M_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M.TextStyle-Base-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M-I.TextStyle-Base-M-I_C
	// Inherited from UTextStyle-Base-M_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M-I_C : public UTextStyle-Base-M_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M-I.TextStyle-Base-M-I_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M.TextStyle-Button-Primary-M_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M.TextStyle-Button-Primary-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M-Disabled.TextStyle-Button-Primary-M-Disabled_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M-Disabled_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M-Disabled.TextStyle-Button-Primary-M-Disabled_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton.TextStyle-MediumButton_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-MediumButton_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton.TextStyle-MediumButton_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_S.ItemCardPowerRatingTextStyle_S_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_S_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_S.ItemCardPowerRatingTextStyle_S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XL.ItemCardPowerRatingTextStyle_XL_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_XL_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XL.ItemCardPowerRatingTextStyle_XL_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XS.ItemCardPowerRatingTextStyle_XS_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_XS_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_XS.ItemCardPowerRatingTextStyle_XS_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S.TextStyle-Button-BottomBar-S_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-BottomBar-S_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S.TextStyle-Button-BottomBar-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S-Selected.TextStyle-Button-BottomBar-S-Selected_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-BottomBar-S-Selected_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-BottomBar-S-Selected.TextStyle-Button-BottomBar-S-Selected_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton-Disabled.TextStyle-MediumButton-Disabled_C
	// Inherited from UTextStyle-MediumButton_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-MediumButton-Disabled_C : public UTextStyle-MediumButton_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-MediumButton-Disabled.TextStyle-MediumButton-Disabled_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumBase.ButtonStyle-MediumBase_C
	// Inherited from UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-MediumBase_C : public UButtonStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumBase.ButtonStyle-MediumBase_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentNoCues.ButtonStyle-MediumTransparentNoCues_C
	// Inherited from UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-MediumTransparentNoCues_C : public UButtonStyle-MediumBase_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentNoCues.ButtonStyle-MediumTransparentNoCues_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S.TextStyle-Base-S_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S.TextStyle-Base-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B.TextStyle-Base-S-B_C
	// Inherited from UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B_C : public UTextStyle-Base-S_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B.TextStyle-Base-S-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue.TextStyle-Base-S-B-Blue_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Blue_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue.TextStyle-Base-S-B-Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-ToolTip-B.TextStyle-Base-ToolTip-B_C
	// Inherited from UTextStyle-Base-S-B-Blue_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-ToolTip-B_C : public UTextStyle-Base-S-B-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-ToolTip-B.TextStyle-Base-ToolTip-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-ToolTip-Body.TextStyle-Base-ToolTip-Body_C
	// Inherited from UTextStyle-Base-S-B-Blue_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-ToolTip-Body_C : public UTextStyle-Base-S-B-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-ToolTip-Body.TextStyle-Base-ToolTip-Body_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS.TextStyle-Base-XS_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS.TextStyle-Base-XS_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-40pc.TextStyle-Base-XS-40pc_C
	// Inherited from UTextStyle-Base-XS_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-40pc_C : public UTextStyle-Base-XS_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-40pc.TextStyle-Base-XS-40pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B.TextStyle-Base-XS-B_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B.TextStyle-Base-XS-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White.TextStyle_BurbSmBk_15_White_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_White_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White.TextStyle_BurbSmBk_15_White_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White50pc.TextStyle_BurbSmBk_15_White50pc_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_White50pc_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_White50pc.TextStyle_BurbSmBk_15_White50pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_DarkBlue.TextStyle_BurbSmBk_15_DarkBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_DarkBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_DarkBlue.TextStyle_BurbSmBk_15_DarkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_LightBlue.TextStyle_BurbSmBk_15_LightBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_LightBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_LightBlue.TextStyle_BurbSmBk_15_LightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-40pc.TextStyle-Base-S-B-40pc_C
	// Inherited from UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-40pc_C : public UTextStyle-Base-S_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-40pc.TextStyle-Base-S-B-40pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Clear.ButtonStyle-Clear_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Clear_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Clear.ButtonStyle-Clear_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_Red.TextStyle_BurbSmBk_15_Red_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_15_Red_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_15_Red.TextStyle_BurbSmBk_15_Red_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-Gray.TextStyle-Base-S-Gray_C
	// Inherited from UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-Gray_C : public UTextStyle-Base-S_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-Gray.TextStyle-Base-S-Gray_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Icon_Transparent.ButtonStyle-Icon_Transparent_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Icon_Transparent_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-Icon_Transparent.ButtonStyle-Icon_Transparent_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue-40.TextStyle-Base-S-B-Blue-40_C
	// Inherited from UTextStyle-Base-S-B-Blue_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Blue-40_C : public UTextStyle-Base-S-B-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Blue-40.TextStyle-Base-S-B-Blue-40_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-L.TextStyle-Base-L_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-L_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-L.TextStyle-Base-L_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-L-B.TextStyle-Base-L-B_C
	// Inherited from UTextStyle-Base-L_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-L-B_C : public UTextStyle-Base-L_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-L-B.TextStyle-Base-L-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M-B.TextStyle-Base-M-B_C
	// Inherited from UTextStyle-Base-M_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M-B_C : public UTextStyle-Base-M_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M-B.TextStyle-Base-M-B_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-M-B_Blue.TextStyle-Base-M-B_Blue_C
	// Inherited from UTextStyle-Base-M-B_C -> UTextStyle-Base-M_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-M-B_Blue_C : public UTextStyle-Base-M-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-M-B_Blue.TextStyle-Base-M-B_Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings.ButtonStyle-GamepadBindings_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-GamepadBindings_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings.ButtonStyle-GamepadBindings_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-Blue.TextStyle-Base-XS-Blue_C
	// Inherited from UTextStyle-Base-XS_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-Blue_C : public UTextStyle-Base-XS_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-Blue.TextStyle-Base-XS-Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B-DarkBlueFade.TextStyle-Base-XS-B-DarkBlueFade_C
	// Inherited from UTextStyle-Base-XS-Blue_C -> UTextStyle-Base-XS_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B-DarkBlueFade_C : public UTextStyle-Base-XS-Blue_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B-DarkBlueFade.TextStyle-Base-XS-B-DarkBlueFade_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray.TextStyle-Base-S-B-Gray_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Gray_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray.TextStyle-Base-S-B-Gray_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray50.TextStyle-Base-S-B-Gray50_C
	// Inherited from UTextStyle-Base-S-B-Gray_C -> UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-Gray50_C : public UTextStyle-Base-S-B-Gray_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-Gray50.TextStyle-Base-S-B-Gray50_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentWithCues.ButtonStyle-MediumTransparentWithCues_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-MediumTransparentWithCues_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-MediumTransparentWithCues.ButtonStyle-MediumTransparentWithCues_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Cyan.TextStyle-BurbankSmall-XS-Cyan_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BurbankSmall-XS-Cyan_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Cyan.TextStyle-BurbankSmall-XS-Cyan_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Gray.TextStyle-BurbankSmall-XS-Gray_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BurbankSmall-XS-Gray_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BurbankSmall-XS-Gray.TextStyle-BurbankSmall-XS-Gray_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_M.ItemCardPowerRatingTextStyle_M_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_M_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_M.ItemCardPowerRatingTextStyle_M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_L.ItemCardPowerRatingTextStyle_L_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UItemCardPowerRatingTextStyle_L_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Items/Parts/TextStyles/ItemCardPowerRatingTextStyle_L.ItemCardPowerRatingTextStyle_L_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-Blue.TextStyle-Header-M-Blue_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-Blue_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-Blue.TextStyle-Header-M-Blue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-L.TextStyle-Header-L_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-L_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-L.TextStyle-Header-L_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-XL.TextStyle-Header-XL_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-XL_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-XL.TextStyle-Header-XL_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-Yellow.TextStyle-Header-M-Yellow_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-Yellow_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-Yellow.TextStyle-Header-M-Yellow_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/Settings/ColorCalibration.ColorCalibration_C
	// Inherited from UFortColorCalibrationScreen -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x538 - 0x530)
	class UColorCalibration_C : public UFortColorCalibrationScreen	
	{
	public:
		UImage* InputBlocker; // 0x530(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/ColorCalibration.ColorCalibration_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C
	// Inherited from UFortFrontendItemViewSettingsManager -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UFrontendItemViewSettingsManager_C : public UFortFrontendItemViewSettingsManager	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/FrontendItemViewSettingsManager.FrontendItemViewSettingsManager_C");
			return ret;
		}

		void IsJunoBuilding(UFortItemDefinition* FortItemDefinition, bool& IsJunoBuilding); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool Is Hero or Previews on Hero(UFortItemDefinition* Item Definition, int32_t SubSlotIndex); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FFortItemViewSettings GetItemViewSettings(EFrontEndCamera Camera, ESubGame GameMode, UItemDefinitionBase* ItemDefinition, int32_t SubSlotIndex); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Main-Recolor.ButtonStyle-Tab-Main-Recolor_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Tab-Main-Recolor_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Main-Recolor.ButtonStyle-Tab-Main-Recolor_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-XL-BrightBlue.TextStyle-Header-XL-BrightBlue_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-XL-BrightBlue_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-XL-BrightBlue.TextStyle-Header-XL-BrightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower-XS.TextStyle-Header-HomeBasePower-XS_C
	// Inherited from UTextStyle-Header-L_C -> UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-HomeBasePower-XS_C : public UTextStyle-Header-L_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower-XS.TextStyle-Header-HomeBasePower-XS_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower.TextStyle-Header-HomeBasePower_C
	// Inherited from UTextStyle-Header-L_C -> UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-HomeBasePower_C : public UTextStyle-Header-L_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-HomeBasePower.TextStyle-Header-HomeBasePower_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/SocialPanelTab.SocialPanelTab_C
	// Inherited from UFortSocialTab -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x1458 - 0x1430)
	class USocialPanelTab_C : public UFortSocialTab	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1430(0x8)
		UWidgetAnimation* Unselected; // 0x1438(0x8)
		UWidgetAnimation* OnFriendsOnlineUpdated; // 0x1440(0x8)
		UWidgetAnimation* Hovered; // 0x1448(0x8)
		UWidgetAnimation* Selected; // 0x1450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanelTab.SocialPanelTab_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanelTab(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-ShellTopBar.Border-ShellTopBar_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ShellTopBar_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ShellTopBar.Border-ShellTopBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Movie/VideoPlayerWidget.VideoPlayerWidget_C
	// Inherited from UFortVideoPlayerWidget -> UFortUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3B8 - 0x3B8)
	class UVideoPlayerWidget_C : public UFortVideoPlayerWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Movie/VideoPlayerWidget.VideoPlayerWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-M-Horizon.TextStyle-Header-M-Horizon_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-M-Horizon_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-M-Horizon.TextStyle-Header-M-Horizon_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextScrollStyle-NoFade.TextScrollStyle-NoFade_C
	// Inherited from UCommonTextScrollStyle -> UObject
	// Size: 0x0 (0x40 - 0x40)
	class UTextScrollStyle-NoFade_C : public UCommonTextScrollStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextScrollStyle-NoFade.TextScrollStyle-NoFade_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/MainMenu/MainMenuButton.MainMenuButton_C
	// Inherited from UFortMainMenuButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x21 (0x1509 - 0x14E8)
	class UMainMenuButton_C : public UFortMainMenuButton	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x14E8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x14F0(0x8)
		UImage* Image_Icon_RightSide; // 0x14F8(0x8)
		USizeBox* SizeBox_Mobile; // 0x1500(0x8)
		bool ShowExternalLinkIcon; // 0x1508(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/MainMenu/MainMenuButton.MainMenuButton_C");
			return ret;
		}

		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRightSideIconColor(FLinearColor Color); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__UI_BigGoldButton_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateRightSideIcon(TWeakObjectPtr<UMaterialInterface*> SoftMaterial); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MainMenuButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_Error.ButtonStyle-Skew_Error_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Skew_Error_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_Error.ButtonStyle-Skew_Error_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-S_Gorse.TextStyle-Base-S-B-S_Gorse_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-S_Gorse_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-S_Gorse.TextStyle-Base-S-B-S_Gorse_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/Settings/OptionsMenuHeader.OptionsMenuHeader_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2D (0x305 - 0x2D8)
	class UOptionsMenuHeader_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UImage* Image; // 0x2E0(0x8)
		USizeBox* SizeBoxContainer; // 0x2E8(0x8)
		USpacer* SpacerBottom; // 0x2F0(0x8)
		UCommonTextBlock* TextHeader; // 0x2F8(0x8)
		int32_t FontSizeMobile; // 0x300(0x4)
		ESettingType LocalSettingType; // 0x304(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/OptionsMenuHeader.OptionsMenuHeader_C");
			return ret;
		}

		void SetFontSize(UCommonTextBlock* Text, int32_t DefaultSize, int32_t MobileSize); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePawnSet(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSize(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Center On Widget(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemSelectionChanged(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMouseLeave(FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnEntryReleased(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CenterOnWidget(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_OptionsMenuHeader(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/PowerRating/Border-PowerBar.Border-PowerBar_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-PowerBar_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/PowerRating/Border-PowerBar.Border-PowerBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Stats/HomebaseRatingBar.HomebaseRatingBar_C
	// Inherited from UFortMaterialProgressBar -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x3D8 - 0x3D8)
	class UHomebaseRatingBar_C : public UFortMaterialProgressBar	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Stats/HomebaseRatingBar.HomebaseRatingBar_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Stats/PowerRatingWidget.PowerRatingWidget_C
	// Inherited from UFortPlayerPowerRating -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8C (0x38C - 0x300)
	class UPowerRatingWidget_C : public UFortPlayerPowerRating	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x300(0x8)
		UCommonTextBlock* BaseRatingValue; // 0x308(0x8)
		UCommonTextBlock* BaseRatingValue_Large; // 0x310(0x8)
		UImage* BuffedRatingOuterGlow; // 0x318(0x8)
		UHomebaseRatingBar_C* HomebaseRatingBar; // 0x320(0x8)
		UImage* Image_Power; // 0x328(0x8)
		UCommonWidgetSwitcherLegacy* ModeTypeSwitcher; // 0x330(0x8)
		UVerticalBox* OversizedMode; // 0x338(0x8)
		UImage* PowerIconGlow; // 0x340(0x8)
		UImage* Rating_Glow_Large; // 0x348(0x8)
		USizeBox* RatingBar; // 0x350(0x8)
		UHorizontalBox* RegularMode; // 0x358(0x8)
		UCommonNumericTextBlock* TeamRatingValue; // 0x360(0x8)
		UCommonNumericTextBlock* TeamRatingValue_Large; // 0x368(0x8)
		bool ShowDualPower; // 0x370(0x1)
		bool ShowProgress; // 0x371(0x1)
		bool ShowGlow; // 0x372(0x1)
		bool UseLargeStyle; // 0x373(0x1)
		bool UseOversizedMode; // 0x374(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x375(0x3) UNKNOWN PROPERTY
		double InterpDuration; // 0x378(0x8)
		USoundBase* PowerIncreasedSound; // 0x380(0x8)
		int32_t Power_Rating_Num; // 0x388(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Stats/PowerRatingWidget.PowerRatingWidget_C");
			return ret;
		}

		void UpdateWidgetState(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBasePowerRatingUpdated(int32_t BasePowerRating); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTeamPowerRatingUpdated(int32_t TeamPowerRating); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTeamMembershipChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PowerRatingWidget(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Stats/Moonbeam_PowerRatingWidget.Moonbeam_PowerRatingWidget_C
	// Inherited from UFortPlayerPowerRating -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xB8 (0x3B8 - 0x300)
	class UMoonbeam_PowerRatingWidget_C : public UFortPlayerPowerRating	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x300(0x8)
		UCommonTextBlock* BaseRatingValue; // 0x308(0x8)
		UCommonTextBlock* BaseRatingValue_Large; // 0x310(0x8)
		UImage* BuffedRatingOuterGlow; // 0x318(0x8)
		UHomebaseRatingBar_C* HomebaseRatingBar; // 0x320(0x8)
		UImage* Image_Power; // 0x328(0x8)
		UCommonWidgetSwitcherLegacy* ModeTypeSwitcher; // 0x330(0x8)
		UImage* Moonbeam_Power_Back; // 0x338(0x8)
		UVerticalBox* OversizedMode; // 0x340(0x8)
		UImage* PowerIconGlow; // 0x348(0x8)
		UImage* Rating_Glow_Large; // 0x350(0x8)
		USizeBox* RatingBar; // 0x358(0x8)
		UHorizontalBox* RegularMode; // 0x360(0x8)
		UCommonNumericTextBlock* TeamRatingValue; // 0x368(0x8)
		UCommonNumericTextBlock* TeamRatingValue_Large; // 0x370(0x8)
		bool ShowDualPower; // 0x378(0x1)
		bool ShowProgress; // 0x379(0x1)
		bool ShowGlow; // 0x37A(0x1)
		bool UseLargeStyle; // 0x37B(0x1)
		bool UseOversizedMode; // 0x37C(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x37D(0x3) UNKNOWN PROPERTY
		double InterpDuration; // 0x380(0x8)
		USoundBase* PowerIncreasedSound; // 0x388(0x8)
		int32_t Power_Rating_Num; // 0x390(0x4)
		FLinearColor PowerBackingColor; // 0x394(0x10)
		FSlateColor FontColor; // 0x3A4(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Stats/Moonbeam_PowerRatingWidget.Moonbeam_PowerRatingWidget_C");
			return ret;
		}

		void SetBackgroundColor(FLinearColor NewColor); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateWidgetState(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBasePowerRatingUpdated(int32_t BasePowerRating); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTeamPowerRatingUpdated(int32_t TeamPowerRating); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTeamMembershipChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Moonbeam_PowerRatingWidget(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Right.ButtonStyle_PageChevron_Right_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_PageChevron_Right_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Right.ButtonStyle_PageChevron_Right_C");
			return ret;
		}
	};


	// Class /Game/UI/Sidebar/ListEntries/MultiActionConfirmationMenu.MultiActionConfirmationMenu_C
	// Inherited from UFortMultiFriendActionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x468 - 0x448)
	class UMultiActionConfirmationMenu_C : public UFortMultiFriendActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x448(0x8)
		UWidgetAnimation* Opened; // 0x450(0x8)
		UHorizontalBox* ConfirmationButtons; // 0x458(0x8)
		UCommonRichTextBlock* Text_ActionText; // 0x460(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Sidebar/ListEntries/MultiActionConfirmationMenu.MultiActionConfirmationMenu_C");
			return ret;
		}

		void UpdateText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionUpdated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOpenedAnimationFinished(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MultiActionConfirmationMenu(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_BlueMenuButton_Settings.Athena_ButtonStyle_BlueMenuButton_Settings_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UAthena_ButtonStyle_BlueMenuButton_Settings_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_BlueMenuButton_Settings.Athena_ButtonStyle_BlueMenuButton_Settings_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Primary/ButtonStyle-Primary-M.ButtonStyle-Primary-M_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Primary-M_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Primary/ButtonStyle-Primary-M.ButtonStyle-Primary-M_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/IconTextButton.IconTextButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x199 (0x1579 - 0x13E0)
	class UIconTextButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UCommonTextBlock* CenterButtonTextWidget; // 0x13E8(0x8)
		UBorder* ContentBorder; // 0x13F0(0x8)
		UHorizontalBox* HorizontalBox_ButtonContent; // 0x13F8(0x8)
		UImage* LeftSideImage; // 0x1400(0x8)
		UNamedSlot* RightExtraContentSlot; // 0x1408(0x8)
		FText ButtonText; // 0x1410(0x10)
		FSlateBrush IconBrush; // 0x1420(0xB0)
		UClass* ControllerInputStyle; // 0x14D0(0x8)
		UClass* MouseKeyboardStyle; // 0x14D8(0x8)
		TEnumAsByte<EHorizontalAlignment> ContentAlignment; // 0x14E0(0x1)
		bool bMouseKeyboardStyleSet; // 0x14E1(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x14E2(0x6) UNKNOWN PROPERTY
		FText OverrideButtonText; // 0x14E8(0x10)
		TEnumAsByte<ETextJustify> ButtonTextJustification; // 0x14F8(0x1)
		bool bDisplayAllCaps; // 0x14F9(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x14FA(0x6) UNKNOWN PROPERTY
		double PressProgress; // 0x1500(0x8)
		bool bIgnoreInputActionWidgetText; // 0x1508(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x1509(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate FocusChangedEvent; // 0x1510(0x10)
		FSlateFontInfo Font; // 0x1520(0x58)
		bool UseLightInput; // 0x1578(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/IconTextButton.IconTextButton_C");
			return ret;
		}

		void BindCommonInputSubsystem(bool bBind); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEventReply OnFocusReceived(FGeometry MyGeometry, FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetPressProgress(double& Progress); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Get Dynamic Material(UMaterialInstanceDynamic* Ret Material); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowIcon(bool bShouldShow); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTextInternal(FText InButtonText); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetInitialMouseKeyboardStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTextStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetContentAlignment(TEnumAsByte<EHorizontalAlignment> ContentAlignment); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateContentAlignment(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMouseKeyboardStyle(UClass* ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateStyle(bool UsingGamepad); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetControllerStyle(UClass* ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTextAndStyle(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeButton(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Icon(FSlateBrush IconBrush); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Text(FText ButtonText); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTriggeredInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionProgress(float HeldPercent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionComplete(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTriggeringInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__UI_BigGoldButton_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_IconTextButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FocusChangedEvent__DelegateSignature(bool HasFocus); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ScrollingTextButton.ScrollingTextButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xF3 (0x14D3 - 0x13E0)
	class UScrollingTextButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UCommonTextBlock* CenterButtonTextWidget; // 0x13E8(0x8)
		UBorder* ContentBorder; // 0x13F0(0x8)
		UImage* LeftSideImage; // 0x13F8(0x8)
		FText ButtonText; // 0x1400(0x10)
		FSlateBrush IconBrush; // 0x1410(0xB0)
		UClass* ControllerInputStyle; // 0x14C0(0x8)
		UClass* MouseKeyboardStyle; // 0x14C8(0x8)
		TEnumAsByte<EHorizontalAlignment> ContentAlignment; // 0x14D0(0x1)
		bool bMouseKeyboardStyleSet; // 0x14D1(0x1)
		bool UseLightInput; // 0x14D2(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ScrollingTextButton.ScrollingTextButton_C");
			return ret;
		}

		void SetInitialMouseKeyboardStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTextStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetContentAlignment(TEnumAsByte<EHorizontalAlignment> ContentAlignment); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateContentAlignment(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMouseKeyboardStyle(UClass* ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateStyle(bool UsingGamepad); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateText(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetControllerStyle(UClass* ControllerInputStyle); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTextAndStyle(bool bUsingGamepad); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeButton(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Icon(FSlateBrush IconBrush); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Text(FText ButtonText); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTriggeredInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionProgress(float HeldPercent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionComplete(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__UI_BigGoldButton_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ScrollingTextButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Modals/PlayerReporting/SocialBanModal.SocialBanModal_C
	// Inherited from UFortSocialBanModal -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x88 (0x5C0 - 0x538)
	class USocialBanModal_C : public UFortSocialBanModal	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x538(0x8)
		UCommonTextBlock* Disclaimer; // 0x540(0x8)
		UCommonTextBlock* Disclaimer; // 0x548(0x8)
		UCommonTextBlock* Disclaimer; // 0x550(0x8)
		UImage* Image_Severe; // 0x558(0x8)
		ULightbox_C* Lightbox; // 0x560(0x8)
		UCommonWidgetSwitcherLegacy* Switcher_Message; // 0x568(0x8)
		UCommonTextBlock* Title; // 0x570(0x8)
		UCommonTextBlock* Title; // 0x578(0x8)
		UImage* Triangles; // 0x580(0x8)
		UImage* Triangles; // 0x588(0x8)
		UImage* Triangles; // 0x590(0x8)
		UVerticalBox* VBox_Banned; // 0x598(0x8)
		UVerticalBox* VBox_Warned; // 0x5A0(0x8)
		UWidgetSwitcher* WidgetSwitcher_SeverityImage; // 0x5A8(0x8)
		FMulticastInlineDelegate OnCloseSucceeded; // 0x5B0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Modals/PlayerReporting/SocialBanModal.SocialBanModal_C");
			return ret;
		}

		void OnDisplayModeSet(bool bIsBanned); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialBanModal(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCloseSucceeded__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-ToolTipShadow.Border-SolidBG-ToolTipShadow_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-ToolTipShadow_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-ToolTipShadow.Border-SolidBG-ToolTipShadow_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-ToolTip.Border-SolidBG-ToolTip_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-ToolTip_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-ToolTip.Border-SolidBG-ToolTip_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA0 (0x378 - 0x2D8)
	class UXpBarToolTip_C : public UCommonUserWidget	
	{
	public:
		UCommonTextBlock* CommonTextBlock; // 0x2D8(0x8)
		UCommonTextBlock* CommonTextBlock; // 0x2E0(0x8)
		UCommonTextBlock* CommonTextBlock; // 0x2E8(0x8)
		UCommonTextBlock* CommonTextBlock; // 0x2F0(0x8)
		UCommonTextBlock* CommonTextBlock; // 0x2F8(0x8)
		UImage* Image; // 0x300(0x8)
		UImage* Image; // 0x308(0x8)
		UImage* Image; // 0x310(0x8)
		UImage* Image; // 0x318(0x8)
		UImage* Image; // 0x320(0x8)
		FText HeaderText; // 0x328(0x10)
		FText CommanderXPText; // 0x338(0x10)
		FText BoostXPText; // 0x348(0x10)
		FText RestedXPText; // 0x358(0x10)
		FText BodyText; // 0x368(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/XpBar/XpBarToolTip.XpBarToolTip_C");
			return ret;
		}

		FText GetBodyText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText GetRestedXPText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText GetBoostXPText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText GetCommanderXPText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText GetHeaderText(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Tooltips/Tooltip-Custom-S.Tooltip-Custom-S_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x318 - 0x2B0)
	class UTooltip-Custom-S_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UImage* _hr_; // 0x2B8(0x8)
		UHorizontalBox* Body_HBox; // 0x2C0(0x8)
		UNamedSlot* Content_Slot; // 0x2C8(0x8)
		UHorizontalBox* Header_HBox; // 0x2D0(0x8)
		UImage* Icon_Header; // 0x2D8(0x8)
		USpacer* Spacer_Header; // 0x2E0(0x8)
		USpacer* Spacer_Icon; // 0x2E8(0x8)
		UTextBlock* Text_Header; // 0x2F0(0x8)
		FText HeaderText; // 0x2F8(0x10)
		USlateBrushAsset* Icon_Brush; // 0x308(0x8)
		UUserWidget* ContentWidget; // 0x310(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Tooltips/Tooltip-Custom-S.Tooltip-Custom-S_C");
			return ret;
		}

		FSlateBrush Get Icon Brush(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText Get Header Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText Get Body Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Tooltip-Custom-S(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Tooltips/Tooltip-Basic-S.Tooltip-Basic-S_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x350 - 0x2D8)
	class UTooltip-Basic-S_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UImage* _hr_; // 0x2E0(0x8)
		UHorizontalBox* Body_HBox; // 0x2E8(0x8)
		UHorizontalBox* Header_HBox; // 0x2F0(0x8)
		UImage* Icon_Header; // 0x2F8(0x8)
		USpacer* Spacer_Icon; // 0x300(0x8)
		UCommonTextBlock* Text_Body; // 0x308(0x8)
		UCommonTextBlock* Text_Header; // 0x310(0x8)
		FText BodyText; // 0x318(0x10)
		FText HeaderText; // 0x328(0x10)
		USlateBrushAsset* Icon_Brush; // 0x338(0x8)
		UClass* Body_Style; // 0x340(0x8)
		UClass* Header_Style; // 0x348(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Tooltips/Tooltip-Basic-S.Tooltip-Basic-S_C");
			return ret;
		}

		FSlateBrush Get Icon Brush(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText Get Header Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FText Get Body Text(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Tooltip-Basic-S(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Tooltips/TooltipLibrary.TooltipLibrary_C
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTooltipLibrary_C : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Tooltips/TooltipLibrary.TooltipLibrary_C");
			return ret;
		}

		void CreateXPTooltip(APlayerController* Owner, FText Header, FText CommanderXP, FText BoostXP, FText RestXp, FText Body, UObject* __WorldContext, UCommonUserWidget* Out); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Create Compare Item Tooltip(APlayerController* Owning Player, FText Header Text, USlateBrushAsset* Header Icon, UFortItem* Item, UFortItem* ComparedItem, UObject* __WorldContext, UWidget* Return Value); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Create Item Tooltip(APlayerController* Owning Player, FText Header Text, USlateBrushAsset* Header Icon, UFortItem* Item, int32_t OverrideQuantity, UObject* __WorldContext, UWidget* Return Value); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Enabled And Tooltip Text(UWidget* Widget, bool Enabled, FText Tooltip Text, UObject* __WorldContext); // Flags: Static|Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Create Custom Tooltip(APlayerController* Owning Player, FText Header Text, USlateBrushAsset* Icon Brush, UUserWidget* Widget, UObject* __WorldContext, UUserWidget* Output); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Create Basic Tooltip(APlayerController* Owning Player, FText Body Text, FText Header Text, USlateBrushAsset* Icon Brush, UClass* Header Style, UClass* Body Style, UObject* __WorldContext, UUserWidget* Output); // Flags: Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Radio/ButtonStyle-Primary-Radio-M.ButtonStyle-Primary-Radio-M_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Primary-Radio-M_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Radio/ButtonStyle-Primary-Radio-M.ButtonStyle-Primary-Radio-M_C");
			return ret;
		}
	};


	// Class /Game/UI/RadioButtonGroup/FortRadioButtonGroup.FortRadioButtonGroup_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x318 - 0x2B0)
	class UFortRadioButtonGroup_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		USizeBox* SizeBox_Buttons; // 0x2B8(0x8)
		UVerticalBox* VerticalBox_Buttons; // 0x2C0(0x8)
		TArray<FFortRadioButtonItemStruct> Buttons; // 0x2C8(0x10)
		TArray<UIconTextButton_C*> CreatedButtons; // 0x2D8(0x10)
		FMulticastInlineDelegate RadioButtonClicked_Event; // 0x2E8(0x10)
		double WidthOverride; // 0x2F8(0x8)
		UCommonButtonGroupLegacy* CreatedButtonsGroup; // 0x300(0x8)
		UClass* CommonButtonGroup; // 0x308(0x8)
		double HeightOverride; // 0x310(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/RadioButtonGroup/FortRadioButtonGroup.FortRadioButtonGroup_C");
			return ret;
		}

		void CenterOnWidget(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnButtonClicked_Bind(UCommonButtonLegacy* AssociatedButton, int32_t ButtonIndex); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateButtons(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FortRadioButtonGroup(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RadioButtonClicked_Event__DelegateSignature(int32_t SelectedIndex); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Settings/OptionsMenuSetting.OptionsMenuSetting_C
	// Inherited from UFortOptionsMenuSetting -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x80 (0x3C8 - 0x348)
	class UOptionsMenuSetting_C : public UFortOptionsMenuSetting	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x348(0x8)
		UButton* Button; // 0x350(0x8)
		UIconTextButton_C* ButtonTouchTooltip; // 0x358(0x8)
		UHorizontalBox* HorizontalBox_Right; // 0x360(0x8)
		UMenuAnchor* MenuAnchorSettingDescription; // 0x368(0x8)
		USizeBox* SizeBoxContainer; // 0x370(0x8)
		USizeBox* SizeBoxLabel; // 0x378(0x8)
		UImage* SliderBackground; // 0x380(0x8)
		UCommonTextBlock* SliderText; // 0x388(0x8)
		UCommonTextBlock* SliderValue; // 0x390(0x8)
		USpacer* Spacer_Right; // 0x398(0x8)
		USpacer* SpacerBottom; // 0x3A0(0x8)
		UMaterialInstanceDynamic* Slider_Texture; // 0x3A8(0x8)
		TEnumAsByte<ERoundingMode> RoundingMode; // 0x3B0(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x3B1(0x7) UNKNOWN PROPERTY
		FVector2D ToolTipSizeMobile; // 0x3B8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/OptionsMenuSetting.OptionsMenuSetting_C");
			return ret;
		}

		void SetFontSize(UCommonTextBlock* Text, int32_t DefaulFontSize, int32_t MobileFont); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Visuals_BP(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ConvertSettingsValueToSliderValue(double SettingsValue, double& SliderValue); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSliderTexture(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ConvertSliderValueToSettingsValue(double SliderValue, double& SettingsValue); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetSliderTextRenderScale(double Scale Normalized); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Hide Tooltip(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Show Tooltip(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UUserWidget OnGetUserMenuContent(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePawnSet(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateSize(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_86_OnMouseCaptureEndEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_107_OnControllerCaptureEndEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature(float Value); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuSlider_K2Node_ComponentBoundEvent_124_OnFloatValueChangedEvent__DelegateSignature(float Value); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnEntryReleased(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMouseLeave(FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Refresh(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemSelectionChanged(bool bIsSelected); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateVisuals(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_OptionsMenuSetting(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/PanelButton.PanelButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1430 - 0x13E0)
	class UPanelButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UNamedSlot* ContentSlot; // 0x13E8(0x8)
		UClass* ControllerInputStyle; // 0x13F0(0x8)
		UClass* MouseKeyboardStyle; // 0x13F8(0x8)
		TEnumAsByte<EHorizontalAlignment> InputActionHorizontalAlignment; // 0x1400(0x1)
		TEnumAsByte<EVerticalAlignment> InputActionVerticalAlignment; // 0x1401(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x1402(0x6) UNKNOWN PROPERTY
		FVector2D InputActionRenderTranslation; // 0x1408(0x10)
		bool InputActionUseRimBrush; // 0x1418(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1419(0x7) UNKNOWN PROPERTY
		FVector2D InputActionRimBrushSize; // 0x1420(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/PanelButton.PanelButton_C");
			return ret;
		}

		void UpdateInputActionLayout(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateStyle(bool bUsingGamepad); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeButton(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTextAndStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTriggeredInputActionChanged(FDataTableRowHandle& NewTriggeredAction); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionProgress(float HeldPercent); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionComplete(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PanelButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-RotatorBorder.ButtonStyle-RotatorBorder_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-RotatorBorder_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-RotatorBorder.ButtonStyle-RotatorBorder_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextRotatorWhite.TextRotatorWhite_C
	// Inherited from UCommonRotator -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x1410 - 0x13F8)
	class UTextRotatorWhite_C : public UCommonRotator	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x13F8(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1400(0x8)
		UCommonBorder* MainBorder; // 0x1408(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextRotatorWhite.TextRotatorWhite_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_TextRotatorWhite(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Profile/PlayerBanner.PlayerBanner_C
	// Inherited from UFortAccountWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x388 - 0x310)
	class UPlayerBanner_C : public UFortAccountWidgetBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x8)
		UImage* BannerImage; // 0x318(0x8)
		UCommonLoadGuard* LoadGuard; // 0x320(0x8)
		UImage* SurroundImage; // 0x328(0x8)
		UCommonLoadGuard* SurroundLoadGuard; // 0x330(0x8)
		bool bUseLargeTexture; // 0x338(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x339(0x7) UNKNOWN PROPERTY
		FUniqueNetIdRepl OwnerNetId; // 0x340(0x30)
		FName CurrentBannerColorId; // 0x370(0x4)
		FName CurrentBannerIconId; // 0x374(0x4)
		bool SurroundEnabled; // 0x378(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x379(0x7) UNKNOWN PROPERTY
		UMaterialInterface* BannerMaterialInstance; // 0x380(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Profile/PlayerBanner.PlayerBanner_C");
			return ret;
		}

		void Update Material Instance(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UnbindDelegates(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupSurround(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBannerIconAndColorFromProfile(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBannerIconAndColor(FName IconId, FName ColorId); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ToggleBannerMask(bool Enable); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RefreshSurround(int32_t Level); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSurroundIconLoaded(UObject* LoadedObject); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void EnableSurround(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearBannerState(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBannerIconLoaded(UObject* LoadedObject); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetBannerMID(UMaterialInstanceDynamic* BannerMID); // Flags: Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBannerOwner(FUniqueNetIdRepl OwnerId); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBannerColorId(FName InBannerColorId); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBannerIconId(FName InBannerIconId); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetBannerImage(FFortHomeBaseInfo Image info, bool& Success); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Account Info Changed(FFortPublicAccountInfo NewInfo); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerBanner(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_SocialInteraction.ButtonStyle-Skew_SocialInteraction_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Skew_SocialInteraction_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Skew/ButtonStyle-Skew_SocialInteraction.ButtonStyle-Skew_SocialInteraction_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Input/KeybindWidget.KeybindWidget_C
	// Inherited from UFortKeybindWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0xB20 - 0xB10)
	class UKeybindWidget_C : public UFortKeybindWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xB10(0x8)
		UImage* Image_Preview; // 0xB18(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Input/KeybindWidget.KeybindWidget_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_KeybindWidget(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/GamepadInfoSelectorPanel_v3.GamepadInfoSelectorPanel_v3_C
	// Inherited from UFortGamePadInfoSelectorPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xC8 (0x628 - 0x560)
	class UGamepadInfoSelectorPanel_v3_C : public UFortGamePadInfoSelectorPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x560(0x8)
		UCommonBorder* CommonBorder_Reset; // 0x568(0x8)
		UFortRadioButtonGroup_C* FortRadioButtonGroup_Configs; // 0x570(0x8)
		UFortRadioButtonGroup_C* FortRadioButtonGroup_Platforms; // 0x578(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_Reset1; // 0x580(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_Reset2; // 0x588(0x8)
		UKeybindWidget_C* KeybindWidget_Reset; // 0x590(0x8)
		UOptionsMenuHeader_C* OptionsMenuHeader_Configs; // 0x598(0x8)
		UOptionsMenuHeader_C* OptionsMenuHeader_Platforms; // 0x5A0(0x8)
		UButton* ResetButton; // 0x5A8(0x8)
		UVerticalBox* VerticalBox_Platforms; // 0x5B0(0x8)
		FDataTableRowHandle Back; // 0x5B8(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorBack; // 0x5C8(0x10)
		FDataTableRowHandle Apply; // 0x5D8(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorApply; // 0x5E8(0x10)
		FDataTableRowHandle Reset; // 0x5F8(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorReset; // 0x608(0x10)
		FMulticastInlineDelegate GamepadInfoSelectorFocus; // 0x618(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/GamepadInfoSelectorPanel_v3.GamepadInfoSelectorPanel_v3_C");
			return ret;
		}

		UWidget BP_GetDesiredFocusTarget(); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleReset(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleApply(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleBack(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAddedToFocusPath(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ResetButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GamepadInfoSelectorPanel_v3(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadInfoSelectorFocus__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadInfoSelectorReset__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadInfoSelectorApply__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadInfoSelectorBack__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-MainL.Border-MainL_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-MainL_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-MainL.Border-MainL_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-MainModal.Border-MainModal_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-MainModal_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-MainModal.Border-MainModal_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-ModalHeader.Border-ModalHeader_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ModalHeader_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ModalHeader.Border-ModalHeader_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border_LightBlue_VGrad.Border_LightBlue_VGrad_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder_LightBlue_VGrad_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border_LightBlue_VGrad.Border_LightBlue_VGrad_C");
			return ret;
		}
	};


	// Class /Game/UI/Frontend/Settings/Deadzone/DeadzoneAdjustment.DeadzoneAdjustment_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x29 (0x2D9 - 0x2B0)
	class UDeadzoneAdjustment_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UImage* Deadzone_Adjustment; // 0x2B8(0x8)
		UOptionsMenuSetting_C* Deadzone_Adjustment_Slider; // 0x2C0(0x8)
		UImage* Deadzone_Max; // 0x2C8(0x8)
		UIconTextButton_C* ResetButton; // 0x2D0(0x8)
		ESettingType SettingType; // 0x2D8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/Deadzone/DeadzoneAdjustment.DeadzoneAdjustment_C");
			return ret;
		}

		UWidget DoCustomNavigation(EUINavigation Navigation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnValueChanged_Bind(float Value); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_DeadzoneAdjustment(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-ItemInfo-Unlocked.Border-ItemInfo-Unlocked_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ItemInfo-Unlocked_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ItemInfo-Unlocked.Border-ItemInfo-Unlocked_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-ItemInfo-Locked.Border-ItemInfo-Locked_C
	// Inherited from UBorder-ItemInfo-Unlocked_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-ItemInfo-Locked_C : public UBorder-ItemInfo-Unlocked_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-ItemInfo-Locked.Border-ItemInfo-Locked_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-Bottom-Box-Rounded-DkBlue.Border-Bottom-Box-Rounded-DkBlue_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-Bottom-Box-Rounded-DkBlue_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-Bottom-Box-Rounded-DkBlue.Border-Bottom-Box-Rounded-DkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Border/Border-Bang.Border-Bang_C
	// Inherited from UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-Bang_C : public UCommonBorderStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-Bang.Border-Bang_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Bangs/NormalBangWrapper.NormalBangWrapper_C
	// Inherited from UFortBangWrapper_NUI -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x82 (0x372 - 0x2F0)
	class UNormalBangWrapper_C : public UFortBangWrapper_NUI	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2F0(0x8)
		UWidgetAnimation* IntroSuperBang; // 0x2F8(0x8)
		UWidgetAnimation* Intro; // 0x300(0x8)
		UWidgetAnimation* TutorialGlow; // 0x308(0x8)
		USizeBox* BangBox; // 0x310(0x8)
		USizeBox* BigBang; // 0x318(0x8)
		USizeBox* BigBangCount; // 0x320(0x8)
		UCommonTextBlock* CommonTextBlock; // 0x328(0x8)
		UNamedSlot* Content; // 0x330(0x8)
		UCommonTextBlock* CountText; // 0x338(0x8)
		UWidgetSwitcher* ModeSwitcher; // 0x340(0x8)
		USizeBox* SmallBang; // 0x348(0x8)
		USizeBox* SmallBangCount; // 0x350(0x8)
		USizeBox* SuperBang; // 0x358(0x8)
		UCommonBorder* TutorialBorder; // 0x360(0x8)
		bool UseSmallVersion; // 0x368(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x369(0x3) UNKNOWN PROPERTY
		int32_t Count; // 0x36C(0x4)
		bool bUseSuperBangNoCount; // 0x370(0x1)
		bool ShouldSuppressBang; // 0x371(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Bangs/NormalBangWrapper.NormalBangWrapper_C");
			return ret;
		}

		void SetShouldSuppressBang(bool ShouldSuppressBang); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitialReset(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerReset(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TriggerIntro(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Adjust Bang Image Translation(FVector2D Translation); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Bang Icon Version(int32_t InCount); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTutorialBorderStyle(UClass* BorderStyle); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStopCallout(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnStartCallout(FName TutorialObjectiveName, ETutorialType TutorialType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBangStateChanged(bool bEnabled, int32_t Count); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_NormalBangWrapper(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/IconTabButton_Legacy.IconTabButton_Legacy_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x150 (0x1530 - 0x13E0)
	class UIconTabButton_Legacy_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UNormalBangWrapper_C* BangWrapper; // 0x13E8(0x8)
		UCommonTextBlock* CenterButtonTextWidget; // 0x13F0(0x8)
		UHorizontalBox* ContentHB; // 0x13F8(0x8)
		UImage* LeftSideImage; // 0x1400(0x8)
		USizeBox* SizeBoxShell; // 0x1408(0x8)
		FText ButtonText; // 0x1410(0x10)
		FSlateBrush IconBrush; // 0x1420(0xB0)
		bool UseText; // 0x14D0(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x14D1(0x3) UNKNOWN PROPERTY
		FLinearColor SelectedIconTint; // 0x14D4(0x10)
		FLinearColor DeselectedIconTint; // 0x14E4(0x10)
		FLinearColor HoveredIconTint; // 0x14F4(0x10)
		bool bBangEnabled; // 0x1504(0x1)
		bool ChangeIconColorWhenSelected; // 0x1505(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x1506(0x2) UNKNOWN PROPERTY
		FSlateColor SelectedIconColor; // 0x1508(0x14)
		FSlateColor UnSelectedIconColor; // 0x151C(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/IconTabButton_Legacy.IconTabButton_Legacy_C");
			return ret;
		}

		void Play Hover Sound(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetChangeIconColorWhenSelected(bool ChangeColorWhenSelected, FSlateColor SelectedColor, FSlateColor UnselectedColor); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Bang State(bool bBangEnabled, int32_t Count); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTutorialBorderStyle(UClass* BorderStyle); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowText(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Icon(FSlateBrush IconBrush); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Text(FText ButtonText); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_IconTabButton_Legacy(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Manage.ButtonStyle-Tab-Manage_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-Tab-Manage_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Tab/ButtonStyle-Tab-Manage.ButtonStyle-Tab-Manage_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings_NonInteractable.ButtonStyle-GamepadBindings_NonInteractable_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-GamepadBindings_NonInteractable_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle-GamepadBindings_NonInteractable.ButtonStyle-GamepadBindings_NonInteractable_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/GamepadKeyTextButton.GamepadKeyTextButton_C
	// Inherited from UFortGamepadCustomListItem -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA8 (0x1498 - 0x13F0)
	class UGamepadKeyTextButton_C : public UFortGamepadCustomListItem	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UKeybindWidget_C* BoundKey; // 0x13F8(0x8)
		UBorder* ContentBorder; // 0x1400(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_Desc; // 0x1408(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_NoKey; // 0x1410(0x8)
		USizeBox* SizeBox_Nokey; // 0x1418(0x8)
		FText ButtonText; // 0x1420(0x10)
		UClass* ControllerInputStyle; // 0x1430(0x8)
		TEnumAsByte<EHorizontalAlignment> ContentAlignment; // 0x1438(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x1439(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate ChangeTheBinding_Button; // 0x1440(0x10)
		FName ActionNameData; // 0x1450(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x1454(0x4) UNKNOWN PROPERTY
		FKey KeyData; // 0x1458(0x18)
		FText TextData; // 0x1470(0x10)
		FKey KeyNone; // 0x1480(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/GamepadKeyTextButton.GamepadKeyTextButton_C");
			return ret;
		}

		void SetNonInteractableStyle(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetContentAlignment(TEnumAsByte<EHorizontalAlignment> ContentAlignment); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateContentAlignment(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetData(FKey Key, FText DescText, FName ActionName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetDataAndUpdateButton(FKey Key, FText DescText, FName ActionName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateButton(UGamepadKeyTextButton_C* Button); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTabLabelInfo(FFortTabButtonLabelInfo& TabLabelInfo); // Flags: Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GamepadKeyTextButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChangeTheBinding_Button__DelegateSignature(FName ActionName, FKey Key); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C
	// Inherited from UFortGamePadCustomActionSelectorPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xB8 (0x618 - 0x560)
	class UGamepadCustomActionSelectorPanel_v3_C : public UFortGamePadCustomActionSelectorPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x560(0x8)
		UButton* Button_Clear; // 0x568(0x8)
		UCommonBorder* CommonBorder_Clear; // 0x570(0x8)
		UCommonListView* CommonListView_GamepadActions; // 0x578(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_Clear1; // 0x580(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_Clear2; // 0x588(0x8)
		UKeybindWidget_C* KeybindWidget_Clear; // 0x590(0x8)
		UOptionsMenuHeader_C* OptionsMenuHeader; // 0x598(0x8)
		FDataTableRowHandle Back; // 0x5A0(0x10)
		FMulticastInlineDelegate CustomActionSelected; // 0x5B0(0x10)
		TArray<UFortOptionsMenuInputData*> CurrentInputData; // 0x5C0(0x10)
		FMulticastInlineDelegate CustomClosedUsingBack; // 0x5D0(0x10)
		FMulticastInlineDelegate CustomClearButton; // 0x5E0(0x10)
		FKey KeyNone; // 0x5F0(0x18)
		FDataTableRowHandle Clear; // 0x608(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C");
			return ret;
		}

		void HandleClear(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CreateCustomListItem(FName ActionName, EFortInputActionGroup InputActionGroup, UGamepadKeyTextButton_C* ReturnItem); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleBack(bool& Passthrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdatePanel(TArray<UFortOptionsMenuInputData*>& InputData); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemClicked_Bind(UObject* Item); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__Button_Clear_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GamepadCustomActionSelectorPanel_v3(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomClearButton__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomClosedUsingBack__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomActionSelected__DelegateSignature(int32_t SelectedIndex, FName ActionName); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-StatItem.Border-SolidBG-StatItem_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-StatItem_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-StatItem.Border-SolidBG-StatItem_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/SoloButton.SoloButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x62 (0x1442 - 0x13E0)
	class USoloButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation* Pressed; // 0x13E8(0x8)
		UWidgetAnimation* Hover; // 0x13F0(0x8)
		UBorder* Border_Container; // 0x13F8(0x8)
		UImage* ButtonBacking; // 0x1400(0x8)
		USizeBox* SizeBox_Control; // 0x1408(0x8)
		UCommonTextBlock* Text_ButtonAction; // 0x1410(0x8)
		FText Button_Description; // 0x1418(0x10)
		bool FontSizeOveride; // 0x1428(0x1)
		unsigned char UnknownData00_6[0x3]; // 0x1429(0x3) UNKNOWN PROPERTY
		int32_t FontSize; // 0x142C(0x4)
		FMargin Padding_Overide; // 0x1430(0x10)
		bool PaddingOveride; // 0x1440(0x1)
		bool IsDisabled; // 0x1441(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/SoloButton.SoloButton_C");
			return ret;
		}

		void SetText(FText Text); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleSize(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnClicked(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SoloButton(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Border/Border-SolidBG-ShellBlue.Border-SolidBG-ShellBlue_C
	// Inherited from UBorder-ShellTopBar_C -> UCommonBorderStyle -> UObject
	// Size: 0x0 (0xE0 - 0xE0)
	class UBorder-SolidBG-ShellBlue_C : public UBorder-ShellTopBar_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Border/Border-SolidBG-ShellBlue.Border-SolidBG-ShellBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/TabbedView/HorizontalTabList_Legacy.HorizontalTabList_Legacy_C
	// Inherited from UFortTabListWidgetBase_Legacy -> UCommonTabListWidgetLegacy -> UCommonTabListWidgetBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA0 (0x5A0 - 0x500)
	class UHorizontalTabList_Legacy_C : public UFortTabListWidgetBase_Legacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x500(0x8)
		UImage* ImageGamepadKeyPrompt; // 0x508(0x8)
		UImage* ImageHorizRule; // 0x510(0x8)
		UCommonActionWidget* NextTabAction; // 0x518(0x8)
		USizeBox* NextTabActionWrapper; // 0x520(0x8)
		UOverlay* Overlay_Container; // 0x528(0x8)
		UCommonActionWidget* PreviousTabAction; // 0x530(0x8)
		USizeBox* PreviousTabActionWrapper; // 0x538(0x8)
		UHorizontalBox* TabButtonBox; // 0x540(0x8)
		FMargin TabButtonPadding; // 0x548(0x10)
		UClass* ButtonStyle; // 0x558(0x8)
		bool UseButtonStyle; // 0x560(0x1)
		bool ShowGamePadInputPrompt; // 0x561(0x1)
		bool ShowRail; // 0x562(0x1)
		unsigned char UnknownData00_6[0x1]; // 0x563(0x1) UNKNOWN PROPERTY
		int32_t MinTabWidth; // 0x564(0x4)
		bool ForceTabLabelsCollapsed; // 0x568(0x1)
		bool ForceTabIconsCollapsed; // 0x569(0x1)
		unsigned char UnknownData01_6[0x6]; // 0x56A(0x6) UNKNOWN PROPERTY
		FMulticastInlineDelegate RefreshGamepad; // 0x570(0x10)
		UClass* DebugButtonTypeDisplay; // 0x580(0x8)
		int32_t DebugTabCount; // 0x588(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x58C(0x4) UNKNOWN PROPERTY
		double PreviousTabActionPaddingRight; // 0x590(0x8)
		double NextTabActionPaddingLeft; // 0x598(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/TabbedView/HorizontalTabList_Legacy.HorizontalTabList_Legacy_C");
			return ret;
		}

		void DebugCreateTabsForDesigner(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTabStyles(UCommonButtonBase* ButtonWidget); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> FillVertically); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateGamepadKeyVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Refresh Next/Previous Visibility(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomEvent(FName TabID); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleOnInputMethodChanged(ECommonInputType bNewInputType); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomEvent(ESlateVisibility InVisibility); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTabCreation(FName TabNameID, UCommonButtonBase* TabButton); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTabRemoval(FName TabNameID, UCommonButtonBase* TabButton); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_HorizontalTabList_Legacy(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RefreshGamepad__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/GamepadMappingInfo_v3.GamepadMappingInfo_v3_C
	// Inherited from UFortGamepadMappingInfo -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x484 (0x75C - 0x2D8)
	class UGamepadMappingInfo_v3_C : public UFortGamepadMappingInfo	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UCommonBorder* CommonBorder_LeftBumperSeparator; // 0x2E0(0x8)
		UCommonBorder* CommonBorder_RightBumperSeparator; // 0x2E8(0x8)
		UCommonBorder* CommonBorder_Legend; // 0x2F0(0x8)
		UDeadzoneAdjustment_C* DeadzoneAdjustment_Look; // 0x2F8(0x8)
		UDeadzoneAdjustment_C* DeadzoneAdjustment_Move; // 0x300(0x8)
		UKeybindWidget_C* DPadDown; // 0x308(0x8)
		UKeybindWidget_C* DpadDown2; // 0x310(0x8)
		UGamepadKeyTextButton_C* DpadDown_Custom; // 0x318(0x8)
		UKeybindWidget_C* DPadLeft; // 0x320(0x8)
		UKeybindWidget_C* DpadLeft2; // 0x328(0x8)
		UGamepadKeyTextButton_C* DpadLeft_Custom; // 0x330(0x8)
		UKeybindWidget_C* DPadRight; // 0x338(0x8)
		UKeybindWidget_C* DpadRight2; // 0x340(0x8)
		UGamepadKeyTextButton_C* DpadRight_Custom; // 0x348(0x8)
		UKeybindWidget_C* DPadUp; // 0x350(0x8)
		UKeybindWidget_C* DpadUp2; // 0x358(0x8)
		UGamepadKeyTextButton_C* DpadUp_Custom; // 0x360(0x8)
		UGamepadKeyTextButton_C* FaceBottom_Custom; // 0x368(0x8)
		UKeybindWidget_C* FaceButtonBot; // 0x370(0x8)
		UKeybindWidget_C* FaceButtonLeft; // 0x378(0x8)
		UKeybindWidget_C* FaceButtonRight; // 0x380(0x8)
		UKeybindWidget_C* FaceButtonTop; // 0x388(0x8)
		UGamepadKeyTextButton_C* FaceLeft_Custom; // 0x390(0x8)
		UGamepadKeyTextButton_C* FaceRight_Custom; // 0x398(0x8)
		UGamepadKeyTextButton_C* FaceTop_Custom; // 0x3A0(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_DeadzoneWarning; // 0x3A8(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_DoubleTap; // 0x3B0(0x8)
		UFortRichTextBlockLegacy* FortRichTextBlock_Hold; // 0x3B8(0x8)
		UGamepadCustomActionSelectorPanel_v3_C* GamepadCustomActionSelectorPanel_v3; // 0x3C0(0x8)
		UHorizontalBox* HorizontalBox_LB_RB; // 0x3C8(0x8)
		UHorizontalBox* HorizontalBox_LB_RT; // 0x3D0(0x8)
		UHorizontalBox* HorizontalBox_LT_RB; // 0x3D8(0x8)
		UHorizontalBox* HorizontalBox_AllText; // 0x3E0(0x8)
		UHorizontalBox* HorizontalBox_CustomButtons; // 0x3E8(0x8)
		UHorizontalTabList_Legacy_C* HorizontalTabList_CustomModes; // 0x3F0(0x8)
		UImage* Image_DoubleTap; // 0x3F8(0x8)
		UImage* Image_Gamepad; // 0x400(0x8)
		UImage* Image_Hold; // 0x408(0x8)
		UImage* Image_LightBox; // 0x410(0x8)
		UCommonTextBlock* LB_RBAction; // 0x418(0x8)
		UCommonTextBlock* LB_RTAction; // 0x420(0x8)
		UGamepadKeyTextButton_C* LB_Custom; // 0x428(0x8)
		UKeybindWidget_C* LS; // 0x430(0x8)
		UGamepadKeyTextButton_C* LS_Click_Custom; // 0x438(0x8)
		UKeybindWidget_C* LSCombo1; // 0x440(0x8)
		UKeybindWidget_C* LSCombo2; // 0x448(0x8)
		UKeybindWidget_C* LStick; // 0x450(0x8)
		UKeybindWidget_C* LStick2; // 0x458(0x8)
		UKeybindWidget_C* LStickClick; // 0x460(0x8)
		UKeybindWidget_C* LStickClick2; // 0x468(0x8)
		UKeybindWidget_C* LT; // 0x470(0x8)
		UCommonTextBlock* LT_RBAction; // 0x478(0x8)
		UGamepadKeyTextButton_C* LT_Custom; // 0x480(0x8)
		UKeybindWidget_C* LTCombo; // 0x488(0x8)
		UOverlay* Overlay_DeadzoneAdjustment; // 0x490(0x8)
		UGamepadKeyTextButton_C* RB_Custom; // 0x498(0x8)
		UKeybindWidget_C* RS; // 0x4A0(0x8)
		UGamepadKeyTextButton_C* RS_Click_Custom; // 0x4A8(0x8)
		UKeybindWidget_C* RSCombo; // 0x4B0(0x8)
		UKeybindWidget_C* RSCombo2; // 0x4B8(0x8)
		UKeybindWidget_C* RStick; // 0x4C0(0x8)
		UKeybindWidget_C* RStickClick; // 0x4C8(0x8)
		UKeybindWidget_C* RT; // 0x4D0(0x8)
		UGamepadKeyTextButton_C* RT_Custom; // 0x4D8(0x8)
		UKeybindWidget_C* RTCombo; // 0x4E0(0x8)
		UGamepadKeyTextButton_C* Select_Custom; // 0x4E8(0x8)
		USizeBox* Separator_LB_RBfromLB_RT; // 0x4F0(0x8)
		UKeybindWidget_C* SpecialLeft; // 0x4F8(0x8)
		UKeybindWidget_C* SpecialRight; // 0x500(0x8)
		UGamepadKeyTextButton_C* Start_Custom; // 0x508(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Bottom; // 0x510(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Left; // 0x518(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Left; // 0x520(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Left; // 0x528(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Right; // 0x530(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Right; // 0x538(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Right; // 0x540(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Top; // 0x548(0x8)
		UCommonTextBlock* Text_Gamepad_Face_Button_Top; // 0x550(0x8)
		UCommonTextBlock* Text_Gamepad_LB; // 0x558(0x8)
		UCommonTextBlock* Text_Gamepad_LT; // 0x560(0x8)
		UCommonTextBlock* Text_Gamepad_RB; // 0x568(0x8)
		UCommonTextBlock* Text_Gamepad_RS; // 0x570(0x8)
		UCommonTextBlock* Text_Gamepad_RS_Click; // 0x578(0x8)
		UCommonTextBlock* Text_Gamepad_RS_Click; // 0x580(0x8)
		UCommonTextBlock* Text_Gamepad_RS_Click; // 0x588(0x8)
		UCommonTextBlock* Text_Gamepad_RT; // 0x590(0x8)
		UCommonTextBlock* Text_Gamepad_Select; // 0x598(0x8)
		UCommonTextBlock* Text_Gamepad_Select; // 0x5A0(0x8)
		UCommonTextBlock* Text_Gamepad_Start; // 0x5A8(0x8)
		UCommonTextBlock* Text_Mode; // 0x5B0(0x8)
		UCommonTextBlock* Text_PS4_Dpad_Down; // 0x5B8(0x8)
		UCommonTextBlock* Text_PS4_Dpad_Left; // 0x5C0(0x8)
		UCommonTextBlock* Text_PS4_Dpad_Right; // 0x5C8(0x8)
		UCommonTextBlock* Text_PS4_Dpad_Up; // 0x5D0(0x8)
		UCommonTextBlock* Text_PS4_LS; // 0x5D8(0x8)
		UCommonTextBlock* Text_PS4_LS_Click; // 0x5E0(0x8)
		UCommonTextBlock* Text_PS4_LS_Click; // 0x5E8(0x8)
		UCommonTextBlock* Text_Xbox_Dpad_Down; // 0x5F0(0x8)
		UCommonTextBlock* Text_Xbox_Dpad_Left; // 0x5F8(0x8)
		UCommonTextBlock* Text_Xbox_Dpad_Right; // 0x600(0x8)
		UCommonTextBlock* Text_Xbox_Dpad_Up; // 0x608(0x8)
		UCommonTextBlock* Text_Xbox_LS; // 0x610(0x8)
		UCommonTextBlock* Text_Xbox_LS_Click; // 0x618(0x8)
		UCommonTextBlock* Text_Xbox_LS_Click; // 0x620(0x8)
		UVerticalBox* VerticalBox_PS4_LS_And_Dpad; // 0x628(0x8)
		UVerticalBox* VerticalBox_Xbox_LS_And_Dpad; // 0x630(0x8)
		UVerticalBox* VerticalBoxMenu_Map; // 0x638(0x8)
		TArray<TWeakObjectPtr> XB1_Images; // 0x640(0x10)
		TArray<TWeakObjectPtr> PS4_Images; // 0x650(0x10)
		TArray<TWeakObjectPtr> Appropriate_Platform_Images; // 0x660(0x10)
		TArray<UCommonTextBlock*> GamepadConfigTextWidgets; // 0x670(0x10)
		TArray<FText> ButtonTextLabels_STW_CombatPro_Build; // 0x680(0x10)
		TArray<FText> ButtonTextLabels_STW_CombatPro_Combat; // 0x690(0x10)
		TArray<TWeakObjectPtr> Erebus_Images; // 0x6A0(0x10)
		TArray<FText> ButtonTextLabels_STW_BuilderPro_Build; // 0x6B0(0x10)
		UGamepadKeyTextButton_C* LastClickedButton; // 0x6C0(0x8)
		EFortInputActionGroup CurrentInputActionGroup; // 0x6C8(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x6C9(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate CustomKeySelected; // 0x6D0(0x10)
		TArray<UGamepadKeyTextButton_C*> CustomKeyButtons; // 0x6E0(0x10)
		FMulticastInlineDelegate Image_LightboxClicked; // 0x6F0(0x10)
		FName CombatModeIdName; // 0x700(0x4)
		FName BuildModeIdName; // 0x704(0x4)
		FName EditModeIdName; // 0x708(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x70C(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate CustomButtonNavLeft; // 0x710(0x10)
		TArray<TWeakObjectPtr> Generic_Images; // 0x720(0x10)
		FName DeadZoneMoveIdName; // 0x730(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x734(0x4) UNKNOWN PROPERTY
		TArray<TWeakObjectPtr> XSX_Images; // 0x738(0x10)
		TArray<TWeakObjectPtr> PS5_Images; // 0x748(0x10)
		FName LTMAbilitiesModeIdName; // 0x758(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/GamepadMappingInfo_v3.GamepadMappingInfo_v3_C");
			return ret;
		}

		void ShowAthenaLTMAbilitiesTab(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideAthenaLTMAbilitiesTab(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowDeadZoneTab(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideDeadZoneTab(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadMappingInfoNavLeft(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowEditModeTab(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HideEditModeTab(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEventReply On_Image_LightBox_MouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCustomButtonDataForKey(FKey Key, FName& ActionName, FText& DescText); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTextForMode(EFortInputActionGroup Selection); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetButtonTextLabelsFromTextArray(TArray<FText>& Array); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeListOfButtonTextForSTW_BuilderProBuild(TArray<FText>& ButtonTextLabels); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetControllerImage(TWeakObjectPtr<UTexture2D*>& Texture); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearAllComboTextLines(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeListOfButtonTextForSTWCombatProCombat(TArray<FText>& ButtonTextLabels); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTextFieldVisibilityForExtraLine(UTextBlock* TextWidget); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetDesiredSlateVisibilityForAbilityChordFromTextDisplay(UTextBlock* TextWidget, ESlateVisibility& DesiredSlateVisibility); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeListOfButtonTextForSTWCombatProBuild(TArray<FText>& ButtonTextLabels); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeListOfButtonLabelTextWidgets(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Handle Config Changed Hide or Show Unused Text Lines(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Handle Config Changed STW Combat Mode(int32_t Config); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Handle Config Changed STW Build Mode(int32_t Config); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleConfigChanged(EFortInputActionGroup Mode, int32_t Config); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleConfigChanged_Athena(EFortInputActionGroup Mode, int32_t Config); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnConfigChanged(EFortInputActionGroup Mode, int32_t Config); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Displayed Mapping(int32_t Platform, EFortInputActionGroup Mode, int32_t Configuration); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnLoaded_CDBC1B27496027B96D10BC9A64224F3D(UObject* Loaded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Controller Images(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnButtonClicked_Bind(UCommonButtonLegacy* Button); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateCustomButtons(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeadZoneTabSelected(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeadZoneTabDeselected(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeadzoneMoveResetButtonClicked_Bind(UCommonButtonLegacy* Button); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeadzoneLookResetButtonClicked_Bind(UCommonButtonLegacy* Button); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_GamepadMappingInfo_v3(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomButtonNavLeft__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Image_LightboxClicked__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomKeySelected__DelegateSignature(FKey Key); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Settings/CustomBindings_v3/TabGamePadConfig_v3.TabGamePadConfig_v3_C
	// Inherited from UFortGamepadInputOptions -> UFortInputOptions -> UFortOptionsTab -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x108 (0x578 - 0x470)
	class UTabGamePadConfig_v3_C : public UFortGamepadInputOptions	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x470(0x8)
		UGamepadInfoSelectorPanel_v3_C* GamepadInfoSelectorPanel_v3; // 0x478(0x8)
		UGamepadMappingInfo_v3_C* GamepadMappingInfo_v3; // 0x480(0x8)
		FMulticastInlineDelegate GamepadMappingInfoChanged; // 0x488(0x10)
		TArray<FString> InputPresets; // 0x498(0x10)
		TArray<FText> InputPresetNames_NoCustom; // 0x4A8(0x10)
		int32_t PresetMappingIndex; // 0x4B8(0x4)
		int32_t PlatformMappingIndex; // 0x4BC(0x4)
		int32_t CustomInputTemplatePresetIndex; // 0x4C0(0x4)
		unsigned char UnknownData00_6[0x4]; // 0x4C4(0x4) UNKNOWN PROPERTY
		UGamepadKeyTextButton_C* DisplayObject; // 0x4C8(0x8)
		EFortInputActionGroup CurrentInputActionGroup; // 0x4D0(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x4D1(0x3) UNKNOWN PROPERTY
		int32_t CustomResetToDefaultConfig; // 0x4D4(0x4)
		FKey CustomKeySelection; // 0x4D8(0x18)
		FName CustomActionSelection; // 0x4F0(0x4)
		int32_t CustomInputActionGroupSelectionIndex; // 0x4F4(0x4)
		int32_t CustomActionSelectionIndex; // 0x4F8(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x4FC(0x4) UNKNOWN PROPERTY
		FKey Key_None; // 0x500(0x18)
		UClass* RadioButtonClass; // 0x518(0x8)
		UClass* RadioButtonStyle; // 0x520(0x8)
		TArray<UFortOptionsMenuInputData*> InputDataForActionsPanel; // 0x528(0x10)
		FMulticastInlineDelegate TabGamePadConfigBack; // 0x538(0x10)
		FMulticastInlineDelegate TabGamePadConfigApply; // 0x548(0x10)
		FMulticastInlineDelegate TabGamePadActionsThatNeedBinds; // 0x558(0x10)
		FMulticastInlineDelegate OverrideResetModal; // 0x568(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/CustomBindings_v3/TabGamePadConfig_v3.TabGamePadConfig_v3_C");
			return ret;
		}

		void GamepadInfoSelectorNavRight(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AreWeOkayWithThisChange(FName ActionName, FKey Key, bool& IsOkay); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleGamepadInfoSelectorFocus(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void NavigateToSelectedConfig(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChangeCustomClearVisibilityForInputType(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChangeCustomResetVisibilityForInputType(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleGamepadInfoSelectorApply(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleGamepadInfoSelectorBack(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ChangeCustomTabListVisibilityForInputType(ECommonInputType Selection); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		TArray CreateCustomResetToDefaultList(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CloseCustomActionsPanel(bool FocusLastButton); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SelectSameItemInActionsList(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetupDisplayObject(FName ActionName, FKey Key, UGamepadKeyTextButton_C* DisplayObject); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		bool IsCustomConfig(int32_t PresetIndex); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleGamepadMappingInfoChange(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCurrentPlatformIndex(int32_t& PlatformIndex); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateData(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstructData(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void InitializeData(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DialogResult_017CD690454514A07B4DE5BE109AEC6E(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DialogResult_7D7E06D747FFEF9849D3CAA2D3D91717(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Gamepad Config Changed(UCommonButtonLegacy* AssociatedButton, int32_t ButtonIndex); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadPlatformConfigChanged(UCommonButtonLegacy* AssociatedButton, int32_t ButtonIndex); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CenterOnTab(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateOptionsTab(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomDoResetToDefault(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomKeySelected_Bind(FKey Key); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomActionSelected_Bind(int32_t SelectedIndex, FName ActionName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomClosedUsingBack_Bind(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CustomClearButton_Bind(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ModesTabSelected_Bind(FName TabID); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleUsingGamepadChanged(ECommonInputType NewInputType); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabDeactivated_Bind(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabActivated_Bind(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeadZoneLookSettingValueChanged_Bind(float Value); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DeadZoneMoveSettingValueChanged_Bind(float Value); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_TabGamePadConfig_v3(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OverrideResetModal__DelegateSignature(bool bOverride); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TabGamePadActionsThatNeedBinds__DelegateSignature(TArray<FText>& ScreenLabels); // Flags: Public|Delegate|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TabGamePadConfigApply__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void TabGamePadConfigBack__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GamepadMappingInfoChanged__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Movie/ActivatableMovieWidget.ActivatableMovieWidget_C
	// Inherited from UFortActivatableVideoPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x658 - 0x640)
	class UActivatableMovieWidget_C : public UFortActivatableVideoPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x640(0x8)
		USafeZone* MainSafeZone; // 0x648(0x8)
		USafeZone* SafeZone; // 0x650(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Movie/ActivatableMovieWidget.ActivatableMovieWidget_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ActivatableMovieWidget(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/ItemManagement/InventoryPanel/ItemTileButtonStyles/ItemManagementTileButtonStyle-Base.ItemManagementTileButtonStyle-Base_C
	// Inherited from UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UItemManagementTileButtonStyle-Base_C : public UButtonStyle-Base_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/ItemManagement/InventoryPanel/ItemTileButtonStyles/ItemManagementTileButtonStyle-Base.ItemManagementTileButtonStyle-Base_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Profile/BP_BannerEditorTile.BP_BannerEditorTile_C
	// Inherited from UFortPlayerProfileBannerEditorTile -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1440 - 0x13F0)
	class UBP_BannerEditorTile_C : public UFortPlayerProfileBannerEditorTile	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UImage* ColorImage; // 0x13F8(0x8)
		UCommonWidgetSwitcherLegacy* CommonWidgetSwitcher; // 0x1400(0x8)
		UImage* IconImage; // 0x1408(0x8)
		UCommonLoadGuard* IconLoadGuard; // 0x1410(0x8)
		UImage* Image_BannerEditBorder; // 0x1418(0x8)
		UNormalBangWrapper_C* NormalBangWrapper; // 0x1420(0x8)
		UMaterialInstanceDynamic* ColorMID; // 0x1428(0x8)
		FMulticastInlineDelegate BannerTileBangUpdated; // 0x1430(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Profile/BP_BannerEditorTile.BP_BannerEditorTile_C");
			return ret;
		}

		void Mark Item As Seen(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Bang State(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleBannerIconLoadGuardFinished(UObject* Object); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BP_BannerEditorTile(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BannerTileBangUpdated__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Profile/WBP_LocalPlayerBannerEditor.WBP_LocalPlayerBannerEditor_C
	// Inherited from UFortPlayerProfileBannerEditor -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x1C8 (0x4F0 - 0x328)
	class UWBP_LocalPlayerBannerEditor_C : public UFortPlayerProfileBannerEditor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x328(0x8)
		UWBP_UIKit_Button_Regular_C* ApplyButton; // 0x330(0x8)
		UCloseButton_C* Button_CloseTouch; // 0x338(0x8)
		UWBP_UIKit_Button_Generic_C* Button_Next; // 0x340(0x8)
		UWBP_UIKit_Button_Generic_C* Button_Previous; // 0x348(0x8)
		UWBP_UIKit_StatusIndicator_C* CategoryStatusIndicator; // 0x350(0x8)
		UCommonTextBlock* CategoryText; // 0x358(0x8)
		UCommonTextBlock* FoundersNoteText; // 0x360(0x8)
		UPlayerBanner_C* HomebaseBanner; // 0x368(0x8)
		UWBP_UIKit_Tabs_C* TabCategories; // 0x370(0x8)
		UFortCommonTileView* TileView_Items; // 0x378(0x8)
		FMulticastInlineDelegate CloseBannerEditor; // 0x380(0x10)
		int32_t IconCategoryIndex; // 0x390(0x4)
		int32_t ColorCategoryIndex; // 0x394(0x4)
		FName CurrentCategory; // 0x398(0x4)
		bool bViewingIcons; // 0x39C(0x1)
		bool bPickingTile; // 0x39D(0x1)
		unsigned char UnknownData00_6[0x2]; // 0x39E(0x2) UNKNOWN PROPERTY
		FName TempChosenIcon; // 0x3A0(0x4)
		FName TempChosenColor; // 0x3A4(0x4)
		UCommonButtonGroupLegacy* ButtonGroup; // 0x3A8(0x8)
		FTimerHandle UpdateBangTimerHandle; // 0x3B0(0x8)
		bool bIsActiveWidget; // 0x3B8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x3B9(0x7) UNKNOWN PROPERTY
		USoundBase* AppearSoundCue; // 0x3C0(0x8)
		FSlateFontInfo Font; // 0x3C8(0x58)
		FText Text; // 0x420(0x10)
		FText Text_button; // 0x430(0x10)
		FSlateBrush In_Brush; // 0x440(0xB0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Profile/WBP_LocalPlayerBannerEditor.WBP_LocalPlayerBannerEditor_C");
			return ret;
		}

		void Is Banner Item Changed(UObject* Item, bool& bNeedToUpdate); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Close Banner Editor(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Select Next Category(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Select Previous Category(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Select Previous Tab(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Select Next Tab(bool& Passtrough); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Unregister Input Events for STW(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Register Input Events for STW(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetTabButtons(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void IsActiveWidget(bool& IsActivated); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleInputMethodChanged(ECommonInputType InputType); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Category Navigation Visibility(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Reset Color Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Reset Icon Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Right Color Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Left Color Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Right Icon Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Left Icon Category Button Bang State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int32_t Get Prev Color Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int32_t Get Next Color Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int32_t Get Prev Icon Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		int32_t Get Next Icon Category Index(); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Color Button Bang State(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Icon Button Bang State(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Bang States(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void FoundsPackTextUpdate(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Reset Pickers and Views(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Reset for Keyboard and Mouse(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Temp State On Item Selected(UObject* Item); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Refresh Apply Button State(); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Apply Chosen Item(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Picking Tile State(bool bPickingTile); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Attempt Leave Picker(bool& Left); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Navigate to Chosen Color(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Navigate to Chosen Icon(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWidgetDeactivated(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Banner Icon Tileview(FName CurrentCategory); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Update Banner Color Tileview(FName CurrentCategory); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Increment Color Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Increment Icon Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Decrement Color Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Decrement Icon Category Index(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Previous Category(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Next Category(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Current Category(FName CurrentCategory); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Setup Tileview For Colorswatches(FName& CategoryRowName); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Setup Tileview For Icons(FName CategoryRowName); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnWidgetActivated(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BannerTileBangUpdated_Event(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Handle Bang State Changed(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnShowPreviousCategory(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnShowNextCategory(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CloseButton_97_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_LocalPlayerBannerEditor_ApplyButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_LocalPlayerBannerEditor_Button_CloseEditorButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void RefreshBannerEditor(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_LocalPlayerBannerEditor_Button_Next_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_LocalPlayerBannerEditor_Button_Previous_0_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTabSelected(FName TabID); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__WBP_LocalPlayerBannerEditor_FortCommonTileView_49_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(UObject* Item); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__WBP_LocalPlayerBannerEditor_FortCommonTileView_49_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature(UObject* Item, bool bIsSelected); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__WBP_LocalPlayerBannerEditor_FortCommonTileView_49_K2Node_ComponentBoundEvent_8_OnListEntryGeneratedDynamic__DelegateSignature(UUserWidget* Widget); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_WBP_LocalPlayerBannerEditor(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void CloseBannerEditor__DelegateSignature(FName IconId, FName ColorId); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Parties/TeamMemberManage.TeamMemberManage_C
	// Inherited from UFortTeamMemberManage -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x38 (0x618 - 0x5E0)
	class UTeamMemberManage_C : public UFortTeamMemberManage	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5E0(0x8)
		UWBP_LocalPlayerBannerEditor_C* BP_LocalPlayerBannerEditor; // 0x5E8(0x8)
		UWBP_UIKit_Button_Regular_C* CloseProfileButton; // 0x5F0(0x8)
		UCommonWidgetSwitcherLegacy* ContentSwitcher; // 0x5F8(0x8)
		USizeBox* TeamMemberManageOptions; // 0x600(0x8)
		UWBP_UIKit_Backplate_C* WBP_UIKit_Backplate; // 0x608(0x8)
		UWBP_UIKit_Scrim_C* WBP_UIKit_Scrim; // 0x610(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Parties/TeamMemberManage.TeamMemberManage_C");
			return ret;
		}

		void OnParticipationChanged(bool bIsParticipating); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_1_CloseBannerEditor__DelegateSignature(FName IconId, FName ColorId); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ContentSwitcher_K2Node_ComponentBoundEvent_2_OnActiveWidgetChanged__DelegateSignature(UWidget* ActiveWidget, int32_t ActiveWidgetIndex); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OpenBannerEditor(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__TeamMemberManage_CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_TeamMemberManage(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Progress/ProgressWidget.ProgressWidget_C
	// Inherited from UFortProgressWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x308 - 0x2F0)
	class UProgressWidget_C : public UFortProgressWidget	
	{
	public:
		USizeBox* ProgressSizeBox; // 0x2F0(0x8)
		UImage* ProgressSpinner; // 0x2F8(0x8)
		UVerticalBox* ProgressVBox; // 0x300(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Progress/ProgressWidget.ProgressWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Modals/ProgressModal/ProgressModalWidget.ProgressModalWidget_C
	// Inherited from UFortProgressModal -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x650 - 0x640)
	class UProgressModalWidget_C : public UFortProgressModal	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x640(0x8)
		ULightbox_C* Lightbox; // 0x648(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Modals/ProgressModal/ProgressModalWidget.ProgressModalWidget_C");
			return ret;
		}

		FEventReply OnAnalogValueChanged(FGeometry MyGeometry, FAnalogInputEvent InAnalogInputEvent); // Flags: Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleIntroEnded(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleOutroEnded(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginIntro(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginOutro(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ProgressModalWidget(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Left.ButtonStyle_PageChevron_Left_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_PageChevron_Left_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_PageChevron_Left.ButtonStyle_PageChevron_Left_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/Art/ButtonStyle_VoiceSettings.ButtonStyle_VoiceSettings_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_VoiceSettings_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/Art/ButtonStyle_VoiceSettings.ButtonStyle_VoiceSettings_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/MissedInvitesActionMenu.MissedInvitesActionMenu_C
	// Inherited from UFortMissedInvitesActionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x488 - 0x438)
	class UMissedInvitesActionMenu_C : public UFortMissedInvitesActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x438(0x8)
		UWidgetAnimation* ConfirmationOpened; // 0x440(0x8)
		UWidgetAnimation* Opened; // 0x448(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x450(0x8)
		UCommonRichTextBlock* CommonRichTextBlock; // 0x458(0x8)
		UCommonRichTextBlock* CommonRichTextBlock; // 0x460(0x8)
		UBorder* EntryBorder; // 0x468(0x8)
		UImage* Image; // 0x470(0x8)
		UImage* Image_Platform; // 0x478(0x8)
		UCommonRichTextBlock* Text_DisplayName; // 0x480(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/MissedInvitesActionMenu.MissedInvitesActionMenu_C");
			return ret;
		}

		FEventReply OnKeyUp(FGeometry MyGeometry, FKeyEvent InKeyEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MissedInvitesActionMenu(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ReferAFriendActionMenu.ReferAFriendActionMenu_C
	// Inherited from UFortReferFriendActionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x498 - 0x438)
	class UReferAFriendActionMenu_C : public UFortReferFriendActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x438(0x8)
		UWidgetAnimation* ConfirmationOpened; // 0x440(0x8)
		UWidgetAnimation* Opened; // 0x448(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x450(0x8)
		UCommonRichTextBlock* CommonRichTextBlock; // 0x458(0x8)
		UCommonRichTextBlock* CommonRichTextBlock; // 0x460(0x8)
		UBorder* EntryBorder; // 0x468(0x8)
		UImage* Image_AddFriendsQR; // 0x470(0x8)
		UImage* Image_PartyUpQR; // 0x478(0x8)
		UImage* Image_Platform; // 0x480(0x8)
		UCommonRichTextBlock* Text_DisplayName; // 0x488(0x8)
		UWidgetSwitcher* WidgetSwitcher_QR; // 0x490(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ReferAFriendActionMenu.ReferAFriendActionMenu_C");
			return ret;
		}

		void Set QRt Image(EReferFriendOrigin Origin); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEventReply OnKeyUp(FGeometry MyGeometry, FKeyEvent InKeyEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRequestOriginChanged(EReferFriendOrigin RequestOrigin); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ReferAFriendActionMenu(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingButton.LocalUserSettingButton_C
	// Inherited from UFortLocalUserSettingButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x20 (0x1420 - 0x1400)
	class ULocalUserSettingButton_C : public UFortLocalUserSettingButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1400(0x8)
		UWidgetAnimation* OnHover; // 0x1408(0x8)
		UBorder* Border_InteractionIndicator; // 0x1410(0x8)
		UImage* Image_AnimatedArrow; // 0x1418(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingButton.LocalUserSettingButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_LocalUserSettingButton(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingTitle.LocalUserSettingTitle_C
	// Inherited from UFortLocalUserSettingTitleButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x1418 - 0x13F0)
	class ULocalUserSettingTitle_C : public UFortLocalUserSettingTitleButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UWidgetAnimation* OnExpansion; // 0x13F8(0x8)
		UWidgetAnimation* OnHover; // 0x1400(0x8)
		UImage* ExpandDirectionTick; // 0x1408(0x8)
		USizeBox* SB_EntryContent; // 0x1410(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingTitle.LocalUserSettingTitle_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExpansionChanged(bool bIsExpanded); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_LocalUserSettingTitle(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingSection.LocalUserSettingSection_C
	// Inherited from UFortLocalUserSettingsSection -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x330 - 0x330)
	class ULocalUserSettingSection_C : public UFortLocalUserSettingsSection	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingSection.LocalUserSettingSection_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/LocalUserSettingsMenu.LocalUserSettingsMenu_C
	// Inherited from UFortLocalUserSettingsMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x428 - 0x428)
	class ULocalUserSettingsMenu_C : public UFortLocalUserSettingsMenu	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LocalUserSettingsMenu.LocalUserSettingsMenu_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/Art/ButtonStyle_VoiceHeader.ButtonStyle_VoiceHeader_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_VoiceHeader_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/Art/ButtonStyle_VoiceHeader.ButtonStyle_VoiceHeader_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/VoiceChannelHeaderButton.VoiceChannelHeaderButton_C
	// Inherited from UFortVoiceChannelHeaderButton -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xA8 (0x1508 - 0x1460)
	class UVoiceChannelHeaderButton_C : public UFortVoiceChannelHeaderButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1460(0x8)
		UWidgetAnimation* OnExpansion; // 0x1468(0x8)
		UWidgetAnimation* JoinSlideOut; // 0x1470(0x8)
		UWidgetAnimation* ScaleUp; // 0x1478(0x8)
		UFortMobileImage* ExpandDirectionTick; // 0x1480(0x8)
		UHorizontalBox* HBox_Join; // 0x1488(0x8)
		UImage* Image_VoiceChatWarning; // 0x1490(0x8)
		UCommonRichTextBlock* JoinText; // 0x1498(0x8)
		UImage* NotTransmitting; // 0x14A0(0x8)
		UCommonRichTextBlock* OffText; // 0x14A8(0x8)
		UWidgetSwitcher* OnOffSwitcher; // 0x14B0(0x8)
		UCommonRichTextBlock* OnText; // 0x14B8(0x8)
		UOverlay* Overlay; // 0x14C0(0x8)
		UImage* SelectionBackplate; // 0x14C8(0x8)
		UWidgetSwitcher* SimultaneousChannelSwitcher; // 0x14D0(0x8)
		UWidgetSwitcher* Switch_Transmitting; // 0x14D8(0x8)
		UImage* Transmitting; // 0x14E0(0x8)
		FLinearColor VoiceStatusActiveColor; // 0x14E8(0x10)
		FLinearColor VoiceStatusWarningColor; // 0x14F8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/VoiceChannelHeaderButton.VoiceChannelHeaderButton_C");
			return ret;
		}

		void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_VoiceChannelHeaderButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/VoiceChannelHeaderOptions.VoiceChannelHeaderOptions_C
	// Inherited from UFortVoiceChannelHeaderButton -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x12B (0x158B - 0x1460)
	class UVoiceChannelHeaderOptions_C : public UFortVoiceChannelHeaderButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1460(0x8)
		UWidgetAnimation* OnHover; // 0x1468(0x8)
		UWidgetAnimation* OnExpansion; // 0x1470(0x8)
		UWidgetAnimation* JoinSlideOut; // 0x1478(0x8)
		UWidgetAnimation* ScaleUp; // 0x1480(0x8)
		UButton* Button_Options; // 0x1488(0x8)
		UHorizontalBox* ChannelInfoPanel; // 0x1490(0x8)
		UFortMobileImage* ExpandDirectionTick; // 0x1498(0x8)
		UHorizontalBox* hb_friends; // 0x14A0(0x8)
		UHorizontalBox* HB_Input; // 0x14A8(0x8)
		UHorizontalBox* hb_teammates; // 0x14B0(0x8)
		UHorizontalBox* HBox_Join; // 0x14B8(0x8)
		UHorizontalBox* HorizontalBox_Buttons; // 0x14C0(0x8)
		UHorizontalBox* HorizontalBox_Options; // 0x14C8(0x8)
		UCommonActionWidget* InputActionWidget; // 0x14D0(0x8)
		UIconTextButton_C* JoinLeaveButtonStw; // 0x14D8(0x8)
		UImage* NotTransmitting; // 0x14E0(0x8)
		UOverlay* Overlay; // 0x14E8(0x8)
		UIconTextButton_C* ReportButtonStw; // 0x14F0(0x8)
		UImage* SelectionBackplate; // 0x14F8(0x8)
		UWidgetSwitcher* Switch_Transmitting; // 0x1500(0x8)
		UCommonActivatableWidgetSwitcher* Switcher_Social; // 0x1508(0x8)
		UCommonActivatableWidgetSwitcher* Switcher_VoiceReporting; // 0x1510(0x8)
		UCommonTextBlock* Text_Bullet_F; // 0x1518(0x8)
		UCommonTextBlock* Text_Bullet_FT; // 0x1520(0x8)
		UCommonTextBlock* Text_Options; // 0x1528(0x8)
		UCommonTextBlock* Text_Social_Friends_Only; // 0x1530(0x8)
		UCommonTextBlock* Text_Social_Friends_Only; // 0x1538(0x8)
		UCommonTextBlock* Text_Social_None; // 0x1540(0x8)
		UCommonTextBlock* Text_VoiceReporting_Off; // 0x1548(0x8)
		UCommonTextBlock* Text_VoiceReporting_On; // 0x1550(0x8)
		UImage* Transmitting; // 0x1558(0x8)
		UWrapBox* WrapBox_Header_Status; // 0x1560(0x8)
		FLinearColor VoiceStatusActiveColor; // 0x1568(0x10)
		FLinearColor VoiceStatusWarningColor; // 0x1578(0x10)
		bool Is_Expanded; // 0x1588(0x1)
		bool Old; // 0x1589(0x1)
		bool Hovered; // 0x158A(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/VoiceChannelHeaderOptions.VoiceChannelHeaderOptions_C");
			return ret;
		}

		UWidget DoCustomNavigation(EUINavigation Navigation); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetJoinOrLeaveButton(bool Join); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDisabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnEnabled(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Options Expansion Changed(bool IsExpanded); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SidebarVoiceChannelHeader_Button_194_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SidebarVoiceChannelHeader_Button_Options_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SidebarVoiceChannelHeader_Button_Options_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetExpansionState(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnFocusReceived(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleHeaderClicked(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Set Header Status Visuals(bool Old); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnUpdateOptionsVisuals(ESocialCommsPermission VoicePermission, bool bVoiceReportingIsAvailable, bool bIsRecording, bool bCanJoinOrLeave, bool bMightBeAbleToReport); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__VoiceChannelHeaderOptions_JoinLeaveButtonStw_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__VoiceChannelHeaderOptions_ReportButtonStw_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_VoiceChannelHeaderOptions(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x13F8 - 0x13E0)
	class USocialPanelWeGameFriendButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation* OnHovered; // 0x13E8(0x8)
		UCommonTextBlock* Text_LinkPrompt; // 0x13F0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanelWeGameFriendButton.SocialPanelWeGameFriendButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanelWeGameFriendButton(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/ButtonStyle_TransparentList_Social.ButtonStyle_TransparentList_Social_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_TransparentList_Social_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/ButtonStyle_TransparentList_Social.ButtonStyle_TransparentList_Social_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/EditNicknameButton.EditNicknameButton_C
	// Inherited from UFortEditNicknameButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x18 (0x1438 - 0x1420)
	class UEditNicknameButton_C : public UFortEditNicknameButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		UWidgetAnimation* OnHovered; // 0x1428(0x8)
		UBorder* ClickCapture; // 0x1430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/EditNicknameButton.EditNicknameButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_EditNicknameButton(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/UserActionMenuInputButton.UserActionMenuInputButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x13E0 - 0x13E0)
	class UUserActionMenuInputButton_C : public UCommonButtonLegacy	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/UserActionMenuInputButton.UserActionMenuInputButton_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/UserListHeaderEntry.UserListHeaderEntry_C
	// Inherited from USocialUserListHeaderEntry -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x1438 - 0x1408)
	class UUserListHeaderEntry_C : public USocialUserListHeaderEntry	
	{
	public:
		unsigned char UnknownData00_3[0x8]; // 0x1408(0x8) UNKNOWN PROPERTY
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation* OnExpansion; // 0x1418(0x8)
		UWidgetAnimation* OnHover; // 0x1420(0x8)
		UFortMobileImage* ExpandDirectionTick; // 0x1428(0x8)
		USizeBox* SB_EntryContent; // 0x1430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/UserListHeaderEntry.UserListHeaderEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnItemExpansionChanged(bool bIsExpanded); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnListItemObjectSet(UObject* ListItemObject); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_UserListHeaderEntry(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialInteraction.SocialInteraction_C
	// Inherited from USocialInteractionButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x14E8 - 0x1490)
	class USocialInteraction_C : public USocialInteractionButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1490(0x8)
		UWidgetAnimation* OnHover; // 0x1498(0x8)
		UImage* EncourageEpicFriend; // 0x14A0(0x8)
		UImage* InteractionIcon; // 0x14A8(0x8)
		UMenuAnchor* MenuAnchor_Actions; // 0x14B0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14B8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14C8(0x10)
		FLinearColor AddFriendColor; // 0x14D8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialInteraction.SocialInteraction_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInteractionSet(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialInteraction(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/UserActionMenu.UserActionMenu_C
	// Inherited from UFortSocialInteractionMenu -> USocialInteractionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x518 - 0x4E8)
	class UUserActionMenu_C : public UFortSocialInteractionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x4E8(0x8)
		UWidgetAnimation* ConfirmationOpened; // 0x4F0(0x8)
		UWidgetAnimation* Opened; // 0x4F8(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x500(0x8)
		UBorder* EntryBorder; // 0x508(0x8)
		UFortMobileImage* Image_Platform; // 0x510(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/UserActionMenu.UserActionMenu_C");
			return ret;
		}

		void OnToggleConfirmation(bool bIsVisible); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_UserActionMenu(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialConfirmationButton.SocialConfirmationButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1428 - 0x13E0)
	class USocialConfirmationButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation* OnHover; // 0x13E8(0x8)
		UBorder* Border_InteractionIndicator; // 0x13F0(0x8)
		UImage* InteractionIcon; // 0x13F8(0x8)
		UMenuAnchor* MenuAnchor_Actions; // 0x1400(0x8)
		UCommonTextBlock* Text_InteractionName; // 0x1408(0x8)
		bool bIsAccept; // 0x1410(0x1)
		unsigned char UnknownData00_6[0x7]; // 0x1411(0x7) UNKNOWN PROPERTY
		FText DisplayText; // 0x1418(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialConfirmationButton.SocialConfirmationButton_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialConfirmationButton(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C
	// Inherited from UFortUserSearchResultListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x1510 - 0x14B0)
	class UUserSearchResultListEntry_XS_C : public UFortUserSearchResultListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation* Selected; // 0x14B8(0x8)
		UWidgetAnimation* Hovered; // 0x14C0(0x8)
		UImage* Arrow; // 0x14C8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UImage* Image_Lock; // 0x14D8(0x8)
		UCommonRichTextBlock* Text_DisplayName; // 0x14E0(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14E8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14F0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x1500(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetNamePlatformAndMutuals(FText& DisplayName, FText& Platform, int32_t MutualCount); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_UserSearchResultListEntry_XS(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SuggestedFriendListEntry.SuggestedFriendListEntry_C
	// Inherited from UFortConnectionsUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x14E0 - 0x1480)
	class USuggestedFriendListEntry_C : public UFortConnectionsUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1480(0x8)
		UWidgetAnimation* Selected; // 0x1488(0x8)
		UWidgetAnimation* Hovered; // 0x1490(0x8)
		UImage* Arrow; // 0x1498(0x8)
		UBorder* Border_Background; // 0x14A0(0x8)
		UBorder* Border_Highlight; // 0x14A8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14B0(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14B8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14C0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14D0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SuggestedFriendListEntry.SuggestedFriendListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SuggestedFriendListEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/MissedInvitesEntry.MissedInvitesEntry_C
	// Inherited from UFortMissedInvitesListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1460 - 0x1410)
	class UMissedInvitesEntry_C : public UFortMissedInvitesListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation* Selected; // 0x1418(0x8)
		UWidgetAnimation* Hovered; // 0x1420(0x8)
		UBorder* AnimatedInputBorder; // 0x1428(0x8)
		UImage* Arrow; // 0x1430(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x1438(0x8)
		UBorder* EntryBorder; // 0x1440(0x8)
		USizeBox* Exclamation; // 0x1448(0x8)
		UCommonRichTextBlock* Text_MissedInvitesText; // 0x1450(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x1458(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/MissedInvitesEntry.MissedInvitesEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MissedInvitesEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Sidebar/ListEntries/MultiFriendActionListEntry.MultiFriendActionListEntry_C
	// Inherited from UFortMultiFriendActionListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x1450 - 0x1410)
	class UMultiFriendActionListEntry_C : public UFortMultiFriendActionListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation* Selected; // 0x1418(0x8)
		UWidgetAnimation* Hovered; // 0x1420(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x1428(0x8)
		UBorder* EntryBorder; // 0x1430(0x8)
		UCommonRichTextBlock* Text_MissedInvitesText; // 0x1438(0x8)
		UCommonRichTextBlock* Text_MissedInvitesText_Hover; // 0x1440(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x1448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Sidebar/ListEntries/MultiFriendActionListEntry.MultiFriendActionListEntry_C");
			return ret;
		}

		void GetText(EMultiFriendAction InAction, FText& Text); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnActionUpdated(EMultiFriendAction InAction); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MultiFriendActionListEntry_InputActionWidget_K2Node_ComponentBoundEvent_1_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MultiFriendActionListEntry(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/InviteListEntry_FriendInvite_XS.InviteListEntry_FriendInvite_XS_C
	// Inherited from UFortConnectionsUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x70 (0x14F0 - 0x1480)
	class UInviteListEntry_FriendInvite_XS_C : public UFortConnectionsUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1480(0x8)
		UWidgetAnimation* Selected; // 0x1488(0x8)
		UWidgetAnimation* Hovered; // 0x1490(0x8)
		UImage* Arrow; // 0x1498(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x14A0(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14A8(0x8)
		UBorder* EntryBorder; // 0x14B0(0x8)
		UCommonRichTextBlock* Text_SentRequest; // 0x14B8(0x8)
		FLinearColor Online; // 0x14C0(0x10)
		FLinearColor Offline; // 0x14D0(0x10)
		FLinearColor Away; // 0x14E0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/InviteListEntry_FriendInvite_XS.InviteListEntry_FriendInvite_XS_C");
			return ret;
		}

		void HandleOnlineIndicatorView(char OnlineStatus); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_InviteListEntry_FriendInvite_XS(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ReferAFriendEntry.ReferAFriendEntry_C
	// Inherited from UFortReferFriendListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1460 - 0x1410)
	class UReferAFriendEntry_C : public UFortReferFriendListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation* Selected; // 0x1418(0x8)
		UWidgetAnimation* Hovered; // 0x1420(0x8)
		UBorder* AnimatedInputBorder; // 0x1428(0x8)
		UImage* Arrow; // 0x1430(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x1438(0x8)
		UBorder* EntryBorder; // 0x1440(0x8)
		USizeBox* Exclamation; // 0x1448(0x8)
		UCommonRichTextBlock* Text_MissedInvitesText; // 0x1450(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x1458(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ReferAFriendEntry.ReferAFriendEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_ReferAFriendEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/VoiceChatMemberListEntry.VoiceChatMemberListEntry_C
	// Inherited from UFortVoiceChatMemberListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x14F8 - 0x14B0)
	class UVoiceChatMemberListEntry_C : public UFortVoiceChatMemberListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation* Selected; // 0x14B8(0x8)
		UWidgetAnimation* Hovered; // 0x14C0(0x8)
		UImage* Arrow; // 0x14C8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14D8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14E8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/VoiceChatMemberListEntry.VoiceChatMemberListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_VoiceChatMemberListEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C
	// Inherited from UFortSocialPanelView_FriendLinkButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1438 - 0x13F0)
	class USocialPanel_FriendLinkButton_C : public UFortSocialPanelView_FriendLinkButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13F0(0x8)
		UWidgetAnimation* OnCopied; // 0x13F8(0x8)
		UWidgetAnimation* OnHovered; // 0x1400(0x8)
		UMenuAnchor* MenuAnchor_Actions; // 0x1408(0x8)
		UFortMobileImage* SharingIcon; // 0x1410(0x8)
		UCommonWidgetSwitcherLegacy* Switcher_CopyState; // 0x1418(0x8)
		UCommonTextBlock* Text_CopyConfirmed; // 0x1420(0x8)
		UCommonTextBlock* Text_FriendLinkInstructions; // 0x1428(0x8)
		UCommonTextBlock* Text_LinkPrompt; // 0x1430(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCopiedToClipboard(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnShareButtonTypeSet(EFriendLinkShareButtonType Type); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanel_FriendLinkButton(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/PartyMemberListEntry.PartyMemberListEntry_C
	// Inherited from UFortPartyMemberListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1500 - 0x14B0)
	class UPartyMemberListEntry_C : public UFortPartyMemberListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation* Selected; // 0x14B8(0x8)
		UWidgetAnimation* Hovered; // 0x14C0(0x8)
		UImage* Arrow; // 0x14C8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14D8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14E0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/PartyMemberListEntry.PartyMemberListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PartyMemberListEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/TeamMemberListEntry.TeamMemberListEntry_C
	// Inherited from UFortTeamMemberListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x50 (0x1500 - 0x14B0)
	class UTeamMemberListEntry_C : public UFortTeamMemberListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14B0(0x8)
		UWidgetAnimation* Selected; // 0x14B8(0x8)
		UWidgetAnimation* Hovered; // 0x14C0(0x8)
		UImage* Arrow; // 0x14C8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14D8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14E0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/TeamMemberListEntry.TeamMemberListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_TeamMemberListEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/JoinRequestUserListEntry.JoinRequestUserListEntry_C
	// Inherited from UFortSocialUserListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x60 (0x1500 - 0x14A0)
	class UJoinRequestUserListEntry_C : public UFortSocialUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation* Selected; // 0x14A8(0x8)
		UWidgetAnimation* Hovered; // 0x14B0(0x8)
		UImage* Arrow; // 0x14B8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14C0(0x8)
		UCommonRichTextBlock* JoinRequest; // 0x14C8(0x8)
		UCommonRichTextBlock* Text_DisplayName; // 0x14D0(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14D8(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14E0(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14F0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/JoinRequestUserListEntry.JoinRequestUserListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_JoinRequestUserListEntry(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/UserListEntry_XS.UserListEntry_XS_C
	// Inherited from UFortSocialUserListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x14F8 - 0x14A0)
	class UUserListEntry_XS_C : public UFortSocialUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation* Selected; // 0x14A8(0x8)
		UWidgetAnimation* Hovered; // 0x14B0(0x8)
		UImage* Arrow; // 0x14B8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14C0(0x8)
		UCommonRichTextBlock* Text_DisplayName; // 0x14C8(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14D0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14D8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14E8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/UserListEntry_XS.UserListEntry_XS_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_UserListEntry_XS(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/JoinablePartyActionMenu.JoinablePartyActionMenu_C
	// Inherited from UFortJoinablePartyActionMenu -> USocialInteractionMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x518 - 0x4F0)
	class UJoinablePartyActionMenu_C : public UFortJoinablePartyActionMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x4F0(0x8)
		UWidgetAnimation* ConfirmationOpened; // 0x4F8(0x8)
		UWidgetAnimation* Opened; // 0x500(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x508(0x8)
		UBorder* EntryBorder; // 0x510(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/JoinablePartyActionMenu.JoinablePartyActionMenu_C");
			return ret;
		}

		void OnToggleConfirmation(bool bIsVisible); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOpened(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_JoinablePartyActionMenu(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/JoinablePartyEntry.JoinablePartyEntry_C
	// Inherited from UFortJoinablePartyListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x78 (0x1518 - 0x14A0)
	class UJoinablePartyEntry_C : public UFortJoinablePartyListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation* Selected; // 0x14A8(0x8)
		UWidgetAnimation* Hovered; // 0x14B0(0x8)
		UBorder* AnimatedInputBorder; // 0x14B8(0x8)
		UImage* Arrow; // 0x14C0(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x14C8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14D0(0x8)
		UBorder* EntryBorder; // 0x14D8(0x8)
		USizeBox* Exclamation; // 0x14E0(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14E8(0x8)
		FSlateColor InviteFontColor; // 0x14F0(0x14)
		FSlateColor DefaultFontColor; // 0x1504(0x14)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/JoinablePartyEntry.JoinablePartyEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInviteStatusUpdated(bool bIsInvited); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_JoinablePartyEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/LeavePartyConfirmationMenu.LeavePartyConfirmationMenu_C
	// Inherited from UFortLeavePartyMenu -> USocialActionMenu -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x450 - 0x440)
	class ULeavePartyConfirmationMenu_C : public UFortLeavePartyMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x440(0x8)
		UWidgetAnimation* Opened; // 0x448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LeavePartyConfirmationMenu.LeavePartyConfirmationMenu_C");
			return ret;
		}

		void OnOpened(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_LeavePartyConfirmationMenu(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/LeavePartyListEntry.LeavePartyListEntry_C
	// Inherited from UFortLeavePartyListEntry -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1458 - 0x1410)
	class ULeavePartyListEntry_C : public UFortLeavePartyListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1410(0x8)
		UWidgetAnimation* Selected; // 0x1418(0x8)
		UWidgetAnimation* Hovered; // 0x1420(0x8)
		UBorder* AnimatedInputBorder; // 0x1428(0x8)
		UImage* Arrow; // 0x1430(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x1438(0x8)
		UBorder* EntryBorder; // 0x1440(0x8)
		UCommonRichTextBlock* Text_LeavePartyText; // 0x1448(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x1450(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/LeavePartyListEntry.LeavePartyListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_LeavePartyListEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C
	// Inherited from UFortSocialEventRSVPWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x29 (0x2D9 - 0x2B0)
	class UFortSocialEventRSVPWidget_C : public UFortSocialEventRSVPWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UOverlay* Overlay_AdditionalEvents; // 0x2B8(0x8)
		UCommonTextBlock* Text_AdditionalEvents; // 0x2C0(0x8)
		UCommonTextBlock* Text_EventName; // 0x2C8(0x8)
		UCommonTextBlock* Text_MonthDay; // 0x2D0(0x8)
		ESlateVisibility In_Visibility; // 0x2D8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/FortSocialEventRSVPWidget.FortSocialEventRSVPWidget_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnRefreshDisplay(FText& EventName, FText& Date, FText& AdditionalEvents); // Flags: Event|Public|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_FortSocialEventRSVPWidget(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Showdown/PrimarySkewButton.PrimarySkewButton_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x48 (0x1428 - 0x13E0)
	class UPrimarySkewButton_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation* Pressed; // 0x13E8(0x8)
		UWidgetAnimation* Hover; // 0x13F0(0x8)
		UCommonTextBlock* CenterButtonTextWidget; // 0x13F8(0x8)
		UImage* Image_ButtonTop; // 0x1400(0x8)
		UImage* Image_Shadow; // 0x1408(0x8)
		bool ToUpper; // 0x1410(0x1)
		bool XL; // 0x1411(0x1)
		unsigned char UnknownData00_6[0x6]; // 0x1412(0x6) UNKNOWN PROPERTY
		FText ButtonNameText; // 0x1418(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Showdown/PrimarySkewButton.PrimarySkewButton_C");
			return ret;
		}

		FEventReply OnMouseButtonUp(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnClicked(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PrimarySkewButton(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Login/SafeZone/SafeZoneEditor.SafeZoneEditor_C
	// Inherited from UFortSafeZoneEditor -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x5B0 - 0x570)
	class USafeZoneEditor_C : public UFortSafeZoneEditor	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x570(0x8)
		UVerticalBox* Default; // 0x578(0x8)
		UImage* Image; // 0x580(0x8)
		UImage* LowerLeftCorner; // 0x588(0x8)
		UImage* LowerRightCorner; // 0x590(0x8)
		USafeZone* SafeZone; // 0x598(0x8)
		UImage* UpperLeftCorner; // 0x5A0(0x8)
		UImage* UpperRightCorner; // 0x5A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Login/SafeZone/SafeZoneEditor.SafeZoneEditor_C");
			return ret;
		}

		void BndEvt__SafeZoneEditor_Button_Done_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SafeZoneEditor_Button_Back_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SafeZoneEditor(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/LocalUserEntry.LocalUserEntry_C
	// Inherited from UFortSocialEventRSVPLocalUserEntry -> UFortLocalUserEntry -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x68 (0x14A8 - 0x1440)
	class ULocalUserEntry_C : public UFortSocialEventRSVPLocalUserEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1440(0x8)
		UWidgetAnimation* Hovered; // 0x1448(0x8)
		UBorder* Border_OnlineStatusIndicator; // 0x1450(0x8)
		UFortMobileImage* FortMobileImage_enforzer; // 0x1458(0x8)
		UImage* Image_MicIcon; // 0x1460(0x8)
		UBorder* LocalUserEntryBorder; // 0x1468(0x8)
		UFortMobileImage* SettingsIcon; // 0x1470(0x8)
		FLinearColor Online; // 0x1478(0x10)
		FLinearColor Offline; // 0x1488(0x10)
		FLinearColor Away; // 0x1498(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/LocalUserEntry.LocalUserEntry_C");
			return ret;
		}

		void HandleOnlineIndicatorView(ELocalUserOnlineStatus InLocalUserOnlineStatus); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnOnlineStatusChanged(ELocalUserOnlineStatus OnlineStatus); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_LocalUserEntry(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/ListEntries/UserListEntry.UserListEntry_C
	// Inherited from UFortSocialUserListEntry -> UFortPresenceUserListEntry -> UFortSocialListUserEntryBase -> USocialListUserEntryBase -> USocialListInteractableEntryBase -> USocialListEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x58 (0x14F8 - 0x14A0)
	class UUserListEntry_C : public UFortSocialUserListEntry	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x14A0(0x8)
		UWidgetAnimation* Selected; // 0x14A8(0x8)
		UWidgetAnimation* Hovered; // 0x14B0(0x8)
		UImage* Arrow; // 0x14B8(0x8)
		UIconTextButton_C* EmptyButtonToEatOneMouseUpEvent; // 0x14C0(0x8)
		UCommonRichTextBlock* Text_DisplayName; // 0x14C8(0x8)
		UUserActionMenuInputButton_C* UserActionMenuInputButton; // 0x14D0(0x8)
		FLinearColor EncourageEpicFriend_IdleColor; // 0x14D8(0x10)
		FLinearColor EncourageEpicFriend_HoveredColor; // 0x14E8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/ListEntries/UserListEntry.UserListEntry_C");
			return ret;
		}

		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnFocusLost(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_UserListEntry(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_ClearSocialSearch.ButtonStyle_ClearSocialSearch_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_ClearSocialSearch_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/ButtonStyle_ClearSocialSearch.ButtonStyle_ClearSocialSearch_C");
			return ret;
		}
	};


	// Class /Game/UI/SocialPanel/SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C
	// Inherited from UFortFriendSearchButton -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x45 (0x14C5 - 0x1480)
	class USocialPanel_FriendSearchBar_C : public UFortFriendSearchButton	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1480(0x8)
		UWidgetAnimation* OnHovered; // 0x1488(0x8)
		UImage* AddFriendBanIcon; // 0x1490(0x8)
		UBorder* ClickCapture; // 0x1498(0x8)
		UCommonRichTextBlock* RichText_CannotAddFriends; // 0x14A0(0x8)
		UCommonRichTextBlock* RichText_SocialBan; // 0x14A8(0x8)
		UFortMobileImage* SharingIcon; // 0x14B0(0x8)
		UFortSimpleWidgetAnimationsPanel* SimpleWidgetAnimationsPanel; // 0x14B8(0x8)
		FName ShakeAnimation; // 0x14C0(0x4)
		bool bShakeAnimationIsPlaying; // 0x14C4(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C");
			return ret;
		}

		FEventReply On_ClickCapture_MouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(FText& Text); // Flags: HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanel_FriendSearchBar(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Settings/OptionsMenu.OptionsMenu_C
	// Inherited from UFortOptionsMenu -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0xFE8 - 0xFC0)
	class UOptionsMenu_C : public UFortOptionsMenu	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0xFC0(0x8)
		UFortHUDElementWrapper_C* FortHUDElementWrapper; // 0xFC8(0x8)
		USizeBox* SizeBox_ContentLetoSplitscreen; // 0xFD0(0x8)
		USizeBox* SizeBox_HeadingLeto; // 0xFD8(0x8)
		UTabGamePadConfig_v3_C* TabGamepadConfig; // 0xFE0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Settings/OptionsMenu.OptionsMenu_C");
			return ret;
		}

		void LoadTabClasses(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Handle Tab Gamepad Config Action Handler States_SAVE(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DialogResult_826C59EC4C294BC872A644878B35A13B(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void DialogResult_B31FF5BD4C0772716F27509EA83B418E(EFortDialogResult Result, FName ResultName); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnActivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTabGamePadActionsNeedBinds(TArray<FText>& ScreenLabels); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTabGamepadConfigActionHandlerStates(); // Flags: Event|Protected|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSettingsTabListPopulated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__TabList_Categories_K2Node_ComponentBoundEvent_0_OnTabButtonCreation__DelegateSignature(FName TabID, UCommonButtonBase* TabButton); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeactivated(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void On Override Reset Modal(bool bOverride); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnShowResetToDefaultModal(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSplitscreenUpdateSizing(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_OptionsMenu(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/VoiceChannelSettings.VoiceChannelSettings_C
	// Inherited from UFortVoiceSettingsDisplay -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x88 (0x450 - 0x3C8)
	class UVoiceChannelSettings_C : public UFortVoiceSettingsDisplay	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x3C8(0x8)
		UWidgetAnimation* GearHover; // 0x3D0(0x8)
		UCommonActionWidget* ActionWidget_InputDisplay; // 0x3D8(0x8)
		UImage* AlertIcon; // 0x3E0(0x8)
		UIconTextButton_C* Button_NextInputDevice; // 0x3E8(0x8)
		UIconTextButton_C* Button_NextOutputDevice; // 0x3F0(0x8)
		UIconTextButton_C* Button_TogglePTT; // 0x3F8(0x8)
		UIconTextButton_C* Button_VoiceSettings; // 0x400(0x8)
		UImage* GearIcon; // 0x408(0x8)
		UFortMobileImage* Image_TitleIcon; // 0x410(0x8)
		UCommonRichTextBlock* InputDevice; // 0x418(0x8)
		UCommonRichTextBlock* OutputDevice; // 0x420(0x8)
		UKeybindWidget_C* PTTKeybindWidget; // 0x428(0x8)
		UCommonRichTextBlock* PushToTalk; // 0x430(0x8)
		UCommonTextBlock* Text_LowPowerMode; // 0x438(0x8)
		UImage* VoiceDisabledIcon; // 0x440(0x8)
		UCommonRichTextBlock* VoiceDisabledText; // 0x448(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/VoiceChannelSettings.VoiceChannelSettings_C");
			return ret;
		}

		void OnComplete_CAAD0AF4467900CF5BC6B8B8CA0C330F(UUserWidget* UserWidget); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ShowVoiceSettingsButton(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__VoiceChannelSettings_Button_VoiceSettings_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_VoiceChannelSettings(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialPanelView_UserLists.SocialPanelView_UserLists_C
	// Inherited from UFortSocialPanelView_UserLists -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0xE8 (0x6D0 - 0x5E8)
	class USocialPanelView_UserLists_C : public UFortSocialPanelView_UserLists	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5E8(0x8)
		UWidgetAnimation* WeGameButtonHovered; // 0x5F0(0x8)
		UWidgetAnimation* SwitcherTransition; // 0x5F8(0x8)
		UWidgetAnimation* NoFriendsArrowBounce; // 0x600(0x8)
		UWidgetAnimation* MenuAnchorItemOpen; // 0x608(0x8)
		UWidgetAnimation* Open; // 0x610(0x8)
		UWidgetAnimation* Open; // 0x618(0x8)
		UImage* bckgrnd; // 0x620(0x8)
		UImage* CircularThrobber_UserSearch; // 0x628(0x8)
		UCommonRichTextBlock* CommonRichTextBlock; // 0x630(0x8)
		UImage* EmptyListImage; // 0x638(0x8)
		UFortMobileImage* FortMobileImage; // 0x640(0x8)
		UImage* Image_MicDisabled; // 0x648(0x8)
		UFortMobileImage* Image_MicIcon; // 0x650(0x8)
		UFortMobileImage* Image_MicIcon; // 0x658(0x8)
		UFortMobileImage* Image_MicIcon; // 0x660(0x8)
		UImage* Image_MicIcon; // 0x668(0x8)
		UFortMobileImage* Image_TitleIcon; // 0x670(0x8)
		UCommonRichTextBlock* RichText_LeavePlatformPartyTitle; // 0x678(0x8)
		UCommonRichTextBlock* RichText_VoiceChatDisabled; // 0x680(0x8)
		UCommonRichTextBlock* RichText_VoiceChatDisabledHeader; // 0x688(0x8)
		UCommonRichTextBlock* RichText_VoiceChatDisabledWarningMessage; // 0x690(0x8)
		URichTextBlock* RichTextBlock; // 0x698(0x8)
		USocialPanel_FriendLinkButton_C* SocialPanel_FriendLinkButton; // 0x6A0(0x8)
		UCommonTextBlock* Text_LowPowerMode; // 0x6A8(0x8)
		UCommonRichTextBlock* VoiceChat_AcceptDescription; // 0x6B0(0x8)
		UCommonRichTextBlock* VoiceChat_AcceptTitle; // 0x6B8(0x8)
		UWBP_UIKit_Button_Regular_C* WBP_UIKit_Button_LearnMore; // 0x6C0(0x8)
		UWBP_UIKit_Button_Regular_C* WBP_UIKit_Button_TurnOn; // 0x6C8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanelView_UserLists.SocialPanelView_UserLists_C");
			return ret;
		}

		void BndEvt__Switcher_UserLists_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(UWidget* ActiveWidget, int32_t ActiveWidgetIndex); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSetVoiceChannelButtonText(FText& ButtonText); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PreConstruct(bool IsDesignTime); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateAudioModerationAcceptPanelText(FText& Title, FText& Description); // Flags: Event|Protected|HasOutParms|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SocialPanelView_UserLists_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SocialPanelView_UserLists_WBP_UIKit_Button_Regular_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(UCommonButtonBase* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanelView_UserLists(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialPanel.SocialPanel_C
	// Inherited from UFortSocialPanel -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x30 (0x5A0 - 0x570)
	class USocialPanel_C : public UFortSocialPanel	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x570(0x8)
		UWidgetAnimation* OnOpened; // 0x578(0x8)
		UImage* Image_Back; // 0x580(0x8)
		ULightbox_C* Lightbox; // 0x588(0x8)
		USafeZone* SafeZone; // 0x590(0x8)
		USocialPanel_TopBarExtension_C* SocialPanel_TopBarExtension; // 0x598(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel.SocialPanel_C");
			return ret;
		}

		void Play Panel Animation Sound(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClosePanelAfterAnimation(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__SocialPanel_TopBarExtension_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClosePanel(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleOutroEnded(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginOutro(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnBeginIntro(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleIntroEnded(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanel(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/SocialPanel/SocialPanel_TopBarExtension.SocialPanel_TopBarExtension_C
	// Inherited from UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x1408 - 0x13E0)
	class USocialPanel_TopBarExtension_C : public UCommonButtonLegacy	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13E0(0x8)
		UWidgetAnimation* Hovered; // 0x13E8(0x8)
		UImage* Arrow; // 0x13F0(0x8)
		UImage* Image_PlatformIcon; // 0x13F8(0x8)
		UMiniPartyBar_C* MiniPartyBar; // 0x1400(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/SocialPanel/SocialPanel_TopBarExtension.SocialPanel_TopBarExtension_C");
			return ret;
		}

		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_SocialPanel_TopBarExtension(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Parties/MiniPartyBar.MiniPartyBar_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x318 - 0x2D8)
	class UMiniPartyBar_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UIconTextButton_C* ButtonLocalPlayer; // 0x2E0(0x8)
		UImage* LineSeparator; // 0x2E8(0x8)
		UTeamMemberBanner_C* LocalPlayer; // 0x2F0(0x8)
		UTeamMemberBanner_C* RemotePlayer1; // 0x2F8(0x8)
		UTeamMemberBanner_C* RemotePlayer2; // 0x300(0x8)
		UTeamMemberBanner_C* RemotePlayer3; // 0x308(0x8)
		UTeamMemberManage_C* NewLocalPlayerWidget; // 0x310(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Parties/MiniPartyBar.MiniPartyBar_C");
			return ret;
		}

		UWidget Get Banners Tooltip Widget(); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePartybarUIFeatureChanged(EFortUIFeature Feature, EFortUIFeatureState FeatureState); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ButtonLocalPlayer_K2Node_ComponentBoundEvent_81_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MiniPartyBar(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Frontend/Parties/TeamMemberBanner.TeamMemberBanner_C
	// Inherited from UFortCampaignTeamMemberBanner -> UFortCampaignTeamMemberEntry -> UFortTeamMemberEntryBase -> UCommonButtonLegacy -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x1460 - 0x1420)
	class UTeamMemberBanner_C : public UFortCampaignTeamMemberBanner	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x8)
		UIconTextButton_C* ButtonPartyFinder; // 0x1428(0x8)
		UOverlay* Connected; // 0x1430(0x8)
		USizeBox* Connecting; // 0x1438(0x8)
		UImage* Image; // 0x1440(0x8)
		UOverlay* Open; // 0x1448(0x8)
		UImage* OpenImage; // 0x1450(0x8)
		UCommonWidgetSwitcherLegacy* Switcher_MemberState; // 0x1458(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Frontend/Parties/TeamMemberBanner.TeamMemberBanner_C");
			return ret;
		}

		void OpenPartyFinder(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleMouseHoverVisualState(bool Hover); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(UCommonButtonLegacy* Button); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnTeamMemberConnectionStateChanged(EFortMemberConnectionState NewConnectionState); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_TeamMemberBanner(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Config/DefaultUIDataConfiguration.DefaultUIDataConfiguration_C
	// Inherited from UFortUIDataConfiguration -> UPrimaryDataAsset -> UDataAsset -> UObject
	// Size: 0x0 (0x4320 - 0x4320)
	class UDefaultUIDataConfiguration_C : public UFortUIDataConfiguration	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Config/DefaultUIDataConfiguration.DefaultUIDataConfiguration_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B-S.TextStyle-Base-XS-B-S_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B-S_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B-S.TextStyle-Base-XS-B-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-S-B-S.TextStyle-Base-S-B-S_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-S-B-S_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-S-B-S.TextStyle-Base-S-B-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XXS-B-S.TextStyle-Base-XXS-B-S_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XXS-B-S_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XXS-B-S.TextStyle-Base-XXS-B-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Header-S.TextStyle-Header-S_C
	// Inherited from UTextStyle-HeaderParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Header-S_C : public UTextStyle-HeaderParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Header-S.TextStyle-Header-S_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Watermark/BuildWatermark.BuildWatermark_C
	// Inherited from UFortBuildWatermark -> UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x8 (0x338 - 0x330)
	class UBuildWatermark_C : public UFortBuildWatermark	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x330(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Watermark/BuildWatermark.BuildWatermark_C");
			return ret;
		}

		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePartyJoined(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePlayerStateChanged(FFortTeamMemberInfo& PlayerInfo); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_BuildWatermark(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Movie/Legacy_MovieWidget.Legacy_MovieWidget_C
	// Inherited from UFortMovieWidget -> UFortUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x338 - 0x2F8)
	class ULegacy_MovieWidget_C : public UFortMovieWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2F8(0x8)
		UImage* Video_Image; // 0x300(0x8)
		UScaleBox* Video_ScaleBox; // 0x308(0x8)
		bool shouldloop; // 0x310(0x1)
		bool AutoPlay; // 0x311(0x1)
		bool MaintainAspectRatio; // 0x312(0x1)
		unsigned char UnknownData00_6[0x5]; // 0x313(0x5) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnMediaReadyToPlay; // 0x318(0x10)
		FMulticastInlineDelegate OnMediaFailedToOpen; // 0x328(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Movie/Legacy_MovieWidget.Legacy_MovieWidget_C");
			return ret;
		}

		void SetDelayedContentValues(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Play(bool ShouldRewind); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopPlaying(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Init(UMediaPlayer* InMediaPlayer, UMediaSource* InMediaSource, UObject* InMediaSoundWave, int32_t AudioTrack); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void MediaDimensionsUpdated(float NewWidth, float NewHeight); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMediaLoaded(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Legacy_MovieWidget(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMediaFailedToOpen__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnMediaReadyToPlay__DelegateSignature(); // Flags: Public|Delegate|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Subtitles/Subtitles.Subtitles_C
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x328 - 0x318)
	class USubtitles_C : public UFortHUDElementWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x8)
		USubtitleDisplay* SubtitleDisplay; // 0x320(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Subtitles/Subtitles.Subtitles_C");
			return ret;
		}

		void TagCountChanged_A7AB416146C6024A11C1AD94F917A95C(int32_t TagCount); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Subtitles(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/InGame/HUD/MicIndicator/MicIndicator.MicIndicator_C
	// Inherited from UFortMicIndicatorWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2A (0x332 - 0x308)
	class UMicIndicator_C : public UFortMicIndicatorWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x308(0x8)
		UOverlay* 01_NotSpeaking; // 0x310(0x8)
		UOverlay* 02_Speaking; // 0x318(0x8)
		UOverlay* 03_Muted; // 0x320(0x8)
		UWidgetSwitcher* MicStateSwitcher; // 0x328(0x8)
		bool bIsMuted; // 0x330(0x1)
		bool bIsTalking; // 0x331(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/InGame/HUD/MicIndicator/MicIndicator.MicIndicator_C");
			return ret;
		}

		void OnPlayerTalkingChanged(bool bIsTalking); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnPlayerMuted(bool bIsMuted); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_MicIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/MicIndicator/Cinematic-TeamMics.Cinematic-TeamMics_C
	// Inherited from UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x258 (0x530 - 0x2D8)
	class UCinematic-TeamMics_C : public UCommonUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2D8(0x8)
		UMicIndicator_C* MicIndicator; // 0x2E0(0x8)
		UCommonWidgetSwitcherLegacy* SwitcherConnectingStranger; // 0x2E8(0x8)
		UCommonTextBlock* TextBlock; // 0x2F0(0x8)
		UCommonTextBlock* TextPlayerName; // 0x2F8(0x8)
		FFortTeamMemberInfo MemberInfo; // 0x300(0x230)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MicIndicator/Cinematic-TeamMics.Cinematic-TeamMics_C");
			return ret;
		}

		void Update(FFortTeamMemberInfo UpdatedMemberInfo); // Flags: Public|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Cinematic-TeamMics(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/MicIndicator/TeamMicStack.TeamMicStack_C
	// Inherited from UFortHUDElementWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x28 (0x340 - 0x318)
	class UTeamMicStack_C : public UFortHUDElementWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x8)
		UVerticalBox* _Vertical_Box__Team_Members; // 0x320(0x8)
		UCommonBorder* BorderFrame; // 0x328(0x8)
		TArray<UCinematic-TeamMics_C*> TeamMembers; // 0x330(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/MicIndicator/TeamMicStack.TeamMicStack_C");
			return ret;
		}

		void ClearContents(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void AppendTeamMember(FFortTeamMemberInfo& TeamMemberInfo); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTeamMemberChanged(FFortTeamMemberInfo Member Info); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleTeamMemberRemoved(int32_t Member Index); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandlePartyLeft(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_TeamMicStack(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/StateLayouts/Cinematic.Cinematic_C
	// Inherited from UFortUIStateWidget_NUI -> UFortActivatablePanel -> UCommonActivatablePanelLegacy -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x59 (0x5F9 - 0x5A0)
	class UCinematic_C : public UFortUIStateWidget_NUI	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x5A0(0x8)
		UNamedSlot* LocalizedAudioOnlyMovieSlot; // 0x5A8(0x8)
		UCommonWidgetStackLegacy* MainContentStack; // 0x5B0(0x8)
		UNamedSlot* MovieSlot; // 0x5B8(0x8)
		UOverlay* OverlayMovieOverlay; // 0x5C0(0x8)
		USubtitles_C* Subtitles; // 0x5C8(0x8)
		UTeamMicStack_C* TeamMicStack; // 0x5D0(0x8)
		UBuildWatermark_C* Widget_BuildWatermark; // 0x5D8(0x8)
		ULegacy_MovieWidget_C* MovieWidget; // 0x5E0(0x8)
		UFortMediaSubtitlesPlayer* SubtitlesPlayer; // 0x5E8(0x8)
		UObject* CinematicMediaSoundWave; // 0x5F0(0x8)
		bool bFinished; // 0x5F8(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/StateLayouts/Cinematic.Cinematic_C");
			return ret;
		}

		void GetAudioTrackIndex(int32_t& AudioTrack); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void StopAndClearSubtitles(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearOldSubtitlesIfNecessary(bool NewSubtitlesExist, UFortMediaSubtitlesPlayer* NewSubtitles); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetMoviePlaying(bool MoviePlaying); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearMovieWidget(UFortMovieWidget* MovieWidgetToClear); // Flags: Public|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearMovieSlot(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		UWidget PopContentWidgetInternal(FContentPushState State); // Flags: Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SkipMovie(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ClearMovie(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Show Movie(UMediaPlayer* MediaPlayer, UMediaSource* MediaSource); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Construct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleClientEvent_QueueCinematic(UObject* EventSource, UObject* EventFocus, FFortClientEvent& ClientEvent); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void Destruct(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleEndReached(); // Flags: BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void HandleClientEvent_SkipCinematic(UObject* EventSource, UObject* EventFocus, FFortClientEvent& ClientEvent); // Flags: HasOutParms|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void PushContentWidgetInternal(UWidget* Widget, FContentPushState State); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnEnterState(EFortUIState PreviousUIState); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnExitState(EFortUIState NextUIState); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_Cinematic(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Text/TextStyle-Base-XS-B-Black.TextStyle-Base-XS-B-Black_C
	// Inherited from UTextStyle-Base-S-B_C -> UTextStyle-Base-S_C -> UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Base-XS-B-Black_C : public UTextStyle-Base-S-B_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-Base-XS-B-Black.TextStyle-Base-XS-B-Black_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankDark.TextStyle-Button-Primary-M_Skew_BurbankDark_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M_Skew_BurbankDark_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankDark.TextStyle-Button-Primary-M_Skew_BurbankDark_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankLightBlue.TextStyle-Button-Primary-M_Skew_BurbankLightBlue_C
	// Inherited from UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-Button-Primary-M_Skew_BurbankLightBlue_C : public UCommonTextStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/TextStyles/TextStyle-Button-Primary-M_Skew_BurbankLightBlue.TextStyle-Button-Primary-M_Skew_BurbankLightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyOrthogonalIndicator.PlayerSurveyOrthogonalIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UPlayerSurveyOrthogonalIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UCommonActionWidget* InputActionWidget_Move; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyOrthogonalIndicator.PlayerSurveyOrthogonalIndicator_C");
			return ret;
		}

		void UpdateGamepadControlsVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__InputActionWidget_Move_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerSurveyOrthogonalIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyVerticalIndicator.PlayerSurveyVerticalIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UPlayerSurveyVerticalIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UCommonActionWidget* InputActionWidget_Move; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyVerticalIndicator.PlayerSurveyVerticalIndicator_C");
			return ret;
		}

		void UpdateGamepadControlsVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__InputActionWidget_Move_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerSurveyVerticalIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Text/TextStyle-BurbankSmall-20-Black.TextStyle-BurbankSmall-20-Black_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle-BurbankSmall-20-Black_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle-BurbankSmall-20-Black.TextStyle-BurbankSmall-20-Black_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White50pc.TextStyle_BurbSmBk_20_White50pc_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_20_White50pc_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White50pc.TextStyle_BurbSmBk_20_White50pc_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-YellowSkew.ButtonStyle-PlayerSurvey-YellowSkew_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-PlayerSurvey-YellowSkew_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-YellowSkew.ButtonStyle-PlayerSurvey-YellowSkew_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White.TextStyle_BurbSmBk_20_White_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_20_White_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_White.TextStyle_BurbSmBk_20_White_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_LightBlue.TextStyle_BurbSmBk_20_LightBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbSmBk_20_LightBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/TextStyle_BurbSmBk_20_LightBlue.TextStyle_BurbSmBk_20_LightBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_AngledBlueMenuButton.Athena_ButtonStyle_AngledBlueMenuButton_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UAthena_ButtonStyle_AngledBlueMenuButton_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Athena/Athena_ButtonStyle_AngledBlueMenuButton.Athena_ButtonStyle_AngledBlueMenuButton_C");
			return ret;
		}
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyHorizontalIndicator.PlayerSurveyHorizontalIndicator_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x2C0 - 0x2B0)
	class UPlayerSurveyHorizontalIndicator_C : public UUserWidget	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x2B0(0x8)
		UCommonActionWidget* InputActionWidget_Move; // 0x2B8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyHorizontalIndicator.PlayerSurveyHorizontalIndicator_C");
			return ret;
		}

		void UpdateGamepadControlsVisibility(); // Flags: Public|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__InputActionWidget_Move_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerSurveyHorizontalIndicator(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/Text/TextStyle_BurbankSmall_M_White.TextStyle_BurbankSmall_M_White_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbankSmall_M_White_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle_BurbankSmall_M_White.TextStyle_BurbankSmall_M_White_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Text/TextStyle_BurbankSmall_L_DarkBlue.TextStyle_BurbankSmall_L_DarkBlue_C
	// Inherited from UTextStyle-BaseParent_C -> UTextStyle-Base_C -> UCommonTextStyle -> UObject
	// Size: 0x0 (0x190 - 0x190)
	class UTextStyle_BurbankSmall_L_DarkBlue_C : public UTextStyle-BaseParent_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Text/TextStyle_BurbankSmall_L_DarkBlue.TextStyle_BurbankSmall_L_DarkBlue_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle_Radial.ButtonStyle_Radial_C
	// Inherited from UButtonStyle-MediumTransparentNoCues_C -> UButtonStyle-MediumBase_C -> UButtonStyle-Base_C -> UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle_Radial_C : public UButtonStyle-MediumTransparentNoCues_C	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle_Radial.ButtonStyle_Radial_C");
			return ret;
		}
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C
	// Inherited from UFortPlayerSurveyRatingChoiceBase -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x10 (0x13B0 - 0x13A0)
	class UPlayerSurveyRatingChoice_C : public UFortPlayerSurveyRatingChoiceBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13A0(0x8)
		UCommonActionWidget* InputActionWidget_Select; // 0x13A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C");
			return ret;
		}

		void GetCurrentButtonBrush(FSlateBrush& CurrentBrush); // Flags: Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateInputActionRenderOpacity(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateTextStyle(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSurveyResetChoice(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerSurveyRatingChoice(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/Foundation/SoftwareCursors/InvisibleCursorWidget.InvisibleCursorWidget_C
	// Inherited from UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x0 (0x2B0 - 0x2B0)
	class UInvisibleCursorWidget_C : public UUserWidget	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/SoftwareCursors/InvisibleCursorWidget.InvisibleCursorWidget_C");
			return ret;
		}
	};


	// Class /Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-ChoiceResponse.ButtonStyle-PlayerSurvey-ChoiceResponse_C
	// Inherited from UCommonButtonStyle -> UObject
	// Size: 0x0 (0x6B0 - 0x6B0)
	class UButtonStyle-PlayerSurvey-ChoiceResponse_C : public UCommonButtonStyle	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/Foundation/Buttons/ButtonStyles/Survey/ButtonStyle-PlayerSurvey-ChoiceResponse.ButtonStyle-PlayerSurvey-ChoiceResponse_C");
			return ret;
		}
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C
	// Inherited from UFortPlayerSurveyResponseChoiceBase -> UCommonButtonBase -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x2E1 (0x1681 - 0x13A0)
	class UPlayerSurveyResponseChoice_C : public UFortPlayerSurveyResponseChoiceBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x13A0(0x8)
		UBorder* Border_InputActionCircle; // 0x13A8(0x8)
		UImage* Image_Checkbox; // 0x13B0(0x8)
		UCommonActionWidget* InputActionWidget_Select; // 0x13B8(0x8)
		FSlateBrush Brush_RadioUnchecked; // 0x13C0(0xB0)
		FSlateBrush Brush_RadioChecked; // 0x1470(0xB0)
		FSlateBrush Brush_CheckboxUnchecked; // 0x1520(0xB0)
		FSlateBrush Brush_CheckboxChecked; // 0x15D0(0xB0)
		TEnumAsByte<EFortPlayerSurveyResponseChoiceType> ChoiceType; // 0x1680(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C");
			return ret;
		}

		void Update Text Scale(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void GetCurrentButtonBrush(FSlateBrush& CurrentBrush); // Flags: Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateChoiceImage(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateInputActionRenderOpacity(); // Flags: Private|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void UpdateButtonColor(); // Flags: Private|HasDefaults|BlueprintCallable|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnHovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnUnhovered(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void SetChoiceType(TEnumAsByte<EFortPlayerSurveyResponseChoiceType> Type); // Flags: Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnSurveyResetChoice(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnSelected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BP_OnDeselected(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnInitialized(); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnCurrentTextStyleChanged(); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void BndEvt__PlayerSurveyResponseChoice_InputActionWidget_Select_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature(); // Flags: BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerSurveyResponseChoice(int32_t EntryPoint); // Flags: Final, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveyMultipleChoiceResponse.PlayerSurveyMultipleChoiceResponse_C
	// Inherited from UFortPlayerSurveyMultipleChoiceResponseBase -> UFortPlayerSurveyChoiceResponseWidget -> UFortPlayerSurveyResponseWidget -> UCommonActivatableWidget -> UCommonUserWidget -> UUserWidget -> UWidget -> UVisual -> UObject
	// Size: 0x40 (0x480 - 0x440)
	class UPlayerSurveyMultipleChoiceResponse_C : public UFortPlayerSurveyMultipleChoiceResponseBase	
	{
	public:
		FPointerToUberGraphFrame UberGraphFrame; // 0x440(0x8)
		UOverlay* Overlay_OrthogonalIndicator; // 0x448(0x8)
		UOverlay* Overlay_VerticalIndicator; // 0x450(0x8)
		UPlayerSurveyOrthogonalIndicator_C* PlayerSurveyOrthogonalIndicator; // 0x458(0x8)
		UPlayerSurveyVerticalIndicator_C* PlayerSurveyVerticalIndicator; // 0x460(0x8)
		USizeBox* SizeBox_Responses; // 0x468(0x8)
		double BaseColumnWidth; // 0x470(0x8)
		double AdditionalColumnWidth; // 0x478(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Game/UI/PlayerSurvey/Widgets/PlayerSurveyMultipleChoiceResponse.PlayerSurveyMultipleChoiceResponse_C");
			return ret;
		}

		void SetNumberOfResponses(int32_t NumberOfResponses); // Flags: Event|Protected|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void OnAddedToFocusPath(FFocusEvent InFocusEvent); // Flags: BlueprintCosmetic|Event|Public|BlueprintEvent, Memory Exec: 0x7FF7471BBE78(relative to base address)
		void ExecuteUbergraph_PlayerSurveyMultipleChoiceResponse(int32_t EntryPoint); // Flags: Final|HasDefaults, Memory Exec: 0x7FF7471BBE78(relative to base address)
	};


	// Class /Game/UI/PlayerSurvey/Widgets/PlayerSurveySingleChoiceResponse.PlayerSurveySingleChoiceResponse_C
