#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: _Verse
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Struct /Solaris/_Verse/VNI/VerseNative.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_R	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_K_Kchar_M_Kchar_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_K_Kchar_M_Kchar_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		unsigned char UnknownData01_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_M_Kany_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kany_M_Kany_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		TArray __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Many_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Many_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_7[0x17]; // 0x11(0x17) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mint_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mint_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x18(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		Ftuple_L_Kany_M_Kany_R __verse_0x932BF92E_Elem2; // 0x18(0x20)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		Ftuple_Lany_Many_R __verse_0x932BF92E_Elem2; // 0x18(0x20)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		Ftuple_Lint_M_Kany_R __verse_0x932BF92E_Elem2; // 0x18(0x18)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		Ftuple_Lint_Many_R __verse_0x932BF92E_Elem2; // 0x18(0x18)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		Ftuple_Lint_Mint_R __verse_0x932BF92E_Elem2; // 0x18(0x10)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Ltype_7b0_7d_Mint_R_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Ltype_7b0_7d_Mint_R_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		Ftuple_Ltype_7b0_7d_Mint_R __verse_0x932BF92E_Elem2; // 0x18(0x10)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_Kchar_M_QWhere_Nlocale_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QWhere_Nlocale_R	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_39	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lany_Many_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lany_Many_R	
	{
	public:
		unsigned char UnknownData01_2[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lfloat_M_QWhere_Nlocale_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lfloat_M_QWhere_Nlocale_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x2]; // 0x8(0x2) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lfloat_Mfloat_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lfloat_Mfloat_Mfloat_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lfloat_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lfloat_Mfloat_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lfloat_Mtuple_L_R_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lfloat_Mtuple_L_R_Mfloat_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lint_M_Kany_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lint_M_Kany_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		TArray __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lint_M_QWhere_Nlocale_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lint_M_QWhere_Nlocale_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x2]; // 0x8(0x2) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lint_Many_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lint_Many_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lint_Mint_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lint_Mint_Mint_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Lint_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lint_Mint_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.tuple_Ltype_7b0_7d_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Ltype_7b0_7d_Mint_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /Verse/_Verse/VNI/Verse.Verse_locale
	// Size: 0x1 (0x1 - 0x0)
	struct FVerse_locale	
	{
	public:
		unsigned char UnknownData01_2[0x1]; // 0x0(0x1) UNKNOWN PROPERTY
	};


	// Struct /VerseRestricted/_Verse/VNI/VerseRestricted.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_40	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseEngine/_Verse/VNI/VerseEngine.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_41	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseEngine/_Verse/VNI/VerseEngine.tuple_Lvk__component_Msupertype_Lany_R_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lvk__component_Msupertype_Lany_R_R	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UClass __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Execution.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_42	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_Rdup_43	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath_transform
	// Size: 0x60 (0x60 - 0x0)
	struct FSpatialMath_transform	
	{
	public:
		FSpatialMath_vector3 __verse_0xA376805D_Scale; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x78C70FF3_Rotation; // 0x20(0x20)
		FSpatialMath_vector3 __verse_0x4E05BF15_Translation; // 0x40(0x18)
		unsigned char UnknownData03_7[0x8]; // 0x58(0x8) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath_vector2
	// Size: 0x10 (0x10 - 0x0)
	struct FSpatialMath_vector2	
	{
	public:
		double __verse_0x51F8FD2F_X; // 0x0(0x8)
		double __verse_0x349F4197_Y; // 0x8(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath_vector2i
	// Size: 0x10 (0x10 - 0x0)
	struct FSpatialMath_vector2i	
	{
	public:
		int64_t __verse_0x51F8FD2F_X; // 0x0(0x8)
		int64_t __verse_0x349F4197_Y; // 0x8(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath_vector3
	// Size: 0x18 (0x18 - 0x0)
	struct FSpatialMath_vector3	
	{
	public:
		double __verse_0x51F8FD2F_X; // 0x0(0x8)
		double __verse_0x349F4197_Y; // 0x8(0x8)
		double __verse_0xDA30F485_Z; // 0x10(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_L_Kany_Mtype_7b___L_Nany_M_Nany_R_3ccomputes_3e_3cdecides_3e_Nvoid_7d_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kany_Mtype_7b___L_Nany_M_Nany_R_3ccomputes_3e_3cdecides_3e_Nvoid_7d_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		unsigned char UnknownData01_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_44	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lany_Many_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lany_Many_Rdup_45	
	{
	public:
		unsigned char UnknownData01_2[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lfloat_Mfloat_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lfloat_Mfloat_Mfloat_Rdup_46	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lfloat_Mtuple_L_R_Mtuple_L_R_Rdup_47	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lfloat_Mvector2_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lfloat_Mvector2_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector2 __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lfloat_Mvector3_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lfloat_Mvector3_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lint_Mvector2i_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lint_Mvector2i_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector2i __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lrotation_Mrotation_Mfloat_R
	// Size: 0x48 (0x48 - 0x0)
	struct Ftuple_Lrotation_Mrotation_Mfloat_R	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
		double __verse_0x932BF92E_Elem2; // 0x40(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lrotation_Mrotation_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lrotation_Mrotation_R	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lrotation_Mtuple_L_R_Mfloat_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lrotation_Mtuple_L_R_Mfloat_R	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x20(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
		double __verse_0x932BF92E_Elem2; // 0x28(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lrotation_Mtuple_L_R_Mrotation_R
	// Size: 0x50 (0x50 - 0x0)
	struct Ftuple_Lrotation_Mtuple_L_R_Mrotation_R	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x20(0x1)
		unsigned char UnknownData01_6[0xF]; // 0x21(0xF) UNKNOWN PROPERTY
		FVerseRotation __verse_0x932BF92E_Elem2; // 0x30(0x20)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0x22 (0x22 - 0x0)
	struct Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x20(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x21(0x1)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lrotation_Mtuple_L_R_Mvector3_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lrotation_Mtuple_L_R_Mvector3_R	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x20(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0x932BF92E_Elem2; // 0x28(0x18)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Ltransform_Mvector3_R
	// Size: 0x78 (0x78 - 0x0)
	struct Ftuple_Ltransform_Mvector3_R	
	{
	public:
		FSpatialMath_transform __verse_0x18E3F084_Elem0; // 0x0(0x60)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x60(0x18)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lvector2_Mfloat_R	
	{
	public:
		FSpatialMath_vector2 __verse_0x18E3F084_Elem0; // 0x0(0x10)
		double __verse_0x7D844C3C_Elem1; // 0x10(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2_Mtuple_L_R_Mfloat_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lvector2_Mtuple_L_R_Mfloat_R	
	{
	public:
		FSpatialMath_vector2 __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		double __verse_0x932BF92E_Elem2; // 0x18(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		FSpatialMath_vector2 __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x11(0x1)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2_Mvector2_Mfloat_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector2_Mvector2_Mfloat_R	
	{
	public:
		FSpatialMath_vector2 __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FSpatialMath_vector2 __verse_0x7D844C3C_Elem1; // 0x10(0x10)
		double __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2_Mvector2_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lvector2_Mvector2_R	
	{
	public:
		FSpatialMath_vector2 __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FSpatialMath_vector2 __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2i_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lvector2i_Mint_R	
	{
	public:
		FSpatialMath_vector2i __verse_0x18E3F084_Elem0; // 0x0(0x10)
		int64_t __verse_0x7D844C3C_Elem1; // 0x10(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector2i_Mvector2i_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lvector2i_Mvector2i_R	
	{
	public:
		FSpatialMath_vector2i __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FSpatialMath_vector2i __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector3_Mfloat_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lvector3_Mfloat_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector3_Mtuple_L_R_Mfloat_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_Mtuple_L_R_Mfloat_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x18(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		double __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0x1A (0x1A - 0x0)
	struct Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x18(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x19(0x1)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector3_Mvector3_Mfloat_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lvector3_Mvector3_Mfloat_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		double __verse_0x932BF92E_Elem2; // 0x30(0x8)
	};


	// Struct /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.tuple_Lvector3_Mvector3_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lvector3_Mvector3_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.Colors_color
	// Size: 0x18 (0x18 - 0x0)
	struct FColors_color	
	{
	public:
		double __verse_0x35184040_R; // 0x0(0x8)
		double __verse_0x98BF8727_G; // 0x8(0x8)
		double __verse_0xAA4F5910_B; // 0x10(0x8)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lcolor_Mcolor_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lcolor_Mcolor_R	
	{
	public:
		FColors_color __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FColors_color __verse_0x7D844C3C_Elem1; // 0x18(0x18)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lcolor_Mfloat_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lcolor_Mfloat_R	
	{
	public:
		FColors_color __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lcolor_Mint_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lcolor_Mint_R	
	{
	public:
		FColors_color __verse_0x18E3F084_Elem0; // 0x0(0x18)
		int64_t __verse_0x7D844C3C_Elem1; // 0x18(0x8)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lfloat_Mcolor_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lfloat_Mcolor_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FColors_color __verse_0x7D844C3C_Elem1; // 0x8(0x18)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lfloat_Mfloat_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lfloat_Mfloat_Mfloat_Rdup_48	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lint_Mcolor_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lint_Mcolor_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FColors_color __verse_0x7D844C3C_Elem1; // 0x8(0x18)
	};


	// Struct /VerseColors/_Verse/VNI/VerseColors.tuple_Lint_Mint_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lint_Mint_Mint_Rdup_49	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseEngine/_Verse/VNI/VerseAssets.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_50	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseEngine/_Verse/VNI/VerseAssets.tuple_Lsupertype_Lany_R_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lsupertype_Lany_R_M_Kchar_R	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /VersePrint/_Verse/VNI/VersePrint.tuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R	
	{
	public:
		unsigned char UnknownData01_2[0x40]; // 0x0(0x40) UNKNOWN PROPERTY
	};


	// Struct /VersePrint/_Verse/VNI/VersePrint.tuple_Lmessage_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lmessage_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R	
	{
	public:
		UVerse_message __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x30]; // 0x8(0x30) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R	
	{
	public:
		unsigned char UnknownData01_2[0x40]; // 0x0(0x40) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R
	// Size: 0x48 (0x48 - 0x0)
	struct Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R	
	{
	public:
		unsigned char UnknownData02_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		Testing_test_result __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData03_7[0x37]; // 0x11(0x37) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_51	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_7[0x48]; // 0x18(0x48) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_7[0x68]; // 0x18(0x68) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_Mrotation_M_QExtent_Nvector3_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0xA8 (0xA8 - 0x0)
	struct Ftuple_Lvector3_Mrotation_M_QExtent_Nvector3_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
		unsigned char UnknownData03_7[0x68]; // 0x40(0x68) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_Mrotation_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0xA8 (0xA8 - 0x0)
	struct Ftuple_Lvector3_Mrotation_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
		unsigned char UnknownData03_7[0x68]; // 0x40(0x68) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_Mvector3_M_QArrowSize_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x88 (0x88 - 0x0)
	struct Ftuple_Lvector3_Mvector3_M_QArrowSize_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		unsigned char UnknownData01_7[0x58]; // 0x30(0x58) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_Mvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x78 (0x78 - 0x0)
	struct Ftuple_Lvector3_Mvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		unsigned char UnknownData01_7[0x48]; // 0x30(0x48) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_Mvector3_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QNumSides_Nint_20_3d_20_2e_2e_2e_M_QAngleWidthRadians_Nfloat_20_3d_20_2e_2e_2e_M_QAngleHeightRadians_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0xB8 (0xB8 - 0x0)
	struct Ftuple_Lvector3_Mvector3_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QNumSides_Nint_20_3d_20_2e_2e_2e_M_QAngleWidthRadians_Nfloat_20_3d_20_2e_2e_2e_M_QAngleHeightRadians_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		unsigned char UnknownData01_7[0x88]; // 0x30(0x88) UNKNOWN PROPERTY
	};


	// Struct /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.tuple_Lvector3_Mvector3_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x98 (0x98 - 0x0)
	struct Ftuple_Lvector3_Mvector3_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		unsigned char UnknownData01_7[0x68]; // 0x30(0x68) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_query_result
	// Size: 0x80 (0x80 - 0x0)
	struct FEpicGamesRestricted_Spline_spline_query_result	
	{
	public:
		FSpatialMath_transform __verse_0xE64384A9_out_transform; // 0x0(0x60)
		FSpatialMath_vector3 __verse_0x97879EFC_tangent; // 0x60(0x18)
		unsigned char UnknownData01_7[0x8]; // 0x78(0x8) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_52	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.tuple_Lfloat_Mlogic_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lfloat_Mlogic_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x8:0(0x1)
	};


	// Struct /EntityFramework/_Verse/VNI/Entity.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_53	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EntityFramework/_Verse/VNI/Entity.tuple_Laccessor_Mtick__events_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mtick__events_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		Utick_events __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Entity.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /EntityFramework/_Verse/VNI/EntityTestSuite.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_54	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EntityFramework/_Verse/VNI/ExecutionTestSuite.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_55	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseSimulation/_Verse/VNI/VerseSimulation.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_56	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseSimulation/_Verse/VNI/VerseSimulation.tuple_Lint_Msupertype_Lany_R_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lint_Msupertype_Lany_R_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UClass __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseSimulation/_Verse/VNI/VerseSimulation.tuple_Lplayer__component_Msupertype_Lany_R_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lplayer__component_Msupertype_Lany_R_R	
	{
	public:
		USimulation_player_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UClass __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_Rdup_57	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_L_Kchar_M_Qwidget_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_L_Kchar_M_Qwidget_R	
	{
	public:
		unsigned char UnknownData01_2[0x18]; // 0x0(0x18) UNKNOWN PROPERTY
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_L_Kchar_Mwidget_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_L_Kchar_Mwidget_R	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		UUI_widget __verse_0x7D844C3C_Elem1; // 0x10(0x8)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_58	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_Limage__tiling_Mimage__tiling_R
	// Size: 0x2 (0x2 - 0x0)
	struct Ftuple_Limage__tiling_Mimage__tiling_R	
	{
	public:
		UI_image_tiling __verse_0x18E3F084_Elem0; // 0x0(0x1)
		UI_image_tiling __verse_0x7D844C3C_Elem1; // 0x1(0x1)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_Lsupertype_Lany_R_M_Kchar_Many_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lsupertype_Lany_R_M_Kchar_Many_R	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x20]; // 0x8(0x20) UNKNOWN PROPERTY
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_Lsupertype_Lany_R_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lsupertype_Lany_R_M_Kchar_Rdup_59	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_Lwidget_Mplayer__ui__slot_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lwidget_Mplayer__ui__slot_R	
	{
	public:
		UUI_widget __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FUI_player_ui_slot __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.tuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R
	// Size: 0x58 (0x58 - 0x0)
	struct Ftuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R	
	{
	public:
		UUI_widget __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector2 __verse_0x7D844C3C_Elem1; // 0x8(0x10)
		unsigned char UnknownData01_7[0x40]; // 0x18(0x40) UNKNOWN PROPERTY
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_anchors
	// Size: 0x20 (0x20 - 0x0)
	struct FUI_anchors	
	{
	public:
		FSpatialMath_vector2 __verse_0x91692725_Minimum; // 0x0(0x10)
		FSpatialMath_vector2 __verse_0xDF63CF93_Maximum; // 0x10(0x10)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_button_slot
	// Size: 0x30 (0x30 - 0x0)
	struct FUI_button_slot	
	{
	public:
		UUI_widget __verse_0xA5B83AD1_Widget; // 0x0(0x8)
		UI_horizontal_alignment __verse_0xF13651F1_HorizontalAlignment; // 0x8(0x1)
		UI_vertical_alignment __verse_0xA83057DE_VerticalAlignment; // 0x9(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
		FUI_margin __verse_0x7F718DF5_Padding; // 0x10(0x20)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_canvas_slot
	// Size: 0x68 (0x68 - 0x0)
	struct FUI_canvas_slot	
	{
	public:
		FUI_anchors __verse_0x6C624651_Anchors; // 0x0(0x20)
		FUI_margin __verse_0xAE9C7630_Offsets; // 0x20(0x20)
		bool __verse_0x270727B9_SizeToContent : 1; // 0x40:0(0x1)
		unsigned char UnknownData01_5[0x7]; // 0x41(0x7) UNKNOWN PROPERTY
		FSpatialMath_vector2 __verse_0xE9839A38_Alignment; // 0x48(0x10)
		int64_t __verse_0xEB688892_ZOrder; // 0x58(0x8)
		UUI_widget __verse_0xA5B83AD1_Widget; // 0x60(0x8)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_margin
	// Size: 0x20 (0x20 - 0x0)
	struct FUI_margin	
	{
	public:
		double __verse_0x88EBCF27_Left; // 0x0(0x8)
		double __verse_0x97B55C26_Top; // 0x8(0x8)
		double __verse_0x296C864F_Right; // 0x10(0x8)
		double __verse_0x7AA421E3_Bottom; // 0x18(0x8)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_overlay_slot
	// Size: 0x30 (0x30 - 0x0)
	struct FUI_overlay_slot	
	{
	public:
		UUI_widget __verse_0xA5B83AD1_Widget; // 0x0(0x8)
		UI_horizontal_alignment __verse_0xF13651F1_HorizontalAlignment; // 0x8(0x1)
		UI_vertical_alignment __verse_0xA83057DE_VerticalAlignment; // 0x9(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
		FUI_margin __verse_0x7F718DF5_Padding; // 0x10(0x20)
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_player_ui_slot
	// Size: 0x10 (0x10 - 0x0)
	struct FUI_player_ui_slot	
	{
	public:
		int64_t __verse_0xEB688892_ZOrder; // 0x0(0x8)
		UI_ui_input_mode __verse_0xF0FC54F2_InputMode; // 0x8(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_stack_box_slot
	// Size: 0x40 (0x40 - 0x0)
	struct FUI_stack_box_slot	
	{
	public:
		UUI_widget __verse_0xA5B83AD1_Widget; // 0x0(0x8)
		UI_horizontal_alignment __verse_0xF13651F1_HorizontalAlignment; // 0x8(0x1)
		UI_vertical_alignment __verse_0xA83057DE_VerticalAlignment; // 0x9(0x1)
		unsigned char UnknownData02_6[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
		FUI_margin __verse_0x7F718DF5_Padding; // 0x10(0x20)
		unsigned char UnknownData03_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseUI/_Verse/VNI/VerseUI.UI_widget_message
	// Size: 0x10 (0x10 - 0x0)
	struct FUI_widget_message	
	{
	public:
		USimulation_player __verse_0xE5E3B371_Player; // 0x0(0x8)
		UUI_widget __verse_0xB1B721CE_Source; // 0x8(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.float_range
	// Size: 0x10 (0x10 - 0x0)
	struct Ffloat_range	
	{
	public:
		double __verse_0x91692725_Minimum; // 0x0(0x8)
		double __verse_0xDF63CF93_Maximum; // 0x8(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.hit_result
	// Size: 0x50 (0x50 - 0x0)
	struct Fhit_result	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0xA0175DA6_HitNormal; // 0x20(0x18)
		FSpatialMath_vector3 __verse_0xE16733E1_HitLocation; // 0x38(0x18)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_L_Kany_Mtuple_L_R_Many_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Many_Rdup_60	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_7[0x17]; // 0x11(0x17) UNKNOWN PROPERTY
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_L_Kany_Mtuple_L_R_Mint_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kany_Mtuple_L_R_Mint_Rdup_61	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x18(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_62	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Laccessor_M_Kchar_Mfloat_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Laccessor_M_Kchar_Mfloat_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x17]; // 0x1(0x17) UNKNOWN PROPERTY
		double __verse_0x932BF92E_Elem2; // 0x18(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Laccessor_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Laccessor_M_Kchar_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_7[0x17]; // 0x1(0x17) UNKNOWN PROPERTY
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Laccessor_Mcolor_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Laccessor_Mcolor_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FColors_color __verse_0x7D844C3C_Elem1; // 0x8(0x18)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Laccessor_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mfloat_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Laccessor_Mlogic_R
	// Size: 0x2 (0x2 - 0x0)
	struct Ftuple_Laccessor_Mlogic_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x1:0(0x1)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Lcanvas_Mplayer__ui__slot_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lcanvas_Mplayer__ui__slot_R	
	{
	public:
		UUI_canvas __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FUI_player_ui_slot __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Lentity_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lentity_Mtransform_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Lsupertype_Lany_R_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lsupertype_Lany_R_M_Kchar_Rdup_63	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Ltype_Lfont_M_20font_R_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Ltype_Lfont_M_20font_R_M_Kchar_R	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /EntityFramework/_Verse/VNI/Component.tuple_Lwidget_Mplayer__ui__slot_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lwidget_Mplayer__ui__slot_Rdup_64	
	{
	public:
		UUI_widget __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FUI_player_ui_slot __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R
	// Size: 0x58 (0x58 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R	
	{
	public:
		unsigned char UnknownData02_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TArray __verse_0x932BF92E_Elem2; // 0x20(0x10)
		unsigned char UnknownData03_7[0x28]; // 0x30(0x28) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R	
	{
	public:
		unsigned char UnknownData02_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TArray __verse_0x932BF92E_Elem2; // 0x20(0x10)
		unsigned char UnknownData03_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R
	// Size: 0x48 (0x48 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R	
	{
	public:
		unsigned char UnknownData02_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TArray __verse_0x932BF92E_Elem2; // 0x20(0x10)
		EpicGames_Input_input_event __verse_0xF64C4596_Elem3; // 0x30(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x31(0x17) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_M_Kchar_M_Kverse__key_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_Kverse__key_R	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TArray __verse_0x932BF92E_Elem2; // 0x20(0x10)
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R	
	{
	public:
		unsigned char UnknownData01_2[0x28]; // 0x0(0x28) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R	
	{
	public:
		unsigned char UnknownData02_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		EpicGames_Input_input_event __verse_0x7D844C3C_Elem1; // 0x10(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x11(0x17) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_Kchar_Minput__event_R
	// Size: 0x11 (0x11 - 0x0)
	struct Ftuple_L_Kchar_Minput__event_R	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		EpicGames_Input_input_event __verse_0x7D844C3C_Elem1; // 0x10(0x1)
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_65	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.tuple_Lverse__ue__input__component_M_Kchar_Minput__event_R
	// Size: 0x19 (0x19 - 0x0)
	struct Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R	
	{
	public:
		UEpicGames_Input_verse_ue_input_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
		EpicGames_Input_input_event __verse_0x932BF92E_Elem2; // 0x18(0x1)
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_66	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.tuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		UAssets_particle_system __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		unsigned char UnknownData01_7[0x40]; // 0x20(0x40) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.tuple_Lsound_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lsound_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		UAssets_sound __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.tuple_Lsound_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lsound_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		UAssets_sound __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		unsigned char UnknownData01_7[0x40]; // 0x20(0x40) UNKNOWN PROPERTY
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_67	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Ldate__time_Mdate__time_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Ldate__time_Mdate__time_R	
	{
	public:
		FVerseExperimental_date_time __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FVerseExperimental_date_time __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Ldate__time_Mtime__span_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Ldate__time_Mtime__span_R	
	{
	public:
		FVerseExperimental_date_time __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FVerseExperimental_time_span __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Lfloat_Mtime__span_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lfloat_Mtime__span_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FVerseExperimental_time_span __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
		int64_t __verse_0xF64C4596_Elem3; // 0x18(0x8)
		int64_t __verse_0x4F74920B_Elem4; // 0x20(0x8)
		int64_t __verse_0x2A132EB3_Elem5; // 0x28(0x8)
		int64_t __verse_0xC4BC9BA1_Elem6; // 0x30(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Lint_Mint_Mint_Mint_Mint_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lint_Mint_Mint_Mint_Mint_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
		int64_t __verse_0xF64C4596_Elem3; // 0x18(0x8)
		int64_t __verse_0x4F74920B_Elem4; // 0x20(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Lint_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lint_Mint_Rdup_68	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Ltime__span_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Ltime__span_Mfloat_R	
	{
	public:
		FVerseExperimental_time_span __verse_0x18E3F084_Elem0; // 0x0(0x10)
		double __verse_0x7D844C3C_Elem1; // 0x10(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.tuple_Ltime__span_Mtime__span_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Ltime__span_Mtime__span_R	
	{
	public:
		FVerseExperimental_time_span __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FVerseExperimental_time_span __verse_0x7D844C3C_Elem1; // 0x10(0x10)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_date_parts
	// Size: 0x18 (0x18 - 0x0)
	struct FVerseExperimental_date_parts	
	{
	public:
		int64_t __verse_0xC55E1F94_Year; // 0x0(0x8)
		int64_t __verse_0x1B283C2C_Month; // 0x8(0x8)
		int64_t __verse_0xD305C642_Day; // 0x10(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_date_time
	// Size: 0x8 (0x8 - 0x0)
	struct FVerseExperimental_date_time	
	{
	public:
		int64_t __verse_0xD9F5FBDB_Ticks; // 0x0(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_time_of_day_parts
	// Size: 0x30 (0x30 - 0x0)
	struct FVerseExperimental_time_of_day_parts	
	{
	public:
		int64_t __verse_0xEF684B3B_Hours; // 0x0(0x8)
		int64_t __verse_0x2D42EE39_Minutes; // 0x8(0x8)
		int64_t __verse_0xA650E91F_Seconds; // 0x10(0x8)
		int64_t __verse_0x59EF8267_Milliseconds; // 0x18(0x8)
		int64_t __verse_0x40AEA2F6_Microseconds; // 0x20(0x8)
		int64_t __verse_0x0E58C5A9_Nanoseconds; // 0x28(0x8)
	};


	// Struct /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_time_span
	// Size: 0x10 (0x10 - 0x0)
	struct FVerseExperimental_time_span	
	{
	public:
		int64_t __verse_0xD9F5FBDB_Ticks; // 0x0(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
	};


	// Struct /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_69	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.tuple_Ltag__container_Mtag__container_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Ltag__container_Mtag__container_R	
	{
	public:
		UTags_tag_container __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UTags_tag_container __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.tuple_Ltag_Mtag_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Ltag_Mtag_R	
	{
	public:
		UTags_tag __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UTags_tag __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_L_Kchar_Mtransform_M_Kchar_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_L_Kchar_Mtransform_M_Kchar_R	
	{
	public:
		unsigned char UnknownData02_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
		unsigned char UnknownData03_7[0x10]; // 0x70(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R
	// Size: 0x90 (0x90 - 0x0)
	struct Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
		unsigned char UnknownData01_6[0x10]; // 0x70(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0xF64C4596_Elem3; // 0x80(0x8)
		UObject __verse_0x4F74920B_Elem4; // 0x88(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R
	// Size: 0x88 (0x88 - 0x0)
	struct Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
		unsigned char UnknownData01_6[0x10]; // 0x70(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0xF64C4596_Elem3; // 0x80(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R
	// Size: 0x88 (0x88 - 0x0)
	struct Ftuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x10(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x932BF92E_Elem2; // 0x30(0x20)
		FSpatialMath_vector3 __verse_0xF64C4596_Elem3; // 0x50(0x18)
		unsigned char UnknownData03_6[0x10]; // 0x68(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0x2A132EB3_Elem5; // 0x78(0x8)
		UObject __verse_0xC4BC9BA1_Elem6; // 0x80(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_70	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lfloat_Mactivation__state_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lfloat_Mactivation__state_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		VGameplayRst_Components_activation_state __verse_0x7D844C3C_Elem1; // 0x8(0x1)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lfloat_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lfloat_Mfloat_Rdup_71	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lint_Mtype_Lvk__component_M_20vk__component_R_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lint_Mtype_Lvk__component_M_20vk__component_R_R	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UClass __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Llevel_Mtime__span_M_Kchar_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Llevel_Mtime__span_M_Kchar_R	
	{
	public:
		UAssets_level __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FVerseExperimental_time_span __verse_0x7D844C3C_Elem1; // 0x8(0x10)
		unsigned char UnknownData01_7[0x10]; // 0x18(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Llogic_Mlogic_R
	// Size: 0x2 (0x2 - 0x0)
	struct Ftuple_Llogic_Mlogic_R	
	{
	public:
		bool __verse_0x18E3F084_Elem0 : 1; // 0x0:0(0x1)
		unsigned char UnknownBit07 : 1; // 0x0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x0:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x0:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x0:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0x0:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit13 : 1; // 0x0:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x1:0(0x1)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lmaterial_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lmaterial_Mint_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lplayer__component_M_Kchar_M_Kchar_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_R	
	{
	public:
		USimulation_player_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x20]; // 0x8(0x20) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lplayer__component_M_Kchar_Mint_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lplayer__component_M_Kchar_Mint_R	
	{
	public:
		USimulation_player_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x18(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0x22 (0x22 - 0x0)
	struct Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_Rdup_72	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x20(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x21(0x1)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Ltime__span_M_Kchar_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Ltime__span_M_Kchar_R	
	{
	public:
		FVerseExperimental_time_span __verse_0x18E3F084_Elem0; // 0x0(0x10)
		unsigned char UnknownData01_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R	
	{
	public:
		FSpatialMath_transform __verse_0x18E3F084_Elem0; // 0x0(0x60)
		unsigned char UnknownData01_6[0x10]; // 0x60(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0x932BF92E_Elem2; // 0x70(0x8)
		UObject __verse_0xF64C4596_Elem3; // 0x78(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Ltransform_M_Kchar_Mmesh_R
	// Size: 0x78 (0x78 - 0x0)
	struct Ftuple_Ltransform_M_Kchar_Mmesh_R	
	{
	public:
		FSpatialMath_transform __verse_0x18E3F084_Elem0; // 0x0(0x60)
		unsigned char UnknownData01_6[0x10]; // 0x60(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0x932BF92E_Elem2; // 0x70(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Ltransform_M_Kchar_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Ltransform_M_Kchar_R	
	{
	public:
		FSpatialMath_transform __verse_0x18E3F084_Elem0; // 0x0(0x60)
		unsigned char UnknownData01_7[0x10]; // 0x60(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvector3_M_Kchar_Mmesh_Mmaterial_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lvector3_M_Kchar_Mmesh_Mmaterial_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_6[0x10]; // 0x18(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0x932BF92E_Elem2; // 0x28(0x8)
		UObject __verse_0xF64C4596_Elem3; // 0x30(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvector3_M_Kchar_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_M_Kchar_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_7[0x10]; // 0x18(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvector3_Mrotation_M_Kchar_Mmesh_Mmaterial_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lvector3_Mrotation_M_Kchar_Mmesh_Mmaterial_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
		unsigned char UnknownData03_6[0x10]; // 0x40(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0xF64C4596_Elem3; // 0x50(0x8)
		UObject __verse_0x4F74920B_Elem4; // 0x58(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R
	// Size: 0x78 (0x78 - 0x0)
	struct Ftuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
		FSpatialMath_vector3 __verse_0x932BF92E_Elem2; // 0x40(0x18)
		unsigned char UnknownData03_6[0x10]; // 0x58(0x10) UNKNOWN PROPERTY
		UAssets_mesh __verse_0x4F74920B_Elem4; // 0x68(0x8)
		UObject __verse_0x2A132EB3_Elem5; // 0x70(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvector3_Mvector3_Mvector3_M_Kchar_R
	// Size: 0x58 (0x58 - 0x0)
	struct Ftuple_Lvector3_Mvector3_Mvector3_M_Kchar_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		FSpatialMath_vector3 __verse_0x932BF92E_Elem2; // 0x30(0x18)
		unsigned char UnknownData01_7[0x10]; // 0x48(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvector3_Mvector3_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lvector3_Mvector3_Rdup_73	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvk__component_Mint_Msupertype_Lany_R_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lvk__component_Mint_Msupertype_Lany_R_R	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		UClass __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvk__component_Mphysics__trace__category_Mphysics__trace__type_Mphysics__trace__shape_Mphysics__trace__channel_Mvector3_Mvector3_Mlogic_Mvector3_Mfloat_M_Kchar_R
	// Size: 0x78 (0x78 - 0x0)
	struct Ftuple_Lvk__component_Mphysics__trace__category_Mphysics__trace__type_Mphysics__trace__shape_Mphysics__trace__channel_Mvector3_Mvector3_Mlogic_Mvector3_Mfloat_M_Kchar_R	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		VGameplayRst_Physics_physics_trace_category __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		VGameplayRst_Physics_physics_trace_type __verse_0x932BF92E_Elem2; // 0x9(0x1)
		VGameplayRst_Physics_physics_trace_shape __verse_0xF64C4596_Elem3; // 0xA(0x1)
		VGameplayRst_Physics_physics_trace_channel __verse_0x4F74920B_Elem4; // 0xB(0x1)
		unsigned char UnknownData03_6[0x4]; // 0xC(0x4) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0x2A132EB3_Elem5; // 0x10(0x18)
		FSpatialMath_vector3 __verse_0xC4BC9BA1_Elem6; // 0x28(0x18)
		bool __verse_0xA1DB2719_Elem7 : 1; // 0x40:0(0x1)
		unsigned char UnknownData04_5[0x7]; // 0x41(0x7) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0xF7CB4441_Elem8; // 0x48(0x18)
		double __verse_0x92ACF8F9_Elem9; // 0x60(0x8)
		unsigned char UnknownData05_7[0x10]; // 0x68(0x10) UNKNOWN PROPERTY
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvk__component_Msupertype_Lany_R_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lvk__component_Msupertype_Lany_R_Rdup_74	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UClass __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.tuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R	
	{
	public:
		UVerseEngine_Entity_vk_entity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		TArray __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Physics_hit_result_legacy
	// Size: 0x40 (0x40 - 0x0)
	struct FVGameplayRst_Physics_hit_result_legacy	
	{
	public:
		int64_t __verse_0x592C3A0F_OtherEntityID; // 0x0(0x8)
		UVGameplayRst_Physics_vk_collision_component __verse_0x15DAA648_OtherComponent; // 0x8(0x8)
		FSpatialMath_vector3 __verse_0xA0175DA6_HitNormal; // 0x10(0x18)
		FSpatialMath_vector3 __verse_0xE16733E1_HitLocation; // 0x28(0x18)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.collision_channel
	// Size: 0x10 (0x10 - 0x0)
	struct Fcollision_channel	
	{
	public:
		int64_t __verse_0x96B895E5_ChannelIndex; // 0x0(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.collision_query_params
	// Size: 0x18 (0x18 - 0x0)
	struct Fcollision_query_params	
	{
	public:
		bool __verse_0xDC858D83_DetectOverlapping : 1; // 0x0:0(0x1)
		unsigned char UnknownBit08 : 1; // 0x0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit10 : 1; // 0x0:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0x0:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0x0:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit13 : 1; // 0x0:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit14 : 1; // 0x0:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x487997B9_DetectBlocking : 1; // 0x1:0(0x1)
		unsigned char UnknownData15_5[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		TArray __verse_0x8D4F251C_IgnoredComponents; // 0x8(0x10)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.overlap_hit
	// Size: 0x8 (0x8 - 0x0)
	struct Foverlap_hit	
	{
	public:
		unsigned char UnknownData01_2[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.overlap_hit_container
	// Size: 0x10 (0x10 - 0x0)
	struct Foverlap_hit_container	
	{
	public:
		TArray __verse_0x61E4BD55_Hits; // 0x0(0x10)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.overlap_result
	// Size: 0x20 (0x20 - 0x0)
	struct Foverlap_result	
	{
	public:
		unsigned char UnknownData01_2[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.trace_hit
	// Size: 0x78 (0x78 - 0x0)
	struct Ftrace_hit	
	{
	public:
		unsigned char UnknownData02_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0xF98E448C_HitPosition; // 0x8(0x18)
		FSpatialMath_vector3 __verse_0xA0175DA6_HitNormal; // 0x20(0x18)
		FSpatialMath_vector3 __verse_0x8DA8C548_HitFaceNormal; // 0x38(0x18)
		FSpatialMath_vector3 __verse_0x69A0C784_TraceHitPosition; // 0x50(0x18)
		double __verse_0x25EF77D3_TraceHitDistance; // 0x68(0x8)
		collision_channel_response __verse_0x26884E96_HitResponse; // 0x70(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x71(0x7) UNKNOWN PROPERTY
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.trace_hit_container
	// Size: 0x10 (0x10 - 0x0)
	struct Ftrace_hit_container	
	{
	public:
		TArray __verse_0x61E4BD55_Hits; // 0x0(0x10)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_75	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Laccessor_Mcollision__override_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mcollision__override_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		Ucollision_override __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lcollision__channel_Mcollision__channel__response_R
	// Size: 0x11 (0x11 - 0x0)
	struct Ftuple_Lcollision__channel_Mcollision__channel__response_R	
	{
	public:
		Fcollision_channel __verse_0x18E3F084_Elem0; // 0x0(0x10)
		collision_channel_response __verse_0x7D844C3C_Elem1; // 0x10(0x1)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lcollision__component_Mvector3_Mrotation_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lcollision__component_Mvector3_Mrotation_R	
	{
	public:
		Ucollision_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		FVerseRotation __verse_0x932BF92E_Elem2; // 0x20(0x20)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lcollision__component_Mvector3_Mvector3_Mrotation_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lcollision__component_Mvector3_Mvector3_Mrotation_R	
	{
	public:
		Ucollision_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		FSpatialMath_vector3 __verse_0x932BF92E_Elem2; // 0x20(0x18)
		unsigned char UnknownData01_6[0x8]; // 0x38(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0xF64C4596_Elem3; // 0x40(0x20)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lconvex__volume3_Mvector3_Mrotation_Mcollision__channel_Mcollision__query__params_R
	// Size: 0x68 (0x68 - 0x0)
	struct Ftuple_Lconvex__volume3_Mvector3_Mrotation_Mcollision__channel_Mcollision__query__params_R	
	{
	public:
		Uconvex_volume3 __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		FVerseRotation __verse_0x932BF92E_Elem2; // 0x20(0x20)
		Fcollision_channel __verse_0xF64C4596_Elem3; // 0x40(0x10)
		Fcollision_query_params __verse_0x4F74920B_Elem4; // 0x50(0x18)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lconvex__volume3_Mvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lconvex__volume3_Mvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R	
	{
	public:
		Uconvex_volume3 __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		FSpatialMath_vector3 __verse_0x932BF92E_Elem2; // 0x20(0x18)
		Fcollision_channel __verse_0xF64C4596_Elem3; // 0x38(0x10)
		Fcollision_query_params __verse_0x4F74920B_Elem4; // 0x48(0x18)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lentity_Mtuple_L_R_Mconvex__volume3_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Uconvex_volume3 __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lentity_Mtuple_L_R_Mtag_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtag_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		UTags_tag __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_Rdup_76	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		UClass __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lentity_Mtuple_L_R_Mtype_Lentity_M_20entity_R_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lentity_M_20entity_R_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		UClass __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQuery.tuple_Lvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R
	// Size: 0x58 (0x58 - 0x0)
	struct Ftuple_Lvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
		Fcollision_channel __verse_0x932BF92E_Elem2; // 0x30(0x10)
		Fcollision_query_params __verse_0xF64C4596_Elem3; // 0x40(0x18)
	};


	// Struct /VerseAINavigation/_Verse/VNI/VerseAINavigation.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_77	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseAbilities/_Verse/VNI/VerseAbilities.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_78	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_79	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Laccessor_Mcamera__director_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mcamera__director_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UVerseCamera_camera_director __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Laccessor_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mfloat_Rdup_80	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R	
	{
	public:
		UVerseCamera_camera_operation_input_parameters __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UVerseCamera_camera_operation_output_parameters __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__float_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lcamera__variable__float_Mfloat_R	
	{
	public:
		UAssets_camera_variable_float __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__integer_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lcamera__variable__integer_Mint_R	
	{
	public:
		UAssets_camera_variable_integer __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__logic_Mlogic_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lcamera__variable__logic_Mlogic_R	
	{
	public:
		UAssets_camera_variable_logic __verse_0x18E3F084_Elem0; // 0x0(0x8)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x8:0(0x1)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__rotation_Mrotation_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lcamera__variable__rotation_Mrotation_R	
	{
	public:
		UAssets_camera_variable_rotation __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x10(0x20)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__transform_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lcamera__variable__transform_Mtransform_R	
	{
	public:
		UAssets_camera_variable_transform __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__vector2_Mvector2_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lcamera__variable__vector2_Mvector2_R	
	{
	public:
		UAssets_camera_variable_vector2 __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector2 __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.tuple_Lcamera__variable__vector3_Mvector3_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lcamera__variable__vector3_Mvector3_R	
	{
	public:
		UAssets_camera_variable_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
	};


	// Struct /VerseCamera/_Verse/VNI/VerseCamera.VerseCamera_camera_mode_context
	// Size: 0x10 (0x10 - 0x0)
	struct FVerseCamera_camera_mode_context	
	{
	public:
		UVerseCamera_camera_mode __verse_0xFA2FE978_CameraMode; // 0x0(0x8)
		UVerseCamera_camera_component __verse_0x84C54853_CameraComponent; // 0x8(0x8)
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_config
	// Size: 0x10 (0x10 - 0x0)
	struct FVerseMovement_move_config	
	{
	public:
		TArray __verse_0xCE82C4DD_Entries; // 0x0(0x10)
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_config_entry
	// Size: 0x30 (0x30 - 0x0)
	struct FVerseMovement_move_config_entry	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		TArray __verse_0x6DA99CE5_Triggers; // 0x10(0x10)
		TArray __verse_0xBAC32A9B_Responses; // 0x20(0x10)
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_input_trigger_params
	// Size: 0x38 (0x38 - 0x0)
	struct FVerseMovement_move_input_trigger_params	
	{
	public:
		bool __verse_0x7D5B20A2_IsAxis : 1; // 0x0:0(0x1)
		unsigned char UnknownData02_3[0x1F]; // 0x1(0x1F) UNKNOWN PROPERTY
		bool __verse_0xC35555B9_AccumulateAxisInput : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_5[0x7]; // 0x21(0x7) UNKNOWN PROPERTY
		FSpatialMath_vector2 __verse_0x9EA11583_ClampAxis; // 0x28(0x10)
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_physics_trigger_params
	// Size: 0x18 (0x18 - 0x0)
	struct FVerseMovement_move_physics_trigger_params	
	{
	public:
		FSpatialMath_vector3 __verse_0xE78E15A1_SpeedInDirection; // 0x0(0x18)
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_response
	// Size: 0x50 (0x50 - 0x0)
	struct FVerseMovement_move_response	
	{
	public:
		FSpatialMath_vector3 __verse_0x0464FDB1_Vector; // 0x0(0x18)
		double __verse_0xA6A970E7_Magnitude; // 0x18(0x8)
		unsigned char UnknownData03_6[0x8]; // 0x20(0x8) UNKNOWN PROPERTY
		VerseMovement_move_response_type __verse_0x72E298E9_Type; // 0x28(0x1)
		VerseMovement_move_response_frame __verse_0x08A22912_Frame; // 0x29(0x1)
		VerseMovement_move_response_effect __verse_0xCDC901A6_Effect; // 0x2A(0x1)
		VerseMovement_move_response_modifier __verse_0xCDC9EFBD_Modifier; // 0x2B(0x1)
		unsigned char UnknownData04_6[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0x7B949B4B_ClampVector; // 0x30(0x18)
		VerseMovement_move_response_frame __verse_0x3B045791_ClampFrame; // 0x48(0x1)
		unsigned char UnknownData05_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_trace_trigger_params
	// Size: 0x38 (0x38 - 0x0)
	struct FVerseMovement_move_trace_trigger_params	
	{
	public:
		FSpatialMath_vector3 __verse_0x722EF6A3_Direction; // 0x0(0x18)
		VerseMovement_move_response_frame __verse_0x08A22912_Frame; // 0x18(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		double __verse_0x2AC13C27_TraceLength; // 0x20(0x8)
		bool __verse_0x99455FC7_ProportionalToHitDistance : 1; // 0x28:0(0x1)
		unsigned char UnknownData03_7[0xF]; // 0x29(0xF) UNKNOWN PROPERTY
	};


	// Struct /VerseMovement/_Verse/VNI/VerseMovement.VerseMovement_move_trigger
	// Size: 0x90 (0x90 - 0x0)
	struct FVerseMovement_move_trigger	
	{
	public:
		VerseMovement_move_trigger_type __verse_0x72E298E9_Type; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		FVerseMovement_move_input_trigger_params __verse_0xD3F71544_InputParams; // 0x8(0x38)
		FVerseMovement_move_physics_trigger_params __verse_0x4D939126_PhysicsParams; // 0x40(0x18)
		FVerseMovement_move_trace_trigger_params __verse_0x874565E7_TraceParams; // 0x58(0x38)
	};


	// Struct /VerseQuery/_Verse/VNI/VerseQueryTestSuite.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_81	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseWorldPartition/_Verse/VNI/VerseWorldPartition.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_82	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseWorldPartition/_Verse/VNI/VerseWorldPartition.tuple_Ldata__layer__asset_Mdata__layer__runtime__state_Mlogic_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Ldata__layer__asset_Mdata__layer__runtime__state_Mlogic_R	
	{
	public:
		UVerseWorldPartition_data_layer_asset __verse_0x18E3F084_Elem0; // 0x0(0x8)
		VerseWorldPartition_data_layer_runtime_state __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		bool __verse_0x932BF92E_Elem2 : 1; // 0x9:0(0x1)
	};


	// Struct /VersePlayspace/_Verse/VNI/VersePlayspace.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_83	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.AI_fort_obstacle_info
	// Size: 0x28 (0x28 - 0x0)
	struct FAI_fort_obstacle_info	
	{
	public:
		FSpatialMath_vector3 __verse_0xB0C27E0A_Location; // 0x0(0x18)
		AI_fort_obstacle_status __verse_0xFA60180E_Status; // 0x18(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x19(0x7) UNKNOWN PROPERTY
		UEntity __verse_0x82A44C52_Obstacle; // 0x20(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.AI_target_info
	// Size: 0x28 (0x28 - 0x0)
	struct FAI_target_info	
	{
	public:
		UEntity __verse_0x459049A1_Target; // 0x0(0x8)
		bool __verse_0xAC2B8860_HasLineOfSight : 1; // 0x8:0(0x1)
		Teams_team_attitude __verse_0xA972C52D_Attitude; // 0x9(0x1)
		unsigned char UnknownData01_7[0x1E]; // 0xA(0x1E) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.Characters_stasis_args
	// Size: 0x3 (0x3 - 0x0)
	struct FCharacters_stasis_args	
	{
	public:
		bool __verse_0xADC8E6AA_AllowTurning : 1; // 0x0:0(0x1)
		unsigned char UnknownBit14 : 1; // 0x0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0x0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x0:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x0:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x0:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit19 : 1; // 0x0:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit20 : 1; // 0x0:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x04C721DA_AllowFalling : 1; // 0x1:0(0x1)
		unsigned char UnknownBit21 : 1; // 0x1:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit22 : 1; // 0x1:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit23 : 1; // 0x1:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit24 : 1; // 0x1:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit25 : 1; // 0x1:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit26 : 1; // 0x1:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit27 : 1; // 0x1:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x178F77CA_AllowEmotes : 1; // 0x2:0(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.Game_damage_args
	// Size: 0x18 (0x18 - 0x0)
	struct FGame_damage_args	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		double __verse_0x193A13B7_Amount; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.Game_damage_result
	// Size: 0x20 (0x20 - 0x0)
	struct FGame_damage_result	
	{
	public:
		UObject __verse_0x459049A1_Target; // 0x0(0x8)
		double __verse_0x193A13B7_Amount; // 0x8(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.Game_elimination_result
	// Size: 0x10 (0x10 - 0x0)
	struct FGame_elimination_result	
	{
	public:
		UObject __verse_0xC5F618E8_EliminatedCharacter; // 0x0(0x8)
		unsigned char UnknownData01_7[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.Game_healing_args
	// Size: 0x18 (0x18 - 0x0)
	struct FGame_healing_args	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		double __verse_0x193A13B7_Amount; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.Game_healing_result
	// Size: 0x20 (0x20 - 0x0)
	struct FGame_healing_result	
	{
	public:
		UObject __verse_0x459049A1_Target; // 0x0(0x8)
		double __verse_0x193A13B7_Amount; // 0x8(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x10(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_L_Kchar_M_Kchar_M_Kchar_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_Kchar_R	
	{
	public:
		unsigned char UnknownData01_2[0x30]; // 0x0(0x30) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_L_Kchar_M_Kchar_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_R	
	{
	public:
		unsigned char UnknownData01_2[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_Rdup_84	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_L_Kchar_M_QLevel_Nlog__level_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_L_Kplayer_Mpreferred__rendering__mode_R
	// Size: 0x11 (0x11 - 0x0)
	struct Ftuple_L_Kplayer_Mpreferred__rendering__mode_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		FortPlayerUtilities_preferred_rendering_mode __verse_0x7D844C3C_Elem1; // 0x10(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_85	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Laccessor_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mfloat_Rdup_86	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Laccessor_Mlogic_R
	// Size: 0x2 (0x2 - 0x0)
	struct Ftuple_Laccessor_Mlogic_Rdup_87	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x1:0(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Laccessor_Mnpc__behavior_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mnpc__behavior_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UAI_npc_behavior __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Laccessor_Mteam__tag_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Laccessor_Mteam__tag_R	
	{
	public:
		Verse_accessor __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x1(0x7) UNKNOWN PROPERTY
		UTeams_team_tag __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lagent_Magent_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lagent_Magent_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		USimulation_agent __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lagent_Mentity_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lagent_Mentity_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UEntity __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lagent_Mfloat_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lagent_Mfloat_Mfloat_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lagent_Mteam_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lagent_Mteam_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		USimulation_team __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lagent_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R
	// Size: 0x50 (0x50 - 0x0)
	struct Ftuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_R __verse_0x932BF92E_Elem2; // 0x10(0x40)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lanimation__sequence_M_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x48 (0x48 - 0x0)
	struct Ftuple_Lanimation__sequence_M_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R	
	{
	public:
		UAssets_animation_sequence __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x40]; // 0x8(0x40) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lanimation__sequence_Mplay__animation__instance_Mlogic_Mfloat_Mfloat_Mfloat_Mfloat_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lanimation__sequence_Mplay__animation__instance_Mlogic_Mfloat_Mfloat_Mfloat_Mfloat_R	
	{
	public:
		UAssets_animation_sequence __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UAnimation_PlayAnimation_play_animation_instance __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		bool __verse_0x932BF92E_Elem2 : 1; // 0x10:0(0x1)
		unsigned char UnknownData01_5[0x7]; // 0x11(0x7) UNKNOWN PROPERTY
		double __verse_0xF64C4596_Elem3; // 0x18(0x8)
		double __verse_0x4F74920B_Elem4; // 0x20(0x8)
		double __verse_0x2A132EB3_Elem5; // 0x28(0x8)
		double __verse_0xC4BC9BA1_Elem6; // 0x30(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lcamera__behavior__component_Mtuple_L_R_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mint_R	
	{
	public:
		UVerseCamera_camera_behavior_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lcamera__behavior__component_Mtuple_L_R_Mplayer_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mplayer_R	
	{
	public:
		UVerseCamera_camera_behavior_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		USimulation_player __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lcamera__component_Mtuple_L_R_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lcamera__component_Mtuple_L_R_Mint_R	
	{
	public:
		UVerseCamera_camera_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lcamera__component_Mtuple_L_R_Mplayer_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lcamera__component_Mtuple_L_R_Mplayer_R	
	{
	public:
		UVerseCamera_camera_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		USimulation_player __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lentity_Mentity_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lentity_Mentity_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UEntity __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lentity_Mteam__tag_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lentity_Mteam__tag_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UTeams_team_tag __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lentity_Mteam_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lentity_Mteam_R	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		USimulation_team __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_Rdup_88	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
	// Size: 0x22 (0x22 - 0x0)
	struct Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R	
	{
	public:
		UAI_navigation_target __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x1A]; // 0x8(0x1A) UNKNOWN PROPERTY
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lnpc__behavior_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lnpc__behavior_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UAI_npc_behavior __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lplayer_Mtuple_L_R_Mplayer_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lplayer_Mtuple_L_R_Mplayer_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		USimulation_player __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lteam__tag_Mteam_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lteam__tag_Mteam_R	
	{
	public:
		UTeams_team_tag __verse_0x18E3F084_Elem0; // 0x0(0x8)
		USimulation_team __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lteam_Mteam_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lteam_Mteam_R	
	{
	public:
		USimulation_team __verse_0x18E3F084_Elem0; // 0x0(0x8)
		USimulation_team __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lteleport__to__result_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lteleport__to__result_Mtransform_R	
	{
	public:
		Game_teleport_to_result __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0xF]; // 0x1(0xF) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lvector3_Mfloat_Mfloat_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_Mfloat_Mfloat_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
		double __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /VerseFortnite/_Verse/VNI/VerseFortnite.tuple_Lvector3_Mrotation_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lvector3_Mrotation_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_cubic_bezier_parameters
	// Size: 0x20 (0x20 - 0x0)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters	
	{
	public:
		double __verse_0xBBCFCA13_X0; // 0x0(0x8)
		double __verse_0x25CF60DF_Y0; // 0x8(0x8)
		double __verse_0xDEA876AB_X1; // 0x10(0x8)
		double __verse_0x40A8DC67_Y1; // 0x18(0x8)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.Devices_CreativeAnimation_keyframe_delta
	// Size: 0x80 (0x80 - 0x0)
	struct FDevices_CreativeAnimation_keyframe_delta	
	{
	public:
		FSpatialMath_vector3 __verse_0xC51B5857_DeltaLocation; // 0x0(0x18)
		unsigned char UnknownData01_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x0D1E29AE_DeltaRotation; // 0x20(0x20)
		FSpatialMath_vector3 __verse_0x97B35C4B_DeltaScale; // 0x40(0x18)
		double __verse_0x742B3E02_Time; // 0x58(0x8)
		FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xB7FF3D07_Interpolation; // 0x60(0x20)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.Devices_device_ai_interaction_result
	// Size: 0x10 (0x10 - 0x0)
	struct FDevices_device_ai_interaction_result	
	{
	public:
		unsigned char UnknownData01_2[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kchar_M_Kchar_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_Rdup_89	
	{
	public:
		unsigned char UnknownData01_2[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_Rdup_90	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kchar_M_QLevel_Nlog__level_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_Rdup_91	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kchar_Mplaystoppause__result_R
	// Size: 0x11 (0x11 - 0x0)
	struct Ftuple_L_Kchar_Mplaystoppause__result_R	
	{
	public:
		unsigned char UnknownData01_7[0x10]; // 0x0(0x10) UNKNOWN PROPERTY
		Devices_CreativeAnimation_playstoppause_result __verse_0x7D844C3C_Elem1; // 0x10(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		unsigned char UnknownData01_7[0x2]; // 0x10(0x2) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		unsigned char UnknownData01_7[0x2]; // 0x10(0x2) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Kkeyframe__delta_M_QMode_Nanimation__mode_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kkeyframe__delta_M_QMode_Nanimation__mode_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		unsigned char UnknownData01_7[0x2]; // 0x10(0x2) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Qanimation__controller_Mget__animation__controller__result_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		Devices_CreativeAnimation_get_animation_controller_result __verse_0x7D844C3C_Elem1; // 0x8(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_Qcreative__prop_Mspawn__prop__result_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R	
	{
	public:
		unsigned char UnknownData01_7[0x8]; // 0x0(0x8) UNKNOWN PROPERTY
		Devices_spawn_prop_result __verse_0x7D844C3C_Elem1; // 0x8(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_92	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__device_Mtuple_L_R_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtransform_R	
	{
	public:
		UDevices_creative_device __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x932BF92E_Elem2; // 0x10(0x60)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UDevices_creative_device __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__device_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R	
	{
	public:
		UDevices_creative_device __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Ltransform_Mfloat_R __verse_0x932BF92E_Elem2; // 0x10(0x70)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R	
	{
	public:
		UDevices_creative_device __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0x932BF92E_Elem2; // 0x10(0x50)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R
	// Size: 0x50 (0x50 - 0x0)
	struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R	
	{
	public:
		UDevices_creative_device __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_R __verse_0x932BF92E_Elem2; // 0x10(0x40)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R	
	{
	public:
		UVerseMovableObjectBase __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x932BF92E_Elem2; // 0x10(0x60)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UVerseMovableObjectBase __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R	
	{
	public:
		UVerseMovableObjectBase __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Ltransform_Mfloat_R __verse_0x932BF92E_Elem2; // 0x10(0x70)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R	
	{
	public:
		UVerseMovableObjectBase __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0x932BF92E_Elem2; // 0x10(0x50)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R
	// Size: 0x50 (0x50 - 0x0)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R	
	{
	public:
		UVerseMovableObjectBase __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_R __verse_0x932BF92E_Elem2; // 0x10(0x40)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__object_Mtuple_L_R_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtransform_R	
	{
	public:
		UDevices_creative_object __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x932BF92E_Elem2; // 0x10(0x60)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UDevices_creative_object __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__object_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R	
	{
	public:
		UDevices_creative_object __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Ltransform_Mfloat_R __verse_0x932BF92E_Elem2; // 0x10(0x70)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R
	// Size: 0x60 (0x60 - 0x0)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R	
	{
	public:
		UDevices_creative_object __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0x932BF92E_Elem2; // 0x10(0x50)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R
	// Size: 0x50 (0x50 - 0x0)
	struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R	
	{
	public:
		UDevices_creative_object __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		Ftuple_Lvector3_Mrotation_R __verse_0x932BF92E_Elem2; // 0x10(0x40)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__prop__asset_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lcreative__prop__asset_Mtransform_R	
	{
	public:
		UDevices_creative_prop_asset __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x8]; // 0x8(0x8) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__prop__asset_Mvector3_Mrotation_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lcreative__prop__asset_Mvector3_Mrotation_R	
	{
	public:
		UDevices_creative_prop_asset __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x8(0x18)
		FVerseRotation __verse_0x932BF92E_Elem2; // 0x20(0x20)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UDevices_creative_prop __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lmaterial_M_QIndex_Nint_20_3d_20_2e_2e_2e_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lmaterial_M_QIndex_Nint_20_3d_20_2e_2e_2e_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lrotation_Mrotation_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lrotation_Mrotation_Rdup_93	
	{
	public:
		FVerseRotation __verse_0x18E3F084_Elem0; // 0x0(0x20)
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lteleport__to__result_Mtransform_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lteleport__to__result_Mtransform_Rdup_94	
	{
	public:
		Game_teleport_to_result __verse_0x18E3F084_Elem0; // 0x0(0x1)
		unsigned char UnknownData01_6[0xF]; // 0x1(0xF) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x7D844C3C_Elem1; // 0x10(0x60)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Ltransform_Mfloat_R
	// Size: 0x68 (0x68 - 0x0)
	struct Ftuple_Ltransform_Mfloat_R	
	{
	public:
		FSpatialMath_transform __verse_0x18E3F084_Elem0; // 0x0(0x60)
		double __verse_0x7D844C3C_Elem1; // 0x60(0x8)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lvector3_Mrotation_Mfloat_R
	// Size: 0x48 (0x48 - 0x0)
	struct Ftuple_Lvector3_Mrotation_Mfloat_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
		double __verse_0x932BF92E_Elem2; // 0x40(0x8)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lvector3_Mrotation_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_Lvector3_Mrotation_Rdup_95	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		FVerseRotation __verse_0x7D844C3C_Elem1; // 0x20(0x20)
	};


	// Struct /VerseDevices/_Verse/VNI/VerseDevices.tuple_Lvector3_Mvector3_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lvector3_Mvector3_Rdup_96	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
	};


	// Struct /EntityFrameworkFortnite/_Verse/VNI/BridgeComponent.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_97	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.add_inventory_result
	// Size: 0x10 (0x10 - 0x0)
	struct Fadd_inventory_result	
	{
	public:
		Uinventory_collection_component __verse_0x78219535_InventoryCollection; // 0x0(0x8)
		Uinventory_component __verse_0x2E1D28B3_Inventory; // 0x8(0x8)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.add_items_result
	// Size: 0x20 (0x20 - 0x0)
	struct Fadd_items_result	
	{
	public:
		Uinventory_collection_component __verse_0x78219535_InventoryCollection; // 0x0(0x8)
		Uinventory_component __verse_0x2E1D28B3_Inventory; // 0x8(0x8)
		TArray __verse_0x29ABE7A6_AddedItems; // 0x10(0x10)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.change_items_slot_result
	// Size: 0x20 (0x20 - 0x0)
	struct Fchange_items_slot_result	
	{
	public:
		Uinventory_collection_component __verse_0x78219535_InventoryCollection; // 0x0(0x8)
		Uinventory_component __verse_0x2E1D28B3_Inventory; // 0x8(0x8)
		TArray __verse_0xF44503D3_SlotChangedItems; // 0x10(0x10)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.inventory_add_items_result
	// Size: 0x18 (0x18 - 0x0)
	struct Finventory_add_items_result	
	{
	public:
		Uinventory_component __verse_0x2E1D28B3_Inventory; // 0x0(0x8)
		TArray __verse_0x29ABE7A6_AddedItems; // 0x8(0x10)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.inventory_add_result
	// Size: 0x18 (0x18 - 0x0)
	struct Finventory_add_result	
	{
	public:
		TArray __verse_0x71171AB5_ModifiedItemList; // 0x0(0x10)
		int64_t __verse_0xC4D54182_AmountAdded; // 0x10(0x8)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.inventory_setup_data_result
	// Size: 0x18 (0x18 - 0x0)
	struct Finventory_setup_data_result	
	{
	public:
		Uinventory_collection_component __verse_0x78219535_InventoryCollection; // 0x0(0x8)
		TArray __verse_0xCBDDA83C_AddedInventoryMap; // 0x8(0x10)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.item_amount_change
	// Size: 0x18 (0x18 - 0x0)
	struct Fitem_amount_change	
	{
	public:
		UItem __verse_0xFB88B569_Item; // 0x0(0x8)
		int64_t __verse_0x593EF27F_NewAmount; // 0x8(0x8)
		int64_t __verse_0x0866375D_PreviousAmount; // 0x10(0x8)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.item_slot_change
	// Size: 0x18 (0x18 - 0x0)
	struct Fitem_slot_change	
	{
	public:
		UItem __verse_0xFB88B569_Item; // 0x0(0x8)
		int64_t __verse_0xD00CECDA_NewSlot; // 0x8(0x8)
		int64_t __verse_0xAC4ADE8C_PreviousSlot; // 0x10(0x8)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.item_state_change
	// Size: 0x10 (0x10 - 0x0)
	struct Fitem_state_change	
	{
	public:
		UItem __verse_0xFB88B569_Item; // 0x0(0x8)
		item_state __verse_0x356D3AEA_NewState; // 0x8(0x1)
		item_state __verse_0xD323BCD0_PreviousState; // 0x9(0x1)
		unsigned char UnknownData01_7[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.remove_inventory_result
	// Size: 0x10 (0x10 - 0x0)
	struct Fremove_inventory_result	
	{
	public:
		Uinventory_collection_component __verse_0x78219535_InventoryCollection; // 0x0(0x8)
		Uinventory_component __verse_0x2E1D28B3_Inventory; // 0x8(0x8)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.remove_items_result
	// Size: 0x20 (0x20 - 0x0)
	struct Fremove_items_result	
	{
	public:
		Uinventory_collection_component __verse_0x78219535_InventoryCollection; // 0x0(0x8)
		Uinventory_component __verse_0x2E1D28B3_Inventory; // 0x8(0x8)
		TArray __verse_0x6CAD7723_RemovedItems; // 0x10(0x10)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_98	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.tuple_Lenhanced__input__action_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lenhanced__input__action_Mint_R	
	{
	public:
		UAssets_enhanced_input_action __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.tuple_Linventory__component_M_Kitem_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Linventory__component_M_Kitem_R	
	{
	public:
		Uinventory_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		TArray __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreRuntime.tuple_Litem_M_QAmount_Nint_20_3d_20_2e_2e_2e_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Litem_M_QAmount_Nint_20_3d_20_2e_2e_2e_R	
	{
	public:
		UItem __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_Rdup_99	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_100	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_Linventory__collection__component_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Linventory__collection__component_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		Uinventory_collection_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_Linventory__component_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Linventory__component_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		Uinventory_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_Litem_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Litem_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UItem __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_Lsupertype_Lany_R_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lsupertype_Lany_R_M_Kchar_Rdup_101	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /ItemizationCore/_Verse/VNI/ItemizationCoreUI.tuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R	
	{
	public:
		UClass __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseBasicGameplay/_Verse/VNI/VerseBasicGameplay.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_102	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseBasicGameplay/_Verse/VNI/VerseBasicGameplay.tuple_Lvector3_M_Kchar_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_M_Kchar_Rdup_103	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_7[0x10]; // 0x18(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.Game_Player_player_team
	// Size: 0x4 (0x4 - 0x0)
	struct FGame_Player_player_team	
	{
	public:
		unsigned char UnknownData01_2[0x4]; // 0x0(0x4) UNKNOWN PROPERTY
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_104	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lint_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lint_Mint_Rdup_105	
	{
	public:
		int64_t __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer__component_Mplayer__start__component_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lplayer__component_Mplayer__start__component_R	
	{
	public:
		USimulation_player_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UGame_Player_player_start_component __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer__component_Mplayer__status__type_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lplayer__component_Mplayer__status__type_R	
	{
	public:
		USimulation_player_component __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Game_Player_player_status_type __verse_0x7D844C3C_Elem1; // 0x8(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer__team_Mint_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lplayer__team_Mint_Mint_R	
	{
	public:
		FGame_Player_player_team __verse_0x18E3F084_Elem0; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer__team_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lplayer__team_Mint_R	
	{
	public:
		FGame_Player_player_team __verse_0x18E3F084_Elem0; // 0x0(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x4(0x4) UNKNOWN PROPERTY
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer__team_Mplayer__team_R
	// Size: 0x8 (0x8 - 0x0)
	struct Ftuple_Lplayer__team_Mplayer__team_R	
	{
	public:
		FGame_Player_player_team __verse_0x18E3F084_Elem0; // 0x0(0x4)
		FGame_Player_player_team __verse_0x7D844C3C_Elem1; // 0x4(0x4)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_M_Kchar_Mint_Mlogic_R
	// Size: 0x21 (0x21 - 0x0)
	struct Ftuple_Lplayer_M_Kchar_Mint_Mlogic_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x18(0x8)
		bool __verse_0xF64C4596_Elem3 : 1; // 0x20:0(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_M_Kchar_Mint_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lplayer_M_Kchar_Mint_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_6[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
		int64_t __verse_0x932BF92E_Elem2; // 0x18(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R
	// Size: 0x19 (0x19 - 0x0)
	struct Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UGame_fort_item_definition __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
		bool __verse_0xF64C4596_Elem3 : 1; // 0x18:0(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mint_Mint_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lplayer_Mint_Mint_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		int64_t __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mint_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lplayer_Mint_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		int64_t __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mlogic_Mlogic_Mlogic_R
	// Size: 0xB (0xB - 0x0)
	struct Ftuple_Lplayer_Mlogic_Mlogic_Mlogic_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x8:0(0x1)
		unsigned char UnknownBit14 : 1; // 0x8:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0x8:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x8:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x8:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x8:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit19 : 1; // 0x8:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit20 : 1; // 0x8:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x9:0(0x1)
		unsigned char UnknownBit21 : 1; // 0x9:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit22 : 1; // 0x9:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit23 : 1; // 0x9:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit24 : 1; // 0x9:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit25 : 1; // 0x9:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit26 : 1; // 0x9:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit27 : 1; // 0x9:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xF64C4596_Elem3 : 1; // 0xA:0(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mlogic_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lplayer_Mlogic_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x8:0(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mplayer__team_R
	// Size: 0xC (0xC - 0x0)
	struct Ftuple_Lplayer_Mplayer__team_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		FGame_Player_player_team __verse_0x7D844C3C_Elem1; // 0x8(0x4)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_Mplayer_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lplayer_Mplayer_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		USimulation_player __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_MPlayerAttribute_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lplayer_MPlayerAttribute_Mfloat_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Game_Player_PlayerAttribute __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Game_Player_PlayerAttribute __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Game_Player_PlayerAttributeOperation __verse_0x932BF92E_Elem2; // 0x9(0x1)
		unsigned char UnknownData01_6[0x6]; // 0xA(0x6) UNKNOWN PROPERTY
		double __verse_0xF64C4596_Elem3; // 0x10(0x8)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lplayer_MPlayerAttribute_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lplayer_MPlayerAttribute_R	
	{
	public:
		USimulation_player __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Game_Player_PlayerAttribute __verse_0x7D844C3C_Elem1; // 0x8(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lvk__component_M_K_Kchar_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lvk__component_M_K_Kchar_R	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		TArray __verse_0x7D844C3C_Elem1; // 0x8(0x10)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lvk__component_Mlogic_R
	// Size: 0x9 (0x9 - 0x0)
	struct Ftuple_Lvk__component_Mlogic_R	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		bool __verse_0x7D844C3C_Elem1 : 1; // 0x8:0(0x1)
	};


	// Struct /VerseFortniteInternal/_Verse/VNI/VerseFortniteInternal.tuple_Lvk__component_Mtype_Lvk__component_M_20vk__component_R_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lvk__component_Mtype_Lvk__component_M_20vk__component_R_R	
	{
	public:
		UEntityComponent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		UClass __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /VerseFortniteGameplayAbilities/_Verse/VNI/VerseFortniteGameplayAbilities.tuple_Lgameplay__ability__asset_M_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lgameplay__ability__asset_M_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R	
	{
	public:
		UGame_Abilities_gameplay_ability_asset __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x8(0x10) UNKNOWN PROPERTY
	};


	// Struct /VerseFortniteGameplayAbilities/_Verse/VNI/VerseFortniteGameplayAbilities.tuple_Lgameplay__effect__asset_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lgameplay__effect__asset_Mfloat_R	
	{
	public:
		UGame_Abilities_gameplay_effect_asset __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.CompanionAI_ping_info
	// Size: 0x38 (0x38 - 0x0)
	struct FCompanionAI_ping_info	
	{
	public:
		CompanionAI_PingCommand_command_type __verse_0x72E298E9_Type; // 0x0(0x1)
		CompanionAI_PingCommand_entity_type __verse_0x6CF7C7E8_EntityType; // 0x1(0x1)
		unsigned char UnknownData02_6[0x6]; // 0x2(0x6) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0xB0C27E0A_Location; // 0x8(0x18)
		bool __verse_0x0FA78E7E_LocationOnHorizontalSurface : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x21(0x17) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_Rdup_106	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R	
	{
	public:
		unsigned char UnknownData01_2[0x40]; // 0x0(0x40) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_Kchar_M_Kchar_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_Rdup_107	
	{
	public:
		unsigned char UnknownData01_2[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R	
	{
	public:
		unsigned char UnknownData01_2[0x40]; // 0x0(0x40) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
	// Size: 0x40 (0x40 - 0x0)
	struct Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_Rdup_108	
	{
	public:
		unsigned char UnknownData01_2[0x40]; // 0x0(0x40) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
	// Size: 0x12 (0x12 - 0x0)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_Rdup_109	
	{
	public:
		unsigned char UnknownData01_2[0x12]; // 0x0(0x12) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_110	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lagent_Mfloat_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_Lagent_Mfloat_Mfloat_Rdup_111	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
		double __verse_0x932BF92E_Elem2; // 0x10(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lagent_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_Rdup_112	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lcompanion__ai_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lcompanion__ai_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UCompanionAI_companion_ai __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_Rdup_113	
	{
	public:
		UEntity __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lfloat_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lfloat_Mfloat_Rdup_114	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lfort__character_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lfort__character_Mfloat_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_Rdup_115	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
	// Size: 0x22 (0x22 - 0x0)
	struct Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_Rdup_116	
	{
	public:
		UAI_navigation_target __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x1A]; // 0x8(0x1A) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lnavigation__target_M_QReachRadius_Nfloat_M_QAllowPartialPath_Nlogic_R
	// Size: 0x1A (0x1A - 0x0)
	struct Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_M_QAllowPartialPath_Nlogic_R	
	{
	public:
		UAI_navigation_target __verse_0x18E3F084_Elem0; // 0x0(0x8)
		unsigned char UnknownData01_7[0x12]; // 0x8(0x12) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lnpc__behavior_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lnpc__behavior_Mtuple_L_R_Mtuple_L_R_Rdup_117	
	{
	public:
		UAI_npc_behavior __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Ltype_7b5_2e000000e_2b01_7d_Mtype_7b2_2e000000e_2b02_7d_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Ltype_7b5_2e000000e_2b01_7d_Mtype_7b2_2e000000e_2b02_7d_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Ltype_7b_2d1_2e000000e_2b03_7d_Mtype_7b1_2e000000e_2b03_7d_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Ltype_7b_2d1_2e000000e_2b03_7d_Mtype_7b1_2e000000e_2b03_7d_R	
	{
	public:
		double __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
	// Size: 0x3A (0x3A - 0x0)
	struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x19]; // 0x21(0x19) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b10_2e000000_7d_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b10_2e000000_7d_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x21(0x17) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b1_2e000000e_2b02_7d_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b1_2e000000e_2b02_7d_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x21(0x17) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b2_2e000000e_2b02_7d_M_QAllowPartialPath_Nlogic_R
	// Size: 0x3A (0x3A - 0x0)
	struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b2_2e000000e_2b02_7d_M_QAllowPartialPath_Nlogic_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x19]; // 0x21(0x19) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b4_2e000000e_2b02_7d_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b4_2e000000e_2b02_7d_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x17]; // 0x21(0x17) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b5_2e000000e_2b01_7d_M_QAllowPartialPath_Nlogic_R
	// Size: 0x3A (0x3A - 0x0)
	struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Ntype_7b5_2e000000e_2b01_7d_M_QAllowPartialPath_Nlogic_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData02_6[0x8]; // 0x18(0x8) UNKNOWN PROPERTY
		bool __verse_0x932BF92E_Elem2 : 1; // 0x20:0(0x1)
		unsigned char UnknownData03_7[0x19]; // 0x21(0x19) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_QColor_Ncolor_M_QRadius_Nfloat_M_QThickness_Ntype_7b3_2e000000_7d_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_M_QNumSegments_Ntype_7b32_7d_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_Lvector3_M_QColor_Ncolor_M_QRadius_Nfloat_M_QThickness_Ntype_7b3_2e000000_7d_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_M_QNumSegments_Ntype_7b32_7d_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_7[0x58]; // 0x18(0x58) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
	// Size: 0x80 (0x80 - 0x0)
	struct Ftuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_Rdup_118	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		unsigned char UnknownData01_7[0x68]; // 0x18(0x68) UNKNOWN PROPERTY
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_Mfloat_Magent_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_Mfloat_Magent_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
		USimulation_agent __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_Mfloat_Mcolor_R
	// Size: 0x38 (0x38 - 0x0)
	struct Ftuple_Lvector3_Mfloat_Mcolor_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
		FColors_color __verse_0x932BF92E_Elem2; // 0x20(0x18)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_Mfloat_Mfloat_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_Mfloat_Mfloat_Rdup_119	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
		double __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_Mtype_7b0_2e500000_7d_Mtype_7b1_2e500000_7d_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_Mtype_7b0_2e500000_7d_Mtype_7b1_2e500000_7d_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
		double __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_Mtype_7b1_2e000000e_2b02_7d_Mfloat_R
	// Size: 0x28 (0x28 - 0x0)
	struct Ftuple_Lvector3_Mtype_7b1_2e000000e_2b02_7d_Mfloat_R	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		double __verse_0x7D844C3C_Elem1; // 0x18(0x8)
		double __verse_0x932BF92E_Elem2; // 0x20(0x8)
	};


	// Struct /CompanionAI/_Verse/VNI/CompanionAI.tuple_Lvector3_Mvector3_R
	// Size: 0x30 (0x30 - 0x0)
	struct Ftuple_Lvector3_Mvector3_Rdup_120	
	{
	public:
		FSpatialMath_vector3 __verse_0x18E3F084_Elem0; // 0x0(0x18)
		FSpatialMath_vector3 __verse_0x7D844C3C_Elem1; // 0x18(0x18)
	};


	// Struct /VerseAIBase/_Verse/VNI/VerseAIBase.VerseAIBase_dummy_verse_ai_base
	// Size: 0x1 (0x1 - 0x0)
	struct FVerseAIBase_dummy_verse_ai_base	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseNPC/_Verse/VNI/VerseNPC.VerseNPC_dummy_verse_npc
	// Size: 0x1 (0x1 - 0x0)
	struct FVerseNPC_dummy_verse_npc	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_Rdup_121	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_122	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.tuple_Lfort__playspace_Mtuple_L_R_Mtuple_L_R_R
	// Size: 0xA (0xA - 0x0)
	struct Ftuple_Lfort__playspace_Mtuple_L_R_Mtuple_L_R_R	
	{
	public:
		UObject __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		Ftuple_L_R __verse_0x932BF92E_Elem2; // 0x9(0x1)
	};


	// Struct /VerseFortniteUI/_Verse/VNI/VerseFortniteUI.tuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R
	// Size: 0x20 (0x20 - 0x0)
	struct Ftuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R	
	{
	public:
		UUI_player_ui __verse_0x18E3F084_Elem0; // 0x0(0x8)
		Ftuple_L_R __verse_0x7D844C3C_Elem1; // 0x8(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x9(0x7) UNKNOWN PROPERTY
		TArray __verse_0x932BF92E_Elem2; // 0x10(0x10)
	};


	// Struct /FNE_Conversation/_Verse/VNI/FNE_ConversationRuntime.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__string_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__string_R	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /FNE_Conversation/_Verse/VNI/FNE_ConversationRuntime.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_Rdup_123	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /FNE_Conversation/_Verse/VNI/FNE_ConversationRuntime.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_124	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EntityInteract/_Verse/VNI/EntityInteract.tuple_L_Kagent_Mfloat_R
	// Size: 0x18 (0x18 - 0x0)
	struct Ftuple_L_Kagent_Mfloat_R	
	{
	public:
		TArray __verse_0x18E3F084_Elem0; // 0x0(0x10)
		double __verse_0x7D844C3C_Elem1; // 0x10(0x8)
	};


	// Struct /EntityInteract/_Verse/VNI/EntityInteract.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
	// Size: 0x70 (0x70 - 0x0)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_Rdup_125	
	{
	public:
		unsigned char UnknownData01_7[0x20]; // 0x0(0x20) UNKNOWN PROPERTY
		TMap __verse_0x932BF92E_Elem2; // 0x20(0x50)
	};


	// Struct /EntityInteract/_Verse/VNI/EntityInteract.tuple_L_R
	// Size: 0x1 (0x1 - 0x0)
	struct Ftuple_L_Rdup_126	
	{
	public:
		char _StructPaddingDummy; // 0x0(0x1)
	};


	// Struct /EntityInteract/_Verse/VNI/EntityInteract.tuple_Lagent_Mfloat_R
	// Size: 0x10 (0x10 - 0x0)
	struct Ftuple_Lagent_Mfloat_R	
	{
	public:
		USimulation_agent __verse_0x18E3F084_Elem0; // 0x0(0x8)
		double __verse_0x7D844C3C_Elem1; // 0x8(0x8)
	};

}
