#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: _Verse
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class /Solaris/_Verse/VNI/VerseNative.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuter : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UConcurrency : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fConcurrency_N_Rtask_L_Nt_20where_20t_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161AC920
		UClass _L_2fVerse_2eorg_2fConcurrency_N_Rawaitable_L_Npayload_20where_20payload_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161AC840
		UClass _L_2fVerse_2eorg_2fConcurrency_N_Rawaitable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161AC760
		void $InitCDO(); // Flags: None 0x7FF4161AC680
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency_awaitable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UConcurrency_awaitable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency_awaitable");
			return ret;
		}

		UConcurrency_task Await(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161ACD00
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency_task
	// Inherited from UObject
	// Size: 0x90 (0xB8 - 0x28)
	class UConcurrency_task : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x90]; // 0x28(0x90) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency_task");
			return ret;
		}

		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUnsettled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD9A0
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUninterrupted(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD8C0
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RSettled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD7E0
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RInterrupted(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD700
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCompleted(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD620
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceling(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD540
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD460
		UConcurrency_task Cancel(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161ADB60
		UConcurrency_task Await(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161ADA80
		void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RActive(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AD380
		void $InitInstance(); // Flags: None 0x7FF4161AD2A0
		void $Block(); // Flags: None 0x7FF4161AD0E0
		void $InitCDO(); // Flags: None 0x7FF4161AD1C0
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Concurrency_task_group
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UConcurrency_task_group : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x28(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Concurrency_task_group");
			return ret;
		}

		int64_t _L_2fVerse_2eorg_2fConcurrency_2ftask__group_N_RGetNumActive(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161AE1E0
		void $InitInstance(); // Flags: None 0x7FF4161AE100
		void $Block(); // Flags: None 0x7FF4161ADF40
		void $InitCDO(); // Flags: None 0x7FF4161AE020
	};


	// Class /Solaris/_Verse/VNI/VerseNative.Native
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UNative : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.Native");
			return ret;
		}

		void $InitCDO(); // Flags: None 0x7FF4161AE5C0
	};


	// Class /Solaris/_Verse/VNI/VerseNative.task_Concurrency_awaitable$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Concurrency_awaitable$Await : public UConcurrency_task	
	{
	public:
		UConcurrency_awaitable _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.task_Concurrency_awaitable$Await");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms 0x7FF4161AE9A0
	};


	// Class /Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Concurrency_task$Await : public UConcurrency_task	
	{
	public:
		UConcurrency_task _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4161AED80
	};


	// Class /Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Cancel
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x9 (0xC1 - 0xB8)
	class Utask_Concurrency_task$Cancel : public UConcurrency_task	
	{
	public:
		UConcurrency_task _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Solaris/_Verse/VNI/VerseNative.task_Concurrency_task$Cancel");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4161AF160
	};


	// Class /Verse/_Verse/VNI/Verse.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_0 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /Verse/_Verse/VNI/Verse.Random
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class URandom : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Random");
			return ret;
		}

		TArray _L_2fVerse_2eorg_2fRandom_N_RShuffle_L_N_Kt_20where_20t_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B2950
		int64_t _L_2fVerse_2eorg_2fRandom_N_RGetRandomInt_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B2870
		double _L_2fVerse_2eorg_2fRandom_N_RGetRandomFloat_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B2790
		void $InitCDO(); // Flags: None 0x7FF4161B26B0
	};


	// Class /Verse/_Verse/VNI/Verse.task_Verse_event$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Verse_event$Await : public UConcurrency_task	
	{
	public:
		UVerse_event _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.task_Verse_event$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4161B2D30
	};


	// Class /Verse/_Verse/VNI/Verse.Verse
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse : public UObject	
	{
	public:
		double __verse_0x34BB10F0_PiFloat; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fVerse_N_Rsubscribable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B69F0
		UClass _L_2fVerse_2eorg_2fVerse_N_Rsubscribable_L_Nt_20where_20t_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6AD0
		UClass _L_2fVerse_2eorg_2fVerse_N_Rsignalable_L_Npayload_20where_20payload_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6670
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B6130
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eSlice_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B6050
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5F70
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceElement_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5E90
		TArray _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lt_Mt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5DB0
		TArray _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eReplaceAll_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_L_Kt_M_Kt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5CD0
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveFirstElement_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Many_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5BF0
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveElement_U_L_N_Kt_M_Ntuple_L_R_M_Nint_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5B10
		TArray _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemoveAllElements_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Many_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5A30
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eRemove_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_Mint_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5950
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsFinite_U_L_Nfloat_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5870
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eIsAlmostZero_U_L_Nfloat_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lfloat_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5790
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eInsert_U_L_N_Kt_M_Ntuple_L_R_M_Ntuple_Lint_M_Kt_R_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B56B0
		void _L_2fVerse_2eorg_2fVerse_N_Roperator_U_2eFind_U_L_N_Kt_M_Ntuple_L_R_M_Nt_20where_20t_R(Ftuple_L_Kany_Mtuple_L_R_Many_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B55D0
		UClass _L_2fVerse_2eorg_2fVerse_N_Rlistenable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4610
		UClass _L_2fVerse_2eorg_2fVerse_N_Rlistenable_L_Npayload_20where_20payload_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B46F0
		UClass _L_2fVerse_2eorg_2fVerse_N_Revent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B3E30
		UClass _L_2fVerse_2eorg_2fVerse_N_Revent_L_Nt_20where_20t_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3F10
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6D70
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar32_R(int32_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6E50
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nchar_R(char __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6F30
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B70F0
		void _L_2fVerse_2eorg_2fVerse_N_RToString_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B7010
		double _L_2fVerse_2eorg_2fVerse_N_RTanh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6C90
		double _L_2fVerse_2eorg_2fVerse_N_RTan_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6BB0
		double _L_2fVerse_2eorg_2fVerse_N_RSqrt_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6910
		double _L_2fVerse_2eorg_2fVerse_N_RSinh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6830
		double _L_2fVerse_2eorg_2fVerse_N_RSin_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6750
		double _L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B64B0
		int64_t _L_2fVerse_2eorg_2fVerse_N_RSgn_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B6590
		void _L_2fVerse_2eorg_2fVerse_N_RRound_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B63D0
		void _L_2fVerse_2eorg_2fVerse_N_RQuotient_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B62F0
		double _L_2fVerse_2eorg_2fVerse_N_RPow_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B6210
		void _L_2fVerse_2eorg_2fVerse_N_RMod_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B54F0
		int64_t _L_2fVerse_2eorg_2fVerse_N_RMin_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5410
		double _L_2fVerse_2eorg_2fVerse_N_RMin_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5330
		int64_t _L_2fVerse_2eorg_2fVerse_N_RMax_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5250
		double _L_2fVerse_2eorg_2fVerse_N_RMax_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B5170
		UVerse_message _L_2fVerse_2eorg_2fVerse_N_RMakeMessageInternal_L_N_Kchar_M_N_Kchar_M_N_5b_Kchar_5dlocalizable__value_R(Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B5090
		UVerse_localizable_int _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4ED0
		UVerse_localizable_float _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4DF0
		UVerse_localizable_message _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_Nmessage_R(UVerse_message __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4FB0
		UVerse_localizable_string _L_2fVerse_2eorg_2fVerse_N_RMakeLocalizableValue_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4D10
		double _L_2fVerse_2eorg_2fVerse_N_RLog_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4C30
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nmessage_R(UVerse_message __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B4B50
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nint_M_N_QWhere_Nlocale_R(Ftuple_Lint_M_QWhere_Nlocale_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4A70
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_Nfloat_M_N_QWhere_Nlocale_R(Ftuple_Lfloat_M_QWhere_Nlocale_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4990
		void _L_2fVerse_2eorg_2fVerse_N_RLocalize_L_N_Kchar_M_N_QWhere_Nlocale_R(Ftuple_L_Kchar_M_QWhere_Nlocale_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B48B0
		double _L_2fVerse_2eorg_2fVerse_N_RLn_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B47D0
		double _L_2fVerse_2eorg_2fVerse_N_RLerp_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B4530
		void _L_2fVerse_2eorg_2fVerse_N_RJoin_L_N_K_Kchar_M_N_Kchar_R(Ftuple_L_K_Kchar_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B4450
		void _L_2fVerse_2eorg_2fVerse_N_RIsAlmostEqual_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B4370
		void _L_2fVerse_2eorg_2fVerse_N_RInt_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B4290
		double _L_2fVerse_2eorg_2fVerse_N_RGetSecondsSinceEpoch(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B41B0
		void _L_2fVerse_2eorg_2fVerse_N_RFloor_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B40D0
		double _L_2fVerse_2eorg_2fVerse_N_RExp_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3FF0
		EVerseFalse _L_2fVerse_2eorg_2fVerse_N_RErr_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3D50
		double _L_2fVerse_2eorg_2fVerse_N_RCosh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3C70
		double _L_2fVerse_2eorg_2fVerse_N_RCos_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3B90
		TArray _L_2fVerse_2eorg_2fVerse_N_RConcatenate_L_N_K_Kt_20where_20t_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B3AB0
		double _L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161B38F0
		int64_t _L_2fVerse_2eorg_2fVerse_N_RClamp_L_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B39D0
		void _L_2fVerse_2eorg_2fVerse_N_RCeil_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3810
		double _L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3490
		double _L_2fVerse_2eorg_2fVerse_N_RArcTan_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3570
		double _L_2fVerse_2eorg_2fVerse_N_RArcSin_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B33B0
		double _L_2fVerse_2eorg_2fVerse_N_RArcCos_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B31F0
		double _L_2fVerse_2eorg_2fVerse_N_RArTanh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3730
		double _L_2fVerse_2eorg_2fVerse_N_RArSinh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B3650
		double _L_2fVerse_2eorg_2fVerse_N_RArCosh_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161B32D0
		FVerse_locale Verse_locale$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms 0x7FF4161B72B0
		FVerse_locale Verse_locale$Factory(); // Flags: Static|HasOutParms 0x7FF4161B71D0
		void $InitCDO(); // Flags: None 0x7FF4161B3110
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_cancelable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_cancelable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_cancelable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF4161B7690
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_disposable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_disposable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_disposable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF4161B7A70
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_enableable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_enableable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_enableable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161B8010
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF4161B7F30
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF4161B7E50
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_event
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UVerse_event : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x28]; // 0x28(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_event");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fsignalable_N_RSignal_L_Npayload_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161B8770
		int64_t _L_2fVerse_2eorg_2fVerse_2fevent_N_RGetAwaitCount(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161B8690
		UConcurrency_task Await(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161B8850
		void $InitInstance(); // Flags: None 0x7FF4161B85B0
		void $Block(); // Flags: None 0x7FF4161B83F0
		void $InitCDO(); // Flags: None 0x7FF4161B84D0
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_invalidatable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_invalidatable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_invalidatable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161B8C30
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_listenable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_listenable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_listenable");
			return ret;
		}
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_value
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_localizable_value : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_value");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161B94D0
		void $Block(); // Flags: None 0x7FF4161B9310
		void $InitCDO(); // Flags: None 0x7FF4161B93F0
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_float
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse_localizable_float : public UVerse_localizable_value	
	{
	public:
		double __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_float");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161B9A70
		void $Block(); // Flags: None 0x7FF4161B98B0
		void $InitCDO(); // Flags: None 0x7FF4161B9990
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_int
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse_localizable_int : public UVerse_localizable_value	
	{
	public:
		int64_t __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_int");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161BA010
		void $Block(); // Flags: None 0x7FF4161B9E50
		void $InitCDO(); // Flags: None 0x7FF4161B9F30
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_message
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerse_localizable_message : public UVerse_localizable_value	
	{
	public:
		UVerse_message __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_message");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161BA5B0
		void $Block(); // Flags: None 0x7FF4161BA3F0
		void $InitCDO(); // Flags: None 0x7FF4161BA4D0
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_localizable_string
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UVerse_localizable_string : public UVerse_localizable_value	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_localizable_string");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161BAB50
		void $Block(); // Flags: None 0x7FF4161BA990
		void $InitCDO(); // Flags: None 0x7FF4161BAA70
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_message
	// Inherited from UObject
	// Size: 0x70 (0x98 - 0x28)
	class UVerse_message : public UObject	
	{
	public:
		unsigned char UnknownData01_3[0x20]; // 0x28(0x20) UNKNOWN PROPERTY
		TMap __verse_0x85420AD2_Substitutions; // 0x48(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_message");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161BB0F0
		void $Block(); // Flags: None 0x7FF4161BAF30
		void $InitCDO(); // Flags: None 0x7FF4161BB010
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_signalable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_signalable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_signalable");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fsignalable_N_RSignal_L_Npayload_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF4161BB4D0
	};


	// Class /Verse/_Verse/VNI/Verse.Verse_subscribable
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerse_subscribable : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Verse/_Verse/VNI/Verse.Verse_subscribable");
			return ret;
		}

		UObject _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161BB8B0
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_1 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class URestricted : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.Restricted");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fRestricted_N_Rsticky__event_L_Nt_20where_20t_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161DE3C8
		UClass _L_2fVerse_2eorg_2fRestricted_N_Rsticky__event(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161DE2E8
		void $InitCDO(); // Flags: None 0x7FF4161DE208
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class URestricted_sticky_event : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.Restricted_sticky_event");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fsignalable_N_RSignal_L_Npayload_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161DECE8
		void _L_2fVerse_2eorg_2fRestricted_2fsticky__event_N_RIsSignaled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161DEC08
		int64_t _L_2fVerse_2eorg_2fRestricted_2fsticky__event_N_RGetAwaitCount(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161DEB28
		void _L_2fVerse_2eorg_2fRestricted_2fsticky__event_N_RClearSignal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161DEA48
		UConcurrency_task Await(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161DEDC8
		void $InitInstance(); // Flags: None 0x7FF4161DE968
		void $Block(); // Flags: None 0x7FF4161DE7A8
		void $InitCDO(); // Flags: None 0x7FF4161DE888
	};


	// Class /VerseRestricted/_Verse/VNI/VerseRestricted.task_Restricted_sticky_event$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_Restricted_sticky_event$Await : public UConcurrency_task	
	{
	public:
		URestricted_sticky_event _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseRestricted/_Verse/VNI/VerseRestricted.task_Restricted_sticky_event$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4161DF1A8
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_2 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.task_VerseEngine_subscribable_event$Await
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_VerseEngine_subscribable_event$Await : public UConcurrency_task	
	{
	public:
		UVerseEngine_subscribable_event _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_7[0x17]; // 0xC1(0x17) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.task_VerseEngine_subscribable_event$Await");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4161E0400
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseEngine : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine");
			return ret;
		}

		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161E0B60
		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161E0A80
		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161E09A0
		UClass _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161E08C0
		void $InitCDO(); // Flags: None 0x7FF4161E07E0
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_EntityHelpers
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseEngine_Entity_EntityHelpers : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_EntityHelpers");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Nvk__component_R(UEntityComponent __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161E11E0
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Nvk__component_M_NType_20where_20Type_R(Ftuple_Lvk__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161E1100
		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Nvk__component_R(UEntityComponent __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161E1020
		void $InitCDO(); // Flags: None 0x7FF4161E0F40
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_vk_entity
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UVerseEngine_Entity_vk_entity : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_Entity_vk_entity");
			return ret;
		}

		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RRemoveComponent_L_Nvk__component_R(UEntityComponent __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E2120
		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RIsEqual_L_Nvk__entity_R(UVerseEngine_Entity_vk_entity __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E2040
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RHasComponents_L_N_Ksubtype_Lvk__component_R_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161E1F60
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1E80
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetName(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1DA0
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetFullname(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1CC0
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1BE0
		TArray _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1B00
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_REnsureComponents_L_N_Ksubtype_Lvk__component_R_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4161E1A20
		bool _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RDestroy(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1940
		void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E1860
		void $InitInstance(); // Flags: None 0x7FF4161E1780
		void $Block(); // Flags: None 0x7FF4161E15C0
		void $InitCDO(); // Flags: None 0x7FF4161E16A0
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_base
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseEngine_multicast_delegate_base : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_base");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4161E26C0
		void $Block(); // Flags: None 0x7FF4161E2500
		void $InitCDO(); // Flags: None 0x7FF4161E25E0
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate
	// Inherited from UVerseEngine_multicast_delegate_base -> UObject
	// Size: 0x40 (0x68 - 0x28)
	class UVerseEngine_multicast_delegate : public UVerseEngine_multicast_delegate_base	
	{
	public:
		unsigned char UnknownData01_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate");
			return ret;
		}

		UObject _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E2D40
		void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_REmpty(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161E2F00
		void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_RBroadcast_L_Nt_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161E2E20
		void $InitInstance(); // Flags: None 0x7FF4161E2C60
		void $Block(); // Flags: None 0x7FF4161E2AA0
		void $InitCDO(); // Flags: None 0x7FF4161E2B80
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_subscription
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UVerseEngine_multicast_delegate_subscription : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x28(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_multicast_delegate_subscription");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161E3580
		void $InitInstance(); // Flags: None 0x7FF4161E34A0
		void $Block(); // Flags: None 0x7FF4161E32E0
		void $InitCDO(); // Flags: None 0x7FF4161E33C0
	};


	// Class /VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_subscribable_event
	// Inherited from UVerseEngine_multicast_delegate -> UVerseEngine_multicast_delegate_base -> UObject
	// Size: 0x28 (0x90 - 0x68)
	class UVerseEngine_subscribable_event : public UVerseEngine_multicast_delegate	
	{
	public:
		unsigned char UnknownData01_1[0x28]; // 0x68(0x28) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseEngine.VerseEngine_subscribable_event");
			return ret;
		}

		UConcurrency_task Await(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4161E3C00
		void $InitInstance(); // Flags: None 0x7FF4161E3B20
		void $Block(); // Flags: None 0x7FF4161E3960
		void $InitCDO(); // Flags: None 0x7FF4161E3A40
	};


	// Class /EntityFramework/_Verse/VNI/Execution.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_3 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Execution.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/Execution.execution_subscribable
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class Uexecution_subscribable : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Execution.execution_subscribable");
			return ret;
		}

		UObject _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4161E4C48
		void $InitInstance(); // Flags: None 0x7FF4161E4B68
		void $Block(); // Flags: None 0x7FF4161E49A8
		void $InitCDO(); // Flags: None 0x7FF4161E4A88
	};


	// Class /EntityFramework/_Verse/VNI/Execution.execution_subscription
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class Uexecution_subscription : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x28(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Execution.execution_subscription");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunBefore_L_Nexecution__subscription_R(Uexecution_subscription __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161E53A8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunAfter_L_Nexecution__subscription_R(Uexecution_subscription __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161E52C8
		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4161E5488
		void $InitInstance(); // Flags: None 0x7FF4161E51E8
		void $Block(); // Flags: None 0x7FF4161E5028
		void $InitCDO(); // Flags: None 0x7FF4161E5108
	};


	// Class /VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_4 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.Simulation
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class USimulation : public UObject	
	{
	public:
		UVerse_message __verse_0x231BDA57_editable_empty_message; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulationMetadata/_Verse/VNI/VerseSimulationMetadata.Simulation");
			return ret;
		}

		void $InitCDO(); // Flags: HasDefaults 0x7FF4161E6088
	};


	// Class /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_5 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Root : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary._Root");
			return ret;
		}

		TArray _L_2fUnrealEngine_2ecom_2fTemporary_N_RSortBy_L_N_Kt_M_Ntype_7b___L_Nt_M_Nt_R_3ccomputes_3e_3cdecides_3e_Nvoid_7d_20where_20t_R(Ftuple_L_Kany_Mtype_7b___L_Nany_M_Nany_R_3ccomputes_3e_3cdecides_3e_Nvoid_7d_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EA6A0
		void $InitCDO(); // Flags: None 0x7FF4161EA5C0
	};


	// Class /EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USpatialMath : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesTemporary/_Verse/VNI/EpicGamesTemporary.SpatialMath");
			return ret;
		}

		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2i_R(FSpatialMath_vector2i __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EEDE0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EEEC0
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Rprefix_U_2d_U_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EED00
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EEA60
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EEC20
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EE980
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2f_U_L_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EEB40
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R(Ftuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE8A0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eUnrotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R(Ftuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE7C0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateVector_U_L_Nrotation_M_Ntuple_L_R_M_Nvector3_R(Ftuple_Lrotation_Mtuple_L_R_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE6E0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eRotateBy_U_L_Nrotation_M_Ntuple_L_R_M_Nrotation_R(Ftuple_Lrotation_Mtuple_L_R_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE600
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE520
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eMakeUnitVector_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE440
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EE360
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquaredXY_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE280
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EE1A0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLengthSquared_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EE0C0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EDF00
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eLength_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EDFE0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector3_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector3_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EDE20
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nvector2_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lvector2_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EDD40
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsFinite_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EDC60
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector3_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lvector3_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EDB80
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eIsAlmostZero_U_L_Nvector2_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lvector2_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EDAA0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eInvert_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED9C0
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetYawPitchRollDegrees_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED8E0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalUp_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ED800
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalRight_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ED720
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetLocalForward_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ED640
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAxis_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED560
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eGetAngle_U_L_Nrotation_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lrotation_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED480
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyYaw_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED3A0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED2C0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED1E0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyWorldRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED100
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyRoll_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ED020
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyPitch_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161ECF40
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationZ_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ECE60
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationY_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ECD80
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2eApplyLocalRotationX_U_L_Nrotation_M_Ntuple_L_R_M_Nfloat_R(Ftuple_Lrotation_Mtuple_L_R_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ECCA0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ECBC0
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ECAE0
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2d_U_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161ECA00
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC760
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC920
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2b_U_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC840
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R(Ftuple_Lfloat_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC140
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC3E0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC680
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC5A0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector3_R(Ftuple_Lfloat_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC220
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nvector2i_M_Nint_R(Ftuple_Lvector2i_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC4C0
		FSpatialMath_vector2i _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nint_M_Nvector2i_R(Ftuple_Lint_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC300
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZero(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EFDA0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RZAxis(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EFCC0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RYAxis(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EFBE0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RXAxis(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EFB00
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVectorNoScale_L_Ntransform_M_Nvector3_R(Ftuple_Ltransform_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EFA20
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RTransformVector_L_Ntransform_M_Nvector3_R(Ftuple_Ltransform_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF940
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2i_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EF860
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToVector2_L_Nvector2i_R(FSpatialMath_vector2i __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EF780
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF400
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF6A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2i_R(FSpatialMath_vector2i __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF5C0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF4E0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RToString_L_Nrotation_R(FVerseRotation __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF320
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RSlerp_L_Nrotation_M_Nrotation_M_Nfloat_R(Ftuple_Lrotation_Mrotation_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF240
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF160
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RReflectVector_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EF080
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RRadiansToDegrees_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EEFA0
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EC060
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EBEA0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EBF80
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EBDC0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EBCE0
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeComponentWiseDeltaRotation_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EBC00
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EBA40
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EBB20
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R(Ftuple_Lvector2_Mvector2_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EB880
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R(Ftuple_Lvector3_Mvector3_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EB960
		FVerseRotation _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB7A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4161EB6C0
		int64_t _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R(Ftuple_Lvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB500
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB5E0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB420
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB340
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB260
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB0A0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EB180
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EAFC0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R(Ftuple_Lvector2_Mvector2_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EAEE0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EAE00
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EAD20
		FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R(Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EAC40
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RAngularDistance_L_Nrotation_M_Nrotation_R(Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4161EAB60
		FSpatialMath_vector3 SpatialMath_vector3$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF4161F04A0
		FSpatialMath_vector3 SpatialMath_vector3$Factory(); // Flags: Static|HasOutParms 0x7FF4161F03C0
		FSpatialMath_vector2i SpatialMath_vector2i$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF4161F02E0
		FSpatialMath_vector2i SpatialMath_vector2i$Factory(); // Flags: Static|HasOutParms 0x7FF4161F0200
		FSpatialMath_vector2 SpatialMath_vector2$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF4161F0120
		FSpatialMath_vector2 SpatialMath_vector2$Factory(); // Flags: Static|HasOutParms 0x7FF4161F0040
		FSpatialMath_transform SpatialMath_transform$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF4161EFF60
		FSpatialMath_transform SpatialMath_transform$Factory(); // Flags: Static|HasOutParms|HasDefaults 0x7FF4161EFE80
		void $InitCDO(); // Flags: None 0x7FF4161EAA80
	};


	// Class /VerseColors/_Verse/VNI/VerseColors.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_6 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseColors/_Verse/VNI/VerseColors.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseColors/_Verse/VNI/VerseColors.Colors
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UColors : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseColors/_Verse/VNI/VerseColors.Colors");
			return ret;
		}

		void _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R(Ftuple_Lcolor_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203C38
		void _L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R(Ftuple_Lcolor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203B58
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R(Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203A78
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R(Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203998
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R(Ftuple_Lcolor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203538
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R(Ftuple_Lcolor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203618
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R(Ftuple_Lfloat_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162037D8
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R(Ftuple_Lcolor_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162036F8
		FColors_color _L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R(Ftuple_Lint_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162038B8
		Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203458
		Ftuple_Lfloat_Mfloat_Mfloat_R _L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203378
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416203298
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162031B8
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162030D8
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416202F18
		FColors_color _L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R(Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416202FF8
		FColors_color Colors_color$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF416203DF8
		FColors_color Colors_color$Factory(); // Flags: Static|HasOutParms 0x7FF416203D18
		void $InitCDO(); // Flags: None 0x7FF416202E38
	};


	// Class /VerseColors/_Verse/VNI/VerseColors.Colors_NamedColors
	// Inherited from UObject
	// Size: 0xDC8 (0xDF0 - 0x28)
	class UColors_NamedColors : public UObject	
	{
	public:
		FColors_color __verse_0x9FBDE6AE_AliceBlue; // 0x28(0x18)
		FColors_color __verse_0xB3F7599D_AntiqueWhite; // 0x40(0x18)
		FColors_color __verse_0x37EE68B4_Aqua; // 0x58(0x18)
		FColors_color __verse_0xA52EBB79_Aquamarine; // 0x70(0x18)
		FColors_color __verse_0xD06EFB2A_Azure; // 0x88(0x18)
		FColors_color __verse_0x8CE5D6D0_Beige; // 0xA0(0x18)
		FColors_color __verse_0xC6B3972A_Bisque; // 0xB8(0x18)
		FColors_color __verse_0x65E4346F_Black; // 0xD0(0x18)
		FColors_color __verse_0x513D3B5F_BlanchedAlmond; // 0xE8(0x18)
		FColors_color __verse_0x80217580_Blue; // 0x100(0x18)
		FColors_color __verse_0x31D0653D_BlueViolet; // 0x118(0x18)
		FColors_color __verse_0xAD308F8F_Brown; // 0x130(0x18)
		FColors_color __verse_0xED3A42A8_Burlywood; // 0x148(0x18)
		FColors_color __verse_0x921A6303_CadetBlue; // 0x160(0x18)
		FColors_color __verse_0x9E2BDE1B_Chartreuse; // 0x178(0x18)
		FColors_color __verse_0x082AED19_Chocolate; // 0x190(0x18)
		FColors_color __verse_0x196BEF87_Coral; // 0x1A8(0x18)
		FColors_color __verse_0xC6BCD84F_CornflowerBlue; // 0x1C0(0x18)
		FColors_color __verse_0xEE818697_Cornsilk; // 0x1D8(0x18)
		FColors_color __verse_0x6733DEF7_Crimson; // 0x1F0(0x18)
		FColors_color __verse_0x2D925695_Cyan; // 0x208(0x18)
		FColors_color __verse_0x935B7248_DarkBlue; // 0x220(0x18)
		FColors_color __verse_0x3EE8515D_DarkCyan; // 0x238(0x18)
		FColors_color __verse_0x5817F032_DarkGoldenrod; // 0x250(0x18)
		FColors_color __verse_0x916F3C35_DarkGray; // 0x268(0x18)
		FColors_color __verse_0x37F798B1_DarkGreen; // 0x280(0x18)
		FColors_color __verse_0x6B6176B1_DarkGrey; // 0x298(0x18)
		FColors_color __verse_0x9A5F61FB_DarkKhaki; // 0x2B0(0x18)
		FColors_color __verse_0x97899EDF_DarkMagenta; // 0x2C8(0x18)
		FColors_color __verse_0xC2E62C73_DarkOliveGreen; // 0x2E0(0x18)
		FColors_color __verse_0x7431D49D_DarkOrange; // 0x2F8(0x18)
		FColors_color __verse_0xA0C47F58_DarkOrchid; // 0x310(0x18)
		FColors_color __verse_0xA3246E28_DarkRed; // 0x328(0x18)
		FColors_color __verse_0x5A06EB6C_DarkSalmon; // 0x340(0x18)
		FColors_color __verse_0xF141484E_DarkSeaGreen; // 0x358(0x18)
		FColors_color __verse_0x4167AB57_DarkSlateBlue; // 0x370(0x18)
		FColors_color __verse_0x4353E52A_DarkSlateGray; // 0x388(0x18)
		FColors_color __verse_0xB95DAFAE_DarkSlateGrey; // 0x3A0(0x18)
		FColors_color __verse_0x26DA5155_DarkTurquoise; // 0x3B8(0x18)
		FColors_color __verse_0x3E781A05_DarkViolet; // 0x3D0(0x18)
		FColors_color __verse_0x53E148EA_DeepPink; // 0x3E8(0x18)
		FColors_color __verse_0xA474CD21_DeepSkyBlue; // 0x400(0x18)
		FColors_color __verse_0xEC312FE8_DimGray; // 0x418(0x18)
		FColors_color __verse_0x163F656C_DimGrey; // 0x430(0x18)
		FColors_color __verse_0x617B6862_DodgerBlue; // 0x448(0x18)
		FColors_color __verse_0xC636E104_Firebrick; // 0x460(0x18)
		FColors_color __verse_0x06164DB2_FloralWhite; // 0x478(0x18)
		FColors_color __verse_0x4939E624_ForestGreen; // 0x490(0x18)
		FColors_color __verse_0x8069E472_Fuchsia; // 0x4A8(0x18)
		FColors_color __verse_0x71D0705F_Gainsboro; // 0x4C0(0x18)
		FColors_color __verse_0x1EDD5A5B_GhostWhite; // 0x4D8(0x18)
		FColors_color __verse_0x0363FA56_Gold; // 0x4F0(0x18)
		FColors_color __verse_0x13A0B098_Goldenrod; // 0x508(0x18)
		FColors_color __verse_0x82153BFD_Gray; // 0x520(0x18)
		FColors_color __verse_0x853EAC70_Green; // 0x538(0x18)
		FColors_color __verse_0x94CAEBA0_GreenYellow; // 0x550(0x18)
		FColors_color __verse_0x781B7179_Grey; // 0x568(0x18)
		FColors_color __verse_0x6FB30324_Honeydew; // 0x580(0x18)
		FColors_color __verse_0x2D404B19_Hotpink; // 0x598(0x18)
		FColors_color __verse_0x2CE09720_IndianRed; // 0x5B0(0x18)
		FColors_color __verse_0x180B2901_Indigo; // 0x5C8(0x18)
		FColors_color __verse_0x1086E2EC_Ivory; // 0x5E0(0x18)
		FColors_color __verse_0x2896553A_Khaki; // 0x5F8(0x18)
		FColors_color __verse_0xB93AFCDC_Lavender; // 0x610(0x18)
		FColors_color __verse_0x4CF8F931_LavenderBlush; // 0x628(0x18)
		FColors_color __verse_0x08B4792E_LawnGreen; // 0x640(0x18)
		FColors_color __verse_0xCC22276F_LemonChiffon; // 0x658(0x18)
		FColors_color __verse_0x607C97F4_LightBlue; // 0x670(0x18)
		FColors_color __verse_0x89B3D40E_LightCoral; // 0x688(0x18)
		FColors_color __verse_0xCDCFB4E1_LightCyan; // 0x6A0(0x18)
		FColors_color __verse_0x6C11FD65_LightGoldenrodYellow; // 0x6B8(0x18)
		FColors_color __verse_0x6248D989_LightGray; // 0x6D0(0x18)
		FColors_color __verse_0x15E697F9_LightGreen; // 0x6E8(0x18)
		FColors_color __verse_0x9846930D_LightGrey; // 0x700(0x18)
		FColors_color __verse_0xC34ABDCC_LightPink; // 0x718(0x18)
		FColors_color __verse_0xC57DAB84_LightSalmon; // 0x730(0x18)
		FColors_color __verse_0x0FE57B41_LightSeaGreen; // 0x748(0x18)
		FColors_color __verse_0x4077C098_LightSkyBlue; // 0x760(0x18)
		FColors_color __verse_0xCABFF9F6_LightSlateGray; // 0x778(0x18)
		FColors_color __verse_0x30B1B372_LightSlateGrey; // 0x790(0x18)
		FColors_color __verse_0xEFD2DF75_LightSteelBlue; // 0x7A8(0x18)
		FColors_color __verse_0x5732C477_LightYellow; // 0x7C0(0x18)
		FColors_color __verse_0xA58A0A97_Lime; // 0x7D8(0x18)
		FColors_color __verse_0xC8D6E552_LimeGreen; // 0x7F0(0x18)
		FColors_color __verse_0xD014B08F_Linen; // 0x808(0x18)
		FColors_color __verse_0xC5065659_Magenta; // 0x820(0x18)
		FColors_color __verse_0x2C6B6225_Maroon; // 0x838(0x18)
		FColors_color __verse_0x603DC640_MediumAquamarine; // 0x850(0x18)
		FColors_color __verse_0x03344EDD_MediumBlue; // 0x868(0x18)
		FColors_color __verse_0xEB235F60_MediumOrchid; // 0x880(0x18)
		FColors_color __verse_0x80AC62AF_MediumPurple; // 0x898(0x18)
		FColors_color __verse_0xA2F1456A_MediumSeaGreen; // 0x8B0(0x18)
		FColors_color __verse_0x81A3E0C2_MediumSlateBlue; // 0x8C8(0x18)
		FColors_color __verse_0x8259C923_MediumSpringGreen; // 0x8E0(0x18)
		FColors_color __verse_0xE61E1AC0_MediumTurquoise; // 0x8F8(0x18)
		FColors_color __verse_0x750A73D1_MediumVioletRed; // 0x910(0x18)
		FColors_color __verse_0x54B068FD_MidnightBlue; // 0x928(0x18)
		FColors_color __verse_0x2D5517E3_MintCream; // 0x940(0x18)
		FColors_color __verse_0xC9B38859_MistyRose; // 0x958(0x18)
		FColors_color __verse_0x045E548D_Moccasin; // 0x970(0x18)
		FColors_color __verse_0x66A473BA_NavajoWhite; // 0x988(0x18)
		FColors_color __verse_0x621CB82D_Navy; // 0x9A0(0x18)
		FColors_color __verse_0x4433768E_OldLace; // 0x9B8(0x18)
		FColors_color __verse_0x4ADCED0B_Olive; // 0x9D0(0x18)
		FColors_color __verse_0x662F5053_OliveDrab; // 0x9E8(0x18)
		FColors_color __verse_0x7B1B98E3_Orange; // 0xA00(0x18)
		FColors_color __verse_0x31DF128E_OrangeRed; // 0xA18(0x18)
		FColors_color __verse_0xAFEE3326_Orchid; // 0xA30(0x18)
		FColors_color __verse_0xA90612F2_PaleGoldenrod; // 0xA48(0x18)
		FColors_color __verse_0x6494F519_PaleGreen; // 0xA60(0x18)
		FColors_color __verse_0xD7CBB395_PaleTurquoise; // 0xA78(0x18)
		FColors_color __verse_0xBC04EB9C_PaleVioletred; // 0xA90(0x18)
		FColors_color __verse_0x1267A5CE_PapayaWhip; // 0xAA8(0x18)
		FColors_color __verse_0x5B815063_PeachPuff; // 0xAC0(0x18)
		FColors_color __verse_0x6A5E8726_Peru; // 0xAD8(0x18)
		FColors_color __verse_0x23175FB8_Pink; // 0xAF0(0x18)
		FColors_color __verse_0x92124624_Plum; // 0xB08(0x18)
		FColors_color __verse_0x315A9690_PowderBlue; // 0xB20(0x18)
		FColors_color __verse_0xC4610EE9_Purple; // 0xB38(0x18)
		FColors_color __verse_0x77CCDA87_Red; // 0xB50(0x18)
		FColors_color __verse_0xFB01846B_RosyBrown; // 0xB68(0x18)
		FColors_color __verse_0xA95C80D8_RoyalBlue; // 0xB80(0x18)
		FColors_color __verse_0xFCC2BB8C_SaddleBrown; // 0xB98(0x18)
		FColors_color __verse_0x552CA712_Salmon; // 0xBB0(0x18)
		FColors_color __verse_0xE1C22521_SandyBrown; // 0xBC8(0x18)
		FColors_color __verse_0x36A1DDC2_SeaGreen; // 0xBE0(0x18)
		FColors_color __verse_0x58B624CB_SeaShell; // 0xBF8(0x18)
		FColors_color __verse_0x013650B1_Sienna; // 0xC10(0x18)
		FColors_color __verse_0xFA47F979_Silver; // 0xC28(0x18)
		FColors_color __verse_0x1EAB27FD_SkyBlue; // 0xC40(0x18)
		FColors_color __verse_0x0AD0EBFD_SlateBlue; // 0xC58(0x18)
		FColors_color __verse_0x08E4A580_SlateGray; // 0xC70(0x18)
		FColors_color __verse_0xF2EAEF04_SlateGrey; // 0xC88(0x18)
		FColors_color __verse_0xE7A26A33_Snow; // 0xCA0(0x18)
		FColors_color __verse_0x2CD5AEB9_SpringGreen; // 0xCB8(0x18)
		FColors_color __verse_0x2D898303_SteelBlue; // 0xCD0(0x18)
		FColors_color __verse_0x09871083_Tan; // 0xCE8(0x18)
		FColors_color __verse_0x303C932D_Teal; // 0xD00(0x18)
		FColors_color __verse_0x303F6677_Thistle; // 0xD18(0x18)
		FColors_color __verse_0x4DC64808_Tomato; // 0xD30(0x18)
		FColors_color __verse_0x6D6D11FF_Turquoise; // 0xD48(0x18)
		FColors_color __verse_0x3152567B_Violet; // 0xD60(0x18)
		FColors_color __verse_0x13A81039_Wheat; // 0xD78(0x18)
		FColors_color __verse_0x27EAE4E0_White; // 0xD90(0x18)
		FColors_color __verse_0xBE90A762_WhiteSmoke; // 0xDA8(0x18)
		FColors_color __verse_0xC763C8E1_Yellow; // 0xDC0(0x18)
		FColors_color __verse_0xF10B434A_YellowGreen; // 0xDD8(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseColors/_Verse/VNI/VerseColors.Colors_NamedColors");
			return ret;
		}

		void $InitCDO(); // Flags: HasDefaults 0x7FF4162041D8
	};


	// Class /VerseEngine/_Verse/VNI/VerseParameterCollections.ParameterCollections_parameter_collection
	// Inherited from UVerseParameterCollection -> UObject
	// Size: 0x0 (0x78 - 0x78)
	class UParameterCollections_parameter_collection : public UVerseParameterCollection	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseParameterCollections.ParameterCollections_parameter_collection");
			return ret;
		}

		void _L_2fVerse_2eorg_2fParameterCollections_2fparameter__collection_N_ROnPropertyChangedFromVerse_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416206060
		void $InitInstance(); // Flags: None 0x7FF416205F80
		void $Block(); // Flags: None 0x7FF416205DC0
		void $InitCDO(); // Flags: None 0x7FF416205EA0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_7 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssets : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets");
			return ret;
		}

		void _L_2fVerse_2eorg_2fAssets_N_RMakeAsset_L_NAssetType_M_N_Kchar_20where_20AssetType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416206C20
		void $InitCDO(); // Flags: None 0x7FF416206B40
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_asset
	// Inherited from UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x8 (0x88 - 0x80)
	class UAssets_asset : public UVerseAssetPtr	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x80(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_asset");
			return ret;
		}

		bool _L_2fVerse_2eorg_2fAssets_2fasset_N_RSyncLoad(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416207540
		void _L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAsyncLoadEvent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416207460
		void _L_2fVerse_2eorg_2fAssets_2fasset_N_RGetAssetType(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416207380
		URestricted_sticky_event _L_2fVerse_2eorg_2fAssets_2fasset_N_RAsync__Load(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162072A0
		void $InitInstance(); // Flags: None 0x7FF4162071C0
		void $Block(); // Flags: None 0x7FF416207000
		void $InitCDO(); // Flags: None 0x7FF4162070E0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416207AE0
		void $Block(); // Flags: None 0x7FF416207920
		void $InitCDO(); // Flags: None 0x7FF416207A00
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_blueprint
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation_blueprint : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_blueprint");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416208080
		void $Block(); // Flags: None 0x7FF416207EC0
		void $InitCDO(); // Flags: None 0x7FF416207FA0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_instance
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation_instance : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_instance");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416208620
		void $Block(); // Flags: None 0x7FF416208460
		void $InitCDO(); // Flags: None 0x7FF416208540
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_sequence
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_animation_sequence : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_animation_sequence");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416208BC0
		void $Block(); // Flags: None 0x7FF416208A00
		void $InitCDO(); // Flags: None 0x7FF416208AE0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_rig_asset
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_rig_asset : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_rig_asset");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416209160
		void $Block(); // Flags: None 0x7FF416208FA0
		void $InitCDO(); // Flags: None 0x7FF416209080
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_float
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_float : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_float");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416209700
		void $Block(); // Flags: None 0x7FF416209540
		void $InitCDO(); // Flags: None 0x7FF416209620
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_integer
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_integer : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_integer");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416209CA0
		void $Block(); // Flags: None 0x7FF416209AE0
		void $InitCDO(); // Flags: None 0x7FF416209BC0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_logic
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_logic : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_logic");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620A240
		void $Block(); // Flags: None 0x7FF41620A080
		void $InitCDO(); // Flags: None 0x7FF41620A160
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_rotation
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_rotation : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_rotation");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620A7E0
		void $Block(); // Flags: None 0x7FF41620A620
		void $InitCDO(); // Flags: None 0x7FF41620A700
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_transform
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_transform : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_transform");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620AD80
		void $Block(); // Flags: None 0x7FF41620ABC0
		void $InitCDO(); // Flags: None 0x7FF41620ACA0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector2
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_vector2 : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector2");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620B320
		void $Block(); // Flags: None 0x7FF41620B160
		void $InitCDO(); // Flags: None 0x7FF41620B240
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector3
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_camera_variable_vector3 : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_camera_variable_vector3");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620B8C0
		void $Block(); // Flags: None 0x7FF41620B700
		void $InitCDO(); // Flags: None 0x7FF41620B7E0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_client_asset
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_client_asset : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_client_asset");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620BE60
		void $Block(); // Flags: None 0x7FF41620BCA0
		void $InitCDO(); // Flags: None 0x7FF41620BD80
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_action
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_enhanced_input_action : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_action");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620C400
		void $Block(); // Flags: None 0x7FF41620C240
		void $InitCDO(); // Flags: None 0x7FF41620C320
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_context
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_enhanced_input_context : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_enhanced_input_context");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620C9A0
		void $Block(); // Flags: None 0x7FF41620C7E0
		void $InitCDO(); // Flags: None 0x7FF41620C8C0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_font
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_font : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_font");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620CF40
		void $Block(); // Flags: None 0x7FF41620CD80
		void $InitCDO(); // Flags: None 0x7FF41620CE60
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_level
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_level : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_level");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620D4E0
		void $Block(); // Flags: None 0x7FF41620D320
		void $InitCDO(); // Flags: None 0x7FF41620D400
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_material
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssets_material : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_material");
			return ret;
		}

		UMaterialInterface _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetMaterialInterface(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41620D9A0
		UAssets_material_asset _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetAsset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41620D8C0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_material_asset
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_material_asset : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_material_asset");
			return ret;
		}

		UMaterialInterface _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetMaterialInterface(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41620E100
		UAssets_material_asset _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetAsset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41620E020
		void $InitInstance(); // Flags: None 0x7FF41620DF40
		void $Block(); // Flags: None 0x7FF41620DD80
		void $InitCDO(); // Flags: None 0x7FF41620DE60
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_mesh
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_mesh : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_mesh");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620E6A0
		void $Block(); // Flags: None 0x7FF41620E4E0
		void $InitCDO(); // Flags: None 0x7FF41620E5C0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_parameter_collection_UE5_definition
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_parameter_collection_UE5_definition : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_parameter_collection_UE5_definition");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620EC40
		void $Block(); // Flags: None 0x7FF41620EA80
		void $InitCDO(); // Flags: None 0x7FF41620EB60
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_material
	// Inherited from UParameterCollections_parameter_collection -> UVerseParameterCollection -> UObject
	// Size: 0x20 (0x98 - 0x78)
	class UAssets_parameterized_material : public UParameterCollections_parameter_collection	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x78(0x8) UNKNOWN PROPERTY
		UObject __verse_0xF2313B1F_Material; // 0x80(0x8)
		unsigned char UnknownData03_7[0x10]; // 0x88(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_material");
			return ret;
		}

		UMaterialInterface _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetMaterialInterface(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41620F3A0
		UAssets_material_asset _L_2fVerse_2eorg_2fAssets_2fmaterial_N_RGetAsset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41620F2C0
		void $InitInstance(); // Flags: None 0x7FF41620F1E0
		void $Block(); // Flags: None 0x7FF41620F020
		void $InitCDO(); // Flags: None 0x7FF41620F100
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_parameter_collection
	// Inherited from UParameterCollections_parameter_collection -> UVerseParameterCollection -> UObject
	// Size: 0x70 (0xE8 - 0x78)
	class UAssets_parameterized_parameter_collection : public UParameterCollections_parameter_collection	
	{
	public:
		UAssets_parameter_collection_UE5_definition __verse_0x83A1751E_UE5Class; // 0x78(0x8)
		unsigned char UnknownData01_7[0x68]; // 0x80(0x68) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_parameterized_parameter_collection");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620F940
		void $Block(); // Flags: None 0x7FF41620F780
		void $InitCDO(); // Flags: None 0x7FF41620F860
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_particle_system
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_particle_system : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_particle_system");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41620FEE0
		void $Block(); // Flags: None 0x7FF41620FD20
		void $InitCDO(); // Flags: None 0x7FF41620FE00
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_skeletal_mesh
	// Inherited from UAssets_mesh -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_skeletal_mesh : public UAssets_mesh	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_skeletal_mesh");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416210480
		void $Block(); // Flags: None 0x7FF4162102C0
		void $InitCDO(); // Flags: None 0x7FF4162103A0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_sound
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_sound : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_sound");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416210A20
		void $Block(); // Flags: None 0x7FF416210860
		void $InitCDO(); // Flags: None 0x7FF416210940
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_texture_base
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_texture_base : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_texture_base");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416210FC0
		void $Block(); // Flags: None 0x7FF416210E00
		void $InitCDO(); // Flags: None 0x7FF416210EE0
	};


	// Class /VerseEngine/_Verse/VNI/VerseAssets.Assets_texture
	// Inherited from UAssets_texture_base -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UAssets_texture : public UAssets_texture_base	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseEngine/_Verse/VNI/VerseAssets.Assets_texture");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416211560
		void $Block(); // Flags: None 0x7FF4162113A0
		void $InitCDO(); // Flags: None 0x7FF416211480
	};


	// Class /VersePrint/_Verse/VNI/VersePrint._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Rootdup_8 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VersePrint/_Verse/VNI/VersePrint._Root");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_N_RPrint_L_N_Kchar_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF416212DE8
		void _L_2fVerse_2eorg_2fVerse_N_RPrint_L_Nmessage_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_R(Ftuple_Lmessage_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF416212EC8
		void $InitCDO(); // Flags: None 0x7FF416212D08
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Curves_editable_curve
	// Inherited from UCurveFloat -> UCurveBase -> UObject
	// Size: 0x0 (0xB8 - 0xB8)
	class UCurves_editable_curve : public UCurveFloat	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Curves_editable_curve");
			return ret;
		}

		double _L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416213938
		void $InitInstance(); // Flags: None 0x7FF416213858
		void $Block(); // Flags: None 0x7FF416213698
		void $InitCDO(); // Flags: None 0x7FF416213778
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics
	// Inherited from UObject
	// Size: 0x38 (0x60 - 0x28)
	class UDiagnostics : public UObject	
	{
	public:
		FColors_color __verse_0x57D963B0_DefaultDebugDrawColor; // 0x28(0x18)
		Diagnostics_debug_draw_duration_policy __verse_0xBB769F64_DefaultDebugDrawDurationPolicy; // 0x40(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x41(0x7) UNKNOWN PROPERTY
		double __verse_0x455A65A8_DefaultDebugDrawDuration; // 0x48(0x8)
		double __verse_0xD30692C9_DefaultDebugDrawSize; // 0x50(0x8)
		double __verse_0xA45DC86B_DefaultDebugDrawThickness; // 0x58(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics");
			return ret;
		}

		void $InitCDO(); // Flags: None 0x7FF416213D18
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw
	// Inherited from UObject
	// Size: 0x18 (0x40 - 0x28)
	class UDiagnostics_debug_draw : public UObject	
	{
	public:
		UClass __verse_0xFAE6EE9E_Channel; // 0x28(0x8)
		unsigned char UnknownData01_7[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RShowChannel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214D38
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RHideChannel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214C58
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawSphere_L_Nvector3_M_N_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214B78
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawPoint_L_Nvector3_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214A98
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawLine_L_Nvector3_M_Nvector3_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162149B8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawCylinder_L_Nvector3_M_Nvector3_M_N_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_N_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QNumSegments_Nint_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162148D8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawCone_L_Nvector3_M_Nvector3_M_N_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_N_QNumSides_Nint_20_3d_20_2e_2e_2e_M_N_QAngleWidthRadians_Nfloat_20_3d_20_2e_2e_2e_M_N_QAngleHeightRadians_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QNumSides_Nint_20_3d_20_2e_2e_2e_M_QAngleWidthRadians_Nfloat_20_3d_20_2e_2e_2e_M_QAngleHeightRadians_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162147F8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawCapsule_L_Nvector3_M_Nrotation_M_N_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_N_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mrotation_M_QHeight_Nfloat_20_3d_20_2e_2e_2e_M_QRadius_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214718
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawBox_L_Nvector3_M_Nrotation_M_N_QExtent_Nvector3_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mrotation_M_QExtent_Nvector3_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214638
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RDrawArrow_L_Nvector3_M_Nvector3_M_N_QArrowSize_Nfloat_20_3d_20_2e_2e_2e_M_N_QColor_Ncolor_20_3d_20_2e_2e_2e_M_N_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_N_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lvector3_Mvector3_M_QArrowSize_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_M_QThickness_Nfloat_20_3d_20_2e_2e_2e_M_QDrawDurationPolicy_Ndebug__draw__duration__policy_20_3d_20_2e_2e_2e_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214558
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RClearChannel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214478
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2fdebug__draw_N_RClear(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416214398
		void $InitInstance(); // Flags: None 0x7FF4162142B8
		void $Block(); // Flags: None 0x7FF4162140F8
		void $InitCDO(); // Flags: None 0x7FF4162141D8
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw_channel
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDiagnostics_debug_draw_channel : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_debug_draw_channel");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4162152D8
		void $Block(); // Flags: None 0x7FF416215118
		void $InitCDO(); // Flags: None 0x7FF4162151F8
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UDiagnostics_log : public UObject	
	{
	public:
		UClass __verse_0xFAE6EE9E_Channel; // 0x28(0x8)
		Diagnostics_log_level __verse_0x540F3253_DefaultLevel; // 0x30(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416215A38
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416215958
		void $InitInstance(); // Flags: None 0x7FF416215878
		void $Block(); // Flags: None 0x7FF4162156B8
		void $InitCDO(); // Flags: None 0x7FF416215798
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log_channel
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDiagnostics_log_channel : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Diagnostics_log_channel");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416215FD8
		void $Block(); // Flags: None 0x7FF416215E18
		void $InitCDO(); // Flags: None 0x7FF416215EF8
	};


	// Class /UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Testing_test_reporter
	// Inherited from UObject
	// Size: 0x68 (0x90 - 0x28)
	class UTesting_test_reporter : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		Diagnostics_log_level __verse_0x540F3253_DefaultLevel; // 0x38(0x1)
		unsigned char UnknownData03_7[0x57]; // 0x39(0x57) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/UnrealEngineExperimental/_Verse/VNI/UnrealEngineExperimental.Testing_test_reporter");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416216C78
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestSkipped_L_N_Kchar_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416216B98
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestResult_L_N_Kchar_M_Ntest__result_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416216AB8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestPassed_L_N_Kchar_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162169D8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RReportTestFailed_L_N_Kchar_M_N_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_N_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162168F8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RPrintSummary_L_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416216818
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RLog_L_N_Kchar_M_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416216738
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fTesting_2ftest__reporter_N_RGetSummaryStrings_L_N_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416216658
		void $InitInstance(); // Flags: None 0x7FF416216578
		void $Block(); // Flags: None 0x7FF4162163B8
		void $InitCDO(); // Flags: HasDefaults 0x7FF416216498
	};


	// Class /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Network
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEpicGamesRestricted_Network : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Network");
			return ret;
		}

		void $InitCDO(); // Flags: None 0x7FF4162181E0
	};


	// Class /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEpicGamesRestricted_Spline : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline");
			return ret;
		}

		FEpicGamesRestricted_Spline_spline_query_result EpicGamesRestricted_Spline_spline_query_result$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms 0x7FF416218780
		FEpicGamesRestricted_Spline_spline_query_result EpicGamesRestricted_Spline_spline_query_result$Factory(); // Flags: Static|HasOutParms 0x7FF4162186A0
		void $InitCDO(); // Flags: None 0x7FF4162185C0
	};


	// Class /EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component
	// Inherited from USplineComponentBase -> UEntityActorComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UEpicGamesRestricted_Spline_spline_component : public USplineComponentBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngineRestricted/_Verse/VNI/EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtTime_L_Nfloat_M_Nlogic_R(Ftuple_Lfloat_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416219260
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtDistanceAlongSpline_L_Nfloat_M_Nlogic_R(Ftuple_Lfloat_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416219180
		double _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetSplineLength(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162190A0
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetInputKeyAtDistanceAlongSpline_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416218FC0
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindDistanceAlongSplineAtInputKey_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416218EE0
		void _L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindClosestInputKeyToWorldPosition_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416218E00
		void $InitInstance(); // Flags: None 0x7FF416218D20
		void $Block(); // Flags: None 0x7FF416218B60
		void $InitCDO(); // Flags: None 0x7FF416218C40
	};


	// Class /EntityFramework/_Verse/VNI/Entity._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Rootdup_9 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity._Root");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eGetSimulationEntity_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R(Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416219C00
		void $InitCDO(); // Flags: None 0x7FF416219B20
	};


	// Class /EntityFramework/_Verse/VNI/Entity.Component
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UComponent : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		UEntity __verse_0xECA943DB_Entity; // 0x30(0x8)
		Utick_events __verse_0x0381BCE3_TickEvents; // 0x28(0x8)
		unsigned char UnknownData03_7[0x18]; // 0x30(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.Component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RSetTickEvents_L_Naccessor_M_Ntick__events_R(Ftuple_Laccessor_Mtick__events_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621AD00
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621AC20
		UConcurrency_task OnSimulate(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41621AEC0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621AB40
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621AA60
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621A980
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621A8A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621A7C0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsSimulating(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621A6E0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621A520
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621A600
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsDisposed(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621A440
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41621A360
		Utick_events _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RGetTickEvents_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621A280
		void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621ADE0
		void $InitInstance(); // Flags: None 0x7FF41621A1A0
		void $Block(); // Flags: None 0x7FF416219FE0
		void $InitCDO(); // Flags: HasDefaults 0x7FF41621A0C0
	};


	// Class /EntityFramework/_Verse/VNI/Entity.Entity
	// Inherited from UBaseEntity -> UObject
	// Size: 0x18 (0x60 - 0x48)
	class UEntity : public UBaseEntity	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x48(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.Entity");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RRemoveFromParent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621BA80
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RIsDisposed(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621B9A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetParent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621B8C0
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetEntities(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621B7E0
		TArray _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetComponents_L_NComponentType_20where_20ComponentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621B700
		void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621BB60
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAddEntities_L_N_Kentity_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621B620
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAddComponents_L_N_Kcomponent_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621B540
		void $InitInstance(); // Flags: None 0x7FF41621B460
		void $Block(); // Flags: None 0x7FF41621B2A0
		void $InitCDO(); // Flags: None 0x7FF41621B380
	};


	// Class /EntityFramework/_Verse/VNI/Entity.entity_prefab
	// Inherited from UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class Uentity_prefab : public UAssets_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.entity_prefab");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41621C100
		void $Block(); // Flags: None 0x7FF41621BF40
		void $InitCDO(); // Flags: None 0x7FF41621C020
	};


	// Class /EntityFramework/_Verse/VNI/Entity.replication_component
	// Inherited from UComponent -> UObject
	// Size: 0x28 (0x70 - 0x48)
	class Ureplication_component : public UComponent	
	{
	public:
		unsigned char UnknownData02_3[0x20]; // 0x48(0x20) UNKNOWN PROPERTY
		bool __verse_0xC6DF029C_AlwaysRelevant : 1; // 0x68:0(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x69(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.replication_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621C940
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621C860
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41621C780
		void $InitInstance(); // Flags: None 0x7FF41621C6A0
		void $Block(); // Flags: None 0x7FF41621C4E0
		void $InitCDO(); // Flags: None 0x7FF41621C5C0
	};


	// Class /EntityFramework/_Verse/VNI/Entity.simulation_entity
	// Inherited from UEntity -> UBaseEntity -> UObject
	// Size: 0x0 (0x60 - 0x60)
	class Usimulation_entity : public UEntity	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.simulation_entity");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41621CEE0
		void $Block(); // Flags: None 0x7FF41621CD20
		void $InitCDO(); // Flags: None 0x7FF41621CE00
	};


	// Class /EntityFramework/_Verse/VNI/Entity.task_component$OnSimulate
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x9 (0xC1 - 0xB8)
	class Utask_component$OnSimulate : public UConcurrency_task	
	{
	public:
		UComponent _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.task_component$OnSimulate");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms 0x7FF41621D2C0
	};


	// Class /EntityFramework/_Verse/VNI/Entity.tick_events
	// Inherited from UObject
	// Size: 0x30 (0x58 - 0x28)
	class Utick_events : public UObject	
	{
	public:
		Uexecution_subscribable __verse_0x8A2FD5A2_PrePhysics; // 0x28(0x8)
		Uexecution_subscribable __verse_0x64E0C2D3_StartPhysics; // 0x30(0x8)
		Uexecution_subscribable __verse_0x2CC1E195_DuringPhysics; // 0x38(0x8)
		Uexecution_subscribable __verse_0xA3739C71_EndPhysics; // 0x40(0x8)
		Uexecution_subscribable __verse_0xF70848B2_PostPhysics; // 0x48(0x8)
		Uexecution_subscribable __verse_0xDA501C13_EndFrame; // 0x50(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.tick_events");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41621D860
		void $Block(); // Flags: None 0x7FF41621D6A0
		void $InitCDO(); // Flags: HasDefaults 0x7FF41621D780
	};


	// Class /EntityFramework/_Verse/VNI/Entity.transform_component
	// Inherited from UComponent -> UObject
	// Size: 0xD8 (0x120 - 0x48)
	class Utransform_component : public UComponent	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x48(0x8) UNKNOWN PROPERTY
		FSpatialMath_transform __verse_0x61C3007D_Transform; // 0x50(0x60)
		FSpatialMath_transform __verse_0xEA0A1CBC_InitialRelativeTransform; // 0xB0(0x60)
		unsigned char UnknownData03_7[0x10]; // 0x110(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.transform_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_RSetTransform_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621E340
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621E0A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_ROnRep__Transform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621E260
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41621DFC0
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41621DEE0
		FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_RGetTransform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41621E180
		void $InitInstance(); // Flags: None 0x7FF41621DE00
		void $Block(); // Flags: None 0x7FF41621DC40
		void $InitCDO(); // Flags: HasDefaults 0x7FF41621DD20
	};


	// Class /EntityFramework/_Verse/VNI/Entity.typed_element_component
	// Inherited from UComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class Utyped_element_component : public UComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Entity.typed_element_component");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41621E8E0
		void $Block(); // Flags: None 0x7FF41621E720
		void $InitCDO(); // Flags: None 0x7FF41621E800
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_10 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component
	// Inherited from UComponent -> UObject
	// Size: 0x208 (0x250 - 0x48)
	class UEntityTestSuite_lambda_test_component : public UComponent	
	{
	public:
		UVerse_event __verse_0x657D7B30_NopEvent; // 0x48(0x8)
		unsigned char UnknownData01_7[0x200]; // 0x50(0x200) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220EB0
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220890
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateCancelledInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162207B0
		UConcurrency_task OnSimulate(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416220F90
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220DD0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220CF0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220C10
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220B30
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416220A50
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416220970
		void $InitInstance(); // Flags: None 0x7FF4162206D0
		void $Block(); // Flags: None 0x7FF416220510
		void $InitCDO(); // Flags: HasDefaults 0x7FF4162205F0
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component
	// Inherited from UComponent -> UObject
	// Size: 0x208 (0x250 - 0x48)
	class UEntityTestSuite_lambda_test_componentdup_11 : public UComponent	
	{
	public:
		UVerse_event __verse_0x657D7B30_NopEvent; // 0x48(0x8)
		unsigned char UnknownData01_7[0x200]; // 0x50(0x200) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_lambda_test_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416221D10
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162216F0
		void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateCancelledInternal(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416221610
		UConcurrency_task OnSimulate(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416221DF0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416221C30
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416221B50
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416221A70
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416221990
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162218B0
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4162217D0
		void $InitInstance(); // Flags: None 0x7FF416221530
		void $Block(); // Flags: None 0x7FF416221370
		void $InitCDO(); // Flags: HasDefaults 0x7FF416221450
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_test_component
	// Inherited from UComponent -> UObject
	// Size: 0x0 (0x48 - 0x48)
	class UEntityTestSuite_test_component : public UComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.EntityTestSuite_test_component");
			return ret;
		}

		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416222470
		void $InitInstance(); // Flags: None 0x7FF416222390
		void $Block(); // Flags: None 0x7FF4162221D0
		void $InitCDO(); // Flags: None 0x7FF4162222B0
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component$OnSimulate
	// Inherited from UConcurrency_task -> UObject
	// Size: 0xD9 (0x191 - 0xB8)
	class Utask_EntityTestSuite_lambda_test_component$OnSimulate : public UConcurrency_task	
	{
	public:
		UEntityTestSuite_lambda_test_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0xC1(0x1)
		unsigned char UnknownData10_6[0x16]; // 0xC2(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0xD8(0x1)
		unsigned char UnknownData11_6[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY
		UVerse_event __verse_0x00000000_; // 0xE0(0x8)
		UConcurrency_task _AsyncTask; // 0xE8(0x8)
		unsigned char UnknownData12_6[0x10]; // 0xF0(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x100(0x1)
		unsigned char UnknownData13_6[0x7]; // 0x101(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x108(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x110(0x1)
		unsigned char UnknownData14_6[0x17]; // 0x111(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x128(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0x129(0x1)
		unsigned char UnknownData15_6[0x16]; // 0x12A(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x140(0x1)
		unsigned char UnknownData16_6[0x7]; // 0x141(0x7) UNKNOWN PROPERTY
		UVerse_event __verse_0x00000000_; // 0x148(0x8)
		UConcurrency_task _AsyncTask; // 0x150(0x8)
		unsigned char UnknownData17_6[0x10]; // 0x158(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x168(0x1)
		unsigned char UnknownData18_6[0x7]; // 0x169(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x170(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x178(0x1)
		unsigned char UnknownData19_6[0x17]; // 0x179(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x190(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component$OnSimulate");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms 0x7FF416222850
	};


	// Class /EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component_2$OnSimulate
	// Inherited from UConcurrency_task -> UObject
	// Size: 0xD9 (0x191 - 0xB8)
	class Utask_EntityTestSuite_lambda_test_component_2$OnSimulate : public UConcurrency_task	
	{
	public:
		UEntityTestSuite_lambda_test_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0xC1(0x1)
		unsigned char UnknownData10_6[0x16]; // 0xC2(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0xD8(0x1)
		unsigned char UnknownData11_6[0x7]; // 0xD9(0x7) UNKNOWN PROPERTY
		UVerse_event __verse_0x00000000_; // 0xE0(0x8)
		UConcurrency_task _AsyncTask; // 0xE8(0x8)
		unsigned char UnknownData12_6[0x10]; // 0xF0(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x100(0x1)
		unsigned char UnknownData13_6[0x7]; // 0x101(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x108(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x110(0x1)
		unsigned char UnknownData14_6[0x17]; // 0x111(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x128(0x1)
		EVerseTrue _InvokeSureResultDummy; // 0x129(0x1)
		unsigned char UnknownData15_6[0x16]; // 0x12A(0x16) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x140(0x1)
		unsigned char UnknownData16_6[0x7]; // 0x141(0x7) UNKNOWN PROPERTY
		UVerse_event __verse_0x00000000_; // 0x148(0x8)
		UConcurrency_task _AsyncTask; // 0x150(0x8)
		unsigned char UnknownData17_6[0x10]; // 0x158(0x10) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x168(0x1)
		unsigned char UnknownData18_6[0x7]; // 0x169(0x7) UNKNOWN PROPERTY
		int64_t _AsyncResult; // 0x170(0x8)
		EVerseTrue _InvokeSureResultDummy; // 0x178(0x1)
		unsigned char UnknownData19_6[0x17]; // 0x179(0x17) UNKNOWN PROPERTY
		Ftuple_L_R _ExprResult; // 0x190(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityTestSuite.task_EntityTestSuite_lambda_test_component_2$OnSimulate");
			return ret;
		}

		int64_t Update(); // Flags: Public|HasOutParms 0x7FF416222C30
	};


	// Class /EntityFramework/_Verse/VNI/ExecutionTestSuite.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_12 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/ExecutionTestSuite.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phase_user
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UExecutionTestSuite_test_phase_user : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		int64_t __verse_0xC0B43457_Counter; // 0x38(0x8)
		double __verse_0x742B3E02_Time; // 0x40(0x8)
		Uexecution_subscription __verse_0x9327ADAA_Connection2; // 0x30(0x8)
		unsigned char UnknownData03_6[0x10]; // 0x38(0x10) UNKNOWN PROPERTY
		int64_t __verse_0x5C605981_Counter2; // 0x48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phase_user");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R(UExecutionTestSuite_test_phase_user __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416225768
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R(UExecutionTestSuite_test_phase_user __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416225688
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime0_L_Nany_R_Nvoid(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4162254C8
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4162255A8
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4162253E8
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416225308
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_R(Uexecution_subscribable __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416225228
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416225148
		void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416225068
		void $InitInstance(); // Flags: None 0x7FF416224F88
		void $Block(); // Flags: None 0x7FF416224DC8
		void $InitCDO(); // Flags: HasDefaults 0x7FF416224EA8
	};


	// Class /EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phases
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UExecutionTestSuite_test_phases : public UObject	
	{
	public:
		unsigned char UnknownData01_3[0x18]; // 0x28(0x18) UNKNOWN PROPERTY
		int64_t __verse_0xC0B43457_Counter; // 0x40(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/ExecutionTestSuite.ExecutionTestSuite_test_phases");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416225D08
		void $Block(); // Flags: None 0x7FF416225B48
		void $InitCDO(); // Flags: HasDefaults 0x7FF416225C28
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulationdup_13 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation");
			return ret;
		}

		UConcurrency_task Sleep_L_Nfloat_R(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|BlueprintCallable 0x7FF416226BD0
		USimulation_localizable_agent _L_2fVerse_2eorg_2fSimulation_N_RMakeLocalizableValue_L_Nagent_R(USimulation_agent __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416226AF0
		double _L_2fVerse_2eorg_2fSimulation_N_RGetSimulationElapsedTime(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416226A10
		USimulation_session _L_2fVerse_2eorg_2fSimulation_N_RGetSession(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416226930
		void _L_2fVerse_2eorg_2fSimulation_N_RGetPlayerComponentByIndex_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416226850
		void _L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R(Ftuple_Lint_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416226690
		void _L_2fVerse_2eorg_2fSimulation_N_RGetOrCreateComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R(Ftuple_Lplayer__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416226770
		void _L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nplayer__component_M_NType_20where_20Type_R(Ftuple_Lplayer__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162265B0
		void _L_2fVerse_2eorg_2fSimulation_N_RGetComponentOfTypeForPlayer_L_Nint_M_NType_20where_20Type_R(Ftuple_Lint_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162264D0
		void $InitCDO(); // Flags: None 0x7FF4162263F0
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_agent
	// Inherited from UVerseAgent -> UVersePersistentVarWeakMapKey -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class USimulation_agent : public UVerseAgent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_agent");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416227170
		void $Block(); // Flags: None 0x7FF416226FB0
		void $InitCDO(); // Flags: None 0x7FF416227090
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_localizable_agent
	// Inherited from UVerse_localizable_value -> UObject
	// Size: 0x8 (0x30 - 0x28)
	class USimulation_localizable_agent : public UVerse_localizable_value	
	{
	public:
		USimulation_agent __verse_0x31A8F10C_Value; // 0x28(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_localizable_agent");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416227710
		void $Block(); // Flags: None 0x7FF416227550
		void $InitCDO(); // Flags: None 0x7FF416227630
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player
	// Inherited from USimulation_agent -> UVerseAgent -> UVersePersistentVarWeakMapKey -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class USimulation_player : public USimulation_agent	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x30(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player");
			return ret;
		}

		void _L_2fVerse_2eorg_2fSimulation_2fplayer_N_RIsActive(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416227D90
		void $InitInstance(); // Flags: None 0x7FF416227CB0
		void $Block(); // Flags: None 0x7FF416227AF0
		void $InitCDO(); // Flags: None 0x7FF416227BD0
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_array_helper
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulation_player_array_helper : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_array_helper");
			return ret;
		}

		int64_t _L_2fVerse_2eorg_2fSimulation_2fplayer__array__helper_N_RTestFunc_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416228250
		void $InitCDO(); // Flags: None 0x7FF416228170
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_component
	// Inherited from UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0xD0 - 0xD0)
	class USimulation_player_component : public UEntityActorPlayerComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_component");
			return ret;
		}

		USimulation_player _L_2fVerse_2eorg_2fSimulation_2fplayer__component_N_RGetHandle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162288D0
		void $InitInstance(); // Flags: None 0x7FF4162287F0
		void $Block(); // Flags: None 0x7FF416228630
		void $InitCDO(); // Flags: None 0x7FF416228710
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_multicast_delegate
	// Inherited from UVerseEngine_multicast_delegate -> UVerseEngine_multicast_delegate_base -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class USimulation_player_multicast_delegate : public UVerseEngine_multicast_delegate	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_player_multicast_delegate");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416228E70
		void $Block(); // Flags: None 0x7FF416228CB0
		void $InitCDO(); // Flags: None 0x7FF416228D90
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_session
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulation_session : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_session");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416229410
		void $Block(); // Flags: None 0x7FF416229250
		void $InitCDO(); // Flags: None 0x7FF416229330
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_team
	// Inherited from UVerseTeam -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class USimulation_team : public UVerseTeam	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.Simulation_team");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4162299B0
		void $Block(); // Flags: None 0x7FF4162297F0
		void $InitCDO(); // Flags: None 0x7FF4162298D0
	};


	// Class /VerseSimulation/_Verse/VNI/VerseSimulation.task_Simulation$Sleep_L_Nfloat_R
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x8 (0xC0 - 0xB8)
	class Utask_Simulation$Sleep_L_Nfloat_R : public UConcurrency_task	
	{
	public:
		double __verse_0xB2CDDD72_Argument; // 0xB8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseSimulation/_Verse/VNI/VerseSimulation.task_Simulation$Sleep_L_Nfloat_R");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF416229D90
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_14 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UUI : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI");
			return ret;
		}

		FUI_canvas_slot _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_N_QSize_Nvector2_20_3d_20_2e_2e_2e_M_N_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_N_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R(Ftuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41622B020
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R(USimulation_player __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41622AF40
		FUI_stack_box_slot UI_stack_box_slot$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622BC60
		FUI_stack_box_slot UI_stack_box_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622BB80
		FUI_overlay_slot UI_overlay_slot$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B8E0
		FUI_overlay_slot UI_overlay_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B800
		FUI_canvas_slot UI_canvas_slot$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B560
		FUI_canvas_slot UI_canvas_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B480
		FUI_button_slot UI_button_slot$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B3A0
		FUI_button_slot UI_button_slot$Factory(); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B2C0
		FUI_margin UI_margin$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B720
		FUI_margin UI_margin$Factory(); // Flags: Static|HasOutParms 0x7FF41622B640
		FUI_anchors UI_anchors$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B1E0
		FUI_anchors UI_anchors$Factory(); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622B100
		FUI_widget_message UI_widget_message$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms 0x7FF41622BE20
		FUI_widget_message UI_widget_message$Factory(); // Flags: Static|HasOutParms 0x7FF41622BD40
		FUI_player_ui_slot UI_player_ui_slot$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF41622BAA0
		FUI_player_ui_slot UI_player_ui_slot$Factory(); // Flags: Static|HasOutParms 0x7FF41622B9C0
		void $InitCDO(); // Flags: None 0x7FF41622AE60
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_player_ui
	// Inherited from UVersePlayerUIEntityComponent -> UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0xD8 - 0xD8)
	class UUI_player_ui : public UVersePlayerUIEntityComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_player_ui");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R(UUI_widget __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622C660
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R(UUI_widget __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622C580
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R(Ftuple_Lwidget_Mplayer__ui__slot_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622C4A0
		void $InitInstance(); // Flags: None 0x7FF41622C3C0
		void $Block(); // Flags: None 0x7FF41622C200
		void $InitCDO(); // Flags: None 0x7FF41622C2E0
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_umg_widget_class_asset
	// Inherited from UAssets_client_asset -> UAssets_asset -> UVerseAssetPtr -> UVerseAsset -> UObject
	// Size: 0x0 (0x88 - 0x88)
	class UUI_umg_widget_class_asset : public UAssets_client_asset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_umg_widget_class_asset");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF41622CC00
		void $Block(); // Flags: None 0x7FF41622CA40
		void $InitCDO(); // Flags: None 0x7FF41622CB20
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_widget
	// Inherited from UVerseWidgetNativeBase -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UUI_widget : public UVerseWidgetNativeBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_widget");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R(UI_widget_visibility __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622D6E0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R(bool __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622D600
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622D520
		UI_widget_visibility _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622D440
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622D360
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622D280
		void $InitInstance(); // Flags: None 0x7FF41622D1A0
		void $Block(); // Flags: None 0x7FF41622CFE0
		void $InitCDO(); // Flags: None 0x7FF41622D0C0
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_button
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x38 (0x70 - 0x38)
	class UUI_button : public UUI_widget	
	{
	public:
		FUI_button_slot __verse_0x9693E4CD_Slot; // 0x38(0x30)
		UVerseEngine_subscribable_event __verse_0x6B2BB37E_OnClickInternal; // 0x68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_button");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_RSetWidget_L_Nbutton__slot_R(FUI_button_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622DE40
		UObject _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_ROnClick(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41622DD60
		void $InitInstance(); // Flags: None 0x7FF41622DC80
		void $Block(); // Flags: None 0x7FF41622DAC0
		void $InitCDO(); // Flags: HasDefaults 0x7FF41622DBA0
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_canvas
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x10 (0x48 - 0x38)
	class UUI_canvas : public UUI_widget	
	{
	public:
		TArray __verse_0x5AE077E0_Slots; // 0x38(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_canvas");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R(UUI_widget __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622E5A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R(FUI_canvas_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622E4C0
		void $InitInstance(); // Flags: None 0x7FF41622E3E0
		void $Block(); // Flags: None 0x7FF41622E220
		void $InitCDO(); // Flags: HasDefaults 0x7FF41622E300
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_color_block
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x30 (0x68 - 0x38)
	class UUI_color_block : public UUI_widget	
	{
	public:
		FColors_color __verse_0xA0FC371C_DefaultColor; // 0x38(0x18)
		double __verse_0x5DA10C15_DefaultOpacity; // 0x50(0x8)
		FSpatialMath_vector2 __verse_0x4DD253BC_DefaultDesiredSize; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_color_block");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622F080
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetDesiredSize_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622EFA0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622EEC0
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetOpacity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622EDE0
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetDesiredSize(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622ED00
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetColor(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622EC20
		void $InitInstance(); // Flags: None 0x7FF41622EB40
		void $Block(); // Flags: None 0x7FF41622E980
		void $InitCDO(); // Flags: HasDefaults 0x7FF41622EA60
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_material_block
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x30 (0x68 - 0x38)
	class UUI_material_block : public UUI_widget	
	{
	public:
		UObject __verse_0x800C064C_DefaultImage; // 0x38(0x8)
		FColors_color __verse_0xC0C585F9_DefaultTint; // 0x40(0x18)
		FSpatialMath_vector2 __verse_0x4DD253BC_DefaultDesiredSize; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_material_block");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622FB60
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R(UObject __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622FA80
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41622F9A0
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622F8C0
		UObject _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622F7E0
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41622F700
		void $InitInstance(); // Flags: None 0x7FF41622F620
		void $Block(); // Flags: None 0x7FF41622F460
		void $InitCDO(); // Flags: HasDefaults 0x7FF41622F540
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_overlay
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x10 (0x48 - 0x38)
	class UUI_overlay : public UUI_widget	
	{
	public:
		TArray __verse_0x5AE077E0_Slots; // 0x38(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_overlay");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RRemoveWidget_L_Nwidget_R(UUI_widget __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162302C0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RAddWidget_L_Noverlay__slot_R(FUI_overlay_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162301E0
		void $InitInstance(); // Flags: None 0x7FF416230100
		void $Block(); // Flags: None 0x7FF41622FF40
		void $InitCDO(); // Flags: HasDefaults 0x7FF416230020
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_stack_box
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x18 (0x50 - 0x38)
	class UUI_stack_box : public UUI_widget	
	{
	public:
		TArray __verse_0x5AE077E0_Slots; // 0x38(0x10)
		UI_orientation __verse_0x4DFAB8C8_Orientation; // 0x48(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_stack_box");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RRemoveWidget_L_Nwidget_R(UUI_widget __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416230A20
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RAddWidget_L_Nstack__box__slot_R(FUI_stack_box_slot __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416230940
		void $InitInstance(); // Flags: None 0x7FF416230860
		void $Block(); // Flags: None 0x7FF4162306A0
		void $InitCDO(); // Flags: HasDefaults 0x7FF416230780
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_text_base
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x30 (0x68 - 0x38)
	class UUI_text_base : public UUI_widget	
	{
	public:
		UVerse_message __verse_0xEDB05B46_DefaultText; // 0x38(0x8)
		FColors_color __verse_0x5DC97209_DefaultTextColor; // 0x40(0x18)
		double __verse_0x1EA9AC7C_DefaultTextOpacity; // 0x58(0x8)
		UI_text_justification __verse_0x616A37A2_DefaultJustification; // 0x60(0x1)
		UI_text_overflow_policy __verse_0x5C09BE1D_DefaultOverflowPolicy; // 0x61(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x62(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_text_base");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416231880
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextColor_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162317A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetText_L_Nmessage_R(UVerse_message __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162316C0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetOverflowPolicy_L_Ntext__overflow__policy_R(UI_text_overflow_policy __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162315E0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetJustification_L_Ntext__justification_R(UI_text_justification __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416231500
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextOpacity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416231420
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextColor(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416231340
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetText(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416231260
		UI_text_overflow_policy _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetOverflowPolicy(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416231180
		UI_text_justification _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetJustification(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162310A0
		void $InitInstance(); // Flags: None 0x7FF416230FC0
		void $Block(); // Flags: None 0x7FF416230E00
		void $InitCDO(); // Flags: HasDefaults 0x7FF416230EE0
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal
	// Inherited from UUI_text_base -> UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class UUI_text_block_internal : public UUI_text_base	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_text_block_internal");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416231E20
		void $Block(); // Flags: None 0x7FF416231C60
		void $InitCDO(); // Flags: None 0x7FF416231D40
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_texture_block
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x38 (0x70 - 0x38)
	class UUI_texture_block : public UUI_widget	
	{
	public:
		UAssets_texture __verse_0x800C064C_DefaultImage; // 0x38(0x8)
		FColors_color __verse_0xC0C585F9_DefaultTint; // 0x40(0x18)
		FSpatialMath_vector2 __verse_0x4DD253BC_DefaultDesiredSize; // 0x58(0x10)
		UI_image_tiling __verse_0xAF9B7624_DefaultHorizontalTiling; // 0x68(0x1)
		UI_image_tiling __verse_0xF679588B_DefaultVerticalTiling; // 0x69(0x1)
		unsigned char UnknownData01_7[0x6]; // 0x6A(0x6) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_texture_block");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTint_L_Ncolor_R(FColors_color __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416232AC0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTiling_L_Nimage__tiling_M_Nimage__tiling_R(Ftuple_Limage__tiling_Mimage__tiling_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162329E0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetImage_L_Ntexture_R(UAssets_texture __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416232900
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetDesiredSize_L_Nvector2_R(FSpatialMath_vector2 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416232820
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTint(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416232740
		Ftuple_Limage__tiling_Mimage__tiling_R _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTiling(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416232660
		UAssets_texture _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetImage(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416232580
		FSpatialMath_vector2 _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetDesiredSize(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162324A0
		void $InitInstance(); // Flags: None 0x7FF4162323C0
		void $Block(); // Flags: None 0x7FF416232200
		void $InitCDO(); // Flags: HasDefaults 0x7FF4162322E0
	};


	// Class /VerseUI/_Verse/VNI/VerseUI.UI_umg_widget
	// Inherited from UUI_widget -> UVerseWidgetNativeBase -> UObject
	// Size: 0x8 (0x40 - 0x38)
	class UUI_umg_widget : public UUI_widget	
	{
	public:
		UUI_umg_widget_class_asset __verse_0x26CD6686_Asset; // 0x38(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseUI/_Verse/VNI/VerseUI.UI_umg_widget");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetViewmodel___L_NViewmodelType_M_N_Kchar_M_NViewmodelType_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_Many_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416233680
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetViewmodelOptional___L_NViewmodelType_M_N_Kchar_M_NViewmodelType_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_Many_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416233760
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetNamedSlot___L_N_Kchar_M_Nwidget_R(Ftuple_L_Kchar_Mwidget_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162334C0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RSetNamedSlotOptional___L_N_Kchar_M_N_Qwidget_R(Ftuple_L_Kchar_M_Qwidget_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162335A0
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetViewmodel___L_NViewmodelType_M_N_Kchar_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416233300
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetViewmodelOptional___L_NViewmodelType_M_N_Kchar_20where_20ViewmodelType_R(Ftuple_Lsupertype_Lany_R_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162333E0
		UUI_widget _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetNamedSlot___L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416233140
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fumg__widget_N_RGetNamedSlotOptional___L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416233220
		void $InitInstance(); // Flags: None 0x7FF416233060
		void $Block(); // Flags: None 0x7FF416232EA0
		void $InitCDO(); // Flags: None 0x7FF416232F80
	};


	// Class /EntityFramework/_Verse/VNI/Component.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_15 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EntityFramework/_Verse/VNI/Component._Root
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U_Rootdup_16 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component._Root");
			return ret;
		}

		Ffloat_range float_range$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF4162379C8
		Ffloat_range float_range$Factory(); // Flags: Static|HasOutParms 0x7FF4162378E8
		Fhit_result hit_result$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms 0x7FF416237B88
		Fhit_result hit_result$Factory(); // Flags: Static|HasOutParms 0x7FF416237AA8
		void $InitCDO(); // Flags: None 0x7FF416237808
	};


	// Class /EntityFramework/_Verse/VNI/Component.basic_camera_component
	// Inherited from UComponent -> UObject
	// Size: 0x28 (0x70 - 0x48)
	class Ubasic_camera_component : public UComponent	
	{
	public:
		double __verse_0xE317D65E_FieldOfView; // 0x48(0x8)
		unsigned char UnknownData01_7[0x20]; // 0x50(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.basic_camera_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RUpdateFieldOfView(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162384A8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RSetFieldOfView_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4162383C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416238908
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_ROnRep__FieldOfView(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4162382E8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416238828
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416238748
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416238668
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416238588
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RGetFieldOfView(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416238208
		void $InitInstance(); // Flags: None 0x7FF416238128
		void $Block(); // Flags: None 0x7FF416237F68
		void $InitCDO(); // Flags: HasDefaults 0x7FF416238048
	};


	// Class /EntityFramework/_Verse/VNI/Component.damageable_component
	// Inherited from UComponent -> UObject
	// Size: 0x20 (0x68 - 0x48)
	class Udamageable_component : public UComponent	
	{
	public:
		unsigned char UnknownData01_3[0x18]; // 0x48(0x18) UNKNOWN PROPERTY
		UObject __verse_0x2DEDA279_DamagedEvent; // 0x60(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.damageable_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdamageable__component_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416238F88
		void $InitInstance(); // Flags: None 0x7FF416238EA8
		void $Block(); // Flags: None 0x7FF416238CE8
		void $InitCDO(); // Flags: HasDefaults 0x7FF416238DC8
	};


	// Class /EntityFramework/_Verse/VNI/Component.light_component
	// Inherited from UComponent -> UObject
	// Size: 0x70 (0xB8 - 0x48)
	class Ulight_component : public UComponent	
	{
	public:
		bool __verse_0x370AFB5F_CastShadows : 1; // 0x48:0(0x1)
		unsigned char UnknownBit59 : 1; // 0x48:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit60 : 1; // 0x48:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit61 : 1; // 0x48:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit62 : 1; // 0x48:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit63 : 1; // 0x48:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit64 : 1; // 0x48:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit65 : 1; // 0x48:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x8E6057EF_CastVolumetricShadow : 1; // 0x49:0(0x1)
		unsigned char UnknownBit66 : 1; // 0x49:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit67 : 1; // 0x49:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit68 : 1; // 0x49:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit69 : 1; // 0x49:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit70 : 1; // 0x49:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit71 : 1; // 0x49:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit72 : 1; // 0x49:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x1635313F_CastDeepShadows : 1; // 0x4A:0(0x1)
		unsigned char UnknownBit73 : 1; // 0x4A:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit74 : 1; // 0x4A:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit75 : 1; // 0x4A:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit76 : 1; // 0x4A:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit77 : 1; // 0x4A:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit78 : 1; // 0x4A:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit79 : 1; // 0x4A:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x41208E8E_AffectReflection : 1; // 0x4B:0(0x1)
		unsigned char UnknownBit80 : 1; // 0x4B:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit81 : 1; // 0x4B:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit82 : 1; // 0x4B:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit83 : 1; // 0x4B:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit84 : 1; // 0x4B:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit85 : 1; // 0x4B:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit86 : 1; // 0x4B:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xF603D50E_AffectGlobalIllumination : 1; // 0x4C:0(0x1)
		unsigned char UnknownData87_5[0x3]; // 0x4D(0x3) UNKNOWN PROPERTY
		double __verse_0x06B3E864_Intensity; // 0x50(0x8)
		FColors_color __verse_0x65678AC7_Color; // 0x58(0x18)
		bool __verse_0x00FBC2A9__CastShadows : 1; // 0x70:0(0x1)
		unsigned char UnknownBit88 : 1; // 0x70:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit89 : 1; // 0x70:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit90 : 1; // 0x70:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit91 : 1; // 0x70:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit92 : 1; // 0x70:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit93 : 1; // 0x70:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit94 : 1; // 0x70:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xA19307B9__CastVolumetricShadow : 1; // 0x71:0(0x1)
		unsigned char UnknownBit95 : 1; // 0x71:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit96 : 1; // 0x71:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit97 : 1; // 0x71:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit98 : 1; // 0x71:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit99 : 1; // 0x71:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit100 : 1; // 0x71:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit101 : 1; // 0x71:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xC5440B7D__CastDeepShadows : 1; // 0x72:0(0x1)
		unsigned char UnknownBit102 : 1; // 0x72:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit103 : 1; // 0x72:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit104 : 1; // 0x72:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit105 : 1; // 0x72:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit106 : 1; // 0x72:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit107 : 1; // 0x72:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit108 : 1; // 0x72:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x94CA2752__AffectReflection : 1; // 0x73:0(0x1)
		unsigned char UnknownBit109 : 1; // 0x73:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit110 : 1; // 0x73:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit111 : 1; // 0x73:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit112 : 1; // 0x73:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit113 : 1; // 0x73:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit114 : 1; // 0x73:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit115 : 1; // 0x73:7(0x1) UNKNOWN PROPERTY
		bool __verse_0xEE7CC240__AffectGlobalIllumination : 1; // 0x74:0(0x1)
		unsigned char UnknownData116_5[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		double __verse_0x4E4E65F6__Intensity; // 0x78(0x8)
		FColors_color __verse_0x89B83CD1__Color; // 0x80(0x18)
		unsigned char UnknownData117_7[0x20]; // 0x98(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623ABE8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_Ncolor_R(Ftuple_Laccessor_Mcolor_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623AB08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_N_Kchar_M_Nfloat_R(Ftuple_Laccessor_M_Kchar_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF41623AA28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A948
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A868
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A788
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A6A8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Naccessor_M_Nlogic_R(Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A5C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162397C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Intensity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A4E8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Color(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A408
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastVolumetricShadow(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A328
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastShadows(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A248
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastDeepShadows(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A168
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectReflection(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623A088
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectGlobalIllumination(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416239FA8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162396E8
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416239608
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416239EC8
		FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416239DE8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_M_N_Kchar_R(Ftuple_Laccessor_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416239D08
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416239C28
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416239B48
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416239A68
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416239988
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162398A8
		void $InitInstance(); // Flags: None 0x7FF416239528
		void $Block(); // Flags: None 0x7FF416239368
		void $InitCDO(); // Flags: HasDefaults 0x7FF416239448
	};


	// Class /EntityFramework/_Verse/VNI/Component.directional_light_component
	// Inherited from Ulight_component -> UComponent -> UObject
	// Size: 0x10 (0xC8 - 0xB8)
	class Udirectional_light_component : public Ulight_component	
	{
	public:
		double __verse_0x7D2E69E8_ShadowOpacity; // 0xB8(0x8)
		double __verse_0xECB66941__ShadowOpacity; // 0xC0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.directional_light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RSetShadowOpacity_L_Naccessor_M_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(Ftuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623B428
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_ROnRep____ShadowOpacity(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623B348
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RGetShadowOpacity_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623B268
		void $InitInstance(); // Flags: None 0x7FF41623B188
		void $Block(); // Flags: None 0x7FF41623AFC8
		void $InitCDO(); // Flags: HasDefaults 0x7FF41623B0A8
	};


	// Class /EntityFramework/_Verse/VNI/Component.local_hud_component
	// Inherited from UComponent -> UObject
	// Size: 0x28 (0x70 - 0x48)
	class Ulocal_hud_component : public UComponent	
	{
	public:
		UUI_canvas __verse_0x89A21F20_Canvas; // 0x48(0x8)
		FUI_player_ui_slot __verse_0xF1214EFE_UISlot; // 0x50(0x10)
		TArray __verse_0x76952CF9_ShowingPlayerUI; // 0x60(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.local_hud_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RShow_L_Nplayer_R(USimulation_player __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF41623BE28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF41623BC68
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF41623BB88
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41623BAA8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R(USimulation_player __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF41623BD48
		void $InitInstance(); // Flags: None 0x7FF41623B9C8
		void $Block(); // Flags: None 0x7FF41623B808
		void $InitCDO(); // Flags: HasDefaults 0x7FF41623B8E8
	};


	// Class /EntityFramework/_Verse/VNI/Component.mesh_component
	// Inherited from UComponent -> UObject
	// Size: 0x88 (0xD0 - 0x48)
	class Umesh_component : public UComponent	
	{
	public:
		UAssets_mesh __verse_0x71AD33A7_Mesh; // 0x48(0x8)
		unsigned char UnknownData09_6[0x50]; // 0x50(0x50) UNKNOWN PROPERTY
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0xA0:0(0x1)
		unsigned char UnknownBit10 : 1; // 0xA0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit11 : 1; // 0xA0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit12 : 1; // 0xA0:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit13 : 1; // 0xA0:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit14 : 1; // 0xA0:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0xA0:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0xA0:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x5CDFC2A5_Enabled : 1; // 0xA1:0(0x1)
		unsigned char UnknownData17_7[0x2E]; // 0xA2(0x2E) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.mesh_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Mesh(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623C9E8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Material(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623C908
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Enabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623C828
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623C748
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623C668
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623C588
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623CC88
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41623C4A8
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623CBA8
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623CAC8
		void $InitInstance(); // Flags: None 0x7FF41623C3C8
		void $Block(); // Flags: None 0x7FF41623C208
		void $InitCDO(); // Flags: HasDefaults 0x7FF41623C2E8
	};


	// Class /EntityFramework/_Verse/VNI/Component.parent_constraint_component
	// Inherited from UComponent -> UObject
	// Size: 0xD8 (0x120 - 0x48)
	class Uparent_constraint_component : public UComponent	
	{
	public:
		bool __verse_0x1AEA3A6F_AutoAttachToOwner : 1; // 0x48:0(0x1)
		unsigned char UnknownData01_7[0xD7]; // 0x49(0xD7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.parent_constraint_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623DAE8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RSetRelativeTransform_L_Ntransform_R(FSpatialMath_transform __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623DA08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623D4C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623D3E8
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41623D308
		FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RGetRelativeTransform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623D928
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RGetAttachedTransform(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623D848
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RDetachFrom(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623D768
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RAttachTo_L_Nentity_R(UEntity __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623D688
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RAttachTo_L_Nentity_M_Ntransform_R(Ftuple_Lentity_Mtransform_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623D5A8
		void $InitInstance(); // Flags: None 0x7FF41623D228
		void $Block(); // Flags: None 0x7FF41623D068
		void $InitCDO(); // Flags: HasDefaults 0x7FF41623D148
	};


	// Class /EntityFramework/_Verse/VNI/Component.particle_system_component
	// Inherited from UComponent -> UObject
	// Size: 0xD8 (0x120 - 0x48)
	class Uparticle_system_component : public UComponent	
	{
	public:
		unsigned char UnknownData11_3[0x28]; // 0x48(0x28) UNKNOWN PROPERTY
		bool __verse_0xC40E3E14_AutoEnable : 1; // 0x70:0(0x1)
		UAssets_particle_system __verse_0x1CB585BF_ParticleSystem; // 0x48(0x8)
		unsigned char UnknownData12_6[0x28]; // 0x50(0x28) UNKNOWN PROPERTY
		int64_t __verse_0xB6DCA931_EnableCounter; // 0x78(0x8)
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0x80:0(0x1)
		unsigned char UnknownBit13 : 1; // 0x80:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit14 : 1; // 0x80:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit15 : 1; // 0x80:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x80:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x80:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x80:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit19 : 1; // 0x80:7(0x1) UNKNOWN PROPERTY
		bool __verse_0x3B072BB9_PreviewInEditor : 1; // 0x81:0(0x1)
		unsigned char UnknownData20_5[0x6]; // 0x82(0x6) UNKNOWN PROPERTY
		FSpatialMath_vector3 __verse_0x68030817_BeamStart; // 0x88(0x18)
		FSpatialMath_vector3 __verse_0x86F3B4EC_BeamStartTangent; // 0xA0(0x18)
		FSpatialMath_vector3 __verse_0x9C23C07D_BeamEnd; // 0xB8(0x18)
		FSpatialMath_vector3 __verse_0xBF08B3B8_BeamEndTangent; // 0xD0(0x18)
		double __verse_0x46028BF2_BeamWidth; // 0xE8(0x8)
		unsigned char UnknownData21_7[0x30]; // 0xF0(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.particle_system_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamWidth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623EF68
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStartTangent_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623EE88
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStart_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623EDA8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEndTangent_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623ECC8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEnd_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623EBE8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E4E8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ParticleSystem(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623EB08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__EnableCounter(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623EA28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamWidth(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E948
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStartTangent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E868
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStart(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E788
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEndTangent(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E6A8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEnd(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E5C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E408
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E328
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623E248
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41623F208
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41623E168
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623F128
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623F048
		void $InitInstance(); // Flags: None 0x7FF41623E088
		void $Block(); // Flags: None 0x7FF41623DEC8
		void $InitCDO(); // Flags: HasDefaults 0x7FF41623DFA8
	};


	// Class /EntityFramework/_Verse/VNI/Component.physics_component
	// Inherited from UComponent -> UObject
	// Size: 0x68 (0xB0 - 0x48)
	class Uphysics_component : public UComponent	
	{
	public:
		unsigned char UnknownData03_3[0x31]; // 0x48(0x31) UNKNOWN PROPERTY
		bool __verse_0x5CDFC2A5_Enabled : 1; // 0x79:0(0x1)
		unsigned char UnknownData04_5[0x2E]; // 0x7A(0x2E) UNKNOWN PROPERTY
		UObject __verse_0x4BFA8E15_HitEvent; // 0xA8(0x8)
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0x78:0(0x1)
		unsigned char UnknownData05_7[0x37]; // 0x79(0x37) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.physics_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623FC08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__component_N_ROnRep__Enabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623FCE8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623FB28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623FA48
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623F968
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41623FF88
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41623F888
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623FEA8
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41623FDC8
		void $InitInstance(); // Flags: None 0x7FF41623F7A8
		void $Block(); // Flags: None 0x7FF41623F5E8
		void $InitCDO(); // Flags: HasDefaults 0x7FF41623F6C8
	};


	// Class /EntityFramework/_Verse/VNI/Component.point_light_component_base
	// Inherited from Ulight_component -> UComponent -> UObject
	// Size: 0x30 (0xE8 - 0xB8)
	class Upoint_light_component_base : public Ulight_component	
	{
	public:
		double __verse_0xBAB0877B_AttenuationRadius; // 0xB8(0x8)
		double __verse_0x12542E15_SourceRadius; // 0xC0(0x8)
		double __verse_0xAA17A810_SourceLength; // 0xC8(0x8)
		double __verse_0x3835D83E__AttenuationRadius; // 0xD0(0x8)
		double __verse_0x7E578E96__SourceRadius; // 0xD8(0x8)
		double __verse_0xC6140893__SourceLength; // 0xE0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.point_light_component_base");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceRadius_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416240D08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceLength_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416240C28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetAttenuationRadius_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416240B48
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____SourceRadius(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416240A68
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____SourceLength(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416240988
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____AttenuationRadius(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162408A8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceRadius_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162407C8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceLength_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162406E8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetAttenuationRadius_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416240608
		void $InitInstance(); // Flags: None 0x7FF416240528
		void $Block(); // Flags: None 0x7FF416240368
		void $InitCDO(); // Flags: HasDefaults 0x7FF416240448
	};


	// Class /EntityFramework/_Verse/VNI/Component.point_light_component
	// Inherited from Upoint_light_component_base -> Ulight_component -> UComponent -> UObject
	// Size: 0x0 (0xE8 - 0xE8)
	class Upoint_light_component : public Upoint_light_component_base	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.point_light_component");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4162412A8
		void $Block(); // Flags: None 0x7FF4162410E8
		void $InitCDO(); // Flags: None 0x7FF4162411C8
	};


	// Class /EntityFramework/_Verse/VNI/Component.rect_light_component
	// Inherited from Ulight_component -> UComponent -> UObject
	// Size: 0x50 (0x108 - 0xB8)
	class Urect_light_component : public Ulight_component	
	{
	public:
		double __verse_0xBAB0877B_AttenuationRadius; // 0xB8(0x8)
		double __verse_0x9F64F627_SourceWidth; // 0xC0(0x8)
		double __verse_0xC3BD8CB5_SourceHeight; // 0xC8(0x8)
		double __verse_0x23D81FBD_BarnDoorAngle; // 0xD0(0x8)
		double __verse_0xDC62E582_BarnDoorLength; // 0xD8(0x8)
		double __verse_0x3835D83E__AttenuationRadius; // 0xE0(0x8)
		double __verse_0xA895CFD1__SourceWidth; // 0xE8(0x8)
		double __verse_0xAFBE2C36__SourceHeight; // 0xF0(0x8)
		double __verse_0xB2401F14__BarnDoorAngle; // 0xF8(0x8)
		double __verse_0x191613DB__BarnDoorLength; // 0x100(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.rect_light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetSourceWidth_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242568
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetSourceHeight_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242488
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetBarnDoorLength_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162423A8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetBarnDoorAngle_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162422C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetAttenuationRadius_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162421E8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____SourceWidth(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242108
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____SourceHeight(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242028
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____BarnDoorLength(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416241F48
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____BarnDoorAngle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416241E68
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____AttenuationRadius(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416241D88
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetSourceWidth_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416241CA8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetSourceHeight_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416241BC8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetBarnDoorLength_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416241AE8
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetBarnDoorAngle_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416241A08
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetAttenuationRadius_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416241928
		void $InitInstance(); // Flags: None 0x7FF416241848
		void $Block(); // Flags: None 0x7FF416241688
		void $InitCDO(); // Flags: HasDefaults 0x7FF416241768
	};


	// Class /EntityFramework/_Verse/VNI/Component.sound_component
	// Inherited from UComponent -> UObject
	// Size: 0x68 (0xB0 - 0x48)
	class Usound_component : public UComponent	
	{
	public:
		UAssets_sound __verse_0xF013250F_Sound; // 0x48(0x8)
		unsigned char UnknownData03_6[0x20]; // 0x50(0x20) UNKNOWN PROPERTY
		bool __verse_0x8892301A_bWantsImplementation : 1; // 0x70:0(0x1)
		unsigned char UnknownData04_5[0x7]; // 0x71(0x7) UNKNOWN PROPERTY
		int64_t __verse_0x38C2642B_StartCounter; // 0x78(0x8)
		unsigned char UnknownData05_7[0x30]; // 0x80(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.sound_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_RStop(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416243128
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_RPlay(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416243048
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242DA8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_ROnRep__StartCounter(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242F68
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_ROnRep__Sound(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242E88
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416242CC8
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416242BE8
		void $InitInstance(); // Flags: None 0x7FF416242B08
		void $Block(); // Flags: None 0x7FF416242948
		void $InitCDO(); // Flags: HasDefaults 0x7FF416242A28
	};


	// Class /EntityFramework/_Verse/VNI/Component.spot_light_component
	// Inherited from Upoint_light_component_base -> Ulight_component -> UComponent -> UObject
	// Size: 0x20 (0x108 - 0xE8)
	class Uspot_light_component : public Upoint_light_component_base	
	{
	public:
		double __verse_0x5C223359_InnerConeAngle; // 0xE8(0x8)
		double __verse_0x9D05865C_OuterConeAngle; // 0xF0(0x8)
		double __verse_0x9956C500__InnerConeAngle; // 0xF8(0x8)
		double __verse_0x58717005__OuterConeAngle; // 0x100(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.spot_light_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RSetOuterConeAngle_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416243C08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RSetInnerConeAngle_L_Naccessor_M_Nfloat_R(Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416243B28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_ROnRep____OuterConeAngle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416243A48
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_ROnRep____InnerConeAngle(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416243968
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RGetOuterConeAngle_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416243888
		double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RGetInnerConeAngle_L_Naccessor_R(Verse_accessor __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162437A8
		void $InitInstance(); // Flags: None 0x7FF4162436C8
		void $Block(); // Flags: None 0x7FF416243508
		void $InitCDO(); // Flags: HasDefaults 0x7FF4162435E8
	};


	// Class /EntityFramework/_Verse/VNI/Component.text_display_component
	// Inherited from UComponent -> UObject
	// Size: 0x78 (0xC0 - 0x48)
	class Utext_display_component : public UComponent	
	{
	public:
		unsigned char UnknownData02_3[0x20]; // 0x48(0x20) UNKNOWN PROPERTY
		bool __verse_0x5CDFC2A5_Enabled : 1; // 0x68:0(0x1)
		unsigned char UnknownData03_5[0x17]; // 0x69(0x17) UNKNOWN PROPERTY
		UAssets_font __verse_0x70A2AEEA_Font; // 0x80(0x8)
		FColors_color __verse_0x65678AC7_Color; // 0x88(0x18)
		Ffloat_range __verse_0x515E2844_VisibleDistance; // 0xA0(0x10)
		double __verse_0xE725FDA9_FadeInTime; // 0xB0(0x8)
		double __verse_0x85320394_FadeOutTime; // 0xB8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/Component.text_display_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__VisibleDistance(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244D08
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Text(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244C28
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Font(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244B48
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__FadeOutTime(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244A68
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__FadeInTime(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244988
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Enabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162448A8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftext__display__component_N_ROnRep__Color(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162447C8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162446E8
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244608
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244528
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244448
		void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244368
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416244FA8
		bool _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416244288
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244EC8
		void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416244DE8
		void $InitInstance(); // Flags: None 0x7FF4162441A8
		void $Block(); // Flags: None 0x7FF416243FE8
		void $InitCDO(); // Flags: HasDefaults 0x7FF4162440C8
	};


	// Class /EntityFramework/_Verse/VNI/EntityLevel.level_entity
	// Inherited from UEntity -> UBaseEntity -> UObject
	// Size: 0x0 (0x60 - 0x60)
	class Ulevel_entity : public UEntity	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EntityFramework/_Verse/VNI/EntityLevel.level_entity");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4162476B0
		void $Block(); // Flags: None 0x7FF4162474F0
		void $InitCDO(); // Flags: None 0x7FF4162475D0
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_17 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesEngine.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.EpicGames_Input_verse_ue_input_component
	// Inherited from UVerseUEInputComponentBase -> UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x108 (0x548 - 0x440)
	class UEpicGames_Input_verse_ue_input_component : public UVerseUEInputComponentBase	
	{
	public:
		unsigned char UnknownData01_1[0x108]; // 0x440(0x108) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesEngine.EpicGames_Input_verse_ue_input_component");
			return ret;
		}

		UConcurrency_task WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF41624A318
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveAxisBinding_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41624A238
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMappingAndBinding_L_N_Kchar_M_Ninput__event_R(Ftuple_L_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF41624A158
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionMapping_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41624A078
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RRemoveActionBinding_L_N_Kchar_M_Ninput__event_R(Ftuple_L_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416249F98
		double _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RGetAxisValue_L_N_Kchar_R(__verse_0xB2CDDD72_Argument __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416249EB8
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputMappingsAndBindings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416249DD8
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearInputBindings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416249CF8
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearAxisMappings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416249C18
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RClearActionMappings(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416249B38
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_M_N_Q_Lfloat_Tvoid_R_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_M_Q_Lfloat_Tvoid_R_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF416249A58
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_N_Qfloat_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_M_Qfloat_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416249978
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddAxisBinding_L_N_Kchar_M_N_Q_Lfloat_Tvoid_R_R(Ftuple_L_Kchar_M_Q_Lfloat_Tvoid_R_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416249898
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMappingAndBinding_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_Minput__event_Mtuple_L_R_Tvoid_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasDefaults|BlueprintCallable 0x7FF4162497B8
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionMapping_L_N_Kchar_M_N_Kchar_M_N_Kverse__key_R(Ftuple_L_Kchar_M_Kchar_M_Kverse__key_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162496D8
		void _L_2fUnrealEngine_2ecom_2fEpicGames_2fInput_2fverse__ue__input__component_N_RAddActionBinding_L_N_Kchar_M_Ninput__event_M_Ntuple_L_R_Tvoid_R(Ftuple_L_Kchar_Minput__event_Mtuple_L_R_Tvoid_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162495F8
		void $InitInstance(); // Flags: None 0x7FF416249518
		void $Block(); // Flags: None 0x7FF416249358
		void $InitCDO(); // Flags: None 0x7FF416249438
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesEngine.task_EpicGames_Input_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x28 (0xE0 - 0xB8)
	class Utask_EpicGames_Input_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R : public UConcurrency_task	
	{
	public:
		UEpicGames_Input_verse_ue_input_component _Self; // 0xB8(0x8)
		Ftuple_Lverse__ue__input__component_M_Kchar_Minput__event_R __verse_0xB2CDDD72_Argument; // 0xC0(0x20)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesEngine.task_EpicGames_Input_verse_ue_input_component$WaitForAction_L_Nverse__ue__input__component_M_N_Kchar_M_Ninput__event_R");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF41624A6F8
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssetsdup_18 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets");
			return ret;
		}

		UObject _L_2fUnrealEngine_2ecom_2fAssets_N_RSpawnParticleSystem_L_Nparticle__system_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624BEB0
		UObject _L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySoundAtLocation_L_Nsound_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lsound_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624BDD0
		UObject _L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySound_L_Nsound_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R(Ftuple_Lsound_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624BCF0
		void $InitCDO(); // Flags: None 0x7FF41624BC10
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_play_sound_subscription
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAssets_play_sound_subscription : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_play_sound_subscription");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41624C530
		void $InitInstance(); // Flags: None 0x7FF41624C450
		void $Block(); // Flags: None 0x7FF41624C290
		void $InitCDO(); // Flags: None 0x7FF41624C370
	};


	// Class /EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_spawn_particle_system_subscription
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAssets_spawn_particle_system_subscription : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/EpicGamesEngine/_Verse/VNI/EpicGamesAssets.Assets_spawn_particle_system_subscription");
			return ret;
		}

		void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF41624CBB0
		void $InitInstance(); // Flags: None 0x7FF41624CAD0
		void $Block(); // Flags: None 0x7FF41624C910
		void $InitCDO(); // Flags: None 0x7FF41624C9F0
	};


	// Class /VerseExperimental/_Verse/VNI/VerseExperimental.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_19 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseExperimental/_Verse/VNI/VerseExperimental.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVerseExperimental : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental");
			return ret;
		}

		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2f_U_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4162518C0
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416251540
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416251620
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4162517E0
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416251700
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416251380
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416251460
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4162512A0
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Nfloat_M_Ntime__span_R(Ftuple_Lfloat_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4162511C0
		bool _L_2fVerse_2eorg_2fVerseExperimental_N_RValidateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416252420
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RValidate_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416252340
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RUtcNow(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416252260
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416252180
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162520A0
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251FC0
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251E00
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251EE0
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeNegate_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251D20
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeMultiply_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251C40
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeDivide_L_Ntime__span_M_Nfloat_R(Ftuple_Ltime__span_Mfloat_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251B60
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416251A80
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ndate__time_M_Ntime__span_R(Ftuple_Ldate__time_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162519A0
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416251000
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4162510E0
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416250E40
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416250F20
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416250C80
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416250D60
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ntime__span_M_Ntime__span_R(Ftuple_Ltime__span_Mtime__span_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416250BA0
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ndate__time_M_Ndate__time_R(Ftuple_Ldate__time_Mdate__time_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416250AC0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetYear_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162509E0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalSeconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250900
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMinutes_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250820
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMilliseconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250740
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMicroseconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250660
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalHours_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250580
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalDays_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162504A0
		FVerseExperimental_time_of_day_parts _L_2fVerse_2eorg_2fVerseExperimental_N_RGetTimeOfDay_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162503C0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162502E0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250200
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250040
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416250120
		VerseExperimental_month_of_year _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonthOfYear_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FF60
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonth_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FE80
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FDA0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FCC0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FBE0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FB00
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624FA20
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F940
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F860
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F780
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetDays_L_Ntime__span_R(FVerseExperimental_time_span __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F6A0
		VerseExperimental_day_of_week _L_2fVerse_2eorg_2fVerseExperimental_N_RGetDayOfWeek_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F5C0
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RGetDay_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F4E0
		FVerseExperimental_date_parts _L_2fVerse_2eorg_2fVerseExperimental_N_RGetDate_L_Ndate__time_R(FVerseExperimental_date_time __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F400
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInYear_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F320
		int64_t _L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInMonth_L_Nint_M_Nint_R(Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624F240
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMin(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41624F160
		FVerseExperimental_date_time _L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMax(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41624F080
		FVerseExperimental_time_span _L_2fVerse_2eorg_2fVerseExperimental_N_RCreateTimeSpan_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624EFA0
		void _L_2fVerse_2eorg_2fVerseExperimental_N_RCreateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R(Ftuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF41624EEC0
		FVerseExperimental_time_span VerseExperimental_time_span$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF416252B20
		FVerseExperimental_time_span VerseExperimental_time_span$Factory(); // Flags: Static|HasOutParms 0x7FF416252A40
		FVerseExperimental_time_of_day_parts VerseExperimental_time_of_day_parts$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms 0x7FF416252960
		FVerseExperimental_time_of_day_parts VerseExperimental_time_of_day_parts$Factory(); // Flags: Static|HasOutParms 0x7FF416252880
		FVerseExperimental_date_parts VerseExperimental_date_parts$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms 0x7FF4162525E0
		FVerseExperimental_date_parts VerseExperimental_date_parts$Factory(); // Flags: Static|HasOutParms 0x7FF416252500
		FVerseExperimental_date_time VerseExperimental_date_time$OverrideFactory(TMap __verse_0xFB48ED96_$InitOverrideMap); // Flags: Static|HasOutParms|HasDefaults 0x7FF4162527A0
		FVerseExperimental_date_time VerseExperimental_date_time$Factory(); // Flags: Static|HasOutParms 0x7FF4162526C0
		void $InitCDO(); // Flags: None 0x7FF41624EDE0
	};


	// Class /VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_date_time_ticks
	// Inherited from UObject
	// Size: 0x48 (0x70 - 0x28)
	class UVerseExperimental_date_time_ticks : public UObject	
	{
	public:
		int64_t __verse_0x8DE5F121_NanosecondsPerTick; // 0x28(0x8)
		int64_t __verse_0x358147B9_TicksPerDay; // 0x30(0x8)
		int64_t __verse_0x5C0949D3_TicksPerHour; // 0x38(0x8)
		int64_t __verse_0x59DFB831_TicksPerMicrosecond; // 0x40(0x8)
		int64_t __verse_0xD20E16AF_TicksPerMillisecond; // 0x48(0x8)
		int64_t __verse_0x4420B794_TicksPerMinute; // 0x50(0x8)
		int64_t __verse_0x3E0178E0_TicksPerSecond; // 0x58(0x8)
		int64_t __verse_0xA7911900_TicksPerWeek; // 0x60(0x8)
		int64_t __verse_0xE371C089_TicksPerYear; // 0x68(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseExperimental/_Verse/VNI/VerseExperimental.VerseExperimental_date_time_ticks");
			return ret;
		}

		void $InitCDO(); // Flags: None 0x7FF416252F00
	};


	// Class /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTags : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags");
			return ret;
		}

		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254C28
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R(UTags_tag_container __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254B48
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument, uint64_t InstancingGraph, UTags_tag_container __verse_0xB482F2DD_CurrentlyInstantiatedObject); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF416254988
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R(FVerseGameplayTagContainer __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254A68
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_NType_20where_20Type_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162548A8
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R(FVerseGameplayTag __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162547C8
		TArray _L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R(UTags_tag_search_criteria __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254608
		TArray _L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254528
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162546E8
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R(Ftuple_Ltag__container_Mtag__container_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254368
		void _L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R(Ftuple_Ltag_Mtag_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416254448
		void $InitCDO(); // Flags: None 0x7FF416254288
	};


	// Class /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag
	// Inherited from UVerseGameplayTagBase -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTags_tag : public UVerseGameplayTagBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF4162551C8
		void $Block(); // Flags: None 0x7FF416255008
		void $InitCDO(); // Flags: None 0x7FF4162550E8
	};


	// Class /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container
	// Inherited from UVerseGameplayTagContainerBase -> UObject
	// Size: 0x0 (0x38 - 0x38)
	class UTags_tag_container : public UVerseGameplayTagContainerBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_container");
			return ret;
		}

		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R(int64_t __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255F48
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255E68
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R(UTags_tag_container __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255CA8
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416255D88
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255BC8
		int64_t _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416255AE8
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162561E8
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416256108
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416256028
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255A08
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255848
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R(UTags_tag_container __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416255928
		void $InitInstance(); // Flags: None 0x7FF416255768
		void $Block(); // Flags: None 0x7FF4162555A8
		void $InitCDO(); // Flags: None 0x7FF416255688
	};


	// Class /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_search_criteria
	// Inherited from UObject
	// Size: 0x38 (0x60 - 0x28)
	class UTags_tag_search_criteria : public UObject	
	{
	public:
		TArray __verse_0x4B15ECEC_RequiredTags; // 0x28(0x10)
		TArray __verse_0xDC4AEE52_PreferredTags; // 0x38(0x10)
		TArray __verse_0x321D6A7B_ExclusionTags; // 0x48(0x10)
		Tags_tag_search_sort_type __verse_0xBFD91910_SortType; // 0x58(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x59(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_search_criteria");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416256788
		void $Block(); // Flags: None 0x7FF4162565C8
		void $InitCDO(); // Flags: HasDefaults 0x7FF4162566A8
	};


	// Class /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_view
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTags_tag_view : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_tag_view");
			return ret;
		}

		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416256D28
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416256C48
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416256B68
	};


	// Class /VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_vk_tag_container_component
	// Inherited from UEntityTagContainerComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0x70 - 0x70)
	class UTags_vk_tag_container_component : public UEntityTagContainerComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VerseGameplayTags/_Verse/VNI/VerseGameplayTags.Tags_vk_tag_container_component");
			return ret;
		}

		void _L_2fVerse_2eorg_2fSimulation_2fTags_2fvk__tag__container__component_N_RSetTags_L_Ntag__container_R(UTags_tag_container __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416257648
		bool _L_2fVerse_2eorg_2fSimulation_2fTags_2fvk__tag__container__component_N_RRemoveTag_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416257568
		UTags_tag_container _L_2fVerse_2eorg_2fSimulation_2fTags_2fvk__tag__container__component_N_RGetTags(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416257488
		void _L_2fVerse_2eorg_2fSimulation_2fTags_2fvk__tag__container__component_N_RAddTag_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF4162573A8
		void $InitInstance(); // Flags: None 0x7FF4162572C8
		void $Block(); // Flags: None 0x7FF416257108
		void $InitCDO(); // Flags: None 0x7FF4162571E8
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.$SolarisSignatureFunctionOuter
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class U$SolarisSignatureFunctionOuterdup_20 : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.$SolarisSignatureFunctionOuter");
			return ret;
		}
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x9 (0xC1 - 0xB8)
	class Utask_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Components_dynamic_activation_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF416282F98
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x9 (0xC1 - 0xB8)
	class Utask_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Components_dynamic_activation_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF416283378
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x28 (0xE0 - 0xB8)
	class Utask_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Messaging_debug_command_component _Self; // 0xB8(0x8)
		unsigned char UnknownData01_7[0x20]; // 0xC0(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF416283758
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_physics_trace$WaitPhysicsTrace
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x20 (0xD8 - 0xB8)
	class Utask_VGameplayRst_Physics_physics_trace$WaitPhysicsTrace : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Physics_physics_trace _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC1(0x7) UNKNOWN PROPERTY
		TArray _RetVal; // 0xC8(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_physics_trace$WaitPhysicsTrace");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF416283B38
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitBeginOverlap
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x18 (0xD0 - 0xB8)
	class Utask_VGameplayRst_Physics_vk_collision_component$WaitBeginOverlap : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Physics_vk_collision_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC1(0x7) UNKNOWN PROPERTY
		UVGameplayRst_Physics_vk_overlap_result _RetVal; // 0xC8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitBeginOverlap");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF416283F18
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitEndOverlap
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x18 (0xD0 - 0xB8)
	class Utask_VGameplayRst_Physics_vk_collision_component$WaitEndOverlap : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Physics_vk_collision_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC1(0x7) UNKNOWN PROPERTY
		UVGameplayRst_Physics_vk_overlap_result _RetVal; // 0xC8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitEndOverlap");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4162842F8
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitHit
	// Inherited from UConcurrency_task -> UObject
	// Size: 0x50 (0x108 - 0xB8)
	class Utask_VGameplayRst_Physics_vk_collision_component$WaitHit : public UConcurrency_task	
	{
	public:
		UVGameplayRst_Physics_vk_collision_component _Self; // 0xB8(0x8)
		Ftuple_L_R __verse_0xB2CDDD72_Argument; // 0xC0(0x1)
		unsigned char UnknownData01_6[0x7]; // 0xC1(0x7) UNKNOWN PROPERTY
		FVGameplayRst_Physics_hit_result_legacy _RetVal; // 0xC8(0x40)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitHit");
			return ret;
		}

		int64_t Update(); // Flags: Native|Public|HasOutParms 0x7FF4162846D8
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Audio_audio_component
	// Inherited from UAudioComponentBase -> UEntityActorComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0x98 - 0x98)
	class UVGameplayRst_Audio_audio_component : public UAudioComponentBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Audio_audio_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R(UAssets_sound __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416284F18
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_REndSound(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416284E38
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RBeginSound(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416284D58
		void $InitInstance(); // Flags: None 0x7FF416284C78
		void $Block(); // Flags: None 0x7FF416284AB8
		void $InitCDO(); // Flags: None 0x7FF416284B98
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component
	// Inherited from UEntityDynamicActivationComponent -> UEntityEnableableComponent -> UEntityComponent -> UObject
	// Size: 0x18 (0xC8 - 0xB0)
	class UVGameplayRst_Components_dynamic_activation_component : public UEntityDynamicActivationComponent	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0xB0(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_dynamic_activation_component");
			return ret;
		}

		UConcurrency_task WaitForTransitionComplete(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF4162859F8
		UConcurrency_task WaitForTransitionBegin(UConcurrency_task __verse_0xC1E81372_CallingTask, int64_t __verse_0xA3A00DDB_CallerResumeState, int64_t __verse_0x2AC0E4D8_CallerCancelState, Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|HasOutParms|BlueprintCallable 0x7FF416285918
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Nvk__component_R(UEntityComponent __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416285838
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416285758
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Nvk__component_R(UEntityComponent __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416285678
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R(Ftuple_Lfloat_Mactivation__state_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416285598
		void $InitInstance(); // Flags: None 0x7FF4162854B8
		void $Block(); // Flags: None 0x7FF4162852F8
		void $InitCDO(); // Flags: None 0x7FF4162853D8
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_script_component
	// Inherited from UEntityScriptComponent -> UEntityTickableComponent -> UEntityEnableableComponent -> UEntityComponent -> UObject
	// Size: 0x40 (0xF0 - 0xB0)
	class UVGameplayRst_Components_script_component : public UEntityScriptComponent	
	{
	public:
		bool __verse_0xFAA77A2E_AllowMultiple : 1; // 0xB0:0(0x1)
		unsigned char UnknownData01_7[0x3F]; // 0xB1(0x3F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Components_script_component");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetTickEnabled_L_Nlogic_R(bool __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416286D98
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetEnabled_L_Nlogic_R(bool __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416286CB8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnTick_L_Nfloat_R(double __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF416286BD8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnPostCreate(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF416286AF8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnd(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF416286A18
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnabledChanged_L_Nlogic_R(bool __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF416286938
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnCreate(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF416286858
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Public|BlueprintCallable 0x7FF416286778
		bool _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsOwner_L_Nvk__entity_R(UVerseEngine_Entity_vk_entity __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416286698
		bool _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsEnabled(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162865B8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetName(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162864D8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetFullname(Ftuple_L_R __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF4162863F8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetComponentOfType_L_NcomponentType_20where_20componentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416286318
		TArray _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetAllComponentsOfType_L_NcomponentType_20where_20componentType_R(UClass __verse_0xB2CDDD72_Argument); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF416286238
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToRequiredComponentList_L_N_Ksubtype_Lvk__component_R_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416286158
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToCreateComponentList_L_N_Ksubtype_Lvk__component_R_R(TArray __verse_0xB2CDDD72_Argument); // Flags: Native|Public|BlueprintCallable 0x7FF416286078
		void $InitInstance(); // Flags: None 0x7FF416285F98
		void $Block(); // Flags: None 0x7FF416285DD8
		void $InitCDO(); // Flags: HasDefaults 0x7FF416285EB8
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Datastore_datastore_component
	// Inherited from UDatastoreComponentBase -> UEntityActorPlayerComponent -> UEntityDataBackedComponent -> UEntityComponent -> UObject
	// Size: 0x0 (0x210 - 0x210)
	class UVGameplayRst_Datastore_datastore_component : public UDatastoreComponentBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Datastore_datastore_component");
			return ret;
		}

		void $InitInstance(); // Flags: None 0x7FF416287338
		void $Block(); // Flags: None 0x7FF416287178
		void $InitCDO(); // Flags: None 0x7FF416287258
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Datastore_DatastoreComponent
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVGameplayRst_Datastore_DatastoreComponent : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_Datastore_DatastoreComponent");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValueInt_L_Nplayer__component_M_N_Kchar_M_Nint_R(Ftuple_Lplayer__component_M_Kchar_Mint_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF4162879B8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValue_L_Nplayer__component_M_N_Kchar_M_N_Kchar_R(Ftuple_Lplayer__component_M_Kchar_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF4162878D8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RClearAllDatastoreValues_L_Nplayer__component_R(USimulation_player_component __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|BlueprintCallable 0x7FF4162877F8
		void $InitCDO(); // Flags: None 0x7FF416287718
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_EntityUtil
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVGameplayRst_EntityUtil : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_EntityUtil");
			return ret;
		}

		int64_t _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntityFromAsset_L_N_Kchar_M_Ntransform_M_N_Kchar_R(Ftuple_L_Kchar_Mtransform_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416288498
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_N_Kchar_R(Ftuple_Lvector3_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162882D8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_Nvector3_M_Nvector3_M_N_Kchar_R(Ftuple_Lvector3_Mvector3_Mvector3_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162883B8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Ntransform_M_N_Kchar_R(Ftuple_Ltransform_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4162881F8
		int64_t _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEmptyEntity_L_Ntransform_M_N_Kchar_R(Ftuple_Ltransform_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416288118
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponentForEntity_L_Nvk__component_M_Nint_M_NType_20where_20Type_R(Ftuple_Lvk__component_Mint_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416288038
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponent_L_Nvk__component_M_NType_20where_20Type_R(Ftuple_Lvk__component_Msupertype_Lany_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416287F58
		UEntityComponent _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RCreateAndAddComponent_L_Nint_M_NComponentType_20where_20ComponentType_R(Ftuple_Lint_Mtype_Lvk__component_M_20vk__component_R_R __verse_0xB2CDDD72_Argument); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF416287E78
		void $InitCDO(); // Flags: None 0x7FF416287D98
	};


	// Class /VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UVGameplayRst_GameObjects : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/VGameplayRst/_Verse/VNI/VGameplayRst.VGameplayRst_GameObjects");
			return ret;
		}

		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Nvector3_R(FSpatialMath_vector3 __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289758
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Ntag_R(UTags_tag __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289598
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Nvk__entity_R(UVerseEngine_Entity_vk_entity __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289838
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Nvector3_M_N_Kchar_R(Ftuple_Lvector3_M_Kchar_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289678
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R(Ftuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416288DB8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R(Ftuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4162892F8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvector3_M_Nrotation_M_N_Kchar_M_Nmesh_M_Nmaterial_R(Ftuple_Lvector3_Mrotation_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289218
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R(Ftuple_Lvector3_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289138
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R(Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416288BF8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R(Ftuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416288F78
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_R(Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416288CD8
		void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntransform_M_N_Kchar_M_Nmesh_R(Ftuple_Ltransform_M_Kchar_Mmesh_R __verse_0xB2CDDD72_Argument); // Flags: Final|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF416289058
