#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Engine
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Class Engine.Actor
	// Inherited from UObject
	// Size: 0x268 (0x290 - 0x28)
	class AActor : public UObject	
	{
	public:
		FActorTickFunction PrimaryActorTick; // 0x28(0x30)
		bool bNetTemporary : 1; // 0x58:0(0x1)
		unsigned char UnknownBit20 : 1; // 0x58:1(0x1) UNKNOWN PROPERTY
		bool bOnlyRelevantToOwner : 1; // 0x58:2(0x1)
		bool bAlwaysRelevant : 1; // 0x58:3(0x1)
		bool bReplicateMovement : 1; // 0x58:4(0x1)
		bool bCallPreReplication : 1; // 0x58:5(0x1)
		bool bCallPreReplicationForReplay : 1; // 0x58:6(0x1)
		bool bHidden : 1; // 0x58:7(0x1)
		bool bTearOff : 1; // 0x59:0(0x1)
		bool bForceNetAddressable : 1; // 0x59:1(0x1)
		bool bExchangedRoles : 1; // 0x59:2(0x1)
		bool bNetLoadOnClient : 1; // 0x59:3(0x1)
		bool bNetUseOwnerRelevancy : 1; // 0x59:4(0x1)
		bool bRelevantForNetworkReplays : 1; // 0x59:5(0x1)
		bool bRelevantForLevelBounds : 1; // 0x59:6(0x1)
		bool bReplayRewindable : 1; // 0x59:7(0x1)
		bool bAllowTickBeforeBeginPlay : 1; // 0x5A:0(0x1)
		bool bAutoDestroyWhenFinished : 1; // 0x5A:1(0x1)
		bool bCanBeDamaged : 1; // 0x5A:2(0x1)
		bool bBlockInput : 1; // 0x5A:3(0x1)
		bool bCollideWhenPlacing : 1; // 0x5A:4(0x1)
		bool bFindCameraComponentWhenViewTarget : 1; // 0x5A:5(0x1)
		bool bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5A:6(0x1)
		bool bIgnoresOriginShifting : 1; // 0x5A:7(0x1)
		bool bEnableAutoLODGeneration : 1; // 0x5B:0(0x1)
		bool bIsEditorOnlyActor : 1; // 0x5B:1(0x1)
		unsigned char UnknownBit21 : 1; // 0x5B:2(0x1) UNKNOWN PROPERTY
		bool bReplicates : 1; // 0x5B:3(0x1)
		bool bCanBeInCluster : 1; // 0x5B:4(0x1)
		bool bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5B:5(0x1)
		unsigned char UnknownBit22 : 1; // 0x5B:6(0x1) UNKNOWN PROPERTY
		bool bReplicateUsingRegisteredSubObjectList : 1; // 0x5B:7(0x1)
		unsigned char UnknownBit23 : 1; // 0x5C:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit24 : 1; // 0x5C:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit25 : 1; // 0x5C:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit26 : 1; // 0x5C:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit27 : 1; // 0x5C:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit28 : 1; // 0x5C:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit29 : 1; // 0x5C:6(0x1) UNKNOWN PROPERTY
		bool bActorEnableCollision : 1; // 0x5C:7(0x1)
		bool bActorIsBeingDestroyed : 1; // 0x5D:0(0x1)
		unsigned char UnknownBit30 : 1; // 0x5D:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit31 : 1; // 0x5D:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit32 : 1; // 0x5D:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit33 : 1; // 0x5D:4(0x1) UNKNOWN PROPERTY
		bool bAsyncPhysicsTickEnabled : 1; // 0x5D:5(0x1)
		EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5E(0x1)
		EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5F(0x1)
		TEnumAsByte RemoteRole; // 0x60(0x1)
		unsigned char UnknownData34_6[0x3]; // 0x61(0x3) UNKNOWN PROPERTY
		float InitialLifeSpan; // 0x64(0x4)
		float CustomTimeDilation; // 0x68(0x4)
		int32_t RayTracingGroupId; // 0x6C(0x4)
		FRepAttachment AttachmentReplication; // 0x70(0x60)
		FRepMovement ReplicatedMovement; // 0xD0(0x70)
		AActor Owner; // 0x140(0x8)
		FName NetDriverName; // 0x148(0x4)
		TEnumAsByte Role; // 0x14C(0x1)
		TEnumAsByte NetDormancy; // 0x14D(0x1)
		ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14E(0x1)
		TEnumAsByte AutoReceiveInput; // 0x14F(0x1)
		int32_t InputPriority; // 0x150(0x4)
		unsigned char UnknownData35_6[0x4]; // 0x154(0x4) UNKNOWN PROPERTY
		UInputComponent InputComponent; // 0x158(0x8)
		int32_t NetTag; // 0x160(0x4)
		float NetCullDistanceSquared; // 0x164(0x4)
		float NetUpdateFrequency; // 0x168(0x4)
		float MinNetUpdateFrequency; // 0x16C(0x4)
		float NetPriority; // 0x170(0x4)
		EPhysicsReplicationMode PhysicsReplicationMode; // 0x174(0x1)
		unsigned char UnknownData36_6[0xB]; // 0x175(0xB) UNKNOWN PROPERTY
		APawn Instigator; // 0x180(0x8)
		TArray Children; // 0x188(0x10)
		USceneComponent RootComponent; // 0x198(0x8)
		unsigned char UnknownData37_6[0x8]; // 0x1A0(0x8) UNKNOWN PROPERTY
		TArray Layers; // 0x1A8(0x10)
		TWeakObjectPtr ParentComponent; // 0x1B8(0x8)
		unsigned char UnknownData38_6[0x10]; // 0x1C0(0x10) UNKNOWN PROPERTY
		TArray Tags; // 0x1D0(0x10)
		FMulticastSparseDelegate OnTakeAnyDamage; // 0x1E0(0x1)
		FMulticastSparseDelegate OnTakePointDamage; // 0x1E1(0x1)
		FMulticastSparseDelegate OnTakeRadialDamage; // 0x1E2(0x1)
		FMulticastSparseDelegate OnActorBeginOverlap; // 0x1E3(0x1)
		FMulticastSparseDelegate OnActorEndOverlap; // 0x1E4(0x1)
		FMulticastSparseDelegate OnBeginCursorOver; // 0x1E5(0x1)
		FMulticastSparseDelegate OnEndCursorOver; // 0x1E6(0x1)
		FMulticastSparseDelegate OnClicked; // 0x1E7(0x1)
		FMulticastSparseDelegate OnReleased; // 0x1E8(0x1)
		FMulticastSparseDelegate OnInputTouchBegin; // 0x1E9(0x1)
		FMulticastSparseDelegate OnInputTouchEnd; // 0x1EA(0x1)
		FMulticastSparseDelegate OnInputTouchEnter; // 0x1EB(0x1)
		FMulticastSparseDelegate OnInputTouchLeave; // 0x1EC(0x1)
		FMulticastSparseDelegate OnActorHit; // 0x1ED(0x1)
		FMulticastSparseDelegate OnDestroyed; // 0x1EE(0x1)
		FMulticastSparseDelegate OnEndPlay; // 0x1EF(0x1)
		unsigned char UnknownData39_6[0x80]; // 0x1F0(0x80) UNKNOWN PROPERTY
		TArray InstanceComponents; // 0x270(0x10)
		TArray BlueprintCreatedComponents; // 0x280(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Actor");
			return ret;
		}

		bool WasRecentlyRendered(float Tolerance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4124998D0
		void UserConstructionScript(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4124997F0
		void TearOff(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412499710
		void SetTickGroup(TEnumAsByte NewTickGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412499630
		void SetTickableWhenPaused(bool bTickableWhenPaused); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412499550
		void SetReplicates(bool bInReplicates); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 0x7FF412499470
		void SetReplicateMovement(bool bInReplicateMovement); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412499390
		void SetRayTracingGroupId(int32_t InRaytracingGroupId); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4124992B0
		void SetPhysicsReplicationMode(EPhysicsReplicationMode ReplicationMode); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4124991D0
		void SetOwner(AActor NewOwner); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4124990F0
		void SetNetUpdateFrequency(float Frequency); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412499010
		void SetNetDormancy(TEnumAsByte NewDormancy); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 0x7FF412498F30
		void SetNetCullDistanceSquared(float DistanceSq); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498E50
		void SetMinNetUpdateFrequency(float MinFrequency); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498D70
		void SetLifeSpan(float InLifespan); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498C90
		void SetAutoDestroyWhenFinished(bool bVal); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498BB0
		void SetActorTickInterval(float TickInterval); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498AD0
		void SetActorTickEnabled(bool bEnabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4124989F0
		void SetActorScale3D(FVector NewScale3D); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF412498910
		void SetActorRelativeScale3D(FVector NewRelativeScale); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF412498830
		void SetActorHiddenInGame(bool bNewHidden); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498750
		void SetActorEnableCollision(bool bNewActorEnableCollision); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498670
		void RemoveTickPrerequisiteComponent(UActorComponent PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412498590
		void RemoveTickPrerequisiteActor(AActor PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4124984B0
		void ReceiveTick(float DeltaSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4124983D0
		void ReceiveRadialDamage(float DamageReceived, UDamageType DamageType, FVector Origin, FHitResult& HitInfo, AController InstigatedBy, AActor DamageCauser); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent 0x7FF4124982F0
		void ReceivePointDamage(float Damage, UDamageType DamageType, FVector HitLocation, FVector HitNormal, UPrimitiveComponent HitComponent, FName BoneName, FVector ShotFromDirection, AController InstigatedBy, AActor DamageCauser, FHitResult& HitInfo); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent 0x7FF412498210
		void ReceiveHit(UPrimitiveComponent MyComp, AActor Other, UPrimitiveComponent OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // Flags: RequiredAPI|Event|Public|HasOutParms|HasDefaults|BlueprintEvent 0x7FF412478130
		void ReceiveEndPlay(TEnumAsByte EndPlayReason); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF412478050
		void ReceiveDestroyed(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477F70
		void ReceiveBeginPlay(); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF412477E90
		void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477DB0
		void ReceiveAnyDamage(float Damage, UDamageType DamageType, AController InstigatedBy, AActor DamageCauser); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x7FF412477CD0
		void ReceiveActorOnReleased(FKey ButtonReleased); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477BF0
		void ReceiveActorOnInputTouchLeave(TEnumAsByte FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477B10
		void ReceiveActorOnInputTouchEnter(TEnumAsByte FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477A30
		void ReceiveActorOnInputTouchEnd(TEnumAsByte FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477950
		void ReceiveActorOnInputTouchBegin(TEnumAsByte FingerIndex); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477870
		void ReceiveActorOnClicked(FKey ButtonPressed); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477790
		void ReceiveActorEndOverlap(AActor OtherActor); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4124776B0
		void ReceiveActorEndCursorOver(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4124775D0
		void ReceiveActorBeginOverlap(AActor OtherActor); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4124774F0
		void ReceiveActorBeginCursorOver(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412477410
		void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412437330
		void OnRep_ReplicateMovement(); // Flags: RequiredAPI|Native|Public 0x7FF412437250
		void OnRep_ReplicatedMovement(); // Flags: RequiredAPI|Native|Public 0x7FF412437170
		void OnRep_Owner(); // Flags: RequiredAPI|Native|Protected 0x7FF412437090
		void OnRep_Instigator(); // Flags: RequiredAPI|Native|Public 0x7FF412436FB0
		void OnRep_AttachmentReplication(); // Flags: RequiredAPI|Native|Public 0x7FF412436ED0
		void MakeNoise(float Loudness, APawn NoiseInstigator, FVector NoiseLocation, float MaxRange, FName tag); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable 0x7FF412436DF0
		bool K2_TeleportTo(FVector DestLocation, FRotator DestRotation); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF412436D10
		bool K2_SetActorTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF412436C30
		bool K2_SetActorRotation(FRotator NewRotation, bool bTeleportPhysics); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF412436B50
		void K2_SetActorRelativeTransform(FTransform& NewRelativeTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF412416A70
		void K2_SetActorRelativeRotation(FRotator NewRelativeRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF412416990
		void K2_SetActorRelativeLocation(FVector NewRelativeLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4124168B0
		bool K2_SetActorLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4124167D0
		bool K2_SetActorLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4124166F0
		void K2_OnReset(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412416610
		void K2_OnEndViewTarget(APlayerController PC); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412416530
		void K2_OnBecomeViewTarget(APlayerController PC); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF412416450
		USceneComponent K2_GetRootComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF412416370
		TArray K2_GetComponentsByClass(UClass ComponentClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF412416290
		FRotator K2_GetActorRotation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4124161B0
		FVector K2_GetActorLocation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4124160D0
		void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412415FF0
		void K2_DestroyActor(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF412415F10
		bool K2_AttachToComponent(USceneComponent Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412415E30
		bool K2_AttachToActor(AActor ParentActor, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412415D50
		void K2_AttachRootComponentToActor(AActor InParentActor, FName InSocketName, TEnumAsByte AttachLocationType, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF412415C70
		void K2_AttachRootComponentTo(USceneComponent InParent, FName InSocketName, TEnumAsByte AttachLocationType, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123F5B90
		void K2_AddActorWorldTransformKeepScale(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F5AB0
		void K2_AddActorWorldTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F59D0
		void K2_AddActorWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F58F0
		void K2_AddActorWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F5810
		void K2_AddActorLocalTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F5730
		void K2_AddActorLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F5650
		void K2_AddActorLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123F5570
		bool IsOverlappingActor(AActor Other); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F5490
		bool IsChildActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F53B0
		bool IsActorTickEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F52D0
		bool IsActorBeingDestroyed(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F51F0
		bool HasAuthority(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F5110
		float GetVerticalDistanceTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F5030
		FVector GetVelocity(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4F50
		FTransform GetTransform(); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4E70
		bool GetTickableWhenPaused(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123F4D90
		float GetSquaredHorizontalDistanceTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4CB0
		float GetSquaredDistanceTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4BD0
		float GetResimulationThreshold(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4AF0
		TEnumAsByte GetRemoteRole(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4A10
		int32_t GetRayTracingGroupId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4930
		EPhysicsReplicationMode GetPhysicsReplicationMode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123F4850
		UChildActorComponent GetParentComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4770
		AActor GetParentActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4690
		AActor GetOwner(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F45B0
		void GetOverlappingComponents(TArray& OverlappingComponents); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4123F44D0
		void GetOverlappingActors(TArray& OverlappingActors, UClass ClassFilter); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4123F43F0
		float GetNetUpdateFrequency(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4310
		float GetNetCullDistanceSquared(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4230
		float GetMinNetUpdateFrequency(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4150
		TEnumAsByte GetLocalRole(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F4070
		float GetLifeSpan(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3F90
		FTransform GetLevelTransform(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3EB0
		ULevel GetLevel(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3DD0
		AController GetInstigatorController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3CF0
		APawn GetInstigator(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3C10
		FVector GetInputVectorAxisValue(FKey InputAxisKey); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3B30
		float GetInputAxisValue(FName InputAxisName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3A50
		float GetInputAxisKeyValue(FKey InputAxisKey); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3970
		float GetHorizontalDotProductTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3890
		float GetHorizontalDistanceTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F37B0
		float GetGameTimeSinceCreation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F36D0
		float GetDotProductTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F35F0
		float GetDistanceTo(AActor OtherActor); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3510
		TArray GetComponentsByTag(UClass ComponentClass, FName tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3430
		TArray GetComponentsByInterface(UClass Interface); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3350
		UActorComponent GetComponentByClass(UClass ComponentClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3270
		FName GetAttachParentSocketName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F3190
		AActor GetAttachParentActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F30B0
		void GetAttachedActors(TArray& OutActors, bool bResetArray, bool bRecursivelyIncludeAttachedActors); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2FD0
		void GetAllChildActors(TArray& ChildActors, bool bIncludeDescendants); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2EF0
		FVector GetActorUpVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2E10
		float GetActorTimeDilation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2D30
		float GetActorTickInterval(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2C50
		FVector GetActorScale3D(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2B70
		FVector GetActorRightVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F2A90
		FVector GetActorRelativeScale3D(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F29B0
		FVector GetActorForwardVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123F28D0
		void GetActorEyesViewPoint(FVector& OutLocation, FRotator& OutRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123B27F0
		bool GetActorEnableCollision(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123B2710
		void GetActorBounds(bool bOnlyCollidingComponents, FVector& Origin, FVector& BoxExtent, bool bIncludeFromChildActors); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4123B2630
		void ForceNetUpdate(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B2550
		void FlushNetDormancy(); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 0x7FF4123B2470
		void FinishAddComponent(UActorComponent Component, bool bManualAttachment, FTransform& RelativeTransform); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123B2390
		UActorComponent FindComponentByTag(UClass ComponentClass, FName tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123B22B0
		void EnableInput(APlayerController PlayerController); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B21D0
		void DisableInput(APlayerController PlayerController); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B20F0
		void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B2010
		void CreateInputComponent(UClass InputComponentToCreate); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B1F30
		bool CanTriggerResimulation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123B1E50
		void AddTickPrerequisiteComponent(UActorComponent PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B1D70
		void AddTickPrerequisiteActor(AActor PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4123B1C90
		UActorComponent AddComponentByClass(UClass Class, bool bManualAttachment, FTransform& RelativeTransform, bool bDeferredFinish); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123B1BB0
		UActorComponent AddComponent(FName TemplateName, bool bManualAttachment, FTransform& RelativeTransform, UObject ComponentTemplateContext, bool bDeferredFinish); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4123B1AD0
		bool ActorHasTag(FName tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4123B19F0
	};


	// Class Engine.HUD
	// Inherited from AActor -> UObject
	// Size: 0xF0 (0x380 - 0x290)
	class AHUD : public AActor	
	{
	public:
		APlayerController PlayerOwner; // 0x290(0x8)
		bool bLostFocusPaused : 1; // 0x298:0(0x1)
		bool bShowHUD : 1; // 0x298:1(0x1)
		bool bShowDebugInfo : 1; // 0x298:2(0x1)
		unsigned char UnknownData04_5[0x3]; // 0x299(0x3) UNKNOWN PROPERTY
		int32_t CurrentTargetIndex; // 0x29C(0x4)
		bool bShowHitBoxDebugInfo : 1; // 0x2A0:0(0x1)
		bool bShowOverlays : 1; // 0x2A0:1(0x1)
		bool bEnableDebugTextShadow : 1; // 0x2A0:2(0x1)
		unsigned char UnknownData05_5[0x7]; // 0x2A1(0x7) UNKNOWN PROPERTY
		TArray PostRenderedActors; // 0x2A8(0x10)
		unsigned char UnknownData06_6[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		TArray DebugDisplay; // 0x2C0(0x10)
		TArray ToggledDebugCategories; // 0x2D0(0x10)
		UCanvas Canvas; // 0x2E0(0x8)
		UCanvas DebugCanvas; // 0x2E8(0x8)
		TArray DebugTextList; // 0x2F0(0x10)
		UClass ShowDebugTargetDesiredClass; // 0x300(0x8)
		AActor ShowDebugTargetActor; // 0x308(0x8)
		unsigned char UnknownData07_7[0x70]; // 0x310(0x70) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.HUD");
			return ret;
		}

		void ShowHUD(); // Flags: RequiredAPI|Exec|Native|Public 0x7FF4145298B8
		void ShowDebugToggleSubCategory(FName category); // Flags: Final|RequiredAPI|Exec|Native|Public 0x7FF4145297D8
		void ShowDebugForReticleTargetToggle(UClass DesiredClass); // Flags: Final|RequiredAPI|Exec|Native|Public 0x7FF4145296F8
		void ShowDebug(FName DebugType); // Flags: RequiredAPI|Exec|Native|Public 0x7FF414529618
		void RemoveDebugText(AActor SrcActor, bool bLeaveDurationText); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF414529538
		void RemoveAllDebugStrings(); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF414529458
		void ReceiveHitBoxRelease(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent 0x7FF414529378
		void ReceiveHitBoxEndCursorOver(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent 0x7FF414529298
		void ReceiveHitBoxClick(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent 0x7FF4145291B8
		void ReceiveHitBoxBeginCursorOver(FName BoxName); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent 0x7FF4145290D8
		void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Flags: RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent 0x7FF414528FF8
		FVector Project(FVector Location, bool bClampToZeroPlane); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF414528F18
		void PreviousDebugTarget(); // Flags: RequiredAPI|Exec|Native|Public 0x7FF414528E38
		void NextDebugTarget(); // Flags: RequiredAPI|Exec|Native|Public 0x7FF414528D58
		void GetTextSize(FString Text, float& OutWidth, float& OutHeight, UFont Font, float Scale); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF414528C78
		APlayerController GetOwningPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414528B98
		APawn GetOwningPawn(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414528AB8
		void GetActorsInSelectionRectangle(UClass ClassFilter, FVector2D& FirstPoint, FVector2D& SecondPoint, TArray& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 0x7FF4145289D8
		void DrawTextureSimple(UTexture Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4145288F8
		void DrawTexture(UTexture Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, FLinearColor TintColor, TEnumAsByte BlendMode, float Scale, bool bScalePosition, float Rotation, FVector2D RotPivot); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414528818
		void DrawText(FString Text, FLinearColor TextColor, float ScreenX, float ScreenY, UFont Font, float Scale, bool bScalePosition); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414528738
		void DrawRect(FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414528658
		void DrawMaterialTriangle(UMaterialInterface Material, FVector2D V0_Pos, FVector2D V1_Pos, FVector2D V2_Pos, FVector2D V0_UV, FVector2D V1_UV, FVector2D V2_UV, FLinearColor V0_Color, FLinearColor V1_Color, FLinearColor V2_Color); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414528578
		void DrawMaterialSimple(UMaterialInterface Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414528498
		void DrawMaterial(UMaterialInterface Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, FVector2D RotPivot); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4145283B8
		void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, FLinearColor LineColor, float LineThickness); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4145282D8
		void Deproject(float ScreenX, float ScreenY, FVector& WorldPosition, FVector& WorldDirection); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4145281F8
		void AddHitBox(FVector2D Position, FVector2D Size, FName InName, bool bConsumesInput, int32_t Priority); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414528118
		void AddDebugText(FString DebugText, AActor SrcActor, float duration, FVector Offset, FVector DesiredOffset, FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, UFont InFont, float FontScale, bool bDrawShadow); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient 0x7FF414528038
	};


	// Class Engine.ActorComponent
	// Inherited from UObject
	// Size: 0x78 (0xA0 - 0x28)
	class UActorComponent : public UObject	
	{
	public:
		unsigned char UnknownData13_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		FActorComponentTickFunction PrimaryComponentTick; // 0x30(0x30)
		TArray ComponentTags; // 0x60(0x10)
		TArray AssetUserData; // 0x70(0x10)
		unsigned char UnknownData14_6[0x4]; // 0x80(0x4) UNKNOWN PROPERTY
		int32_t UCSSerializationIndex; // 0x84(0x4)
		unsigned char UnknownBit15 : 1; // 0x88:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x88:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x88:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x88:3(0x1) UNKNOWN PROPERTY
		bool bNetAddressable : 1; // 0x88:4(0x1)
		bool bReplicateUsingRegisteredSubObjectList : 1; // 0x88:5(0x1)
		bool bReplicates : 1; // 0x88:6(0x1)
		unsigned char UnknownData19_3[0x1]; // 0x89(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit20 : 1; // 0x8A:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit21 : 1; // 0x8A:1(0x1) UNKNOWN PROPERTY
		bool bAutoActivate : 1; // 0x8A:2(0x1)
		bool bIsActive : 1; // 0x8A:3(0x1)
		bool bEditableWhenInherited : 1; // 0x8A:4(0x1)
		unsigned char UnknownBit22 : 1; // 0x8A:5(0x1) UNKNOWN PROPERTY
		bool bCanEverAffectNavigation : 1; // 0x8A:6(0x1)
		unsigned char UnknownBit23 : 1; // 0x8A:7(0x1) UNKNOWN PROPERTY
		bool bIsEditorOnly : 1; // 0x8B:0(0x1)
		unsigned char UnknownData24_5[0x1]; // 0x8C(0x1) UNKNOWN PROPERTY
		EComponentCreationMethod CreationMethod; // 0x8D(0x1)
		FMulticastSparseDelegate OnComponentActivated; // 0x8E(0x1)
		FMulticastSparseDelegate OnComponentDeactivated; // 0x8F(0x1)
		unsigned char UnknownData25_7[0x10]; // 0x90(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActorComponent");
			return ret;
		}

		void ToggleActive(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA1408
		void SetTickGroup(TEnumAsByte NewTickGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA12C0
		void SetTickableWhenPaused(bool bTickableWhenPaused); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA11E0
		void SetIsReplicated(bool ShouldReplicate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA1100
		void SetComponentTickIntervalAndCooldown(float TickInterval); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA1020
		void SetComponentTickInterval(float TickInterval); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0F40
		void SetComponentTickEnabled(bool bEnabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0E60
		void SetAutoActivate(bool bNewAutoActivate); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0D80
		void SetActive(bool bNewActive, bool bReset); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0CA0
		void RemoveTickPrerequisiteComponent(UActorComponent PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0BC0
		void RemoveTickPrerequisiteActor(AActor PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0AE0
		void ReceiveTick(float DeltaSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF410FA0A00
		void ReceiveEndPlay(TEnumAsByte EndPlayReason); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF410FA08B8
		void ReceiveBeginPlay(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF410FA07D8
		void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF410FA06F8
		void OnRep_IsActive(); // Flags: RequiredAPI|Native|Public 0x7FF410FA0618
		void K2_DestroyComponent(UObject Object); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF410FA0538
		bool IsComponentTickEnabled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF410FA0458
		bool IsBeingDestroyed(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF410FA0378
		bool IsActive(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF410FA0298
		AActor GetOwner(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF410FA01B8
		float GetComponentTickInterval(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF410FA00D8
		void Deactivate(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410F9FFF8
		bool ComponentHasTag(FName tag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF410F9FF18
		void AddTickPrerequisiteComponent(UActorComponent PrerequisiteComponent); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410F9FE38
		void AddTickPrerequisiteActor(AActor PrerequisiteActor); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410F9FD58
		void Activate(bool bReset); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF410F9FC78
	};


	// Class Engine.Info
	// Inherited from AActor -> UObject
	// Size: 0x0 (0x290 - 0x290)
	class AInfo : public AActor	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Info");
			return ret;
		}
	};


	// Class Engine.PlayerState
	// Inherited from AInfo -> AActor -> UObject
	// Size: 0xB8 (0x348 - 0x290)
	class APlayerState : public AInfo	
	{
	public:
		float Score; // 0x290(0x4)
		int32_t PlayerId; // 0x294(0x4)
		char CompressedPing; // 0x298(0x1)
		unsigned char UnknownData07_6[0x1]; // 0x299(0x1) UNKNOWN PROPERTY
		bool bShouldUpdateReplicatedPing : 1; // 0x29A:0(0x1)
		bool bIsSpectator : 1; // 0x29A:1(0x1)
		bool bOnlySpectator : 1; // 0x29A:2(0x1)
		bool bIsABot : 1; // 0x29A:3(0x1)
		unsigned char UnknownBit08 : 1; // 0x29A:4(0x1) UNKNOWN PROPERTY
		bool bIsInactive : 1; // 0x29A:5(0x1)
		bool bFromPreviousLevel : 1; // 0x29A:6(0x1)
		unsigned char UnknownData09_5[0x1]; // 0x29B(0x1) UNKNOWN PROPERTY
		int32_t StartTime; // 0x29C(0x4)
		UClass EngineMessageClass; // 0x2A0(0x8)
		unsigned char UnknownData10_6[0x8]; // 0x2A8(0x8) UNKNOWN PROPERTY
		FString SavedNetworkAddress; // 0x2B0(0x10)
		FUniqueNetIdRepl UniqueID; // 0x2C0(0x30)
		unsigned char UnknownData11_6[0x8]; // 0x2F0(0x8) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnPawnSet; // 0x2F8(0x10)
		APawn PawnPrivate; // 0x308(0x8)
		unsigned char UnknownData12_6[0x18]; // 0x310(0x18) UNKNOWN PROPERTY
		FString PlayerNamePrivate; // 0x328(0x10)
		unsigned char UnknownData13_7[0x10]; // 0x338(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlayerState");
			return ret;
		}

		void ReceiveOverrideWith(APlayerState OldPlayerState); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF413E377A0
		void ReceiveCopyProperties(APlayerState NewPlayerState); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF413E376C0
		void OnRep_UniqueId(); // Flags: RequiredAPI|Native|Public 0x7FF413E375E0
		void OnRep_Score(); // Flags: RequiredAPI|Native|Public 0x7FF413E37500
		void OnRep_PlayerName(); // Flags: RequiredAPI|Native|Public 0x7FF413E37420
		void OnRep_PlayerId(); // Flags: RequiredAPI|Native|Public 0x7FF413E37340
		void OnRep_bIsInactive(); // Flags: RequiredAPI|Native|Public 0x7FF413E37260
		void OnPawnPrivateDestroyed(AActor InActor); // Flags: Final|RequiredAPI|Native|Private 0x7FF413E37180
		bool IsSpectator(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E370A0
		bool IsOnlyASpectator(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36FC0
		bool IsABot(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36EE0
		float GetScore(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36E00
		FString GetPlayerName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36D20
		int32_t GetPlayerId(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36C40
		APlayerController GetPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36B60
		float GetPingInMilliseconds(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E36A80
		APawn GetPawn(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E369A0
		char GetCompressedPing(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E368C0
		FUniqueNetIdRepl BP_GetUniqueId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413E367E0
	};


	// Class Engine.Controller
	// Inherited from AActor -> UObject
	// Size: 0x98 (0x328 - 0x290)
	class AController : public AActor	
	{
	public:
		unsigned char UnknownData06_3[0x8]; // 0x290(0x8) UNKNOWN PROPERTY
		APlayerState PlayerState; // 0x298(0x8)
		unsigned char UnknownData07_6[0x8]; // 0x2A0(0x8) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x2A8(0x10)
		FMulticastInlineDelegate OnPossessedPawnChanged; // 0x2B8(0x10)
		FName StateName; // 0x2C8(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x2CC(0x4) UNKNOWN PROPERTY
		APawn Pawn; // 0x2D0(0x8)
		unsigned char UnknownData09_6[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		ACharacter Character; // 0x2E0(0x8)
		USceneComponent TransformComponent; // 0x2E8(0x8)
		unsigned char UnknownData10_6[0x18]; // 0x2F0(0x18) UNKNOWN PROPERTY
		FRotator ControlRotation; // 0x308(0x18)
		bool bAttachToPawn : 1; // 0x320:0(0x1)
		unsigned char UnknownData11_7[0x7]; // 0x321(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Controller");
			return ret;
		}

		void UnPossess(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310EB00
		void StopMovement(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310EA20
		void SetInitialLocationAndRotation(FVector& NewLocation, FRotator& NewRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41310E940
		void SetIgnoreMoveInput(bool bNewMoveInput); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310E860
		void SetIgnoreLookInput(bool bNewLookInput); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310E780
		void SetControlRotation(FRotator& NewRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41310E6A0
		void ResetIgnoreMoveInput(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310E5C0
		void ResetIgnoreLookInput(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310E4E0
		void ResetIgnoreInputFlags(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310E400
		void ReceiveUnPossess(APawn UnpossessedPawn); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF41310E320
		void ReceivePossess(APawn PossessedPawn); // Flags: RequiredAPI|Event|Protected|BlueprintEvent 0x7FF41310E240
		void ReceiveInstigatedAnyDamage(float Damage, UDamageType DamageType, AActor DamagedActor, AActor DamageCauser); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Protected|BlueprintEvent 0x7FF41310E160
		void Possess(APawn InPawn); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 0x7FF41310E080
		void OnRep_PlayerState(); // Flags: RequiredAPI|Native|Public 0x7FF41310DFA0
		void OnRep_Pawn(); // Flags: RequiredAPI|Native|Public 0x7FF41310DEC0
		bool LineOfSightTo(AActor Other, FVector ViewPoint, bool bAlternateChecks); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41310DDE0
		APawn K2_GetPawn(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310DD00
		bool IsPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310DC20
		bool IsMoveInputIgnored(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310DB40
		bool IsLookInputIgnored(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310DA60
		bool IsLocalPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310D980
		bool IsLocalController(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310D8A0
		AActor GetViewTarget(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41310D7C0
		void GetPlayerViewPoint(FVector& Location, FRotator& Rotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41310D6E0
		FRotator GetDesiredRotation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41310D600
		FRotator GetControlRotation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41310D520
		void ClientSetRotation(FRotator NewRotation, bool bResetCamera); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient|NetValidate 0x7FF41310D440
		void ClientSetLocation(FVector NewLocation, FRotator NewRotation); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient|NetValidate 0x7FF41310D360
	};


	// Class Engine.PlayerController
	// Inherited from AController -> AActor -> UObject
	// Size: 0x520 (0x848 - 0x328)
	class APlayerController : public AController	
	{
	public:
		unsigned char UnknownData25_3[0x8]; // 0x328(0x8) UNKNOWN PROPERTY
		UPlayer Player; // 0x330(0x8)
		APawn AcknowledgedPawn; // 0x338(0x8)
		AHUD MyHUD; // 0x340(0x8)
		APlayerCameraManager PlayerCameraManager; // 0x348(0x8)
		UClass PlayerCameraManagerClass; // 0x350(0x8)
		bool bAutoManageActiveCameraTarget; // 0x358(0x1)
		unsigned char UnknownData26_6[0x7]; // 0x359(0x7) UNKNOWN PROPERTY
		FRotator TargetViewRotation; // 0x360(0x18)
		unsigned char UnknownData27_6[0x18]; // 0x378(0x18) UNKNOWN PROPERTY
		float SmoothTargetViewRotationSpeed; // 0x390(0x4)
		unsigned char UnknownData28_6[0x4]; // 0x394(0x4) UNKNOWN PROPERTY
		TArray HiddenActors; // 0x398(0x10)
		TArray HiddenPrimitiveComponents; // 0x3A8(0x10)
		unsigned char UnknownData29_6[0x4]; // 0x3B8(0x4) UNKNOWN PROPERTY
		float LastSpectatorStateSynchTime; // 0x3BC(0x4)
		FVector LastSpectatorSyncLocation; // 0x3C0(0x18)
		FRotator LastSpectatorSyncRotation; // 0x3D8(0x18)
		int32_t ClientCap; // 0x3F0(0x4)
		unsigned char UnknownData30_6[0x4]; // 0x3F4(0x4) UNKNOWN PROPERTY
		UCheatManager CheatManager; // 0x3F8(0x8)
		UClass CheatClass; // 0x400(0x8)
		UPlayerInput PlayerInput; // 0x408(0x8)
		TArray ActiveForceFeedbackEffects; // 0x410(0x10)
		unsigned char UnknownData31_6[0x80]; // 0x420(0x80) UNKNOWN PROPERTY
		unsigned char UnknownBit32 : 1; // 0x4A0:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit33 : 1; // 0x4A0:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit34 : 1; // 0x4A0:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit35 : 1; // 0x4A0:3(0x1) UNKNOWN PROPERTY
		bool bPlayerIsWaiting : 1; // 0x4A0:4(0x1)
		unsigned char UnknownData36_5[0x3]; // 0x4A1(0x3) UNKNOWN PROPERTY
		char NetPlayerIndex; // 0x4A4(0x1)
		unsigned char UnknownData37_6[0x5B]; // 0x4A5(0x5B) UNKNOWN PROPERTY
		UNetConnection PendingSwapConnection; // 0x500(0x8)
		UNetConnection NetConnection; // 0x508(0x8)
		unsigned char UnknownData38_6[0x18]; // 0x510(0x18) UNKNOWN PROPERTY
		float InputYawScale; // 0x528(0x4)
		float InputPitchScale; // 0x52C(0x4)
		float InputRollScale; // 0x530(0x4)
		bool bShowMouseCursor : 1; // 0x534:0(0x1)
		bool bEnableClickEvents : 1; // 0x534:1(0x1)
		bool bEnableTouchEvents : 1; // 0x534:2(0x1)
		bool bEnableMouseOverEvents : 1; // 0x534:3(0x1)
		bool bEnableTouchOverEvents : 1; // 0x534:4(0x1)
		bool bForceFeedbackEnabled : 1; // 0x534:5(0x1)
		bool bEnableMotionControls : 1; // 0x534:6(0x1)
		bool bEnableStreamingSource : 1; // 0x534:7(0x1)
		bool bStreamingSourceShouldActivate : 1; // 0x535:0(0x1)
		bool bStreamingSourceShouldBlockOnSlowStreaming : 1; // 0x535:1(0x1)
		unsigned char UnknownData39_5[0x2]; // 0x536(0x2) UNKNOWN PROPERTY
		EStreamingSourcePriority StreamingSourcePriority; // 0x538(0x1)
		unsigned char UnknownData40_6[0x3]; // 0x539(0x3) UNKNOWN PROPERTY
		FColor StreamingSourceDebugColor; // 0x53C(0x4)
		TArray StreamingSourceShapes; // 0x540(0x10)
		float ForceFeedbackScale; // 0x550(0x4)
		unsigned char UnknownData41_6[0x4]; // 0x554(0x4) UNKNOWN PROPERTY
		TArray ClickEventKeys; // 0x558(0x10)
		TEnumAsByte DefaultMouseCursor; // 0x568(0x1)
		TEnumAsByte CurrentMouseCursor; // 0x569(0x1)
		TEnumAsByte DefaultClickTraceChannel; // 0x56A(0x1)
		TEnumAsByte CurrentClickTraceChannel; // 0x56B(0x1)
		float HitResultTraceDistance; // 0x56C(0x4)
		uint16_t SeamlessTravelCount; // 0x570(0x2)
		uint16_t LastCompletedSeamlessTravelCount; // 0x572(0x2)
		unsigned char UnknownData42_6[0x84]; // 0x574(0x84) UNKNOWN PROPERTY
		UInputComponent InactiveStateInputComponent; // 0x5F8(0x8)
		unsigned char UnknownBit43 : 1; // 0x600:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit44 : 1; // 0x600:1(0x1) UNKNOWN PROPERTY
		bool bShouldPerformFullTickWhenPaused : 1; // 0x600:2(0x1)
		unsigned char UnknownData45_5[0x17]; // 0x601(0x17) UNKNOWN PROPERTY
		UTouchInterface CurrentTouchInterface; // 0x618(0x8)
		UClass OverridePlayerInputClass; // 0x620(0x8)
		unsigned char UnknownData46_6[0x78]; // 0x628(0x78) UNKNOWN PROPERTY
		ASpectatorPawn SpectatorPawn; // 0x6A0(0x8)
		unsigned char UnknownData47_6[0x4]; // 0x6A8(0x4) UNKNOWN PROPERTY
		bool bIsLocalPlayerController; // 0x6AC(0x1)
		unsigned char UnknownData48_6[0x3]; // 0x6AD(0x3) UNKNOWN PROPERTY
		FVector SpawnLocation; // 0x6B0(0x18)
		unsigned char UnknownData49_7[0x180]; // 0x6C8(0x180) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlayerController");
			return ret;
		}

		bool WasInputKeyJustReleased(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4131F7B60
		bool WasInputKeyJustPressed(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4131B7A80
		void ToggleSpeaking(bool bInSpeaking); // Flags: RequiredAPI|Exec|Native|Public 0x7FF4131B79A0
		void TestServerLevelVisibilityChange(FName PackageName, FName Filename); // Flags: Final|RequiredAPI|Exec|Native|Private 0x7FF4131B78C0
		void SwitchLevel(FString URL); // Flags: RequiredAPI|Exec|Native|Public 0x7FF4131B77E0
		bool StreamingSourceShouldBlockOnSlowStreaming(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4131B7700
		bool StreamingSourceShouldActivate(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4131B7620
		void StopHapticEffect(EControllerHand Hand); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4131B7540
		void StartFire(char FireModeNum); // Flags: RequiredAPI|Exec|Native|Public 0x7FF4131B7460
		void SetVirtualJoystickVisibility(bool bVisible); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4131B7380
		void SetViewTargetWithBlend(AActor NewViewTarget, float BlendTime, TEnumAsByte BlendFunc, float BlendExp, bool bLockOutgoing); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4131B72A0
		void SetName(FString S); // Flags: RequiredAPI|Exec|Native|Public 0x7FF4131B71C0
		void SetMouseLocation(int32_t X, int32_t Y); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4131970E0
		void SetMouseCursorWidget(TEnumAsByte Cursor, UUserWidget CursorWidget); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413157000
		void SetMotionControlsEnabled(bool bEnabled); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156F20
		void SetHapticsByValue(float Frequency, float Amplitude, EControllerHand Hand); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156E40
		void SetDisableHaptics(bool bNewDisabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156D60
		void SetDeprecatedInputYawScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156C80
		void SetDeprecatedInputRollScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156BA0
		void SetDeprecatedInputPitchScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156AC0
		void SetControllerLightColor(FColor Color); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4131569E0
		void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF413156900
		void SetAudioListenerOverride(USceneComponent AttachToComponent, FVector Location, FRotator Rotation); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF413156820
		void SetAudioListenerAttenuationOverride(USceneComponent AttachToComponent, FVector AttenuationLocationOVerride); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF413156740
		void ServerViewSelf(FViewTargetTransitionParams TransitionParams); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate 0x7FF413156660
		void ServerViewPrevPlayer(); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate 0x7FF413156580
		void ServerViewNextPlayer(); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate 0x7FF4131564A0
		void ServerVerifyViewTarget(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF4131563C0
		void ServerUpdateMultipleLevelsVisibility(TArray LevelVisibilities); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF4131562E0
		void ServerUpdateLevelVisibility(FUpdateLevelVisibilityLevelInfo LevelVisibility); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413156140
		void ServerUpdateCamera(FVector_NetQuantize CamLoc, int32_t CamPitchAndYaw); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate 0x7FF413156060
		void ServerUnmutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155F80
		void ServerUnblockPlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155EA0
		void ServerToggleAILogging(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155DC0
		void ServerShortTimeout(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155CE0
		void ServerSetSpectatorWaiting(bool bWaiting); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155C00
		void ServerSetSpectatorLocation(FVector NewLoc, FRotator NewRot); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|HasDefaults|NetValidate 0x7FF413155B20
		void ServerSendLatestAsyncPhysicsTimestamp(FAsyncPhysicsTimestamp Timestamp); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer 0x7FF413155A40
		void ServerRestartPlayer(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155960
		void ServerRecvClientInputFrame(int32_t RecvClientInputFrame, TArray Data); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer 0x7FF413155880
		void ServerPause(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF4131557A0
		void ServerNotifyLoadedWorld(FName WorldPackageName); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF4131556C0
		void ServerMutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF4131555E0
		void ServerExecRPC(FString Msg); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155500
		void ServerExec(FString Msg); // Flags: Final|RequiredAPI|Exec|Native|Public 0x7FF413155420
		void ServerCheckClientPossessionReliable(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155340
		void ServerCheckClientPossession(); // Flags: RequiredAPI|Net|Native|Event|Public|NetServer|NetValidate 0x7FF413155260
		void ServerChangeName(FString S); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413155180
		void ServerCamera(FName NewMode); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF4131550A0
		void ServerBlockPlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413154FC0
		void ServerAcknowledgePossession(APawn P); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 0x7FF413154EE0
		void SendToConsole(FString Command); // Flags: RequiredAPI|Exec|Native|Public 0x7FF413154E00
		void RestartLevel(); // Flags: RequiredAPI|Exec|Native|Public 0x7FF413154D20
		void ResetControllerLightColor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413154C40
		bool ProjectWorldLocationToScreen(FVector WorldLocation, FVector2D& ScreenLocation, bool bPlayerViewportRelative); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413154B60
		void PlayHapticEffect(UHapticFeedbackEffect_Base HapticEffect, EControllerHand Hand, float Scale, bool bLoop); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413154A80
		void PlayDynamicForceFeedback(float Intensity, float duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, TEnumAsByte Action, FLatentActionInfo LatentInfo); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4131549A0
		void Pause(); // Flags: RequiredAPI|Exec|Native|Public 0x7FF4131548C0
		void OnServerStartedVisualLogger(bool bIsLogging); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF4131547E0
		void LocalTravel(FString URL); // Flags: RequiredAPI|Exec|Native|Public 0x7FF413154700
		void K2_ClientPlayForceFeedback(UForceFeedbackEffect ForceFeedbackEffect, FName tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413154620
		bool IsStreamingSourceEnabled(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413154540
		bool IsInputKeyDown(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413154460
		void GetViewportSize(int32_t& SizeX, int32_t& SizeY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413154380
		void GetStreamingSourceShapes(TArray& OutShapes); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4131541E0
		EStreamingSourcePriority GetStreamingSourcePriority(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413154100
		void GetStreamingSourceLocationAndRotation(FVector& OutLocation, FRotator& OutRotation); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413154020
		ASpectatorPawn GetSpectatorPawn(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413153F40
		FPlatformUserId GetPlatformUserId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413153E60
		UClass GetOverridePlayerInputClass(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413153D80
		bool GetMousePosition(float& LocationX, float& LocationY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413153CA0
		FVector GetInputVectorKeyState(FKey Key); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413153BC0
		void GetInputTouchState(TEnumAsByte FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133AE0
		void GetInputMouseDelta(float& DeltaX, float& DeltaY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133A00
		void GetInputMotionState(FVector& Tilt, FVector& RotationRate, FVector& Gravity, FVector& Acceleration); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413133920
		float GetInputKeyTimeDown(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413133840
		void GetInputAnalogStickState(TEnumAsByte WhichStick, float& StickX, float& StickY); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133760
		float GetInputAnalogKeyState(FKey Key); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413133680
		AHUD GetHUD(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4131335A0
		bool GetHitResultUnderFingerForObjects(TEnumAsByte FingerIndex, TArray& ObjectTypes, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4131334C0
		bool GetHitResultUnderFingerByChannel(TEnumAsByte FingerIndex, TEnumAsByte TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4131333E0
		bool GetHitResultUnderFinger(TEnumAsByte FingerIndex, TEnumAsByte TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133300
		bool GetHitResultUnderCursorForObjects(TArray& ObjectTypes, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133220
		bool GetHitResultUnderCursorByChannel(TEnumAsByte TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133140
		bool GetHitResultUnderCursor(TEnumAsByte TraceChannel, bool bTraceComplex, FHitResult& HitResult); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF413133060
		FVector GetFocalLocation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413132F80
		float GetDeprecatedInputYawScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413132EA0
		float GetDeprecatedInputRollScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413132DC0
		float GetDeprecatedInputPitchScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF413132CE0
		void FOV(float NewFOV); // Flags: RequiredAPI|Exec|Native|Public 0x7FF413132C00
		void EnableCheats(); // Flags: RequiredAPI|Exec|Native|Public 0x7FF413132B20
		bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, FVector& WorldLocation, FVector& WorldDirection); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413132A40
		bool DeprojectMousePositionToWorld(FVector& WorldLocation, FVector& WorldDirection); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF413132960
		void ConsoleKey(FKey Key); // Flags: RequiredAPI|Exec|Native|Public 0x7FF413132880
		void ClientWasKicked(FText KickReason); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF4131327A0
		void ClientVoiceHandshakeComplete(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF4131326C0
		void ClientUpdateMultipleLevelsStreamingStatus(TArray LevelStatuses); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413132520
		void ClientUpdateLevelStreamingStatus(FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32_t LODIndex, FNetLevelVisibilityTransactionId TransactionId, bool bNewShouldBlockOnUnload); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413132440
		void ClientUnmutePlayers(TArray PlayerIds); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413132360
		void ClientUnmutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413132280
		void ClientTravelInternal(FString URL, TEnumAsByte TravelType, bool bSeamless, FGuid MapPackageGuid); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient 0x7FF4131321A0
		void ClientTravel(FString URL, TEnumAsByte TravelType, bool bSeamless, FGuid MapPackageGuid); // Flags: Final|RequiredAPI|Native|Public|HasDefaults 0x7FF4131320C0
		void ClientTeamMessage(APlayerState SenderPlayerState, FString S, FName Type, float MsgLifeTime); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111FE0
		void ClientStopForceFeedback(UForceFeedbackEffect ForceFeedbackEffect, FName tag); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable 0x7FF413111F00
		void ClientStopCameraShakesFromSource(UCameraShakeSourceComponent SourceComponent, bool bImmediately); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413111E20
		void ClientStopCameraShake(UClass Shake, bool bImmediately); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable 0x7FF413111D40
		void ClientStartOnlineSession(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111C60
		void ClientStartCameraShakeFromSource(UClass Shake, UCameraShakeSourceComponent SourceComponent); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF413111B80
		void ClientStartCameraShake(UClass Shake, float Scale, ECameraShakePlaySpace Playspace, FRotator UserPlaySpaceRot); // Flags: RequiredAPI|Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable 0x7FF413111AA0
		void ClientSpawnGenericCameraLensEffect(UClass LensEffectEmitterClass); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient|BlueprintCallable 0x7FF4131119C0
		void ClientSpawnCameraLensEffect(UClass LensEffectEmitterClass); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient 0x7FF4131118E0
		void ClientSetViewTarget(AActor A, FViewTargetTransitionParams TransitionParams); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111740
		void ClientSetupNetworkPhysicsTimestamp(FAsyncPhysicsTimestamp Timestamp); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111660
		void ClientSetSpectatorWaiting(bool bWaiting); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111580
		void ClientSetHUD(UClass NewHUDClass); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable 0x7FF4131114A0
		void ClientSetForceMipLevelsToBeResident(UMaterialInterface Material, float ForceDuration, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF4131113C0
		void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF4131112E0
		void ClientSetCameraMode(FName NewCamMode); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111200
		void ClientSetCameraFade(bool bEnableFading, FColor FadeColor, FVector2D FadeAlpha, float FadeTime, bool bFadeAudio, bool bHoldWhenFinished); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient 0x7FF413111120
		void ClientSetBlockOnAsyncLoading(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413111040
		void ClientReturnToMainMenuWithTextReason(FText ReturnReason); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110F60
		void ClientRetryClientRestart(APawn NewPawn); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110E80
		void ClientRestart(APawn NewPawn); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110DA0
		void ClientReset(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110CC0
		void ClientRepObjRef(UObject Object); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110BE0
		void ClientRecvServerAckFrameDebug(char NumBuffered, float TargetNumBufferedCmds); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient 0x7FF413110B00
		void ClientRecvServerAckFrame(int32_t LastProcessedInputFrame, int32_t RecvServerFrameNumber, int8_t TimeDilation); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient 0x7FF413110A20
		void ClientReceiveLocalizedMessage(UClass Message, int32_t SWITCH, APlayerState RelatedPlayerState, APlayerState RelatedPlayerState, UObject OptionalObject); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110940
		void ClientPrestreamTextures(AActor ForcedActor, float ForceDuration, bool bEnableStreaming, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110860
		void ClientPrepareMapChange(FName LevelName, bool bFirst, bool bLast); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110780
		void ClientPlaySoundAtLocation(USoundBase Sound, FVector Location, float VolumeMultiplier, float PitchMultiplier); // Flags: RequiredAPI|Net|Native|Event|Public|HasDefaults|NetClient 0x7FF4131106A0
		void ClientPlaySound(USoundBase Sound, float VolumeMultiplier, float PitchMultiplier); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient 0x7FF4131105C0
		void ClientPlayForceFeedback_Internal(UForceFeedbackEffect ForceFeedbackEffect, FForceFeedbackParameters Params); // Flags: Final|RequiredAPI|Net|Native|Event|Private|NetClient 0x7FF413110420
		void ClientMutePlayer(FUniqueNetIdRepl PlayerId); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110340
		void ClientMessage(FString S, FName Type, float MsgLifeTime); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110260
		void ClientIgnoreMoveInput(bool bIgnore); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF413110180
		void ClientIgnoreLookInput(bool bIgnore); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF4131100A0
		void ClientGotoState(FName NewState); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310FFC0
		void ClientGameEnded(AActor EndGameFocus, bool bIsWinner); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310FEE0
		void ClientForceGarbageCollection(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310FE00
		void ClientFlushLevelStreaming(); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310FD20
		void ClientEndOnlineSession(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310FC40
		void ClientEnableNetworkVoice(bool bEnable); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310FB60
		void ClientCorrectionAsyncPhysicsTimestamp(FAsyncPhysicsTimestamp Timestamp); // Flags: Final|RequiredAPI|Net|Native|Event|Private|NetClient 0x7FF41310F9C0
		void ClientCommitMapChange(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310F8E0
		void ClientClearCameraLensEffects(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable 0x7FF41310F800
		void ClientCapBandwidth(int32_t Cap); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310F720
		void ClientCancelPendingMapChange(); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310F640
		void ClientAddTextureStreamingLoc(FVector InLoc, float duration, bool bOverrideLocation); // Flags: Final|RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient 0x7FF41310F560
		void ClientAckUpdateLevelVisibility(FName PackageName, FNetLevelVisibilityTransactionId TransactionId, bool bClientAckCanMakeVisible); // Flags: RequiredAPI|Net|NetReliableNative|Event|Public|NetClient 0x7FF41310F3C0
		void ClientAckTimeDilation(float TimeDilation, int32_t ServerStep); // Flags: RequiredAPI|Net|Native|Event|Public|NetClient 0x7FF41310F2E0
		void ClearAudioListenerOverride(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310F200
		void ClearAudioListenerAttenuationOverride(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310F120
		bool CanRestartPlayer(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310F040
		void Camera(FName NewMode); // Flags: RequiredAPI|Exec|Native|Public 0x7FF41310EF60
		void AddYawInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310EE80
		void AddRollInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310EDA0
		void AddPitchInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310ECC0
		void ActivateTouchInterface(UTouchInterface NewTouchInterface); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41310EBE0
	};


	// Class Engine.Subsystem
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class USubsystem : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Subsystem");
			return ret;
		}
	};


	// Class Engine.WorldSubsystem
	// Inherited from USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UWorldSubsystem : public USubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.WorldSubsystem");
			return ret;
		}
	};


	// Class Engine.NavigationObjectBase
	// Inherited from AActor -> UObject
	// Size: 0x28 (0x2B8 - 0x290)
	class ANavigationObjectBase : public AActor	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x290(0x8) UNKNOWN PROPERTY
		UCapsuleComponent CapsuleComponent; // 0x298(0x8)
		UBillboardComponent GoodSprite; // 0x2A0(0x8)
		UBillboardComponent BadSprite; // 0x2A8(0x8)
		bool bIsPIEPlayerStart : 1; // 0x2B0:0(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x2B1(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.NavigationObjectBase");
			return ret;
		}
	};


	// Class Engine.PlayerStart
	// Inherited from ANavigationObjectBase -> AActor -> UObject
	// Size: 0x8 (0x2C0 - 0x2B8)
	class APlayerStart : public ANavigationObjectBase	
	{
	public:
		FName PlayerStartTag; // 0x2B8(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2BC(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlayerStart");
			return ret;
		}
	};


	// Class Engine.Pawn
	// Inherited from AActor -> UObject
	// Size: 0x80 (0x310 - 0x290)
	class APawn : public AActor	
	{
	public:
		unsigned char UnknownData07_3[0x8]; // 0x290(0x8) UNKNOWN PROPERTY
		bool bUseControllerRotationPitch : 1; // 0x298:0(0x1)
		bool bUseControllerRotationYaw : 1; // 0x298:1(0x1)
		bool bUseControllerRotationRoll : 1; // 0x298:2(0x1)
		bool bCanAffectNavigationGeneration : 1; // 0x298:3(0x1)
		unsigned char UnknownBit08 : 1; // 0x298:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0x298:5(0x1) UNKNOWN PROPERTY
		bool bIsLocalViewTarget : 1; // 0x298:6(0x1)
		unsigned char UnknownData10_5[0x3]; // 0x299(0x3) UNKNOWN PROPERTY
		float BaseEyeHeight; // 0x29C(0x4)
		TEnumAsByte AutoPossessPlayer; // 0x2A0(0x1)
		EAutoPossessAI AutoPossessAI; // 0x2A1(0x1)
		char RemoteViewPitch; // 0x2A2(0x1)
		unsigned char UnknownData11_6[0x5]; // 0x2A3(0x5) UNKNOWN PROPERTY
		UClass AIControllerClass; // 0x2A8(0x8)
		APlayerState PlayerState; // 0x2B0(0x8)
		AController LastHitBy; // 0x2B8(0x8)
		AController Controller; // 0x2C0(0x8)
		AController PreviousController; // 0x2C8(0x8)
		unsigned char UnknownData12_6[0x4]; // 0x2D0(0x4) UNKNOWN PROPERTY
		FMulticastSparseDelegate ReceiveControllerChangedDelegate; // 0x2D4(0x1)
		FMulticastSparseDelegate ReceiveRestartedDelegate; // 0x2D5(0x1)
		unsigned char UnknownData13_6[0x2]; // 0x2D6(0x2) UNKNOWN PROPERTY
		FVector ControlInputVector; // 0x2D8(0x18)
		FVector LastControlInputVector; // 0x2F0(0x18)
		UClass OverrideInputComponentClass; // 0x308(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Pawn");
			return ret;
		}

		void SpawnDefaultController(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41265E948
		void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41265E868
		void ReceiveUnpossessed(AController OldController); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x7FF41265E788
		void ReceiveRestarted(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF41265E6A8
		void ReceivePossessed(AController NewController); // Flags: RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent 0x7FF41265E5C8
		void ReceiveControllerChanged(AController OldController, AController NewController); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF41265E4E8
		void PawnMakeNoise(float Loudness, FVector NoiseLocation, bool bUseNoiseMakerLocation, AActor NoiseMaker); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable 0x7FF41265E408
		void OnRep_PlayerState(); // Flags: RequiredAPI|Native|Public 0x7FF41265E328
		void OnRep_Controller(); // Flags: RequiredAPI|Native|Public 0x7FF41265E248
		bool IsPlayerControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265E168
		bool IsPawnControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265E088
		bool IsMoveInputIgnored(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265DFA8
		bool IsLocallyViewed(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265DEC8
		bool IsLocallyControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265DDE8
		bool IsControlled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265DD08
		bool IsBotControlled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265DC28
		FPlatformUserId GetPlatformUserId(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265DB48
		FVector GetPendingMovementInputVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41265DA68
		UClass GetOverrideInputComponentClass(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265D988
		FVector GetNavAgentLocation(); // Flags: Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41265D8A8
		UPawnMovementComponent GetMovementComponent(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265D7C8
		AActor GetMovementBaseActor(APawn Pawn); // Flags: Final|RequiredAPI|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF41265D6E8
		APlayerController GetLocalViewingPlayerController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265D608
		FVector GetLastMovementInputVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41265D528
		FRotator GetControlRotation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41265D448
		AController GetController(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41265D368
		FRotator GetBaseAimRotation(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41265D288
		void DetachFromControllerPendingDestroy(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41265D1A8
		FVector ConsumeMovementInputVector(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41265D0C8
		void AddMovementInput(FVector WorldDirection, float ScaleValue, bool bForce); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41265CFE8
		void AddControllerYawInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41265CF08
		void AddControllerRollInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41265CE28
		void AddControllerPitchInput(float Val); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41263CD48
	};


	// Class Engine.BlueprintFunctionLibrary
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBlueprintFunctionLibrary : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintFunctionLibrary");
			return ret;
		}
	};


	// Class Engine.SceneComponent
	// Inherited from UActorComponent -> UObject
	// Size: 0x180 (0x220 - 0xA0)
	class USceneComponent : public UActorComponent	
	{
	public:
		unsigned char UnknownData05_3[0x8]; // 0xA0(0x8) UNKNOWN PROPERTY
		TWeakObjectPtr PhysicsVolume; // 0xA8(0x8)
		USceneComponent AttachParent; // 0xB0(0x8)
		FName AttachSocketName; // 0xB8(0x4)
		unsigned char UnknownData06_6[0x4]; // 0xBC(0x4) UNKNOWN PROPERTY
		TArray AttachChildren; // 0xC0(0x10)
		TArray ClientAttachedChildren; // 0xD0(0x10)
		unsigned char UnknownData07_6[0x40]; // 0xE0(0x40) UNKNOWN PROPERTY
		FVector RelativeLocation; // 0x120(0x18)
		FRotator RelativeRotation; // 0x138(0x18)
		FVector RelativeScale3D; // 0x150(0x18)
		FVector ComponentVelocity; // 0x168(0x18)
		bool bComponentToWorldUpdated : 1; // 0x180:0(0x1)
		unsigned char UnknownBit08 : 1; // 0x180:1(0x1) UNKNOWN PROPERTY
		bool bAbsoluteLocation : 1; // 0x180:2(0x1)
		bool bAbsoluteRotation : 1; // 0x180:3(0x1)
		bool bAbsoluteScale : 1; // 0x180:4(0x1)
		bool bVisible : 1; // 0x180:5(0x1)
		bool bShouldBeAttached : 1; // 0x180:6(0x1)
		bool bShouldSnapLocationWhenAttached : 1; // 0x180:7(0x1)
		bool bShouldSnapRotationWhenAttached : 1; // 0x181:0(0x1)
		bool bShouldSnapScaleWhenAttached : 1; // 0x181:1(0x1)
		bool bShouldUpdatePhysicsVolume : 1; // 0x181:2(0x1)
		bool bHiddenInGame : 1; // 0x181:3(0x1)
		bool bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x181:4(0x1)
		bool bUseAttachParentBound : 1; // 0x181:5(0x1)
		bool bComputeFastLocalBounds : 1; // 0x181:6(0x1)
		bool bComputeBoundsOnceForGame : 1; // 0x181:7(0x1)
		bool bComputedBoundsOnceForGame : 1; // 0x182:0(0x1)
		bool bIsNotRenderAttachmentRoot : 1; // 0x182:1(0x1)
		TEnumAsByte Mobility; // 0x183(0x1)
		TEnumAsByte DetailMode; // 0x184(0x1)
		FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x185(0x1)
		unsigned char UnknownData09_7[0x9A]; // 0x186(0x9A) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SceneComponent");
			return ret;
		}

		void ToggleVisibility(bool bPropagateToChildren); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4110257D0
		void SetWorldScale3D(FVector NewScale); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110256F0
		void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Flags: Final|Native|Public|BlueprintCallable 0x7FF411025610
		void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411025530
		void SetRelativeScale3D(FVector NewScale3D); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025450
		void SetMobility(TEnumAsByte NewMobility); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF411025308
		void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Flags: Final|Native|Public|BlueprintCallable 0x7FF411025228
		void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411025148
		void ResetRelativeTransform(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411025068
		void OnRep_Visibility(bool OldValue); // Flags: Final|RequiredAPI|Native|Private 0x7FF411024F88
		void OnRep_Transform(); // Flags: Final|RequiredAPI|Native|Private 0x7FF411024EA8
		void OnRep_AttachSocketName(); // Flags: Final|RequiredAPI|Native|Private 0x7FF411024DC8
		void OnRep_AttachParent(); // Flags: Final|RequiredAPI|Native|Private 0x7FF411024CE8
		void OnRep_AttachChildren(); // Flags: Final|RequiredAPI|Native|Private 0x7FF411024C08
		void K2_SetWorldTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411024B28
		void K2_SetWorldRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411024A48
		void K2_SetWorldLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411024968
		void K2_SetWorldLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411024888
		void K2_SetRelativeTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4110247A8
		void K2_SetRelativeRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4110246C8
		void K2_SetRelativeLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4110245E8
		void K2_SetRelativeLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411024508
		FTransform K2_GetComponentToWorld(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411024428
		FVector K2_GetComponentScale(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411024348
		FRotator K2_GetComponentRotation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411024268
		FVector K2_GetComponentLocation(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411024188
		void K2_DetachFromComponent(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule, bool bCallModify); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411024040
		bool K2_AttachToComponent(USceneComponent Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411023EF8
		bool K2_AttachTo(USceneComponent InParent, FName InSocketName, TEnumAsByte AttachType, bool bWeldSimulatedBodies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411023DB0
		void K2_AddWorldTransformKeepScale(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023CD0
		void K2_AddWorldTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023BF0
		void K2_AddWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023B10
		void K2_AddWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023A30
		void K2_AddRelativeRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023950
		void K2_AddRelativeLocation(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023870
		void K2_AddLocalTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411023790
		void K2_AddLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4110236B0
		void K2_AddLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4110235D0
		bool IsVisible(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110234F0
		bool IsSimulatingPhysics(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411023410
		bool IsAnySimulatingPhysics(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411023330
		FVector GetUpVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411023250
		FTransform GetSocketTransform(FName InSocketName, TEnumAsByte TransformSpace); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411023108
		FRotator GetSocketRotation(FName InSocketName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411023028
		FQuat GetSocketQuaternion(FName InSocketName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411022F48
		FVector GetSocketLocation(FName InSocketName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411022E68
		bool GetShouldUpdatePhysicsVolume(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411022D88
		FVector GetRightVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411022CA8
		FTransform GetRelativeTransform(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411022BC8
		APhysicsVolume GetPhysicsVolume(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411022AE8
		void GetParentComponents(TArray& Parents); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF411022A08
		int32_t GetNumChildrenComponents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411022928
		FVector GetForwardVector(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411022848
		FVector GetComponentVelocity(); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411022768
		void GetChildrenComponents(bool bIncludeAllDescendants, TArray& Children); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF411022688
		USceneComponent GetChildComponent(int32_t ChildIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110225A8
		FName GetAttachSocketName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110224C8
		USceneComponent GetAttachParent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110223E8
		TArray GetAllSocketNames(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411022308
		bool DoesSocketExist(FName InSocketName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411022228
		void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF411022148
	};


	// Class Engine.PrimitiveComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x2B0 (0x4D0 - 0x220)
	class UPrimitiveComponent : public USceneComponent	
	{
	public:
		unsigned char UnknownData18_3[0x18]; // 0x220(0x18) UNKNOWN PROPERTY
		float MinDrawDistance; // 0x238(0x4)
		float LDMaxDrawDistance; // 0x23C(0x4)
		float CachedMaxDrawDistance; // 0x240(0x4)
		TEnumAsByte DepthPriorityGroup; // 0x244(0x1)
		TEnumAsByte ViewOwnerDepthPriorityGroup; // 0x245(0x1)
		TEnumAsByte IndirectLightingCacheQuality; // 0x246(0x1)
		ELightmapType LightmapType; // 0x247(0x1)
		EHLODBatchingPolicy HLODBatchingPolicy; // 0x248(0x1)
		EShadowCacheInvalidationBehavior ShadowCacheInvalidationBehavior; // 0x249(0x1)
		bool bEnableAutoLODGeneration : 1; // 0x24A:0(0x1)
		bool bIsActorTextureStreamingBuiltData : 1; // 0x24A:1(0x1)
		bool bIsValidTextureStreamingBuiltData : 1; // 0x24A:2(0x1)
		bool bNeverDistanceCull : 1; // 0x24A:3(0x1)
		unsigned char UnknownBit19 : 1; // 0x24A:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit20 : 1; // 0x24A:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit21 : 1; // 0x24A:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit22 : 1; // 0x24A:7(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit23 : 1; // 0x24B:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit24 : 1; // 0x24B:1(0x1) UNKNOWN PROPERTY
		bool bAlwaysCreatePhysicsState : 1; // 0x24B:2(0x1)
		bool bGenerateOverlapEvents : 1; // 0x24B:3(0x1)
		bool bMultiBodyOverlap : 1; // 0x24B:4(0x1)
		bool bTraceComplexOnMove : 1; // 0x24B:5(0x1)
		bool bReturnMaterialOnMove : 1; // 0x24B:6(0x1)
		bool bUseViewOwnerDepthPriorityGroup : 1; // 0x24B:7(0x1)
		bool bAllowCullDistanceVolume : 1; // 0x24C:0(0x1)
		bool bVisibleInReflectionCaptures : 1; // 0x24C:1(0x1)
		bool bVisibleInRealTimeSkyCaptures : 1; // 0x24C:2(0x1)
		bool bVisibleInRayTracing : 1; // 0x24C:3(0x1)
		bool bRenderInMainPass : 1; // 0x24C:4(0x1)
		bool bRenderInDepthPass : 1; // 0x24C:5(0x1)
		bool bReceivesDecals : 1; // 0x24C:6(0x1)
		bool bHoldout : 1; // 0x24C:7(0x1)
		bool bOwnerNoSee : 1; // 0x24D:0(0x1)
		bool bOnlyOwnerSee : 1; // 0x24D:1(0x1)
		bool bTreatAsBackgroundForOcclusion : 1; // 0x24D:2(0x1)
		bool bUseAsOccluder : 1; // 0x24D:3(0x1)
		bool bSelectable : 1; // 0x24D:4(0x1)
		bool bWantsEditorEffects : 1; // 0x24D:5(0x1)
		bool bForceMipStreaming : 1; // 0x24D:6(0x1)
		bool bHasPerInstanceHitProxies : 1; // 0x24D:7(0x1)
		bool CastShadow : 1; // 0x24E:0(0x1)
		bool bEmissiveLightSource : 1; // 0x24E:1(0x1)
		bool bAffectDynamicIndirectLighting : 1; // 0x24E:2(0x1)
		bool bAffectIndirectLightingWhileHidden : 1; // 0x24E:3(0x1)
		bool bAffectDistanceFieldLighting : 1; // 0x24E:4(0x1)
		bool bCastDynamicShadow : 1; // 0x24E:5(0x1)
		bool bCastStaticShadow : 1; // 0x24E:6(0x1)
		bool bCastVolumetricTranslucentShadow : 1; // 0x24E:7(0x1)
		bool bCastContactShadow : 1; // 0x24F:0(0x1)
		bool bSelfShadowOnly : 1; // 0x24F:1(0x1)
		bool bCastFarShadow : 1; // 0x24F:2(0x1)
		bool bCastInsetShadow : 1; // 0x24F:3(0x1)
		bool bCastCinematicShadow : 1; // 0x24F:4(0x1)
		bool bCastHiddenShadow : 1; // 0x24F:5(0x1)
		bool bCastShadowAsTwoSided : 1; // 0x24F:6(0x1)
		bool bLightAsIfStatic : 1; // 0x24F:7(0x1)
		bool bLightAttachmentsAsGroup : 1; // 0x250:0(0x1)
		bool bExcludeFromLightAttachmentGroup : 1; // 0x250:1(0x1)
		bool bReceiveMobileCSMShadows : 1; // 0x250:2(0x1)
		bool bSingleSampleShadowFromStationaryLights : 1; // 0x250:3(0x1)
		bool bIgnoreRadialImpulse : 1; // 0x250:4(0x1)
		bool bIgnoreRadialForce : 1; // 0x250:5(0x1)
		bool bApplyImpulseOnDamage : 1; // 0x250:6(0x1)
		bool bReplicatePhysicsToAutonomousProxy : 1; // 0x250:7(0x1)
		bool bFillCollisionUnderneathForNavmesh : 1; // 0x251:0(0x1)
		bool AlwaysLoadOnClient : 1; // 0x251:1(0x1)
		bool AlwaysLoadOnServer : 1; // 0x251:2(0x1)
		bool bUseEditorCompositing : 1; // 0x251:3(0x1)
		bool bIsBeingMovedByEditor : 1; // 0x251:4(0x1)
		bool bRenderCustomDepth : 1; // 0x251:5(0x1)
		bool bVisibleInSceneCaptureOnly : 1; // 0x251:6(0x1)
		bool bHiddenInSceneCapture : 1; // 0x251:7(0x1)
		bool bRayTracingFarField : 1; // 0x252:0(0x1)
		bool bIsFirstPerson : 1; // 0x252:1(0x1)
		unsigned char UnknownBit25 : 1; // 0x252:2(0x1) UNKNOWN PROPERTY
		bool bHasNoStreamableTextures : 1; // 0x252:3(0x1)
		bool bStaticWhenNotMoveable : 1; // 0x252:4(0x1)
		unsigned char UnknownData26_5[0x1]; // 0x253(0x1) UNKNOWN PROPERTY
		TEnumAsByte bHasCustomNavigableGeometry; // 0x254(0x1)
		unsigned char UnknownData27_6[0x1]; // 0x255(0x1) UNKNOWN PROPERTY
		TEnumAsByte CanCharacterStepUpOn; // 0x256(0x1)
		FLightingChannels LightingChannels; // 0x257(0x1)
		unsigned char UnknownData28_6[0x18]; // 0x258(0x18) UNKNOWN PROPERTY
		int32_t RayTracingGroupId; // 0x270(0x4)
		int32_t VisibilityId; // 0x274(0x4)
		int32_t CustomDepthStencilValue; // 0x278(0x4)
		ERayTracingGroupCullingPriority RayTracingGroupCullingPriority; // 0x27C(0x1)
		ERendererStencilMask CustomDepthStencilWriteMask; // 0x27D(0x1)
		char ExcludeFromHLODLevels; // 0x27E(0x1)
		unsigned char UnknownData29_6[0x1]; // 0x27F(0x1) UNKNOWN PROPERTY
		FCustomPrimitiveData CustomPrimitiveData; // 0x280(0x10)
		FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x290(0x10)
		unsigned char UnknownData30_6[0x8]; // 0x2A0(0x8) UNKNOWN PROPERTY
		int32_t TranslucencySortPriority; // 0x2A8(0x4)
		float TranslucencySortDistanceOffset; // 0x2AC(0x4)
		TArray RuntimeVirtualTextures; // 0x2B0(0x10)
		int8_t VirtualTextureLodBias; // 0x2C0(0x1)
		int8_t VirtualTextureCullMips; // 0x2C1(0x1)
		int8_t VirtualTextureMinCoverage; // 0x2C2(0x1)
		ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2C3(0x1)
		unsigned char UnknownData31_6[0x8]; // 0x2C4(0x8) UNKNOWN PROPERTY
		float BoundsScale; // 0x2CC(0x4)
		unsigned char UnknownData32_6[0x30]; // 0x2D0(0x30) UNKNOWN PROPERTY
		TArray MoveIgnoreActors; // 0x300(0x10)
		TArray MoveIgnoreComponents; // 0x310(0x10)
		unsigned char UnknownData33_6[0x10]; // 0x320(0x10) UNKNOWN PROPERTY
		FBodyInstance BodyInstance; // 0x330(0x170)
		FMulticastSparseDelegate OnComponentHit; // 0x4A0(0x1)
		FMulticastSparseDelegate OnComponentBeginOverlap; // 0x4A1(0x1)
		FMulticastSparseDelegate OnComponentEndOverlap; // 0x4A2(0x1)
		FMulticastSparseDelegate OnComponentWake; // 0x4A3(0x1)
		FMulticastSparseDelegate OnComponentSleep; // 0x4A4(0x1)
		unsigned char UnknownData34_6[0x1]; // 0x4A5(0x1) UNKNOWN PROPERTY
		FMulticastSparseDelegate OnComponentPhysicsStateChanged; // 0x4A6(0x1)
		FMulticastSparseDelegate OnBeginCursorOver; // 0x4A7(0x1)
		FMulticastSparseDelegate OnEndCursorOver; // 0x4A8(0x1)
		FMulticastSparseDelegate OnClicked; // 0x4A9(0x1)
		FMulticastSparseDelegate OnReleased; // 0x4AA(0x1)
		FMulticastSparseDelegate OnInputTouchBegin; // 0x4AB(0x1)
		FMulticastSparseDelegate OnInputTouchEnd; // 0x4AC(0x1)
		FMulticastSparseDelegate OnInputTouchEnter; // 0x4AD(0x1)
		FMulticastSparseDelegate OnInputTouchLeave; // 0x4AE(0x1)
		unsigned char UnknownData35_6[0x11]; // 0x4AF(0x11) UNKNOWN PROPERTY
		UPrimitiveComponent LODParentPrimitive; // 0x4C0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PrimitiveComponent");
			return ret;
		}

		bool WasRecentlyRendered(float Tolerance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41102E350
		void WakeRigidBody(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102E270
		void WakeAllRigidBodies(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102E190
		void SetWalkableSlopeOverride(FWalkableSlopeOverride& NewOverride); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41102E0B0
		void SetVisibleInSceneCaptureOnly(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102DFD0
		void SetVisibleInRayTracing(bool bNewVisibleInRayTracing); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102DEF0
		void SetVectorParameterForDefaultCustomPrimitiveData(FName ParameterName, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102DE10
		void SetVectorParameterForCustomPrimitiveData(FName ParameterName, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102DD30
		void SetUseMACD(bool InUseMACD, FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102DC50
		void SetUseCCD(bool InUseCCD, FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102DB70
		void SetUpdateKinematicFromSimulation(bool bUpdateKinematicFromSimulation); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102DA90
		void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D9B0
		void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D8D0
		void SetStaticWhenNotMoveable(bool bInStaticWhenNotMoveable); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D7F0
		void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D710
		void SetSimulatePhysics(bool bSimulate); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D630
		void SetScalarParameterForDefaultCustomPrimitiveData(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D550
		void SetScalarParameterForCustomPrimitiveData(FName ParameterName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D470
		void SetRenderInMainPass(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D390
		void SetRenderInDepthPass(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D2B0
		void SetRenderCustomDepth(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D1D0
		void SetReceivesDecals(bool bNewReceivesDecals); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D0F0
		void SetPhysMaterialOverride(UPhysicalMaterial NewPhysMaterial); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102D010
		void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102CF30
		void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, FName BoneName); // Flags: Final|Native|Public|BlueprintCallable 0x7FF41102CE50
		void SetPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102CD70
		void SetPhysicsAngularVelocityInRadians(FVector NewAngVel, bool bAddToCurrent, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102CC90
		void SetPhysicsAngularVelocityInDegrees(FVector NewAngVel, bool bAddToCurrent, FName BoneName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102CBB0
		void SetOwnerNoSee(bool bNewOwnerNoSee); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102CAD0
		void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C9F0
		void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C910
		void SetMaxDepenetrationVelocity(FName BoneName, float InMaxDepenetrationVelocity); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C830
		void SetMaterialByName(FName MaterialSlotName, UMaterialInterface Material); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C750
		void SetMaterial(int32_t ElementIndex, UMaterialInterface Material); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C670
		void SetMassScale(FName BoneName, float InMassScale); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C590
		void SetMassOverrideInKg(FName BoneName, float MassInKg, bool bOverrideMass); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C4B0
		void SetLinearDamping(float InDamping); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C3D0
		void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C2F0
		void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C210
		void SetIsFirstPerson(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102C130
		void SetIgnoreBoundsForEditorFocus(bool bIgnore); // Flags: Final|Native|Public|BlueprintCallable 0x7FF41102C050
		void SetHoldout(bool bNewHoldout); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102BF70
		void SetHiddenInSceneCapture(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102BE90
		void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102BDB0
		void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102BCD0
		void SetExcludeForSpecificHLODLevels(TArray& InExcludeForSpecificHLODLevels); // Flags: Final|RequiredAPI|Native|Private|HasOutParms|BlueprintCallable 0x7FF41102BBF0
		void SetExcludedFromHLODLevel(EHLODLevelExclusion HLODLevel, bool bExcluded); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102BB10
		void SetEnableGravity(bool bGravityEnabled); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102BA30
		void SetEmissiveLightSource(bool NewEmissiveLightSource); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102B950
		void SetDefaultCustomPrimitiveDataVector4(int32_t DataIndex, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102B870
		void SetDefaultCustomPrimitiveDataVector3(int32_t DataIndex, FVector Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102B790
		void SetDefaultCustomPrimitiveDataVector2(int32_t DataIndex, FVector2D Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102B6B0
		void SetDefaultCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102B5D0
		void SetCustomPrimitiveDataVector4(int32_t DataIndex, FVector4 Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102B4F0
		void SetCustomPrimitiveDataVector3(int32_t DataIndex, FVector Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102B410
		void SetCustomPrimitiveDataVector2(int32_t DataIndex, FVector2D Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102B330
		void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102B250
		void SetCustomDepthStencilWriteMask(ERendererStencilMask WriteMaskBit); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102B108
		void SetCustomDepthStencilValue(int32_t Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102B028
		void SetCullDistance(float NewCullDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102AF48
		void SetConstraintMode(TEnumAsByte ConstraintMode); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102AE00
		void SetCollisionResponseToChannel(TEnumAsByte Channel, TEnumAsByte NewResponse); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102AD20
		void SetCollisionResponseToAllChannels(TEnumAsByte NewResponse); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102AC40
		void SetCollisionProfileName(FName InCollisionProfileName, bool bUpdateOverlaps); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102AB60
		void SetCollisionObjectType(TEnumAsByte Channel); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102AA80
		void SetCollisionEnabled(TEnumAsByte NewType); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A9A0
		void SetCenterOfMass(FVector CenterOfMassOffset, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102A8C0
		void SetCastShadow(bool NewCastShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A7E0
		void SetCastInsetShadow(bool bInCastInsetShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A700
		void SetCastHiddenShadow(bool NewCastHiddenShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A620
		void SetCastContactShadow(bool bInCastContactShadow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A540
		void SetBoundsScale(float NewBoundsScale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A460
		void SetAngularDamping(float InDamping); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A380
		void SetAllUseMACD(bool InUseMACD); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A2A0
		void SetAllUseCCD(bool InUseCCD); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102A1C0
		void SetAllPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102A0E0
		void SetAllPhysicsAngularVelocityInRadians(FVector& NewAngVel, bool bAddToCurrent); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41102A000
		void SetAllPhysicsAngularVelocityInDegrees(FVector& NewAngVel, bool bAddToCurrent); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411029F20
		void SetAllMassScale(float InMassScale); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF411029E40
		void SetAffectIndirectLightingWhileHidden(bool bNewAffectIndirectLightingWhileHidden); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411029D60
		void SetAffectDynamicIndirectLighting(bool bNewAffectDynamicIndirectLighting); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411029C80
		void SetAffectDistanceFieldLighting(bool NewAffectDistanceFieldLighting); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411029BA0
		FVector ScaleByMomentOfInertia(FVector InputVector, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411029AC0
		void PutRigidBodyToSleep(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4110299E0
		bool K2_SphereTraceComponent(FVector TraceStart, FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411029900
		bool K2_SphereOverlapComponent(FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411029820
		bool K2_LineTraceComponent(FVector TraceStart, FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF411029740
		bool K2_IsQueryCollisionEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411029660
		bool K2_IsPhysicsCollisionEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411029580
		bool K2_IsCollisionEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110294A0
		bool K2_BoxOverlapComponent(FVector InBoxCentre, FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4110293C0
		bool IsOverlappingComponent(UPrimitiveComponent OtherComp); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110292E0
		bool IsOverlappingActor(AActor Other); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411029200
		bool IsMaterialSlotNameValid(FName MaterialSlotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411029120
		bool IsGravityEnabled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411029040
		bool IsExcludedFromHLODLevel(EHLODLevelExclusion HLODLevel); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411028EF8
		bool IsAnyRigidBodyAwake(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF411028E18
		void InvalidateLumenSurfaceCache(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411028D38
		void IgnoreComponentWhenMoving(UPrimitiveComponent Component, bool bShouldIgnore); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411028C58
		void IgnoreActorWhenMoving(AActor Actor, bool bShouldIgnore); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411028B78
		FWalkableSlopeOverride GetWalkableSlopeOverride(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411028970
		bool GetUpdateKinematicFromSimulation(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411028890
		bool GetStaticWhenNotMoveable(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110287B0
		FVector GetPhysicsLinearVelocityAtPoint(FVector Point, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110286D0
		FVector GetPhysicsLinearVelocity(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110285F0
		FVector GetPhysicsAngularVelocityInRadians(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411028510
		FVector GetPhysicsAngularVelocityInDegrees(FName BoneName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411028430
		void GetOverlappingComponents(TArray& OutOverlappingComponents); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF411028350
		void GetOverlappingActors(TArray& OverlappingActors, UClass ClassFilter); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF411028270
		int32_t GetNumMaterials(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411028190
		float GetMaxDepenetrationVelocity(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4110280B0
		TArray GetMaterialSlotNames(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027FD0
		int32_t GetMaterialIndex(FName MaterialSlotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027EF0
		UMaterialInterface GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF411027E10
		UMaterialInterface GetMaterialByName(FName MaterialSlotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027D30
		UMaterialInterface GetMaterial(int32_t ElementIndex); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027C50
		float GetMassScale(FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027B70
		float GetMass(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027A90
		float GetLinearDamping(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110279B0
		FVector GetInertiaTensor(FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4110278D0
		bool GetIgnoreBoundsForEditorFocus(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4110277F0
		bool GetGenerateOverlapEvents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027710
		TArray GetExcludeForSpecificHLODLevels(); // Flags: Final|RequiredAPI|Native|Private|BlueprintCallable|BlueprintPure|Const 0x7FF411027630
		int32_t GetCustomPrimitiveDataIndexForVectorParameter(FName ParameterName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027550
		int32_t GetCustomPrimitiveDataIndexForScalarParameter(FName ParameterName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027470
		TEnumAsByte GetCollisionResponseToChannel(TEnumAsByte Channel); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027328
		FName GetCollisionProfileName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027248
		TEnumAsByte GetCollisionObjectType(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411027100
		TEnumAsByte GetCollisionEnabled(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411026FB8
		float GetClosestPointOnCollision(FVector& Point, FVector& OutPointOnBody, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411026ED8
		FVector GetCenterOfMass(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF411026DF8
		FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(FName BoneName, bool bGetWelded, int32_t Index); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411026C58
		float GetAngularDamping(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411026B78
		UMaterialInstanceDynamic CreateDynamicMaterialInstance(int32_t ElementIndex, UMaterialInterface SourceMaterial, FName OptionalName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF411026A98
		UMaterialInstanceDynamic CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, UMaterialInterface Parent); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4110269B8
		UMaterialInstanceDynamic CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4110268D8
		TArray CopyArrayOfMoveIgnoreComponents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4110267F8
		TArray CopyArrayOfMoveIgnoreActors(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411026718
		void ClearMoveIgnoreComponents(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF411026638
		void ClearMoveIgnoreActors(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF411026558
		bool CanCharacterStepUp(APawn Pawn); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF411026478
		bool AllowHLODLevelsExclusion(); // Flags: Final|Native|Private|Const 0x7FF411026398
		void AddVelocityChangeImpulseAtLocation(FVector Impulse, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110262B8
		void AddTorqueInRadians(FVector Torque, FName BoneName, bool bAccelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110261D8
		void AddTorqueInDegrees(FVector Torque, FName BoneName, bool bAccelChange); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110260F8
		void AddRadialImpulse(FVector Origin, float Radius, float Strength, TEnumAsByte Falloff, bool bVelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411026018
		void AddRadialForce(FVector Origin, float Radius, float Strength, TEnumAsByte Falloff, bool bAccelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025F38
		void AddImpulseAtLocation(FVector Impulse, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025E58
		void AddImpulse(FVector Impulse, FName BoneName, bool bVelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025D78
		void AddForceAtLocationLocal(FVector Force, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025C98
		void AddForceAtLocation(FVector Force, FVector Location, FName BoneName); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025BB8
		void AddForce(FVector Force, FName BoneName, bool bAccelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025AD8
		void AddAngularImpulseInRadians(FVector Impulse, FName BoneName, bool bVelChange); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4110259F8
		void AddAngularImpulseInDegrees(FVector Impulse, FName BoneName, bool bVelChange); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF411025918
	};


	// Class Engine.MeshComponent
	// Inherited from UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x38 (0x500 - 0x4C8)
	class UMeshComponent : public UPrimitiveComponent	
	{
	public:
		TArray OverrideMaterials; // 0x4C8(0x10)
		UMaterialInterface OverlayMaterial; // 0x4D8(0x8)
		float OverlayMaterialMaxDrawDistance; // 0x4E0(0x4)
		bool bEnableMaterialParameterCaching : 1; // 0x4E4:0(0x1)
		unsigned char UnknownData01_7[0x13]; // 0x4E5(0x13) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MeshComponent");
			return ret;
		}

		void SetVectorParameterValueOnMaterials(FName ParameterName, FVector ParameterValue); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF41102F418
		void SetScalarParameterValueOnMaterials(FName ParameterName, float ParameterValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102F338
		void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102F258
		void SetOverlayMaterial(UMaterialInterface NewOverlayMaterial); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102F178
		void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102F098
		bool PrestreamMeshLODs(float Seconds); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41102EFB8
		float GetOverlayMaterialMaxDrawDistance(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41102EED8
		UMaterialInterface GetOverlayMaterial(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41102EDF8
		TArray GetMaterials(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41102ED18
	};


	// Class Engine.StaticMeshComponent
	// Inherited from UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x98 (0x590 - 0x4F8)
	class UStaticMeshComponent : public UMeshComponent	
	{
	public:
		int32_t ForcedLodModel; // 0x4F8(0x4)
		int32_t MinLOD; // 0x4FC(0x4)
		int32_t SubDivisionStepSize; // 0x500(0x4)
		FColor WireframeColorOverride; // 0x504(0x4)
		UStaticMesh StaticMesh; // 0x508(0x8)
		int32_t WorldPositionOffsetDisableDistance; // 0x510(0x4)
		bool bForceNaniteForMasked : 1; // 0x514:0(0x1)
		bool bDisallowNanite : 1; // 0x514:1(0x1)
		bool bForceDisableNanite : 1; // 0x514:2(0x1)
		bool bEvaluateWorldPositionOffset : 1; // 0x514:3(0x1)
		bool bWorldPositionOffsetWritesVelocity : 1; // 0x514:4(0x1)
		bool bEvaluateWorldPositionOffsetInRayTracing : 1; // 0x514:5(0x1)
		unsigned char UnknownBit05 : 1; // 0x514:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit06 : 1; // 0x514:7(0x1) UNKNOWN PROPERTY
		bool bOverrideWireframeColor : 1; // 0x515:0(0x1)
		bool bOverrideMinLOD : 1; // 0x515:1(0x1)
		bool bOverrideNavigationExport : 1; // 0x515:2(0x1)
		bool bForceNavigationObstacle : 1; // 0x515:3(0x1)
		bool bDisallowMeshPaintPerInstance : 1; // 0x515:4(0x1)
		bool bMeshPaintTexture : 1; // 0x515:5(0x1)
		bool bIgnoreInstanceForTextureStreaming : 1; // 0x515:6(0x1)
		bool bOverrideLightMapRes : 1; // 0x515:7(0x1)
		bool bCastDistanceFieldIndirectShadow : 1; // 0x516:0(0x1)
		bool bOverrideDistanceFieldSelfShadowBias : 1; // 0x516:1(0x1)
		bool bUseSubDivisions : 1; // 0x516:2(0x1)
		bool bUseDefaultCollision : 1; // 0x516:3(0x1)
		bool bSortTriangles : 1; // 0x516:4(0x1)
		bool bReverseCulling : 1; // 0x516:5(0x1)
		unsigned char UnknownData07_5[0x1]; // 0x517(0x1) UNKNOWN PROPERTY
		UTexture MeshPaintTexture; // 0x518(0x8)
		UTexture MeshPaintTextureOverride; // 0x520(0x8)
		int32_t OverriddenLightMapRes; // 0x528(0x4)
		float DistanceFieldIndirectShadowMinVisibility; // 0x52C(0x4)
		float DistanceFieldSelfShadowBias; // 0x530(0x4)
		float StreamingDistanceMultiplier; // 0x534(0x4)
		float NanitePixelProgrammableDistance; // 0x538(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x53C(0x4) UNKNOWN PROPERTY
		TArray LODData; // 0x540(0x10)
		TArray StreamingTextureData; // 0x550(0x10)
		FLightmassPrimitiveSettings LightmassSettings; // 0x560(0x18)
		unsigned char UnknownData09_7[0x18]; // 0x578(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.StaticMeshComponent");
			return ret;
		}

		void UpdateInitialEvaluateWorldPositionOffset(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140A5B38
		void SetWorldPositionOffsetDisableDistance(int32_t NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A5A58
		bool SetStaticMesh(UStaticMesh NewMesh); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A5978
		void SetReverseCulling(bool ReverseCulling); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A5898
		void SetForcedLodModel(int32_t NewForcedLodModel); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A57B8
		void SetForceDisableNanite(bool bInForceDisableNanite); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A56D8
		void SetEvaluateWorldPositionOffsetInRayTracing(bool NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A55F8
		void SetEvaluateWorldPositionOffset(bool NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A5518
		void SetDistanceFieldSelfShadowBias(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4140A5438
		void OnRep_StaticMesh(UStaticMesh OldStaticMesh); // Flags: Final|RequiredAPI|Native|Public 0x7FF4140A5358
		void GetLocalBounds(FVector& Min, FVector& Max); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4140A5278
		bool GetInitialEvaluateWorldPositionOffset(); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4140A5198
	};


	// Class Engine.InstancedStaticMeshComponent
	// Inherited from UStaticMeshComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x350 (0x8E0 - 0x590)
	class UInstancedStaticMeshComponent : public UStaticMeshComponent	
	{
	public:
		unsigned char UnknownData04_3[0x8]; // 0x590(0x8) UNKNOWN PROPERTY
		TArray PerInstanceSMData; // 0x598(0x10)
		TArray PerInstancePrevTransform; // 0x5A8(0x10)
		FBox NavigationBounds; // 0x5B8(0x38)
		FTransform PreviousComponentTransform; // 0x5F0(0x60)
		int32_t NumCustomDataFloats; // 0x650(0x4)
		int32_t InstancingRandomSeed; // 0x654(0x4)
		TArray PerInstanceSMCustomData; // 0x658(0x10)
		TArray AdditionalRandomSeeds; // 0x668(0x10)
		float InstanceLODDistanceScale; // 0x678(0x4)
		int32_t InstanceStartCullDistance; // 0x67C(0x4)
		int32_t InstanceEndCullDistance; // 0x680(0x4)
		bool bUseGpuLodSelection : 1; // 0x684:0(0x1)
		bool bInheritPerInstanceData : 1; // 0x684:1(0x1)
		bool bDisableCollision : 1; // 0x684:2(0x1)
		unsigned char UnknownData05_5[0x3]; // 0x685(0x3) UNKNOWN PROPERTY
		TArray InstanceReorderTable; // 0x688(0x10)
		unsigned char UnknownData06_6[0xB0]; // 0x698(0xB0) UNKNOWN PROPERTY
		int32_t NumPendingLightmaps; // 0x748(0x4)
		unsigned char UnknownData07_6[0x184]; // 0x74C(0x184) UNKNOWN PROPERTY
		TArray CachedMappings; // 0x8D0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.InstancedStaticMeshComponent");
			return ret;
		}

		bool UpdateInstanceTransform(int32_t InstanceIndex, FTransform& NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41449B858
		void SetNumCustomDataFloats(int32_t InNumCustomDataFloats); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449B778
		void SetLODDistanceScale(float InLODDistanceScale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449B698
		bool SetCustomDataValue(int32_t InstanceIndex, int32_t CustomDataIndex, float CustomDataValue, bool bMarkRenderStateDirty); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449B5B8
		void SetCullDistances(int32_t StartCullDistance, int32_t EndCullDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449B4D8
		bool RemoveInstances(TArray& InstancesToRemove); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41449B3F8
		bool RemoveInstance(int32_t InstanceIndex); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449B318
		bool IsValidInstance(int32_t InstanceIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449B238
		float GetLODDistanceScale(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449B158
		bool GetInstanceTransform(int32_t InstanceIndex, FTransform& OutInstanceTransform, bool bWorldSpace); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41449B078
		TArray GetInstancesOverlappingSphere(FVector& Center, float Radius, bool bSphereInWorldSpace); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41449AF98
		TArray GetInstancesOverlappingBox(FBox& Box, bool bBoxInWorldSpace); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41449AEB8
		int32_t GetInstanceCount(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449ADD8
		void GetCullDistances(int32_t& OutStartCullDistance, int32_t& OutEndCullDistance); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF41449ACF8
		void ClearInstances(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449AC18
		bool BatchUpdateInstancesTransforms(int32_t StartInstanceIndex, TArray& NewInstancesTransforms, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41449AB38
		bool BatchUpdateInstancesTransform(int32_t StartInstanceIndex, int32_t NumInstances, FTransform& NewInstancesTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41449AA58
		int32_t AddInstanceWorldSpace(FTransform& WorldTransform); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41449A978
		TArray AddInstances(TArray& InstanceTransforms, bool bShouldReturnIndices, bool bWorldSpace, bool bUpdateNavigation); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41449A898
		int32_t AddInstance(FTransform& InstanceTransform, bool bWorldSpace); // Flags: RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41449A7B8
	};


	// Class Engine.HierarchicalInstancedStaticMeshComponent
	// Inherited from UInstancedStaticMeshComponent -> UStaticMeshComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x1A0 (0xA80 - 0x8E0)
	class UHierarchicalInstancedStaticMeshComponent : public UInstancedStaticMeshComponent	
	{
	public:
		unsigned char UnknownData06_3[0x10]; // 0x8E0(0x10) UNKNOWN PROPERTY
		bool bUseTranslatedInstanceSpace : 1; // 0x8F0:0(0x1)
		unsigned char UnknownData07_5[0x7]; // 0x8F1(0x7) UNKNOWN PROPERTY
		FVector TranslatedInstanceSpaceOrigin; // 0x8F8(0x18)
		TArray SortedInstances; // 0x910(0x10)
		int32_t NumBuiltInstances; // 0x920(0x4)
		unsigned char UnknownData08_6[0x4]; // 0x924(0x4) UNKNOWN PROPERTY
		FBox BuiltInstanceBounds; // 0x928(0x38)
		FBox UnbuiltInstanceBounds; // 0x960(0x38)
		TArray UnbuiltInstanceBoundsList; // 0x998(0x10)
		bool bEnableDensityScaling : 1; // 0x9A8:0(0x1)
		unsigned char UnknownData09_5[0x7]; // 0x9A9(0x7) UNKNOWN PROPERTY
		int32_t OcclusionLayerNumNodes; // 0x9B0(0x4)
		unsigned char UnknownData10_6[0x4]; // 0x9B4(0x4) UNKNOWN PROPERTY
		FBoxSphereBounds CacheMeshExtendedBounds; // 0x9B8(0x38)
		int32_t InstanceCountToRender; // 0x9F0(0x4)
		unsigned char UnknownData11_7[0x84]; // 0x9F4(0x84) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.HierarchicalInstancedStaticMeshComponent");
			return ret;
		}
	};


	// Class Engine.PartitionActor
	// Inherited from AActor -> UObject
	// Size: 0x0 (0x290 - 0x290)
	class APartitionActor : public AActor	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PartitionActor");
			return ret;
		}
	};


	// Class Engine.ISMPartitionActor
	// Inherited from APartitionActor -> AActor -> UObject
	// Size: 0x10 (0x2A0 - 0x290)
	class AISMPartitionActor : public APartitionActor	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x290(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ISMPartitionActor");
			return ret;
		}
	};


	// Class Engine.StaticMeshActor
	// Inherited from AActor -> UObject
	// Size: 0x10 (0x2A0 - 0x290)
	class AStaticMeshActor : public AActor	
	{
	public:
		UStaticMeshComponent StaticMeshComponent; // 0x290(0x8)
		bool bStaticMeshReplicateMovement; // 0x298(0x1)
		EPhysicsReplicationMode StaticMeshPhysicsReplicationMode; // 0x299(0x1)
		ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x29A(0x1)
		unsigned char UnknownData01_7[0x5]; // 0x29B(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.StaticMeshActor");
			return ret;
		}

		void SetMobility(TEnumAsByte InMobility); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449BBD8
	};


	// Class Engine.Brush
	// Inherited from AActor -> UObject
	// Size: 0x38 (0x2C8 - 0x290)
	class ABrush : public AActor	
	{
	public:
		TEnumAsByte BrushType; // 0x290(0x1)
		unsigned char UnknownData03_6[0x3]; // 0x291(0x3) UNKNOWN PROPERTY
		FColor BrushColor; // 0x294(0x4)
		int32_t PolyFlags; // 0x298(0x4)
		bool bColored : 1; // 0x29C:0(0x1)
		bool bSolidWhenSelected : 1; // 0x29C:1(0x1)
		bool bPlaceableFromClassBrowser : 1; // 0x29C:2(0x1)
		bool bNotForClientOrServer : 1; // 0x29C:3(0x1)
		unsigned char UnknownData04_5[0x3]; // 0x29D(0x3) UNKNOWN PROPERTY
		UModel Brush; // 0x2A0(0x8)
		UBrushComponent BrushComponent; // 0x2A8(0x8)
		unsigned char UnknownData05_7[0x18]; // 0x2B0(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Brush");
			return ret;
		}
	};


	// Class Engine.Volume
	// Inherited from ABrush -> AActor -> UObject
	// Size: 0x0 (0x2C8 - 0x2C8)
	class AVolume : public ABrush	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Volume");
			return ret;
		}
	};


	// Class Engine.StreamableRenderAsset
	// Inherited from UObject
	// Size: 0xA0 (0xC8 - 0x28)
	class UStreamableRenderAsset : public UObject	
	{
	public:
		unsigned char UnknownData03_3[0x18]; // 0x28(0x18) UNKNOWN PROPERTY
		double ForceMipLevelsToBeResidentTimestamp; // 0x40(0x8)
		int32_t NumCinematicMipLevels; // 0x48(0x4)
		unsigned char UnknownData04_6[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY
		FPerQualityLevelInt NoRefStreamingLODBias; // 0x50(0x68)
		int32_t StreamingIndex; // 0xB8(0x4)
		bool NeverStream : 1; // 0xBC:0(0x1)
		bool bGlobalForceMipLevelsToBeResident : 1; // 0xBC:1(0x1)
		bool bHasStreamingUpdatePending : 1; // 0xBC:2(0x1)
		bool bForceMiplevelsToBeResident : 1; // 0xBC:3(0x1)
		bool bIgnoreStreamingMipBias : 1; // 0xBC:4(0x1)
		bool bUseCinematicMipLevels : 1; // 0xBC:5(0x1)
		unsigned char UnknownData05_7[0xB]; // 0xBD(0xB) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.StreamableRenderAsset");
			return ret;
		}

		void SetForceMipLevelsToBeResident(float Seconds, int32_t CinematicLODGroupMask); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449CAB8
	};


	// Class Engine.MaterialInterface
	// Inherited from UObject
	// Size: 0x90 (0xB8 - 0x28)
	class UMaterialInterface : public UObject	
	{
	public:
		unsigned char UnknownData04_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		USubsurfaceProfile SubsurfaceProfile; // 0x38(0x8)
		TArray SpecularProfiles; // 0x40(0x10)
		UNeuralProfile NeuralProfile; // 0x50(0x8)
		unsigned char UnknownData05_6[0x20]; // 0x58(0x20) UNKNOWN PROPERTY
		FLightmassMaterialInterfaceSettings LightmassSettings; // 0x78(0x10)
		TArray TextureStreamingData; // 0x88(0x10)
		TArray AssetUserData; // 0x98(0x10)
		unsigned char UnknownData06_6[0x4]; // 0xA8(0x4) UNKNOWN PROPERTY
		bool bIncludedInBaseGame : 1; // 0xAC:0(0x1)
		unsigned char UnknownData07_7[0xB]; // 0xAD(0xB) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialInterface");
			return ret;
		}

		void SetForceMipLevelsToBeResident(bool OverrideForceMiplevelsToBeResident, bool bForceMiplevelsToBeResidentValue, float ForceDuration, int32_t CinematicTextureGroups, bool bFastResponse); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449D6F8
		UPhysicalMaterialMask GetPhysicalMaterialMask(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449D618
		UPhysicalMaterial GetPhysicalMaterialFromMap(int32_t Index); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449D538
		UPhysicalMaterial GetPhysicalMaterial(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449D458
		FMaterialParameterInfo GetParameterInfo(TEnumAsByte Association, FName ParameterName, UMaterialFunctionInterface LayerFunction); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449D378
		UMaterialInterface GetNaniteOverideMaterial(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449D298
		TEnumAsByte GetBlendMode(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449D1B8
		UMaterial GetBaseMaterial(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41449D0D8
	};


	// Class Engine.MaterialInstance
	// Inherited from UMaterialInterface -> UObject
	// Size: 0x1F0 (0x2A8 - 0xB8)
	class UMaterialInstance : public UMaterialInterface	
	{
	public:
		UPhysicalMaterial PhysMaterial; // 0xB8(0x8)
		UPhysicalMaterial PhysicalMaterialMap; // 0xC0(0x40)
		UMaterialInterface Parent; // 0x100(0x8)
		FMaterialOverrideNanite NaniteOverrideMaterial; // 0x108(0x30)
		bool bHasStaticPermutationResource : 1; // 0x138:0(0x1)
		bool bOverrideSubsurfaceProfile : 1; // 0x138:1(0x1)
		bool bOverrideBlendableLocation : 1; // 0x138:2(0x1)
		bool bOverrideBlendablePriority : 1; // 0x138:3(0x1)
		unsigned char UnknownData04_5[0x2]; // 0x139(0x2) UNKNOWN PROPERTY
		TEnumAsByte BlendableLocationOverride; // 0x13B(0x1)
		int32_t BlendablePriorityOverride; // 0x13C(0x4)
		unsigned char UnknownData05_6[0x20]; // 0x140(0x20) UNKNOWN PROPERTY
		TArray ScalarParameterValues; // 0x160(0x10)
		TArray VectorParameterValues; // 0x170(0x10)
		TArray DoubleVectorParameterValues; // 0x180(0x10)
		TArray TextureParameterValues; // 0x190(0x10)
		TArray TextureCollectionParameterValues; // 0x1A0(0x10)
		TArray RuntimeVirtualTextureParameterValues; // 0x1B0(0x10)
		TArray SparseVolumeTextureParameterValues; // 0x1C0(0x10)
		TArray FontParameterValues; // 0x1D0(0x10)
		TArray UserSceneTextureOverrides; // 0x1E0(0x10)
		FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x1F0(0x20)
		unsigned char UnknownData06_6[0x8]; // 0x210(0x8) UNKNOWN PROPERTY
		FStaticParameterSetRuntimeData StaticParametersRuntime; // 0x218(0x60)
		unsigned char UnknownData07_7[0x30]; // 0x278(0x30) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialInstance");
			return ret;
		}
	};


	// Class Engine.MaterialInstanceConstant
	// Inherited from UMaterialInstance -> UMaterialInterface -> UObject
	// Size: 0x8 (0x2B0 - 0x2A8)
	class UMaterialInstanceConstant : public UMaterialInstance	
	{
	public:
		UPhysicalMaterialMask PhysMaterialMask; // 0x2A8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialInstanceConstant");
			return ret;
		}

		FLinearColor K2_GetVectorParameterValue(FName ParameterName); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable 0x7FF41449D998
		UTexture K2_GetTextureParameterValue(FName ParameterName); // Flags: Final|Native|Public|BlueprintCallable 0x7FF41449D8B8
		float K2_GetScalarParameterValue(FName ParameterName); // Flags: Final|Native|Public|BlueprintCallable 0x7FF41449D7D8
	};


	// Class Engine.MaterialExpression
	// Inherited from UObject
	// Size: 0x88 (0xB0 - 0x28)
	class UMaterialExpression : public UObject	
	{
	public:
		int32_t MaterialExpressionEditorX; // 0x28(0x4)
		int32_t MaterialExpressionEditorY; // 0x2C(0x4)
		UEdGraphNode GraphNode; // 0x30(0x8)
		UMaterialExpression SubgraphExpression; // 0x38(0x8)
		unsigned char UnknownData05_6[0x10]; // 0x40(0x10) UNKNOWN PROPERTY
		FGuid MaterialExpressionGuid; // 0x50(0x10)
		UMaterial Material; // 0x60(0x8)
		UMaterialFunction Function; // 0x68(0x8)
		FString Desc; // 0x70(0x10)
		unsigned char UnknownData06_6[0x4]; // 0x80(0x4) UNKNOWN PROPERTY
		bool bRealtimePreview : 1; // 0x84:0(0x1)
		bool bNeedToUpdatePreview : 1; // 0x84:1(0x1)
		unsigned char UnknownData07_3[0x3]; // 0x85(0x3) UNKNOWN PROPERTY
		bool bIsParameterExpression : 1; // 0x88:0(0x1)
		unsigned char UnknownData08_3[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		bool bCommentBubbleVisible : 1; // 0x8C:0(0x1)
		bool bShowOutputNameOnPin : 1; // 0x8C:1(0x1)
		bool bShowMaskColorsOnPin : 1; // 0x8C:2(0x1)
		bool bHidePreviewWindow : 1; // 0x8C:3(0x1)
		bool bCollapsed : 1; // 0x8C:4(0x1)
		bool bShaderInputData : 1; // 0x8C:5(0x1)
		bool bShowInputs : 1; // 0x8C:6(0x1)
		bool bShowOutputs : 1; // 0x8C:7(0x1)
		unsigned char UnknownData09_5[0x3]; // 0x8D(0x3) UNKNOWN PROPERTY
		TArray MenuCategories; // 0x90(0x10)
		TArray Outputs; // 0xA0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialExpression");
			return ret;
		}
	};


	// Class Engine.MaterialExpressionCustomOutput
	// Inherited from UMaterialExpression -> UObject
	// Size: 0x0 (0xB0 - 0xB0)
	class UMaterialExpressionCustomOutput : public UMaterialExpression	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.MaterialExpressionCustomOutput");
			return ret;
		}
	};


	// Class Engine.HLODBuilder
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UHLODBuilder : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.HLODBuilder");
			return ret;
		}
	};


	// Class Engine.TickableWorldSubsystem
	// Inherited from UWorldSubsystem -> USubsystem -> UObject
	// Size: 0x10 (0x40 - 0x30)
	class UTickableWorldSubsystem : public UWorldSubsystem	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x30(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TickableWorldSubsystem");
			return ret;
		}
	};


	// Class Engine.AssetUserData
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAssetUserData : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AssetUserData");
			return ret;
		}
	};


	// Class Engine.TextureMipDataProviderFactory
	// Inherited from UAssetUserData -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTextureMipDataProviderFactory : public UAssetUserData	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TextureMipDataProviderFactory");
			return ret;
		}
	};


	// Class Engine.TextureAllMipDataProviderFactory
	// Inherited from UTextureMipDataProviderFactory -> UAssetUserData -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UTextureAllMipDataProviderFactory : public UTextureMipDataProviderFactory	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TextureAllMipDataProviderFactory");
			return ret;
		}
	};


	// Class Engine.DynamicSubsystem
	// Inherited from USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UDynamicSubsystem : public USubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DynamicSubsystem");
			return ret;
		}
	};


	// Class Engine.EngineSubsystem
	// Inherited from UDynamicSubsystem -> USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UEngineSubsystem : public UDynamicSubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EngineSubsystem");
			return ret;
		}
	};


	// Class Engine.EngineCustomTimeStep
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEngineCustomTimeStep : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EngineCustomTimeStep");
			return ret;
		}
	};


	// Class Engine.TimecodeProvider
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UTimecodeProvider : public UObject	
	{
	public:
		float FrameDelay; // 0x28(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x2C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.TimecodeProvider");
			return ret;
		}

		Ftimecode GetTimecode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449E878
		ETimecodeProviderSynchronizationState GetSynchronizationState(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449E798
		FQualifiedFrameTime GetQualifiedFrameTime(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449E6B8
		FFrameRate GetFrameRate(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449E5D8
		Ftimecode GetDelayedTimecode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449E4F8
		FQualifiedFrameTime GetDelayedQualifiedFrameTime(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41449E418
		bool FetchTimecode(FQualifiedFrameTime& OutFrameTime); // Flags: Native|Public|HasOutParms|BlueprintCallable 0x7FF41449E338
		void FetchAndUpdate(); // Flags: Native|Public|BlueprintCallable 0x7FF41449E258
	};


	// Class Engine.EdGraphNode
	// Inherited from UObject
	// Size: 0x70 (0x98 - 0x28)
	class UEdGraphNode : public UObject	
	{
	public:
		unsigned char UnknownData05_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		TArray DeprecatedPins; // 0x38(0x10)
		int32_t NodePosX; // 0x48(0x4)
		int32_t NodePosY; // 0x4C(0x4)
		int32_t NodeWidth; // 0x50(0x4)
		int32_t NodeHeight; // 0x54(0x4)
		TEnumAsByte AdvancedPinDisplay; // 0x58(0x1)
		ENodeEnabledState EnabledState; // 0x59(0x1)
		unsigned char UnknownData06_6[0x1]; // 0x5A(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit07 : 1; // 0x5B:0(0x1) UNKNOWN PROPERTY
		bool bDisplayAsDisabled : 1; // 0x5B:1(0x1)
		bool bUserSetEnabledState : 1; // 0x5B:2(0x1)
		bool bIsIntermediateNode : 1; // 0x5B:3(0x1)
		bool bHasCompilerMessage : 1; // 0x5B:4(0x1)
		unsigned char UnknownData08_5[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		FString NodeComment; // 0x60(0x10)
		int32_t ErrorType; // 0x70(0x4)
		unsigned char UnknownData09_6[0x4]; // 0x74(0x4) UNKNOWN PROPERTY
		FString ErrorMsg; // 0x78(0x10)
		FGuid NodeGUID; // 0x88(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EdGraphNode");
			return ret;
		}
	};


	// Class Engine.EdGraph
	// Inherited from UObject
	// Size: 0x38 (0x60 - 0x28)
	class UEdGraph : public UObject	
	{
	public:
		UClass Schema; // 0x28(0x8)
		TArray Nodes; // 0x30(0x10)
		bool bEditable : 1; // 0x40:0(0x1)
		bool bAllowDeletion : 1; // 0x40:1(0x1)
		bool bAllowRenaming : 1; // 0x40:2(0x1)
		unsigned char UnknownData01_7[0x1F]; // 0x41(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EdGraph");
			return ret;
		}
	};


	// Class Engine.DebugDrawComponent
	// Inherited from UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x58 (0x520 - 0x4C8)
	class UDebugDrawComponent : public UPrimitiveComponent	
	{
	public:
		unsigned char UnknownData01_1[0x50]; // 0x4C8(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DebugDrawComponent");
			return ret;
		}
	};


	// Class Engine.AnimNotify
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UAnimNotify : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x10]; // 0x28(0x10) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimNotify");
			return ret;
		}

		bool Received_Notify(USkeletalMeshComponent MeshComp, UAnimSequenceBase Animation, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const 0x7FF4144A8B38
		FString GetNotifyName(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const 0x7FF4144A8A58
		float GetDefaultTriggerWeightThreshold(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const 0x7FF4144A8978
	};


	// Class Engine.AnimNotifyState
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAnimNotifyState : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimNotifyState");
			return ret;
		}

		bool Received_NotifyTick(USkeletalMeshComponent MeshComp, UAnimSequenceBase Animation, float FrameDeltaTime, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const 0x7FF4144A8F98
		bool Received_NotifyEnd(USkeletalMeshComponent MeshComp, UAnimSequenceBase Animation, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const 0x7FF4144A8EB8
		bool Received_NotifyBegin(USkeletalMeshComponent MeshComp, UAnimSequenceBase Animation, float TotalDuration, FAnimNotifyEventReference& EventReference); // Flags: RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const 0x7FF4144A8DD8
		FString GetNotifyName(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const 0x7FF4144A8CF8
		float GetDefaultTriggerWeightThreshold(); // Flags: RequiredAPI|Native|Event|Public|BlueprintEvent|Const 0x7FF4144A8C18
	};


	// Class Engine.SkinnedMeshComponent
	// Inherited from UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x368 (0x860 - 0x4F8)
	class USkinnedMeshComponent : public UMeshComponent	
	{
	public:
		unsigned char UnknownData22_3[0x8]; // 0x4F8(0x8) UNKNOWN PROPERTY
		USkeletalMesh SkeletalMesh; // 0x500(0x8)
		USkinnedAsset SkinnedAsset; // 0x508(0x8)
		TWeakObjectPtr LeaderPoseComponent; // 0x510(0x8)
		TArray SkinCacheUsage; // 0x518(0x10)
		bool bSetMeshDeformer; // 0x528(0x1)
		unsigned char UnknownData23_6[0x7]; // 0x529(0x7) UNKNOWN PROPERTY
		UMeshDeformer MeshDeformer; // 0x530(0x8)
		UMeshDeformerInstanceSettings MeshDeformerInstanceSettings; // 0x538(0x8)
		FMeshDeformerInstanceSet MeshDeformerInstances; // 0x540(0x20)
		unsigned char UnknownData24_6[0x180]; // 0x560(0x180) UNKNOWN PROPERTY
		UPhysicsAsset PhysicsAssetOverride; // 0x6E0(0x8)
		int32_t ForcedLodModel; // 0x6E8(0x4)
		unsigned char UnknownData25_6[0x4]; // 0x6EC(0x4) UNKNOWN PROPERTY
		int32_t MinLodModel; // 0x6F0(0x4)
		unsigned char UnknownData26_6[0x8]; // 0x6F4(0x8) UNKNOWN PROPERTY
		float StreamingDistanceMultiplier; // 0x6FC(0x4)
		unsigned char UnknownData27_6[0x8]; // 0x700(0x8) UNKNOWN PROPERTY
		TArray LODInfo; // 0x708(0x10)
		unsigned char UnknownData28_6[0x24]; // 0x718(0x24) UNKNOWN PROPERTY
		EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x73C(0x1)
		unsigned char UnknownData29_6[0x1]; // 0x73D(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit30 : 1; // 0x73E:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit31 : 1; // 0x73E:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit32 : 1; // 0x73E:2(0x1) UNKNOWN PROPERTY
		bool bOverrideMinLOD : 1; // 0x73E:3(0x1)
		bool bUseBoundsFromLeaderPoseComponent : 1; // 0x73E:4(0x1)
		bool bIncludeComponentLocationIntoBounds : 1; // 0x73E:5(0x1)
		bool bForceWireframe : 1; // 0x73E:6(0x1)
		bool bDisableMorphTarget : 1; // 0x73E:7(0x1)
		bool bHideSkin : 1; // 0x73F:0(0x1)
		bool bPerBoneMotionBlur : 1; // 0x73F:1(0x1)
		bool bComponentUseFixedSkelBounds : 1; // 0x73F:2(0x1)
		bool bConsiderAllBodiesForBounds : 1; // 0x73F:3(0x1)
		bool bSyncAttachParentLOD : 1; // 0x73F:4(0x1)
		bool bCanHighlightSelectedSections : 1; // 0x73F:5(0x1)
		bool bRecentlyRendered : 1; // 0x73F:6(0x1)
		bool bCastCapsuleDirectShadow : 1; // 0x73F:7(0x1)
		bool bCastCapsuleIndirectShadow : 1; // 0x740:0(0x1)
		bool bCPUSkinning : 1; // 0x740:1(0x1)
		bool bEnableUpdateRateOptimizations : 1; // 0x740:2(0x1)
		bool bDisplayDebugUpdateRateOptimizations : 1; // 0x740:3(0x1)
		bool bRenderStatic : 1; // 0x740:4(0x1)
		bool bIgnoreLeaderPoseComponentLOD : 1; // 0x740:5(0x1)
		unsigned char UnknownBit33 : 1; // 0x740:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit34 : 1; // 0x740:7(0x1) UNKNOWN PROPERTY
		bool bCachedLocalBoundsUpToDate : 1; // 0x741:0(0x1)
		bool bCachedWorldSpaceBoundsUpToDate : 1; // 0x741:1(0x1)
		unsigned char UnknownBit35 : 1; // 0x741:2(0x1) UNKNOWN PROPERTY
		bool bForceMeshObjectUpdate : 1; // 0x741:3(0x1)
		unsigned char UnknownBit36 : 1; // 0x741:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit37 : 1; // 0x741:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit38 : 1; // 0x741:6(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit39 : 1; // 0x741:7(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit40 : 1; // 0x742:0(0x1) UNKNOWN PROPERTY
		bool bFollowerShouldTickPose : 1; // 0x742:1(0x1)
		unsigned char UnknownData41_5[0x1]; // 0x743(0x1) UNKNOWN PROPERTY
		float CapsuleIndirectShadowMinVisibility; // 0x744(0x4)
		unsigned char UnknownData42_6[0x40]; // 0x748(0x40) UNKNOWN PROPERTY
		FBoxSphereBounds CachedWorldOrLocalSpaceBounds; // 0x788(0x38)
		FMatrix CachedWorldToLocalTransform; // 0x7C0(0x80)
		unsigned char UnknownData43_7[0x20]; // 0x840(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SkinnedMeshComponent");
			return ret;
		}

		void UnsetMeshDeformer(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F6158
		void UnloadSkinWeightProfile(FName InProfileName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F6078
		void UnHideBoneByName(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5F98
		void TransformToBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144F5EB8
		void TransformFromBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF4144F5DD8
		void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5CF8
		void ShowAllMaterialSections(int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5C18
		void SetVertexOffsetUsage(int32_t LODIndex, int32_t Usage); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144F5B38
		void SetVertexColorOverride_LinearColor(int32_t LODIndex, TArray& VertexColors); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144F5A58
		bool SetSkinWeightProfile(FName InProfileName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5978
		void SetSkinWeightOverride(int32_t LODIndex, TArray& SkinWeights); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144F5898
		void SetSkinnedAssetAndUpdate(USkinnedAsset NewMesh, bool bReinitPose); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F57B8
		void SetRenderStatic(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F56D8
		void SetPreSkinningOffsets(int32_t LODIndex, TArray Offsets); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144F55F8
		void SetPostSkinningOffsets(int32_t LODIndex, TArray Offsets); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144F5518
		void SetPhysicsAsset(UPhysicsAsset NewPhysicsAsset, bool bForceReInit); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5438
		void SetMinLOD(int32_t InNewMinLOD); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5358
		void SetMeshDeformer(UMeshDeformer InMeshDeformer); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5278
		void SetLeaderPoseComponent(USkinnedMeshComponent NewLeaderBoneComponent, bool bForceUpdate, bool bInFollowerShouldTickPose); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F5198
		void SetForcedLOD(int32_t InNewForcedLOD); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F50B8
		void SetCastCapsuleIndirectShadow(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F4FD8
		void SetCastCapsuleDirectShadow(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F4EF8
		void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F4E18
		void OverrideMinLOD(int32_t InNewMinLOD); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F4D38
		bool IsUsingSkinWeightProfile(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4C58
		bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F4B78
		bool IsBoneHiddenByName(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F4A98
		void HideBoneByName(FName BoneName, TEnumAsByte PhysBodyOption); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F49B8
		int32_t GetVertexOffsetUsage(int32_t LODIndex); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F48D8
		bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144F47F8
		FName GetSocketBoneName(FName InSocketName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4718
		USkinnedAsset GetSkinnedAsset(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4638
		USkeletalMesh GetSkeletalMesh_DEPRECATED(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4558
		FTransform GetRefPoseTransform(int32_t BoneIndex); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4478
		FVector GetRefPosePosition(int32_t BoneIndex); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4398
		int32_t GetPredictedLODLevel(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F42B8
		FName GetParentBone(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F41D8
		int32_t GetNumLODs(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F40F8
		int32_t GetNumBones(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F4018
		UMeshDeformerInstance GetMeshDeformerInstance(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3F38
		int32_t GetForcedLOD(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3E58
		FTransform GetDeltaTransformFromRefPose(FName BoneName, FName BaseName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3D78
		FName GetCurrentSkinWeightProfileName(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3C98
		FTransform GetBoneTransform(FName InBoneName, TEnumAsByte TransformSpace); // Flags: Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3BB8
		FName GetBoneName(int32_t BoneIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3AD8
		int32_t GetBoneIndex(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F39F8
		FName FindClosestBone_K2(FVector TestLocation, FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3918
		void ClearVertexColorOverride(int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F3838
		void ClearSkinWeightProfile(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F3758
		void ClearSkinWeightOverride(int32_t LODIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144F3678
		bool BoneIsChildOf(FName BoneName, FName ParentBoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144F3598
	};


	// Class Engine.SkeletalMeshComponent
	// Inherited from USkinnedMeshComponent -> UMeshComponent -> UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x6A0 (0xF00 - 0x860)
	class USkeletalMeshComponent : public USkinnedMeshComponent	
	{
	public:
		UAnimBlueprintGeneratedClass AnimBlueprintGeneratedClass; // 0x860(0x8)
		UClass AnimClass; // 0x868(0x8)
		UAnimInstance AnimScriptInstance; // 0x870(0x8)
		UAnimInstance PostProcessAnimInstance; // 0x878(0x8)
		FSingleAnimationPlayData AnimationData; // 0x880(0x18)
		unsigned char UnknownData24_6[0x10]; // 0x898(0x10) UNKNOWN PROPERTY
		FVector RootBoneTranslation; // 0x8A8(0x18)
		FVector LineCheckBoundsScale; // 0x8C0(0x18)
		unsigned char UnknownData25_6[0x20]; // 0x8D8(0x20) UNKNOWN PROPERTY
		TArray LinkedInstances; // 0x8F8(0x10)
		unsigned char UnknownData26_6[0x10]; // 0x908(0x10) UNKNOWN PROPERTY
		TArray CachedBoneSpaceTransforms; // 0x918(0x10)
		TArray CachedComponentSpaceTransforms; // 0x928(0x10)
		unsigned char UnknownData27_6[0xA0]; // 0x938(0xA0) UNKNOWN PROPERTY
		float GlobalAnimRateScale; // 0x9D8(0x4)
		TEnumAsByte KinematicBonesUpdateType; // 0x9DC(0x1)
		TEnumAsByte PhysicsTransformUpdateMode; // 0x9DD(0x1)
		unsigned char UnknownData28_6[0x1]; // 0x9DE(0x1) UNKNOWN PROPERTY
		TEnumAsByte AnimationMode; // 0x9DF(0x1)
		unsigned char UnknownData29_6[0x1]; // 0x9E0(0x1) UNKNOWN PROPERTY
		bool bDisablePostProcessBlueprint : 1; // 0x9E1:0(0x1)
		unsigned char UnknownBit30 : 1; // 0x9E1:1(0x1) UNKNOWN PROPERTY
		bool bUpdateOverlapsOnAnimationFinalize : 1; // 0x9E1:2(0x1)
		unsigned char UnknownBit31 : 1; // 0x9E1:3(0x1) UNKNOWN PROPERTY
		bool bHasValidBodies : 1; // 0x9E1:4(0x1)
		bool bBlendPhysics : 1; // 0x9E1:5(0x1)
		bool bEnablePhysicsOnDedicatedServer : 1; // 0x9E1:6(0x1)
		bool bUpdateMeshWhenKinematic : 1; // 0x9E1:7(0x1)
		bool bUpdateJointsFromAnimation : 1; // 0x9E2:0(0x1)
		bool bAllowClothActors : 1; // 0x9E2:1(0x1)
		bool bDisableClothSimulation : 1; // 0x9E2:2(0x1)
		unsigned char UnknownData32_3[0x5]; // 0x9E3(0x5) UNKNOWN PROPERTY
		bool bDisableRigidBodyAnimNode : 1; // 0x9E8:0(0x1)
		bool bAllowAnimCurveEvaluation : 1; // 0x9E8:1(0x1)
		unsigned char UnknownBit33 : 1; // 0x9E8:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit34 : 1; // 0x9E8:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit35 : 1; // 0x9E8:4(0x1) UNKNOWN PROPERTY
		bool bCollideWithEnvironment : 1; // 0x9E8:5(0x1)
		bool bCollideWithAttachedChildren : 1; // 0x9E8:6(0x1)
		bool bForceCollisionUpdate : 1; // 0x9E8:7(0x1)
		unsigned char UnknownData36_5[0x3]; // 0x9E9(0x3) UNKNOWN PROPERTY
		float ClothVelocityScale; // 0x9EC(0x4)
		bool bResetAfterTeleport : 1; // 0x9F0:0(0x1)
		unsigned char UnknownBit37 : 1; // 0x9F0:1(0x1) UNKNOWN PROPERTY
		bool bDeferKinematicBoneUpdate : 1; // 0x9F0:2(0x1)
		bool bNoSkeletonUpdate : 1; // 0x9F0:3(0x1)
		bool bPauseAnims : 1; // 0x9F0:4(0x1)
		bool bUseRefPoseOnInitAnim : 1; // 0x9F0:5(0x1)
		bool bEnablePerPolyCollision : 1; // 0x9F0:6(0x1)
		bool bForceRefpose : 1; // 0x9F0:7(0x1)
		bool bOnlyAllowAutonomousTickPose : 1; // 0x9F1:0(0x1)
		bool bIsAutonomousTickPose : 1; // 0x9F1:1(0x1)
		bool bOldForceRefPose : 1; // 0x9F1:2(0x1)
		bool bShowPrePhysBones : 1; // 0x9F1:3(0x1)
		bool bRequiredBonesUpToDate : 1; // 0x9F1:4(0x1)
		bool bAnimTreeInitialised : 1; // 0x9F1:5(0x1)
		bool bEnableLineCheckWithBounds : 1; // 0x9F1:6(0x1)
		bool bPropagateCurvesToFollowers : 1; // 0x9F1:7(0x1)
		bool bSkipKinematicUpdateWhenInterpolating : 1; // 0x9F2:0(0x1)
		bool bSkipBoundsUpdateWhenInterpolating : 1; // 0x9F2:1(0x1)
		unsigned char UnknownBit38 : 1; // 0x9F2:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit39 : 1; // 0x9F2:3(0x1) UNKNOWN PROPERTY
		bool bNeedsQueuedAnimEventsDispatched : 1; // 0x9F2:4(0x1)
		unsigned char UnknownData40_5[0x1]; // 0x9F3(0x1) UNKNOWN PROPERTY
		uint16_t CachedAnimCurveUidVersion; // 0x9F4(0x2)
		unsigned char UnknownData41_6[0x2]; // 0x9F6(0x2) UNKNOWN PROPERTY
		float ClothBlendWeight; // 0x9F8(0x4)
		bool bWaitForParallelClothTask; // 0x9FC(0x1)
		bool bFilteredAnimCurvesIsAllowList; // 0x9FD(0x1)
		uint16_t CachedMeshCurveMetaDataVersion; // 0x9FE(0x2)
		TArray FilteredAnimCurves; // 0xA00(0x10)
		UBodySetup BodySetup; // 0xA10(0x8)
		unsigned char UnknownData42_6[0x4]; // 0xA18(0x4) UNKNOWN PROPERTY
		float ClothMaxDistanceScale; // 0xA1C(0x4)
		FMulticastInlineDelegate OnConstraintBroken; // 0xA20(0x10)
		FMulticastInlineDelegate OnPlasticDeformation; // 0xA30(0x10)
		UClass ClothingSimulationFactory; // 0xA40(0x8)
		unsigned char UnknownData43_6[0xF8]; // 0xA48(0xF8) UNKNOWN PROPERTY
		float TeleportDistanceThreshold; // 0xB40(0x4)
		float TeleportRotationThreshold; // 0xB44(0x4)
		unsigned char UnknownData44_6[0x98]; // 0xB48(0x98) UNKNOWN PROPERTY
		UClothingSimulationInteractor ClothingInteractor; // 0xBE0(0x8)
		unsigned char UnknownData45_6[0xB8]; // 0xBE8(0xB8) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnAnimInitialized; // 0xCA0(0x10)
		unsigned char UnknownData46_6[0x240]; // 0xCB0(0x240) UNKNOWN PROPERTY
		uint32_t LastPoseTickFrame; // 0xEF0(0x4)
		unsigned char UnknownData47_7[0x4]; // 0xEF4(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SkeletalMeshComponent");
			return ret;
		}

		void UnlinkAnimClassLayers(UClass InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D758
		void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D678
		void ToggleDisablePostProcessBlueprint(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D598
		void TermBodiesBelow(FName ParentBoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D4B8
		void SuspendClothingSimulation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D3D8
		void Stop(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D2F8
		void SnapshotPose(FPoseSnapshot& Snapshot); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41451D218
		void SetUpdateClothInEditor(bool NewUpdateState); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D138
		void SetUpdateAnimationInEditor(bool NewUpdateState); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451D058
		void SetTeleportRotationThreshold(float Threshold); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451CF78
		void SetTeleportDistanceThreshold(float Threshold); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451CE98
		void SetSkeletalMeshAsset(USkeletalMesh NewMesh); // Flags: Final|Native|Public|BlueprintCallable 0x7FF41451CDB8
		void SetPosition(float InPos, bool bFireNotifies); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451CCD8
		void SetPlayRate(float Rate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451CBF8
		void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451CB18
		void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, FName BoneName, bool bIncludeSelf); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451CA38
		void SetMorphTarget(FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C958
		void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C878
		void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, FName BoneName, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C798
		void SetEnableBodyGravity(bool bEnableGravity, FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C6B8
		void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C5D8
		void SetDisableAnimCurves(bool bInDisableAnimCurves); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C4F8
		void SetConstraintProfileForAll(FName ProfileName, bool bDefaultIfNotFound); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C418
		void SetConstraintProfile(FName JointName, FName ProfileName, bool bDefaultIfNotFound); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C338
		void SetClothMaxDistanceScale(float Scale); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C258
		void SetBodySimulatePhysics(FName& InBoneName, bool bSimulate); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41451C178
		void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, FName BoneName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451C098
		void SetAnimClass(UClass NewClass); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451BFB8
		void SetAnimationMode(TEnumAsByte InAnimationMode, bool bForceInitAnimScriptInstance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451BED8
		void SetAnimation(UAnimationAsset NewAnimToPlay); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451BDF8
		void SetAngularLimits(FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451BD18
		void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451BC38
		void SetAllowedAnimCurvesEvaluation(TArray& List, bool bAllow); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41451BB58
		void SetAllowClothActors(bool bInAllow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451BA78
		void SetAllowAnimCurveEvaluation(bool bInAllow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B998
		void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B8B8
		void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B7D8
		void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B6F8
		void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B618
		void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B538
		void SetAllBodiesBelowSimulatePhysics(FName& InBoneName, bool bNewSimulate, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41451B458
		void SetAllBodiesBelowPhysicsDisabled(FName& InBoneName, bool bDisabled, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41451B378
		void SetAllBodiesBelowPhysicsBlendWeight(FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF41451B298
		void SetAllBodiesBelowLinearVelocity(FName& InBoneName, FVector& LinearVelocity, bool bIncludeSelf); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41451B1B8
		void ResumeClothingSimulation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451B0D8
		void ResetClothTeleportMode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AFF8
		void ResetAnimInstanceDynamics(ETeleportType InTeleportType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AF18
		void ResetAllowedAnimCurveEvaluation(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AE38
		void ResetAllBodiesSimulatePhysics(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AD58
		void RecreateClothingActors(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AC78
		void PlayAnimation(UAnimationAsset NewAnimToPlay, bool bLooping); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AB98
		void Play(bool bLooping); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451AAB8
		void OverrideAnimationData(UAnimationAsset InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451A9D8
		void LinkAnimGraphByTag(FName InTag, UClass InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451A8F8
		void LinkAnimClassLayers(UClass InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451A818
		bool K2_GetClosestPointOnPhysicsAsset(FVector& WorldPosition, FVector& ClosestWorldPosition, FVector& Normal, FName& BoneName, float& Distance); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF41451A738
		bool IsPlaying(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41451A658
		bool IsClothingSimulationSuspended(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41451A578
		bool IsBodyGravityEnabled(FName BoneName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF41451A498
		bool HasValidAnimationInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41451A3B8
		bool GetTransformAttribute_Ref(FName& BoneName, FName& AttributeName, FTransform& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41451A2D8
		bool GetTransformAttribute(FName& BoneName, FName& AttributeName, FTransform DefaultValue, FTransform& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF41451A1F8
		float GetTeleportRotationThreshold(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41451A118
		float GetTeleportDistanceThreshold(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF41451A038
		bool GetStringAttribute_Ref(FName& BoneName, FName& AttributeName, FString& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414519F58
		bool GetStringAttribute(FName& BoneName, FName& AttributeName, FString DefaultValue, FString& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414519E78
		USkeletalMesh GetSkeletalMeshAsset(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519D98
		FVector GetSkeletalCenterOfMass(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF414519CB8
		UAnimInstance GetPostProcessInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519BD8
		float GetPosition(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519AF8
		float GetPlayRate(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519A18
		float GetMorphTarget(FName MorphTargetName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519938
		UAnimInstance GetLinkedAnimLayerInstanceByGroup(FName InGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519858
		UAnimInstance GetLinkedAnimLayerInstanceByClass(UClass InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519778
		void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray& OutLinkedInstances); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF414519698
		UAnimInstance GetLinkedAnimGraphInstanceByTag(FName InTag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4145195B8
		bool GetIntegerAttribute_Ref(FName& BoneName, FName& AttributeName, int32_t& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4145194D8
		bool GetIntegerAttribute(FName& BoneName, FName& AttributeName, int32_t DefaultValue, int32_t& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4145193F8
		bool GetFloatAttribute_Ref(FName& BoneName, FName& AttributeName, float& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414519318
		bool GetFloatAttribute(FName& BoneName, FName& AttributeName, float DefaultValue, float& OutValue, ECustomBoneAttributeLookup LookupType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414519238
		bool GetDisablePostProcessBlueprint(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519158
		bool GetDisableAnimCurves(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414519078
		void GetCurrentJointAngles(FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414518F98
		void GetConstraintsFromBody(FName BodyName, bool bParentConstraints, bool bChildConstraints, bool bIncludesTerminated, TArray& OutConstraints); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414518EB8
		void GetConstraints(bool bIncludesTerminated, TArray& OutConstraints); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414518DD8
		FConstraintInstanceAccessor GetConstraintByName(FName ConstraintName, bool bIncludesTerminated); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414518CF8
		float GetClothMaxDistanceScale(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414518C18
		UClothingSimulationInteractor GetClothingSimulationInteractor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414518B38
		float GetBoneMass(FName BoneName, bool bScaleMass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414518A58
		FVector GetBoneLinearVelocity(FName& InBoneName); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 0x7FF414518978
		UAnimInstance GetAnimInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414518898
		UClass GetAnimClass(); // Flags: Final|RequiredAPI|Native|Public 0x7FF4145187B8
		TEnumAsByte GetAnimationMode(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4145186D8
		bool GetAllowRigidBodyAnimNode(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4145185F8
		bool GetAllowedAnimCurveEvaluate(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414518518
		bool GetAllowClothActors(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF414518438
		void ForceClothNextUpdateTeleportAndReset(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414518358
		void ForceClothNextUpdateTeleport(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414518278
		FName FindConstraintBoneName(int32_t ConstraintIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414518198
		void ClearMorphTargets(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4145180B8
		void BreakConstraint(FVector Impulse, FVector HitLocation, FName InBoneName); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414517FD8
		void BindClothToLeaderPoseComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414517EF8
		void AllowAnimCurveEvaluation(FName NameOfCurve, bool bAllow); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF414517E18
		void AddImpulseToAllBodiesBelow(FVector Impulse, FName BoneName, bool bVelChange, bool bIncludeSelf); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414517D38
		void AddForceToAllBodiesBelow(FVector Force, FName BoneName, bool bAccelChange, bool bIncludeSelf); // Flags: RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF414517C58
		void AccumulateAllBodiesBelowPhysicsBlendWeight(FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF414517B78
	};


	// Class Engine.AnimInstance
	// Inherited from UObject
	// Size: 0x398 (0x3C0 - 0x28)
	class UAnimInstance : public UObject	
	{
	public:
		USkeleton CurrentSkeleton; // 0x28(0x8)
		TEnumAsByte RootMotionMode; // 0x30(0x1)
		bool bUseMultiThreadedAnimationUpdate : 1; // 0x31:0(0x1)
		bool bUsingCopyPoseFromMesh : 1; // 0x31:1(0x1)
		unsigned char UnknownBit07 : 1; // 0x31:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0x31:3(0x1) UNKNOWN PROPERTY
		bool bReceiveNotifiesFromLinkedInstances : 1; // 0x31:4(0x1)
		bool bPropagateNotifiesToLinkedInstances : 1; // 0x31:5(0x1)
		bool bUseMainInstanceMontageEvaluationData : 1; // 0x31:6(0x1)
		unsigned char UnknownData09_3[0x1]; // 0x32(0x1) UNKNOWN PROPERTY
		bool bQueueMontageEvents : 1; // 0x33:0(0x1)
		unsigned char UnknownData10_5[0x4]; // 0x34(0x4) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnMontageBlendingOut; // 0x38(0x10)
		FMulticastInlineDelegate OnMontageBlendedIn; // 0x48(0x10)
		FMulticastInlineDelegate OnMontageStarted; // 0x58(0x10)
		FMulticastInlineDelegate OnMontageEnded; // 0x68(0x10)
		FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x78(0x10)
		unsigned char UnknownData11_6[0xB0]; // 0x88(0xB0) UNKNOWN PROPERTY
		TMap SlotGroupInertializationRequestDataMap; // 0x138(0x50)
		unsigned char UnknownData12_6[0x38]; // 0x188(0x38) UNKNOWN PROPERTY
		FAnimNotifyQueue NotifyQueue; // 0x1C0(0x70)
		TArray ActiveAnimNotifyState; // 0x230(0x10)
		TArray ActiveAnimNotifyEventReference; // 0x240(0x10)
		unsigned char UnknownData13_7[0x168]; // 0x250(0x168) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimInstance");
			return ret;
		}

		bool WasAnimNotifyTriggeredInStateMachine(int32_t MachineIndex, UClass AnimNotifyType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AEFD8
		bool WasAnimNotifyTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, UClass AnimNotifyType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AEEF8
		bool WasAnimNotifyTriggeredInAnyState(UClass AnimNotifyType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AEE18
		bool WasAnimNotifyStateActiveInStateMachine(int32_t MachineIndex, UClass AnimNotifyStateType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AED38
		bool WasAnimNotifyStateActiveInSourceState(int32_t MachineIndex, int32_t StateIndex, UClass AnimNotifyStateType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AEC58
		bool WasAnimNotifyStateActiveInAnyState(UClass AnimNotifyStateType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AEB78
		bool WasAnimNotifyNameTriggeredInStateMachine(int32_t MachineIndex, FName NotifyName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AEA98
		bool WasAnimNotifyNameTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, FName NotifyName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AE9B8
		bool WasAnimNotifyNameTriggeredInAnyState(FName NotifyName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AE8D8
		void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 0x7FF4144AE7F8
		void UnlinkAnimClassLayers(UClass InClass); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AE718
		APawn TryGetPawnOwner(); // Flags: RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AE638
		void StopSlotAnimation(float InBlendOutTime, FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AE558
		void SnapshotPose(FPoseSnapshot& Snapshot); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144AE478
		void SetUseMainInstanceMontageEvaluationData(bool bSet); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144AE398
		void SetRootMotionMode(TEnumAsByte Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AE2B8
		void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144AE1D8
		void SetPropagateNotifiesToLinkedInstances(bool bSet); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144AE0F8
		void SetMorphTarget(FName MorphTargetName, float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AE018
		void SavePoseSnapshot(FName SnapshotName); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ADF38
		void ResetDynamics(ETeleportType InTeleportType); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ADE58
		bool RequestTransitionEvent(FName EventName, double RequestTimeout, ETransitionRequestQueueMode QueueMode, ETransitionRequestOverwriteMode OverwriteMode); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ADD78
		void RequestSlotGroupInertialization(FName InSlotGroupName, float duration, UBlendProfile BlendProfile); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ADC98
		void RemovePoseSnapshot(FName SnapshotName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ADBB8
		bool QueryTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, FName EventName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144ADAD8
		bool QueryAndMarkTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, FName EventName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AD9F8
		UAnimMontage PlaySlotAnimationAsDynamicMontage_WithBlendSettings(UAnimSequenceBase Asset, FName SlotNodeName, FMontageBlendSettings& BlendInSettings, FMontageBlendSettings& BlendOutSettings, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144AD918
		UAnimMontage PlaySlotAnimationAsDynamicMontage_WithBlendArgs(UAnimSequenceBase Asset, FName SlotNodeName, FAlphaBlendArgs& BlendIn, FAlphaBlendArgs& BlendOut, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144AD838
		UAnimMontage PlaySlotAnimationAsDynamicMontage(UAnimSequenceBase Asset, FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD758
		void MontageSync_StopFollowing(UAnimMontage MontageFollower); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD678
		void MontageSync_Follow(UAnimMontage MontageFollower, UAnimInstance OtherAnimInstance, UAnimMontage MontageLeader); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD598
		void Montage_StopWithBlendSettings(FMontageBlendSettings& BlendOutSettings, UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144AD4B8
		void Montage_StopWithBlendOut(FAlphaBlendArgs& BlendOut, UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144AD3D8
		void Montage_StopGroupByName(float InBlendOutTime, FName GroupName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD2F8
		void Montage_Stop(float InBlendOutTime, UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD218
		void Montage_SetPosition(UAnimMontage Montage, float NewPosition); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD138
		void Montage_SetPlayRate(UAnimMontage Montage, float NewPlayRate); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AD058
		void Montage_SetNextSection(FName SectionNameToChange, FName NextSection, UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ACF78
		void Montage_Resume(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ACE98
		float Montage_PlayWithBlendSettings(UAnimMontage MontageToPlay, FMontageBlendSettings& BlendInSettings, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144ACDB8
		float Montage_PlayWithBlendIn(UAnimMontage MontageToPlay, FAlphaBlendArgs& BlendIn, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144ACCD8
		float Montage_Play(UAnimMontage MontageToPlay, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ACBF8
		void Montage_Pause(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ACB18
		void Montage_JumpToSectionsEnd(FName SectionName, UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ACA38
		void Montage_JumpToSection(FName SectionName, UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AC958
		bool Montage_IsPlaying(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC878
		bool Montage_IsActive(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC798
		float Montage_GetPosition(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC6B8
		float Montage_GetPlayRate(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC5D8
		bool Montage_GetIsStopped(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC4F8
		float Montage_GetEffectivePlayRate(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC418
		FName Montage_GetCurrentSection(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC338
		float Montage_GetBlendTime(UAnimMontage Montage); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AC258
		void LockAIResources(bool bLockMovement, bool LockAILogic); // Flags: Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 0x7FF4144AC178
		void LinkAnimGraphByTag(FName InTag, UClass InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144AC098
		void LinkAnimClassLayers(UClass InClass); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144ABFB8
		bool IsUsingMainInstanceMontageEvaluationData(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144ABED8
		bool IsSyncGroupBetweenMarkers(FName InSyncGroupName, FName PreviousMarker, FName NextMarker, bool bRespectMarkerOrder); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144ABDF8
		bool IsSlotActive(FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144ABD18
		bool IsPlayingSlotAnimation(UAnimSequenceBase Asset, FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144ABC38
		bool IsAnyMontagePlaying(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144ABB58
		bool HasMarkerBeenHitThisFrame(FName SyncGroup, FName MarkerName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144ABA78
		bool GetTimeToClosestMarker(FName SyncGroup, FName MarkerName, float& OutMarkerTime); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144AB998
		FMarkerSyncAnimPosition GetSyncGroupPosition(FName InSyncGroupName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AB8B8
		float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AB7D8
		float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AB6F8
		float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AB618
		float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AB538
		float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AB458
		bool GetReceiveNotifiesFromLinkedInstances(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AB378
		bool GetPropagateNotifiesToLinkedInstances(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AB298
		USkeletalMeshComponent GetOwningComponent(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AB1B8
		AActor GetOwningActor(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AB0D8
		void GetLinkedAnimLayerInstancesByGroup(FName InGroup, TArray& OutLinkedInstances); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144AAFF8
		UAnimInstance GetLinkedAnimLayerInstanceByGroupAndClass(FName InGroup, UClass InClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AAF18
		UAnimInstance GetLinkedAnimLayerInstanceByGroup(FName InGroup); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AAE38
		UAnimInstance GetLinkedAnimLayerInstanceByClass(UClass InClass, bool bCheckForChildClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AAD58
		void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray& OutLinkedInstances); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144AAC78
		UAnimInstance GetLinkedAnimGraphInstanceByTag(FName InTag); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AAB98
		float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AAAB8
		float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA9D8
		float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA8F8
		float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA818
		float GetInstanceMachineWeight(int32_t MachineIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA738
		float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA658
		float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA578
		float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA498
		float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA3B8
		float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA2D8
		float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144AA1F8
		float GetDeltaSeconds(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144AA118
		bool GetCurveValueWithDefault(FName CurveName, float DefaultValue, float& OutValue); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 0x7FF4144AA038
		float GetCurveValue(FName CurveName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9F58
		FName GetCurrentStateName(int32_t MachineIndex); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure 0x7FF4144A9E78
		UAnimMontage GetCurrentActiveMontage(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9D98
		void GetAllCurveNames(TArray& OutNames); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9CB8
		void GetActiveCurveNames(EAnimCurveType CurveType, TArray& OutNames); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9BD8
		bool DynamicMontage_IsPlayingFrom(UAnimSequenceBase Animation); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9AF8
		void ClearTransitionEvents(FName EventName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144A9A18
		void ClearMorphTargets(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144A9938
		void ClearAllTransitionEvents(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144A9858
		float CalculateDirection(FVector& Velocity, FRotator& BaseRotation); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9778
		void BlueprintUpdateAnimation(float DeltaTimeX); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144A9698
		void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144A95B8
		void BlueprintPostEvaluateAnimation(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144A94D8
		void BlueprintLinkedAnimationLayersInitialized(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144A93F8
		void BlueprintInitializeAnimation(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144A9318
		void BlueprintBeginPlay(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144A9238
		float Blueprint_GetSlotMontageLocalWeight(FName SlotNodeName); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9158
		UAnimInstance Blueprint_GetMainAnimInstance(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144A9078
	};


	// Class Engine.BlueprintAsyncActionBase
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UBlueprintAsyncActionBase : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintAsyncActionBase");
			return ret;
		}

		void Activate(); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4116AC250
	};


	// Class Engine.BlueprintCore
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UBlueprintCore : public UObject	
	{
	public:
		UClass SkeletonGeneratedClass; // 0x28(0x8)
		UClass GeneratedClass; // 0x30(0x8)
		bool bLegacyNeedToPurgeSkelRefs; // 0x38(0x1)
		unsigned char UnknownData02_6[0x3]; // 0x39(0x3) UNKNOWN PROPERTY
		FGuid BlueprintGuid; // 0x3C(0x10)
		unsigned char UnknownData03_7[0x4]; // 0x4C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintCore");
			return ret;
		}
	};


	// Class Engine.Blueprint
	// Inherited from UBlueprintCore -> UObject
	// Size: 0x58 (0xA8 - 0x50)
	class UBlueprint : public UBlueprintCore	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x50(0x8) UNKNOWN PROPERTY
		UClass ParentClass; // 0x58(0x8)
		TEnumAsByte BlueprintType; // 0x60(0x1)
		bool bRecompileOnLoad : 1; // 0x61:0(0x1)
		bool bHasBeenRegenerated : 1; // 0x61:1(0x1)
		bool bIsRegeneratingOnLoad : 1; // 0x61:2(0x1)
		unsigned char UnknownData03_5[0x2]; // 0x62(0x2) UNKNOWN PROPERTY
		int32_t BlueprintSystemVersion; // 0x64(0x4)
		USimpleConstructionScript SimpleConstructionScript; // 0x68(0x8)
		TArray ComponentTemplates; // 0x70(0x10)
		TArray Timelines; // 0x80(0x10)
		TArray ComponentClassOverrides; // 0x90(0x10)
		UInheritableComponentHandler InheritableComponentHandler; // 0xA0(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Blueprint");
			return ret;
		}
	};


	// Class Engine.DynamicBlueprintBinding
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDynamicBlueprintBinding : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DynamicBlueprintBinding");
			return ret;
		}
	};


	// Class Engine.BlueprintGeneratedClass
	// Inherited from UClass -> UStruct -> UField -> UObject
	// Size: 0x160 (0x360 - 0x200)
	class UBlueprintGeneratedClass : public UClass	
	{
	public:
		unsigned char UnknownData05_3[0x8]; // 0x200(0x8) UNKNOWN PROPERTY
		int32_t NumReplicatedProperties; // 0x208(0x4)
		bool bHasCookedComponentInstancingData : 1; // 0x20C:0(0x1)
		unsigned char UnknownData06_5[0x3]; // 0x20D(0x3) UNKNOWN PROPERTY
		TArray DynamicBindingObjects; // 0x210(0x10)
		TArray ComponentTemplates; // 0x220(0x10)
		TArray Timelines; // 0x230(0x10)
		TArray ComponentClassOverrides; // 0x240(0x10)
		TArray FieldNotifies; // 0x250(0x10)
		unsigned char UnknownData07_6[0x8]; // 0x260(0x8) UNKNOWN PROPERTY
		USimpleConstructionScript SimpleConstructionScript; // 0x268(0x8)
		UInheritableComponentHandler InheritableComponentHandler; // 0x270(0x8)
		unsigned char UnknownData08_6[0x8]; // 0x278(0x8) UNKNOWN PROPERTY
		UFunction UberGraphFunction; // 0x280(0x8)
		TMap CookedPropertyGuids; // 0x288(0x50)
		TMap CookedComponentInstancingData; // 0x2D8(0x50)
		unsigned char UnknownData09_7[0x38]; // 0x328(0x38) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintGeneratedClass");
			return ret;
		}
	};


	// Class Engine.CameraActor
	// Inherited from AActor -> UObject
	// Size: 0x720 (0x9B0 - 0x290)
	class ACameraActor : public AActor	
	{
	public:
		TEnumAsByte AutoActivateForPlayer; // 0x290(0x1)
		unsigned char UnknownData03_6[0x7]; // 0x291(0x7) UNKNOWN PROPERTY
		UCameraComponent CameraComponent; // 0x298(0x8)
		USceneComponent SceneComponent; // 0x2A0(0x8)
		bool bConstrainAspectRatio : 1; // 0x2A8:0(0x1)
		unsigned char UnknownData04_5[0x3]; // 0x2A9(0x3) UNKNOWN PROPERTY
		float AspectRatio; // 0x2AC(0x4)
		float FOVAngle; // 0x2B0(0x4)
		float PostProcessBlendWeight; // 0x2B4(0x4)
		unsigned char UnknownData05_6[0x8]; // 0x2B8(0x8) UNKNOWN PROPERTY
		FPostProcessSettings PostProcessSettings; // 0x2C0(0x6F0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.CameraActor");
			return ret;
		}

		int32_t GetAutoActivatePlayerIndex(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144C9058
	};


	// Class Engine.CameraComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x7B0 (0x9D0 - 0x220)
	class UCameraComponent : public USceneComponent	
	{
	public:
		float FieldOfView; // 0x220(0x4)
		float FirstPersonFieldOfView; // 0x224(0x4)
		float FirstPersonScale; // 0x228(0x4)
		float OrthoWidth; // 0x22C(0x4)
		bool bAutoCalculateOrthoPlanes; // 0x230(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x231(0x3) UNKNOWN PROPERTY
		float AutoPlaneShift; // 0x234(0x4)
		float OrthoNearClipPlane; // 0x238(0x4)
		float OrthoFarClipPlane; // 0x23C(0x4)
		bool bUpdateOrthoPlanes; // 0x240(0x1)
		bool bUseCameraHeightAsViewTarget; // 0x241(0x1)
		unsigned char UnknownData05_6[0x2]; // 0x242(0x2) UNKNOWN PROPERTY
		float AspectRatio; // 0x244(0x4)
		TEnumAsByte AspectRatioAxisConstraint; // 0x248(0x1)
		bool bConstrainAspectRatio : 1; // 0x249:0(0x1)
		bool bOverrideAspectRatioAxisConstraint : 1; // 0x249:1(0x1)
		bool bUseFieldOfViewForLOD : 1; // 0x249:2(0x1)
		bool bLockToHmd : 1; // 0x249:3(0x1)
		bool bUsePawnControlRotation : 1; // 0x249:4(0x1)
		bool bEnableFirstPersonFieldOfView : 1; // 0x249:5(0x1)
		bool bEnableFirstPersonScale : 1; // 0x249:6(0x1)
		TEnumAsByte ProjectionMode; // 0x24A(0x1)
		unsigned char UnknownData06_6[0x65]; // 0x24B(0x65) UNKNOWN PROPERTY
		float PostProcessBlendWeight; // 0x2B0(0x4)
		unsigned char UnknownData07_6[0x2C]; // 0x2B4(0x2C) UNKNOWN PROPERTY
		FPostProcessSettings PostProcessSettings; // 0x2E0(0x6F0)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.CameraComponent");
			return ret;
		}

		void SetUseFieldOfViewForLOD(bool bInUseFieldOfViewForLOD); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144CA478
		void SetUseCameraHeightAsViewTarget(bool bInUseCameraHeightAsViewTarget); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144CA398
		void SetUpdateOrthoPlanes(bool bInUpdateOrthoPlanes); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144CA2B8
		void SetProjectionMode(TEnumAsByte InProjectionMode); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144CA1D8
		void SetPostProcessBlendWeight(float InPostProcessBlendWeight); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144CA0F8
		void SetOrthoWidth(float InOrthoWidth); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144CA018
		void SetOrthoNearClipPlane(float InOrthoNearClipPlane); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9F38
		void SetOrthoFarClipPlane(float InOrthoFarClipPlane); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9E58
		void SetFirstPersonScale(float InFirstPersonScale); // Flags: Native|Public|BlueprintCallable 0x7FF4144C9D78
		void SetFirstPersonFieldOfView(float InFirstPersonFieldOfView); // Flags: Native|Public|BlueprintCallable 0x7FF4144C9C98
		void SetFieldOfView(float InFieldOfView); // Flags: Native|Public|BlueprintCallable 0x7FF4144C9BB8
		void SetEnableFirstPersonScale(bool bInEnableFirstPersonScale); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9AD8
		void SetEnableFirstPersonFieldOfView(bool bInEnableFirstPersonFieldOfView); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C99F8
		void SetConstraintAspectRatio(bool bInConstrainAspectRatio); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9918
		void SetAutoPlaneShift(float InAutoPlaneShift); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9838
		void SetAutoCalculateOrthoPlanes(bool bAutoCalculate); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9758
		void SetAspectRatioAxisConstraint(TEnumAsByte InAspectRatioAxisConstraint); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9678
		void SetAspectRatio(float InAspectRatio); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9598
		void RemoveBlendable(TScriptInterface InBlendableObject); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C94B8
		void OnCameraMeshHiddenChanged(); // Flags: Final|RequiredAPI|Native|Protected|BlueprintCallable 0x7FF4144C93D8
		void GetCameraView(float DeltaTime, FMinimalViewInfo& DesiredView); // Flags: RequiredAPI|Native|Public|HasOutParms|BlueprintCallable 0x7FF4144C92F8
		void AddOrUpdateBlendable(TScriptInterface InBlendableObject, float InWeight); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144C9218
	};


	// Class Engine.AudioEngineSubsystem
	// Inherited from UDynamicSubsystem -> USubsystem -> UObject
	// Size: 0x0 (0x30 - 0x30)
	class UAudioEngineSubsystem : public UDynamicSubsystem	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AudioEngineSubsystem");
			return ret;
		}
	};


	// Class Engine.SoundBase
	// Inherited from UObject
	// Size: 0x140 (0x168 - 0x28)
	class USoundBase : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		USoundClass SoundClassObject; // 0x30(0x8)
		bool bDebug : 1; // 0x38:0(0x1)
		bool bOverrideConcurrency : 1; // 0x38:1(0x1)
		bool bEnableBusSends : 1; // 0x38:2(0x1)
		bool bEnableBaseSubmix : 1; // 0x38:3(0x1)
		bool bEnableSubmixSends : 1; // 0x38:4(0x1)
		bool bHasDelayNode : 1; // 0x38:5(0x1)
		bool bHasConcatenatorNode : 1; // 0x38:6(0x1)
		bool bBypassVolumeScaleForPriority : 1; // 0x38:7(0x1)
		EVirtualizationMode VirtualizationMode; // 0x39(0x1)
		unsigned char UnknownData03_6[0x56]; // 0x3A(0x56) UNKNOWN PROPERTY
		TSet ConcurrencySet; // 0x90(0x50)
		FSoundConcurrencySettings ConcurrencyOverrides; // 0xE0(0x20)
		float duration; // 0x100(0x4)
		float MaxDistance; // 0x104(0x4)
		float TotalSamples; // 0x108(0x4)
		float Priority; // 0x10C(0x4)
		USoundAttenuation AttenuationSettings; // 0x110(0x8)
		USoundSubmixBase SoundSubmixObject; // 0x118(0x8)
		TArray SoundSubmixSends; // 0x120(0x10)
		USoundEffectSourcePresetChain SourceEffectChain; // 0x130(0x8)
		TArray BusSends; // 0x138(0x10)
		TArray PreEffectBusSends; // 0x148(0x10)
		TArray AssetUserData; // 0x158(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundBase");
			return ret;
		}

		bool IsAttenuationSettingsEditable(); // Flags: Native|Public|Const 0x7FF4144CE8B8
	};


	// Class Engine.SoundWave
	// Inherited from USoundBase -> UObject
	// Size: 0x288 (0x3F0 - 0x168)
	class USoundWave : public USoundBase	
	{
	public:
		unsigned char UnknownData12_3[0x10]; // 0x168(0x10) UNKNOWN PROPERTY
		int32_t CompressionQuality; // 0x178(0x4)
		int32_t StreamingPriority; // 0x17C(0x4)
		ESoundwaveSampleRateSettings SampleRateQuality; // 0x180(0x1)
		unsigned char UnknownData13_6[0x1]; // 0x181(0x1) UNKNOWN PROPERTY
		TEnumAsByte SoundGroup; // 0x182(0x1)
		bool bLooping : 1; // 0x183:0(0x1)
		bool bStreaming : 1; // 0x183:1(0x1)
		bool bSeekableStreaming : 1; // 0x183:2(0x1)
		bool bUseBinkAudio : 1; // 0x183:3(0x1)
		ESoundAssetCompressionType SoundAssetCompressionType; // 0x184(0x1)
		unsigned char UnknownData14_6[0x13]; // 0x185(0x13) UNKNOWN PROPERTY
		FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x198(0x168)
		TArray FrequenciesToAnalyze; // 0x300(0x10)
		TArray CookedSpectralTimeData; // 0x310(0x10)
		TArray CookedEnvelopeTimeData; // 0x320(0x10)
		unsigned char UnknownData15_6[0x1C]; // 0x330(0x1C) UNKNOWN PROPERTY
		unsigned char UnknownBit16 : 1; // 0x34C:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit17 : 1; // 0x34C:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit18 : 1; // 0x34C:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit19 : 1; // 0x34C:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit20 : 1; // 0x34C:4(0x1) UNKNOWN PROPERTY
		bool bMature : 1; // 0x34C:5(0x1)
		bool bManualWordWrap : 1; // 0x34C:6(0x1)
		bool bSingleLine : 1; // 0x34C:7(0x1)
		bool bIsAmbisonics : 1; // 0x34D:0(0x1)
		ESoundWaveLoadingBehavior LoadingBehavior; // 0x34E(0x1)
		unsigned char UnknownData21_6[0x1]; // 0x34F(0x1) UNKNOWN PROPERTY
		FString SpokenText; // 0x350(0x10)
		float SubtitlePriority; // 0x360(0x4)
		float Volume; // 0x364(0x4)
		float pitch; // 0x368(0x4)
		int32_t NumChannels; // 0x36C(0x4)
		int32_t SampleRate; // 0x370(0x4)
		unsigned char UnknownData22_6[0xC]; // 0x374(0xC) UNKNOWN PROPERTY
		TArray Subtitles; // 0x380(0x10)
		UCurveTable Curves; // 0x390(0x8)
		UCurveTable InternalCurves; // 0x398(0x8)
		unsigned char UnknownData23_7[0x50]; // 0x3A0(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundWave");
			return ret;
		}

		void SetSoundAssetCompressionType(ESoundAssetCompressionType InSoundAssetCompressionType, bool bMarkDirty); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144CEC38
		ESoundAssetCompressionType GetSoundAssetCompressionType(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144CEB58
		TArray GetLoopRegions(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144CEA78
		TArray GetCuePoints(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144CE998
	};


	// Class Engine.SoundWaveProcedural
	// Inherited from USoundWave -> USoundBase -> UObject
	// Size: 0x50 (0x440 - 0x3F0)
	class USoundWaveProcedural : public USoundWave	
	{
	public:
		unsigned char UnknownData01_1[0x50]; // 0x3F0(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundWaveProcedural");
			return ret;
		}
	};


	// Class Engine.SoundEffectPreset
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class USoundEffectPreset : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x40]; // 0x28(0x40) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundEffectPreset");
			return ret;
		}
	};


	// Class Engine.SoundEffectSubmixPreset
	// Inherited from USoundEffectPreset -> UObject
	// Size: 0x0 (0x68 - 0x68)
	class USoundEffectSubmixPreset : public USoundEffectPreset	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.SoundEffectSubmixPreset");
			return ret;
		}
	};


	// Class Engine.Texture
	// Inherited from UStreamableRenderAsset -> UObject
	// Size: 0x68 (0x130 - 0xC8)
	class UTexture : public UStreamableRenderAsset	
	{
	public:
		unsigned char UnknownData04_3[0x10]; // 0xC8(0x10) UNKNOWN PROPERTY
		FGuid LightingGuid; // 0xD8(0x10)
		int32_t LevelIndex; // 0xE8(0x4)
		int32_t LODBias; // 0xEC(0x4)
		TEnumAsByte CompressionSettings; // 0xF0(0x1)
		TEnumAsByte Filter; // 0xF1(0x1)
		ETextureMipLoadOptions MipLoadOptions; // 0xF2(0x1)
		TEnumAsByte CookPlatformTilingSettings; // 0xF3(0x1)
		bool bOodlePreserveExtremes; // 0xF4(0x1)
		TEnumAsByte LODGroup; // 0xF5(0x1)
		unsigned char UnknownData05_6[0x2]; // 0xF6(0x2) UNKNOWN PROPERTY
		FPerPlatformFloat Downscale; // 0xF8(0x4)
		ETextureDownscaleOptions DownscaleOptions; // 0xFC(0x1)
		ETextureAvailability Availability; // 0xFD(0x1)
		bool SRGB : 1; // 0xFE:0(0x1)
		bool bNoTiling : 1; // 0xFE:1(0x1)
		bool VirtualTextureStreaming : 1; // 0xFE:2(0x1)
		bool CompressionYCoCg : 1; // 0xFE:3(0x1)
		bool bNotOfflineProcessed : 1; // 0xFE:4(0x1)
		bool bAsyncResourceReleaseHasBeenStarted : 1; // 0xFE:5(0x1)
		unsigned char UnknownData06_5[0x1]; // 0xFF(0x1) UNKNOWN PROPERTY
		TArray AssetUserData; // 0x100(0x10)
		unsigned char UnknownData07_7[0x20]; // 0x110(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Texture");
			return ret;
		}

		bool ComputeTextureSourceChannelMinMax(FLinearColor& OutColorMin, FLinearColor& OutColorMax); // Flags: Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|Const 0x7FF4144D6878
		void Blueprint_GetTextureSourceDiskAndMemorySize(int64_t& OutDiskSize, int64_t& OutMemorySize); // Flags: Final|Native|Public|HasOutParms|BlueprintCallable|Const 0x7FF4144D6798
		int64_t Blueprint_GetMemorySize(); // Flags: Final|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144D66B8
		bool AreDownscalePropertiesEditable(); // Flags: Native|Public|Const 0x7FF4144D65D8
	};


	// Class Engine.ActiveSoundUpdateInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UActiveSoundUpdateInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActiveSoundUpdateInterface");
			return ret;
		}
	};


	// Class Engine.Channel
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UChannel : public UObject	
	{
	public:
		UNetConnection Connection; // 0x28(0x8)
		unsigned char UnknownData01_7[0x38]; // 0x30(0x38) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Channel");
			return ret;
		}
	};


	// Class Engine.ActorChannel
	// Inherited from UChannel -> UObject
	// Size: 0x230 (0x298 - 0x68)
	class UActorChannel : public UChannel	
	{
	public:
		AActor Actor; // 0x68(0x8)
		unsigned char UnknownData02_6[0xF0]; // 0x70(0xF0) UNKNOWN PROPERTY
		TArray CreateSubObjects; // 0x160(0x10)
		unsigned char UnknownData03_7[0x128]; // 0x170(0x128) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActorChannel");
			return ret;
		}
	};


	// Class Engine.ActorInstanceManagerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UActorInstanceManagerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ActorInstanceManagerInterface");
			return ret;
		}
	};


	// Class Engine.AnimationAssetExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimationAssetExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimationAssetExtensions");
			return ret;
		}
	};


	// Class Engine.AnimBlueprintClassSubsystem_PropertyAccess
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimBlueprintClassSubsystem_PropertyAccess : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimBlueprintClassSubsystem_PropertyAccess");
			return ret;
		}
	};


	// Class Engine.Interface_AnimCurveMetaData
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UInterface_AnimCurveMetaData : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Interface_AnimCurveMetaData");
			return ret;
		}
	};


	// Class Engine.AnimCurveMetaData
	// Inherited from UAssetUserData -> UObject
	// Size: 0x78 (0xA0 - 0x28)
	class UAnimCurveMetaData : public UAssetUserData	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		TMap CurveMetaData; // 0x30(0x50)
		unsigned char UnknownData03_7[0x20]; // 0x80(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimCurveMetaData");
			return ret;
		}
	};


	// Class Engine.AnimationDataModelNotifiesExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimationDataModelNotifiesExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimationDataModelNotifiesExtensions");
			return ret;
		}
	};


	// Class Engine.AnimLayerInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAnimLayerInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimLayerInterface");
			return ret;
		}
	};


	// Class Engine.AnimationAsset
	// Inherited from UObject
	// Size: 0x58 (0x80 - 0x28)
	class UAnimationAsset : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x10]; // 0x28(0x10) UNKNOWN PROPERTY
		USkeleton Skeleton; // 0x38(0x8)
		unsigned char UnknownData03_6[0x20]; // 0x40(0x20) UNKNOWN PROPERTY
		TArray MetaData; // 0x60(0x10)
		TArray AssetUserData; // 0x70(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimationAsset");
			return ret;
		}

		float GetPlayLength(); // Flags: Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144DF558
		UAnimMetaData FindMetaDataByClass(UClass MetaDataClass); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144DF478
	};


	// Class Engine.AnimSequenceBase
	// Inherited from UAnimationAsset -> UObject
	// Size: 0x30 (0xB0 - 0x80)
	class UAnimSequenceBase : public UAnimationAsset	
	{
	public:
		TArray Notifies; // 0x80(0x10)
		float SequenceLength; // 0x90(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x94(0x4) UNKNOWN PROPERTY
		FRawCurveTracks RawCurveData; // 0x98(0x10)
		float RateScale; // 0xA8(0x4)
		bool bLoop; // 0xAC(0x1)
		unsigned char UnknownData03_7[0x3]; // 0xAD(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnimSequenceBase");
			return ret;
		}
	};


	// Class Engine.RawAnimSequenceTrackExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class URawAnimSequenceTrackExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.RawAnimSequenceTrackExtensions");
			return ret;
		}

		TArray GetScaleKeys(FRawAnimSequenceTrack& Track); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 0x7FF4144DF7F8
		TArray GetRotationalKeys(FRawAnimSequenceTrack& Track); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 0x7FF4144DF718
		TArray GetPositionalKeys(FRawAnimSequenceTrack& Track); // Flags: Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 0x7FF4144DF638
	};


	// Class Engine.AssetExportTask
	// Inherited from UObject
	// Size: 0x50 (0x78 - 0x28)
	class UAssetExportTask : public UObject	
	{
	public:
		UObject Object; // 0x28(0x8)
		UExporter Exporter; // 0x30(0x8)
		FString Filename; // 0x38(0x10)
		bool bSelected; // 0x48(0x1)
		bool bReplaceIdentical; // 0x49(0x1)
		bool bPrompt; // 0x4A(0x1)
		bool bAutomated; // 0x4B(0x1)
		bool bUseFileArchive; // 0x4C(0x1)
		bool bWriteEmptyFiles; // 0x4D(0x1)
		unsigned char UnknownData01_6[0x2]; // 0x4E(0x2) UNKNOWN PROPERTY
		TArray IgnoreObjectList; // 0x50(0x10)
		UObject Options; // 0x60(0x8)
		TArray Errors; // 0x68(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AssetExportTask");
			return ret;
		}
	};


	// Class Engine.AssetManagerSettings
	// Inherited from UDeveloperSettings -> UObject
	// Size: 0xC8 (0xF8 - 0x30)
	class UAssetManagerSettings : public UDeveloperSettings	
	{
	public:
		TArray PrimaryAssetTypesToScan; // 0x30(0x10)
		TArray DirectoriesToExclude; // 0x40(0x10)
		TArray PrimaryAssetRules; // 0x50(0x10)
		TArray CustomPrimaryAssetRules; // 0x60(0x10)
		bool bOnlyCookProductionAssets; // 0x70(0x1)
		bool bShouldManagerDetermineTypeAndName; // 0x71(0x1)
		bool bShouldGuessTypeAndNameInEditor; // 0x72(0x1)
		bool bShouldAcquireMissingChunksOnLoad; // 0x73(0x1)
		bool bShouldWarnAboutInvalidAssets; // 0x74(0x1)
		unsigned char UnknownData01_6[0x3]; // 0x75(0x3) UNKNOWN PROPERTY
		TArray PrimaryAssetIdRedirects; // 0x78(0x10)
		TArray PrimaryAssetTypeRedirects; // 0x88(0x10)
		TArray AssetPathRedirects; // 0x98(0x10)
		TSet MetaDataTagsForAssetRegistry; // 0xA8(0x50)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AssetManagerSettings");
			return ret;
		}
	};


	// Class Engine.AsyncLoadingTests_Shared
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UAsyncLoadingTests_Shared : public UObject	
	{
	public:
		TWeakObjectPtr SoftReference; // 0x28(0x20)
		UObject HardReference; // 0x48(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AsyncLoadingTests_Shared");
			return ret;
		}
	};


	// Class Engine.AsyncPhysicsData
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAsyncPhysicsData : public UObject	
	{
	public:
		int32_t ServerFrame; // 0x28(0x4)
		int32_t ReplicationRedundancy; // 0x2C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AsyncPhysicsData");
			return ret;
		}
	};


	// Class Engine.AudioPanelWidgetInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UAudioPanelWidgetInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AudioPanelWidgetInterface");
			return ret;
		}

		FName GetIconBrushName(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144DF9B8
		FText GetEditorName(); // Flags: RequiredAPI|Event|Public|BlueprintEvent 0x7FF4144DF8D8
	};


	// Class Engine.AutoRTFMTestActor
	// Inherited from AActor -> UObject
	// Size: 0x8 (0x298 - 0x290)
	class AAutoRTFMTestActor : public AActor	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x290(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestActor");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestAnotherActor
	// Inherited from AActor -> UObject
	// Size: 0x8 (0x298 - 0x290)
	class AAutoRTFMTestAnotherActor : public AActor	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x290(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestAnotherActor");
			return ret;
		}
	};


	// Class Engine.BodySetup
	// Inherited from UBodySetupCore -> UObject
	// Size: 0x2C0 (0x2F0 - 0x30)
	class UBodySetup : public UBodySetupCore	
	{
	public:
		FKAggregateGeom AggGeom; // 0x30(0x80)
		bool bAlwaysFullAnimWeight : 1; // 0xB0:0(0x1)
		bool bConsiderForBounds : 1; // 0xB0:1(0x1)
		bool bMeshCollideAll : 1; // 0xB0:2(0x1)
		bool bDoubleSidedGeometry : 1; // 0xB0:3(0x1)
		bool bGenerateNonMirroredCollision : 1; // 0xB0:4(0x1)
		bool bSharedCookedData : 1; // 0xB0:5(0x1)
		bool bGenerateMirroredCollision : 1; // 0xB0:6(0x1)
		bool bSupportUVsAndFaceRemap : 1; // 0xB0:7(0x1)
		unsigned char UnknownBit07 : 1; // 0xB1:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit08 : 1; // 0xB1:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit09 : 1; // 0xB1:2(0x1) UNKNOWN PROPERTY
		bool bNeverNeedsCookedCollisionData : 1; // 0xB1:3(0x1)
		unsigned char UnknownData10_5[0x6]; // 0xB2(0x6) UNKNOWN PROPERTY
		UPhysicalMaterial PhysMaterial; // 0xB8(0x8)
		FWalkableSlopeOverride WalkableSlopeOverride; // 0xC0(0x10)
		unsigned char UnknownData11_6[0x70]; // 0xD0(0x70) UNKNOWN PROPERTY
		FBodyInstance DefaultInstance; // 0x140(0x170)
		unsigned char UnknownData12_6[0x8]; // 0x2B0(0x8) UNKNOWN PROPERTY
		FVector BuildScale3D; // 0x2B8(0x18)
		unsigned char UnknownData13_7[0x20]; // 0x2D0(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BodySetup");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestBodySetup
	// Inherited from UBodySetup -> UBodySetupCore -> UObject
	// Size: 0x8 (0x2F8 - 0x2F0)
	class UAutoRTFMTestBodySetup : public UBodySetup	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x2F0(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestBodySetup");
			return ret;
		}
	};


	// Class Engine.ChildActorComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x50 (0x270 - 0x220)
	class UChildActorComponent : public USceneComponent	
	{
	public:
		UClass ChildActorClass; // 0x220(0x8)
		AActor ChildActor; // 0x228(0x8)
		AActor ChildActorTemplate; // 0x230(0x8)
		unsigned char UnknownData02_6[0x18]; // 0x238(0x18) UNKNOWN PROPERTY
		bool bChildActorIsTransient : 1; // 0x250:0(0x1)
		unsigned char UnknownData03_7[0x1F]; // 0x251(0x1F) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChildActorComponent");
			return ret;
		}

		void SetChildActorClass(UClass InClass); // Flags: Final|Native|Public|BlueprintCallable 0x7FF4144DFC58
		void OnRep_ChildActor(); // Flags: Final|Native|Private 0x7FF4144DFB78
		void OnChildActorDestroyed(AActor Actor); // Flags: Final|RequiredAPI|Native|Private 0x7FF4144DFA98
	};


	// Class Engine.AutoRTFMTestChildActorComponent
	// Inherited from UChildActorComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x0 (0x270 - 0x270)
	class UAutoRTFMTestChildActorComponent : public UChildActorComponent	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestChildActorComponent");
			return ret;
		}
	};


	// Class Engine.Level
	// Inherited from UObject
	// Size: 0x2F0 (0x318 - 0x28)
	class ULevel : public UObject	
	{
	public:
		unsigned char UnknownData17_3[0x98]; // 0x28(0x98) UNKNOWN PROPERTY
		UWorld OwningWorld; // 0xC0(0x8)
		UModel Model; // 0xC8(0x8)
		TArray ModelComponents; // 0xD0(0x10)
		ULevelActorContainer ActorCluster; // 0xE0(0x8)
		int32_t NumTextureStreamingUnbuiltComponents; // 0xE8(0x4)
		int32_t NumTextureStreamingDirtyResources; // 0xEC(0x4)
		ALevelScriptActor LevelScriptActor; // 0xF0(0x8)
		ANavigationObjectBase NavListStart; // 0xF8(0x8)
		ANavigationObjectBase NavListEnd; // 0x100(0x8)
		TArray NavDataChunks; // 0x108(0x10)
		float LightmapTotalSize; // 0x118(0x4)
		float ShadowmapTotalSize; // 0x11C(0x4)
		TArray StaticNavigableGeometry; // 0x120(0x10)
		TArray StreamingTextureGuids; // 0x130(0x10)
		TArray StreamingTextures; // 0x140(0x10)
		uint32_t PackedTextureStreamingQualityLevelFeatureLevel; // 0x150(0x4)
		unsigned char UnknownData18_6[0xBC]; // 0x154(0xBC) UNKNOWN PROPERTY
		FGuid LevelBuildDataId; // 0x210(0x10)
		UMapBuildDataRegistry MapBuildData; // 0x220(0x8)
		FIntVector LightBuildLevelOffset; // 0x228(0xC)
		unsigned char UnknownData19_6[0xC]; // 0x234(0xC) UNKNOWN PROPERTY
		bool bIsLightingScenario : 1; // 0x240:0(0x1)
		unsigned char UnknownBit20 : 1; // 0x240:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit21 : 1; // 0x240:2(0x1) UNKNOWN PROPERTY
		bool bTextureStreamingRotationChanged : 1; // 0x240:3(0x1)
		bool bStaticComponentsRegisteredInStreamingManager : 1; // 0x240:4(0x1)
		bool bIsVisible : 1; // 0x240:5(0x1)
		unsigned char UnknownData22_3[0x1]; // 0x241(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit23 : 1; // 0x242:0(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit24 : 1; // 0x242:1(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit25 : 1; // 0x242:2(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit26 : 1; // 0x242:3(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit27 : 1; // 0x242:4(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit28 : 1; // 0x242:5(0x1) UNKNOWN PROPERTY
		unsigned char UnknownBit29 : 1; // 0x242:6(0x1) UNKNOWN PROPERTY
		bool bIsPartitioned : 1; // 0x242:7(0x1)
		unsigned char UnknownData30_5[0x65]; // 0x243(0x65) UNKNOWN PROPERTY
		AWorldSettings WorldSettings; // 0x2A8(0x8)
		AWorldDataLayers WorldDataLayers; // 0x2B0(0x8)
		TWeakObjectPtr WorldPartitionRuntimeCell; // 0x2B8(0x20)
		unsigned char UnknownData31_6[0x8]; // 0x2D8(0x8) UNKNOWN PROPERTY
		TArray AssetUserData; // 0x2E0(0x10)
		unsigned char UnknownData32_6[0x10]; // 0x2F0(0x10) UNKNOWN PROPERTY
		TArray DestroyedReplicatedStaticActors; // 0x300(0x10)
		unsigned char UnknownData33_7[0x8]; // 0x310(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Level");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestLevel
	// Inherited from ULevel -> UObject
	// Size: 0x8 (0x320 - 0x318)
	class UAutoRTFMTestLevel : public ULevel	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x318(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestLevel");
			return ret;
		}
	};


	// Class Engine.AutoRTFMTestObject
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UAutoRTFMTestObject : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestObject");
			return ret;
		}

		void OnComponentPhysicsStateChanged(UPrimitiveComponent ChangedComponent, EComponentPhysicsStateChange StateChange); // Flags: Final|RequiredAPI|Native|Public 0x7FF4144DFD38
	};


	// Class Engine.AutoRTFMTestPrimitiveComponent
	// Inherited from UPrimitiveComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x18 (0x4E0 - 0x4C8)
	class UAutoRTFMTestPrimitiveComponent : public UPrimitiveComponent	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x4C8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AutoRTFMTestPrimitiveComponent");
			return ret;
		}
	};


	// Class Engine.BlendableInterface
	// Inherited from UInterface -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBlendableInterface : public UInterface	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlendableInterface");
			return ret;
		}
	};


	// Class Engine.AnalysisProperties
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UAnalysisProperties : public UObject	
	{
	public:
		FString Function; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.AnalysisProperties");
			return ret;
		}
	};


	// Class Engine.BlendSpace
	// Inherited from UAnimationAsset -> UObject
	// Size: 0x140 (0x1C0 - 0x80)
	class UBlendSpace : public UAnimationAsset	
	{
	public:
		unsigned char UnknownData07_3[0x8]; // 0x80(0x8) UNKNOWN PROPERTY
		bool bContainsRotationOffsetMeshSpaceSamples; // 0x88(0x1)
		unsigned char UnknownData08_6[0x3]; // 0x89(0x3) UNKNOWN PROPERTY
		FInterpolationParameter InterpolationParam; // 0x8C(0x30)
		float TargetWeightInterpolationSpeedPerSec; // 0xBC(0x4)
		bool bTargetWeightInterpolationEaseInOut; // 0xC0(0x1)
		bool bAllowMeshSpaceBlending; // 0xC1(0x1)
		bool bLoop; // 0xC2(0x1)
		unsigned char UnknownData09_6[0x1]; // 0xC3(0x1) UNKNOWN PROPERTY
		float AnimLength; // 0xC4(0x4)
		TEnumAsByte NotifyTriggerMode; // 0xC8(0x1)
		bool bInterpolateUsingGrid; // 0xC9(0x1)
		EPreferredTriangulationDirection PreferredTriangulationDirection; // 0xCA(0x1)
		EBlendSpacePerBoneBlendMode PerBoneBlendMode; // 0xCB(0x1)
		unsigned char UnknownData10_6[0x4]; // 0xCC(0x4) UNKNOWN PROPERTY
		TArray ManualPerBoneOverrides; // 0xD0(0x10)
		FBlendSpaceBlendProfile PerBoneBlendProfile; // 0xE0(0x10)
		unsigned char UnknownData11_6[0x10]; // 0xF0(0x10) UNKNOWN PROPERTY
		int32_t SampleIndexWithMarkers; // 0x100(0x4)
		unsigned char UnknownData12_6[0x4]; // 0x104(0x4) UNKNOWN PROPERTY
		TArray SampleData; // 0x108(0x10)
		TArray GridSamples; // 0x118(0x10)
		FBlendSpaceData BlendSpaceData; // 0x128(0x20)
		FBlendParameter BlendParameters; // 0x148(0x60)
		TEnumAsByte AxisToScaleAnimation; // 0x1A8(0x1)
		unsigned char UnknownData13_6[0x7]; // 0x1A9(0x7) UNKNOWN PROPERTY
		TArray DimensionIndices; // 0x1B0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlendSpace");
			return ret;
		}
	};


	// Class Engine.Breakpoint
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBreakpoint : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Breakpoint");
			return ret;
		}
	};


	// Class Engine.BlueprintExtension
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBlueprintExtension : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BlueprintExtension");
			return ret;
		}
	};


	// Class Engine.BookmarkBase
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBookmarkBase : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BookmarkBase");
			return ret;
		}
	};


	// Class Engine.BookMark2D
	// Inherited from UBookmarkBase -> UObject
	// Size: 0x10 (0x38 - 0x28)
	class UBookMark2D : public UBookmarkBase	
	{
	public:
		float Zoom2D; // 0x28(0x4)
		FIntPoint Location; // 0x2C(0x8)
		unsigned char UnknownData01_7[0x4]; // 0x34(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BookMark2D");
			return ret;
		}
	};


	// Class Engine.ReflectionCapture
	// Inherited from AActor -> UObject
	// Size: 0x8 (0x298 - 0x290)
	class AReflectionCapture : public AActor	
	{
	public:
		UReflectionCaptureComponent CaptureComponent; // 0x290(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ReflectionCapture");
			return ret;
		}
	};


	// Class Engine.BoxReflectionCapture
	// Inherited from AReflectionCapture -> AActor -> UObject
	// Size: 0x0 (0x298 - 0x298)
	class ABoxReflectionCapture : public AReflectionCapture	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BoxReflectionCapture");
			return ret;
		}
	};


	// Class Engine.ReflectionCaptureComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0x70 (0x290 - 0x220)
	class UReflectionCaptureComponent : public USceneComponent	
	{
	public:
		UBillboardComponent CaptureOffsetComponent; // 0x220(0x8)
		EReflectionSourceType ReflectionSourceType; // 0x228(0x1)
		unsigned char UnknownData02_6[0x7]; // 0x229(0x7) UNKNOWN PROPERTY
		UTextureCube Cubemap; // 0x230(0x8)
		float SourceCubemapAngle; // 0x238(0x4)
		float Brightness; // 0x23C(0x4)
		FVector CaptureOffset; // 0x240(0x18)
		FGuid MapBuildDataId; // 0x258(0x10)
		unsigned char UnknownData03_7[0x20]; // 0x268(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ReflectionCaptureComponent");
			return ret;
		}
	};


	// Class Engine.BoxReflectionCaptureComponent
	// Inherited from UReflectionCaptureComponent -> USceneComponent -> UActorComponent -> UObject
	// Size: 0x18 (0x2A0 - 0x288)
	class UBoxReflectionCaptureComponent : public UReflectionCaptureComponent	
	{
	public:
		float BoxTransitionDistance; // 0x288(0x4)
		unsigned char UnknownData01_6[0x4]; // 0x28C(0x4) UNKNOWN PROPERTY
		UBoxComponent PreviewInfluenceBox; // 0x290(0x8)
		UBoxComponent PreviewCaptureBox; // 0x298(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BoxReflectionCaptureComponent");
			return ret;
		}
	};


	// Class Engine.BuiltInAttributesExtensions
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UBuiltInAttributesExtensions : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.BuiltInAttributesExtensions");
			return ret;
		}
	};


	// Class Engine.ChaosBlueprintLibrary
	// Inherited from UBlueprintFunctionLibrary -> UObject
	// Size: 0x0 (0x28 - 0x28)
	class UChaosBlueprintLibrary : public UBlueprintFunctionLibrary	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChaosBlueprintLibrary");
			return ret;
		}

		UChaosEventRelay GetEventRelayFromContext(UObject ContextObject); // Flags: Final|Native|Static|Public|BlueprintCallable|BlueprintPure 0x7FF4144DFE18
	};


	// Class Engine.ChaosEventRelay
	// Inherited from UObject
	// Size: 0x40 (0x68 - 0x28)
	class UChaosEventRelay : public UObject	
	{
	public:
		FMulticastInlineDelegate OnCollisionEvent; // 0x28(0x10)
		FMulticastInlineDelegate OnBreakEvent; // 0x38(0x10)
		FMulticastInlineDelegate OnRemovalEvent; // 0x48(0x10)
		FMulticastInlineDelegate OnCrumblingEvent; // 0x58(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChaosEventRelay");
			return ret;
		}
	};


	// Class Engine.Player
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UPlayer : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		APlayerController PlayerController; // 0x30(0x8)
		int32_t CurrentNetSpeed; // 0x38(0x4)
		int32_t ConfiguredInternetSpeed; // 0x3C(0x4)
		int32_t ConfiguredLanSpeed; // 0x40(0x4)
		unsigned char UnknownData03_7[0x4]; // 0x44(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Player");
			return ret;
		}
	};


	// Class Engine.NetConnection
	// Inherited from UPlayer -> UObject
	// Size: 0x1DC8 (0x1E10 - 0x48)
	class UNetConnection : public UPlayer	
	{
	public:
		TArray Children; // 0x48(0x10)
		UNetDriver Driver; // 0x58(0x8)
		UClass PackageMapClass; // 0x60(0x8)
		UPackageMap PackageMap; // 0x68(0x8)
		TArray OpenChannels; // 0x70(0x10)
		TArray SentTemporaries; // 0x80(0x10)
		AActor ViewTarget; // 0x90(0x8)
		AActor OwningActor; // 0x98(0x8)
		int32_t MaxPacket; // 0xA0(0x4)
		bool InternalAck : 1; // 0xA4:0(0x1)
		unsigned char UnknownData05_5[0xBB]; // 0xA5(0xBB) UNKNOWN PROPERTY
		FUniqueNetIdRepl PlayerId; // 0x160(0x30)
		unsigned char UnknownData06_6[0x48]; // 0x190(0x48) UNKNOWN PROPERTY
		double LastReceiveTime; // 0x1D8(0x8)
		unsigned char UnknownData07_6[0x11E0]; // 0x1E0(0x11E0) UNKNOWN PROPERTY
		int32_t DefaultMaxChannelSize; // 0x13C0(0x4)
		unsigned char UnknownData08_6[0x334]; // 0x13C4(0x334) UNKNOWN PROPERTY
		TArray ChannelsToTick; // 0x16F8(0x10)
		unsigned char UnknownData09_7[0x708]; // 0x1708(0x708) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.NetConnection");
			return ret;
		}
	};


	// Class Engine.ChildConnection
	// Inherited from UNetConnection -> UPlayer -> UObject
	// Size: 0x8 (0x1E18 - 0x1E10)
	class UChildConnection : public UNetConnection	
	{
	public:
		UNetConnection Parent; // 0x1E10(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ChildConnection");
			return ret;
		}
	};


	// Class Engine.PlatformInterfaceBase
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UPlatformInterfaceBase : public UObject	
	{
	public:
		TArray AllDelegates; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PlatformInterfaceBase");
			return ret;
		}
	};


	// Class Engine.CloudStorageBase
	// Inherited from UPlatformInterfaceBase -> UObject
	// Size: 0x18 (0x50 - 0x38)
	class UCloudStorageBase : public UPlatformInterfaceBase	
	{
	public:
		TArray LocalCloudFiles; // 0x38(0x10)
		bool bSuppressDelegateCalls : 1; // 0x48:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.CloudStorageBase");
			return ret;
		}
	};


	// Class Engine.ContentBundleTypeFactory
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UContentBundleTypeFactory : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ContentBundleTypeFactory");
			return ret;
		}
	};


	// Class Engine.ControlChannel
	// Inherited from UChannel -> UObject
	// Size: 0x18 (0x80 - 0x68)
	class UControlChannel : public UChannel	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x68(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ControlChannel");
			return ret;
		}
	};


	// Class Engine.WorldPartition
	// Inherited from UObject
	// Size: 0xD8 (0x100 - 0x28)
	class UWorldPartition : public UObject	
	{
	public:
		unsigned char UnknownData03_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		UWorldPartitionRuntimeHash RuntimeHash; // 0x30(0x8)
		bool bEnableStreaming; // 0x38(0x1)
		EWorldPartitionServerStreamingMode ServerStreamingMode; // 0x39(0x1)
		EWorldPartitionServerStreamingOutMode ServerStreamingOutMode; // 0x3A(0x1)
		EWorldPartitionDataLayersLogicOperator DataLayersLogicOperator; // 0x3B(0x1)
		bool bDisableContentBundles : 1; // 0x3C:0(0x1)
		unsigned char UnknownData04_5[0x93]; // 0x3D(0x93) UNKNOWN PROPERTY
		UDataLayerManager DataLayerManager; // 0xD0(0x8)
		UExternalDataLayerManager ExternalDataLayerManager; // 0xD8(0x8)
		UWorldPartitionStreamingPolicy StreamingPolicy; // 0xE0(0x8)
		unsigned char UnknownData05_7[0x18]; // 0xE8(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.WorldPartition");
			return ret;
		}
	};


	// Class Engine.DataLayerManager
	// Inherited from UObject
	// Size: 0xB0 (0xD8 - 0x28)
	class UDataLayerManager : public UObject	
	{
	public:
		FMulticastInlineDelegate OnDataLayerInstanceRuntimeStateChanged; // 0x28(0x10)
		TSet ReferencedObjects; // 0x38(0x50)
		unsigned char UnknownData01_7[0x50]; // 0x88(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DataLayerManager");
			return ret;
		}

		bool SetDataLayerRuntimeState(UDataLayerAsset InDataLayerAsset, EDataLayerRuntimeState InState, bool bInIsRecursive); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0438
		bool SetDataLayerInstanceRuntimeState(UDataLayerInstance InDataLayerInstance, EDataLayerRuntimeState InState, bool bInIsRecursive); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0358
		TArray GetDataLayerInstances(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144E0278
		EDataLayerRuntimeState GetDataLayerInstanceRuntimeState(UDataLayerInstance InDataLayerInstance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144E0198
		UDataLayerInstance GetDataLayerInstanceFromName(FName& InDataLayerInstanceName); // Flags: Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 0x7FF4144E00B8
		UDataLayerInstance GetDataLayerInstanceFromAsset(UDataLayerAsset InDataLayerAsset); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144DFFD8
		EDataLayerRuntimeState GetDataLayerInstanceEffectiveRuntimeState(UDataLayerInstance InDataLayerInstance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144DFEF8
	};


	// Class Engine.DebugGarbageCollectionGraph
	// Inherited from UObject
	// Size: 0x20 (0x48 - 0x28)
	class UDebugGarbageCollectionGraph : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x20]; // 0x28(0x20) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DebugGarbageCollectionGraph");
			return ret;
		}
	};


	// Class Engine.DeletedObjectPlaceholder
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UDeletedObjectPlaceholder : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DeletedObjectPlaceholder");
			return ret;
		}
	};


	// Class Engine.DemoNetConnection
	// Inherited from UNetConnection -> UPlayer -> UObject
	// Size: 0x50 (0x1E60 - 0x1E10)
	class UDemoNetConnection : public UNetConnection	
	{
	public:
		unsigned char UnknownData01_1[0x50]; // 0x1E10(0x50) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DemoNetConnection");
			return ret;
		}
	};


	// Class Engine.PendingNetGame
	// Inherited from UObject
	// Size: 0x98 (0xC0 - 0x28)
	class UPendingNetGame : public UObject	
	{
	public:
		unsigned char UnknownData02_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		UNetDriver NetDriver; // 0x30(0x8)
		UDemoNetDriver DemoNetDriver; // 0x38(0x8)
		unsigned char UnknownData03_7[0x80]; // 0x40(0x80) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.PendingNetGame");
			return ret;
		}
	};


	// Class Engine.DemoPendingNetGame
	// Inherited from UPendingNetGame -> UObject
	// Size: 0x0 (0xC0 - 0xC0)
	class UDemoPendingNetGame : public UPendingNetGame	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DemoPendingNetGame");
			return ret;
		}
	};


	// Class Engine.DeviceProfileFragment
	// Inherited from UObject
	// Size: 0x10 (0x38 - 0x28)
	class UDeviceProfileFragment : public UObject	
	{
	public:
		TArray CVars; // 0x28(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DeviceProfileFragment");
			return ret;
		}
	};


	// Class Engine.DialogueSoundWaveProxy
	// Inherited from USoundBase -> UObject
	// Size: 0x18 (0x180 - 0x168)
	class UDialogueSoundWaveProxy : public USoundBase	
	{
	public:
		unsigned char UnknownData01_1[0x18]; // 0x168(0x18) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DialogueSoundWaveProxy");
			return ret;
		}
	};


	// Class Engine.Light
	// Inherited from AActor -> UObject
	// Size: 0x10 (0x2A0 - 0x290)
	class ALight : public AActor	
	{
	public:
		ULightComponent LightComponent; // 0x290(0x8)
		bool bEnabled : 1; // 0x298:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x299(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Light");
			return ret;
		}

		void ToggleEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0F98
		void SetLightFunctionScale(FVector NewLightFunctionScale); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E0EB8
		void SetLightFunctionMaterial(UMaterialInterface NewLightFunctionMaterial); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0DD8
		void SetLightFunctionFadeDistance(float NewLightFunctionFadeDistance); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0CF8
		void SetLightColor(FLinearColor NewLightColor); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E0C18
		void SetEnabled(bool bSetEnabled); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0B38
		void SetCastShadows(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0A58
		void SetBrightness(float NewBrightness); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0978
		void SetAffectTranslucentLighting(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E0898
		void OnRep_bEnabled(); // Flags: RequiredAPI|Native|Public 0x7FF4144E07B8
		bool IsEnabled(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144E06D8
		FLinearColor GetLightColor(); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 0x7FF4144E05F8
		float GetBrightness(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144E0518
	};


	// Class Engine.DirectionalLight
	// Inherited from ALight -> AActor -> UObject
	// Size: 0x0 (0x2A0 - 0x2A0)
	class ADirectionalLight : public ALight	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DirectionalLight");
			return ret;
		}
	};


	// Class Engine.Distribution
	// Inherited from UObject
	// Size: 0x8 (0x30 - 0x28)
	class UDistribution : public UObject	
	{
	public:
		unsigned char UnknownData01_1[0x8]; // 0x28(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Distribution");
			return ret;
		}
	};


	// Class Engine.DistributionFloat
	// Inherited from UDistribution -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class UDistributionFloat : public UDistribution	
	{
	public:
		bool bCanBeBaked : 1; // 0x30:0(0x1)
		unsigned char UnknownBit02 : 1; // 0x30:1(0x1) UNKNOWN PROPERTY
		bool bBakedDataSuccesfully : 1; // 0x30:2(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloat");
			return ret;
		}
	};


	// Class Engine.DistributionFloatConstant
	// Inherited from UDistributionFloat -> UDistribution -> UObject
	// Size: 0x8 (0x40 - 0x38)
	class UDistributionFloatConstant : public UDistributionFloat	
	{
	public:
		float Constant; // 0x38(0x4)
		unsigned char UnknownData01_7[0x4]; // 0x3C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloatConstant");
			return ret;
		}
	};


	// Class Engine.DistributionFloatConstantCurve
	// Inherited from UDistributionFloat -> UDistribution -> UObject
	// Size: 0x18 (0x50 - 0x38)
	class UDistributionFloatConstantCurve : public UDistributionFloat	
	{
	public:
		FInterpCurveFloat ConstantCurve; // 0x38(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloatConstantCurve");
			return ret;
		}
	};


	// Class Engine.DistributionFloatParameterBase
	// Inherited from UDistributionFloatConstant -> UDistributionFloat -> UDistribution -> UObject
	// Size: 0x18 (0x58 - 0x40)
	class UDistributionFloatParameterBase : public UDistributionFloatConstant	
	{
	public:
		FName ParameterName; // 0x40(0x4)
		float MinInput; // 0x44(0x4)
		float MaxInput; // 0x48(0x4)
		float MinOutput; // 0x4C(0x4)
		float MaxOutput; // 0x50(0x4)
		TEnumAsByte ParamMode; // 0x54(0x1)
		unsigned char UnknownData01_7[0x3]; // 0x55(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloatParameterBase");
			return ret;
		}
	};


	// Class Engine.DistributionFloatParticleParameter
	// Inherited from UDistributionFloatParameterBase -> UDistributionFloatConstant -> UDistributionFloat -> UDistribution -> UObject
	// Size: 0x0 (0x58 - 0x58)
	class UDistributionFloatParticleParameter : public UDistributionFloatParameterBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloatParticleParameter");
			return ret;
		}
	};


	// Class Engine.DistributionFloatUniform
	// Inherited from UDistributionFloat -> UDistribution -> UObject
	// Size: 0x8 (0x40 - 0x38)
	class UDistributionFloatUniform : public UDistributionFloat	
	{
	public:
		float Min; // 0x38(0x4)
		float Max; // 0x3C(0x4)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloatUniform");
			return ret;
		}
	};


	// Class Engine.DistributionFloatUniformCurve
	// Inherited from UDistributionFloat -> UDistribution -> UObject
	// Size: 0x18 (0x50 - 0x38)
	class UDistributionFloatUniformCurve : public UDistributionFloat	
	{
	public:
		FInterpCurveVector2D ConstantCurve; // 0x38(0x18)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionFloatUniformCurve");
			return ret;
		}
	};


	// Class Engine.DistributionVector
	// Inherited from UDistribution -> UObject
	// Size: 0x8 (0x38 - 0x30)
	class UDistributionVector : public UDistribution	
	{
	public:
		bool bCanBeBaked : 1; // 0x30:0(0x1)
		bool bIsDirty : 1; // 0x30:1(0x1)
		bool bBakedDataSuccesfully : 1; // 0x30:2(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x31(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVector");
			return ret;
		}
	};


	// Class Engine.DistributionVectorConstant
	// Inherited from UDistributionVector -> UDistribution -> UObject
	// Size: 0x20 (0x58 - 0x38)
	class UDistributionVectorConstant : public UDistributionVector	
	{
	public:
		FVector Constant; // 0x38(0x18)
		bool bLockAxes : 1; // 0x50:0(0x1)
		unsigned char UnknownData02_5[0x3]; // 0x51(0x3) UNKNOWN PROPERTY
		TEnumAsByte LockedAxes; // 0x54(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x55(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVectorConstant");
			return ret;
		}
	};


	// Class Engine.DistributionVectorConstantCurve
	// Inherited from UDistributionVector -> UDistribution -> UObject
	// Size: 0x20 (0x58 - 0x38)
	class UDistributionVectorConstantCurve : public UDistributionVector	
	{
	public:
		FInterpCurveVector ConstantCurve; // 0x38(0x18)
		bool bLockAxes : 1; // 0x50:0(0x1)
		unsigned char UnknownData02_5[0x3]; // 0x51(0x3) UNKNOWN PROPERTY
		TEnumAsByte LockedAxes; // 0x54(0x1)
		unsigned char UnknownData03_7[0x3]; // 0x55(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVectorConstantCurve");
			return ret;
		}
	};


	// Class Engine.DistributionVectorParameterBase
	// Inherited from UDistributionVectorConstant -> UDistributionVector -> UDistribution -> UObject
	// Size: 0x70 (0xC8 - 0x58)
	class UDistributionVectorParameterBase : public UDistributionVectorConstant	
	{
	public:
		FName ParameterName; // 0x58(0x4)
		unsigned char UnknownData02_6[0x4]; // 0x5C(0x4) UNKNOWN PROPERTY
		FVector MinInput; // 0x60(0x18)
		FVector MaxInput; // 0x78(0x18)
		FVector MinOutput; // 0x90(0x18)
		FVector MaxOutput; // 0xA8(0x18)
		TEnumAsByte ParamModes; // 0xC0(0x3)
		unsigned char UnknownData03_7[0x5]; // 0xC3(0x5) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVectorParameterBase");
			return ret;
		}
	};


	// Class Engine.DistributionVectorParticleParameter
	// Inherited from UDistributionVectorParameterBase -> UDistributionVectorConstant -> UDistributionVector -> UDistribution -> UObject
	// Size: 0x0 (0xC8 - 0xC8)
	class UDistributionVectorParticleParameter : public UDistributionVectorParameterBase	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVectorParticleParameter");
			return ret;
		}
	};


	// Class Engine.DistributionVectorUniform
	// Inherited from UDistributionVector -> UDistribution -> UObject
	// Size: 0x40 (0x78 - 0x38)
	class UDistributionVectorUniform : public UDistributionVector	
	{
	public:
		FVector Max; // 0x38(0x18)
		FVector Min; // 0x50(0x18)
		bool bLockAxes : 1; // 0x68:0(0x1)
		unsigned char UnknownData02_5[0x3]; // 0x69(0x3) UNKNOWN PROPERTY
		TEnumAsByte LockedAxes; // 0x6C(0x1)
		TEnumAsByte MirrorFlags; // 0x6D(0x3)
		bool bUseExtremes : 1; // 0x70:0(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x71(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVectorUniform");
			return ret;
		}
	};


	// Class Engine.DistributionVectorUniformCurve
	// Inherited from UDistributionVector -> UDistribution -> UObject
	// Size: 0x28 (0x60 - 0x38)
	class UDistributionVectorUniformCurve : public UDistributionVector	
	{
	public:
		FInterpCurveTwoVectors ConstantCurve; // 0x38(0x18)
		bool bLockAxes1 : 1; // 0x50:0(0x1)
		bool bLockAxes2 : 1; // 0x50:1(0x1)
		unsigned char UnknownData03_5[0x3]; // 0x51(0x3) UNKNOWN PROPERTY
		TEnumAsByte LockedAxes; // 0x54(0x2)
		TEnumAsByte MirrorFlags; // 0x56(0x3)
		unsigned char UnknownData04_6[0x3]; // 0x59(0x3) UNKNOWN PROPERTY
		bool bUseExtremes : 1; // 0x5C:0(0x1)
		unsigned char UnknownData05_7[0x3]; // 0x5D(0x3) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.DistributionVectorUniformCurve");
			return ret;
		}
	};


	// Class Engine.GraphNodeContextMenuContext
	// Inherited from UObject
	// Size: 0x28 (0x50 - 0x28)
	class UGraphNodeContextMenuContext : public UObject	
	{
	public:
		UBlueprint Blueprint; // 0x28(0x8)
		UEdGraph Graph; // 0x30(0x8)
		UEdGraphNode Node; // 0x38(0x8)
		unsigned char UnknownData02_6[0x8]; // 0x40(0x8) UNKNOWN PROPERTY
		bool bIsDebugging; // 0x48(0x1)
		unsigned char UnknownData03_7[0x7]; // 0x49(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.GraphNodeContextMenuContext");
			return ret;
		}
	};


	// Class Engine.EdGraphPin_Deprecated
	// Inherited from UObject
	// Size: 0xD8 (0x100 - 0x28)
	class UEdGraphPin_Deprecated : public UObject	
	{
	public:
		FString PinName; // 0x28(0x10)
		FString PinToolTip; // 0x38(0x10)
		TEnumAsByte Direction; // 0x48(0x1)
		unsigned char UnknownData01_6[0x7]; // 0x49(0x7) UNKNOWN PROPERTY
		FEdGraphPinType PinType; // 0x50(0x48)
		FString DefaultValue; // 0x98(0x10)
		FString AutogeneratedDefaultValue; // 0xA8(0x10)
		UObject DefaultObject; // 0xB8(0x8)
		FText DefaultTextValue; // 0xC0(0x10)
		TArray LinkedTo; // 0xD0(0x10)
		TArray SubPins; // 0xE0(0x10)
		UEdGraphPin_Deprecated ParentPin; // 0xF0(0x8)
		UEdGraphPin_Deprecated ReferencePassThroughConnection; // 0xF8(0x8)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EdGraphPin_Deprecated");
			return ret;
		}
	};


	// Class Engine.EdGraphSchema
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEdGraphSchema : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EdGraphSchema");
			return ret;
		}
	};


	// Class Engine.Emitter
	// Inherited from AActor -> UObject
	// Size: 0x50 (0x2E0 - 0x290)
	class AEmitter : public AActor	
	{
	public:
		UParticleSystemComponent ParticleSystemComponent; // 0x290(0x8)
		bool bDestroyOnSystemFinish : 1; // 0x298:0(0x1)
		bool bPostUpdateTickGroup : 1; // 0x298:1(0x1)
		bool bCurrentlyActive : 1; // 0x298:2(0x1)
		unsigned char UnknownData01_5[0x7]; // 0x299(0x7) UNKNOWN PROPERTY
		FMulticastInlineDelegate OnParticleSpawn; // 0x2A0(0x10)
		FMulticastInlineDelegate OnParticleBurst; // 0x2B0(0x10)
		FMulticastInlineDelegate OnParticleDeath; // 0x2C0(0x10)
		FMulticastInlineDelegate OnParticleCollide; // 0x2D0(0x10)

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Emitter");
			return ret;
		}

		void ToggleActive(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1A18
		void SetVectorParameter(FName ParameterName, FVector Param); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E1938
		void SetTemplate(UParticleSystem NewTemplate); // Flags: RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1858
		void SetMaterialParameter(FName ParameterName, UMaterialInterface Param); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1778
		void SetFloatParameter(FName ParameterName, float Param); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1698
		void SetColorParameter(FName ParameterName, FLinearColor Param); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E15B8
		void SetActorParameter(FName ParameterName, AActor Param); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E14D8
		void OnRep_bCurrentlyActive(); // Flags: RequiredAPI|Native|Public 0x7FF4144E13F8
		void OnParticleSystemFinished(UParticleSystemComponent FinishedComponent); // Flags: RequiredAPI|Native|Public 0x7FF4144E1318
		bool IsActive(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 0x7FF4144E1238
		void Deactivate(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1158
		void Activate(); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1078
	};


	// Class Engine.EmitterCameraLensEffectBase
	// Inherited from AEmitter -> AActor -> UObject
	// Size: 0xA0 (0x380 - 0x2E0)
	class AEmitterCameraLensEffectBase : public AEmitter	
	{
	public:
		unsigned char UnknownData04_3[0x8]; // 0x2E0(0x8) UNKNOWN PROPERTY
		UParticleSystem PS_CameraEffect; // 0x2E8(0x8)
		APlayerCameraManager BaseCamera; // 0x2F0(0x8)
		unsigned char UnknownData05_6[0x8]; // 0x2F8(0x8) UNKNOWN PROPERTY
		FTransform RelativeTransform; // 0x300(0x60)
		float BaseFOV; // 0x360(0x4)
		bool bAllowMultipleInstances : 1; // 0x364:0(0x1)
		bool bResetWhenRetriggered : 1; // 0x364:1(0x1)
		unsigned char UnknownData06_5[0x3]; // 0x365(0x3) UNKNOWN PROPERTY
		TArray EmittersToTreatAsSame; // 0x368(0x10)
		float DistFromCamera; // 0x378(0x4)
		unsigned char UnknownData07_7[0x4]; // 0x37C(0x4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EmitterCameraLensEffectBase");
			return ret;
		}
	};


	// Class Engine.Engine
	// Inherited from UObject
	// Size: 0xEF8 (0xF20 - 0x28)
	class UEngine : public UObject	
	{
	public:
		unsigned char UnknownData23_3[0x8]; // 0x28(0x8) UNKNOWN PROPERTY
		UFont TinyFont; // 0x30(0x8)
		FSoftObjectPath TinyFontName; // 0x38(0x18)
		UFont SmallFont; // 0x50(0x8)
		FSoftObjectPath SmallFontName; // 0x58(0x18)
		UFont MediumFont; // 0x70(0x8)
		FSoftObjectPath MediumFontName; // 0x78(0x18)
		UFont LargeFont; // 0x90(0x8)
		FSoftObjectPath LargeFontName; // 0x98(0x18)
		UFont SubtitleFont; // 0xB0(0x8)
		FSoftObjectPath SubtitleFontName; // 0xB8(0x18)
		TArray AdditionalFonts; // 0xD0(0x10)
		TArray AdditionalFontNames; // 0xE0(0x10)
		UClass ConsoleClass; // 0xF0(0x8)
		FSoftClassPath ConsoleClassName; // 0xF8(0x18)
		UClass GameViewportClientClass; // 0x110(0x8)
		FSoftClassPath GameViewportClientClassName; // 0x118(0x18)
		UClass LocalPlayerClass; // 0x130(0x8)
		FSoftClassPath LocalPlayerClassName; // 0x138(0x18)
		UClass WorldSettingsClass; // 0x150(0x8)
		FSoftClassPath WorldSettingsClassName; // 0x158(0x18)
		FSoftClassPath NavigationSystemClassName; // 0x170(0x18)
		UClass NavigationSystemClass; // 0x188(0x8)
		FSoftClassPath NavigationSystemConfigClassName; // 0x190(0x18)
		UClass NavigationSystemConfigClass; // 0x1A8(0x8)
		FSoftClassPath AvoidanceManagerClassName; // 0x1B0(0x18)
		UClass AvoidanceManagerClass; // 0x1C8(0x8)
		FSoftClassPath AIControllerClassName; // 0x1D0(0x18)
		UClass PhysicsCollisionHandlerClass; // 0x1E8(0x8)
		FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1F0(0x18)
		FSoftClassPath GameUserSettingsClassName; // 0x208(0x18)
		UClass GameUserSettingsClass; // 0x220(0x8)
		UGameUserSettings GameUserSettings; // 0x228(0x8)
		UClass LevelScriptActorClass; // 0x230(0x8)
		FSoftClassPath LevelScriptActorClassName; // 0x238(0x18)
		FSoftClassPath DefaultBlueprintBaseClassName; // 0x250(0x18)
		FSoftClassPath GameSingletonClassName; // 0x268(0x18)
		UObject GameSingleton; // 0x280(0x8)
		FSoftClassPath AssetManagerClassName; // 0x288(0x18)
		UAssetManager AssetManager; // 0x2A0(0x8)
		UTexture2D DefaultTexture; // 0x2A8(0x8)
		FSoftObjectPath DefaultTextureName; // 0x2B0(0x18)
		UTexture DefaultDiffuseTexture; // 0x2C8(0x8)
		FSoftObjectPath DefaultDiffuseTextureName; // 0x2D0(0x18)
		UTexture2D DefaultBSPVertexTexture; // 0x2E8(0x8)
		FSoftObjectPath DefaultBSPVertexTextureName; // 0x2F0(0x18)
		UTexture2D HighFrequencyNoiseTexture; // 0x308(0x8)
		FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310(0x18)
		UTexture2D DefaultBokehTexture; // 0x328(0x8)
		FSoftObjectPath DefaultBokehTextureName; // 0x330(0x18)
		UTexture2D DefaultBloomKernelTexture; // 0x348(0x8)
		FSoftObjectPath DefaultBloomKernelTextureName; // 0x350(0x18)
		UTexture2D DefaultFilmGrainTexture; // 0x368(0x8)
		FSoftObjectPath DefaultFilmGrainTextureName; // 0x370(0x18)
		UMaterial WireframeMaterial; // 0x388(0x8)
		FString WireframeMaterialName; // 0x390(0x10)
		UMaterial DebugMeshMaterial; // 0x3A0(0x8)
		FSoftObjectPath DebugMeshMaterialName; // 0x3A8(0x18)
		UMaterial NaniteHiddenSectionMaterial; // 0x3C0(0x8)
		FString NaniteHiddenSectionMaterialName; // 0x3C8(0x10)
		UMaterial EmissiveMeshMaterial; // 0x3D8(0x8)
		FSoftObjectPath EmissiveMeshMaterialName; // 0x3E0(0x18)
		UMaterial LevelColorationLitMaterial; // 0x3F8(0x8)
		FString LevelColorationLitMaterialName; // 0x400(0x10)
		UMaterial LevelColorationUnlitMaterial; // 0x410(0x8)
		FString LevelColorationUnlitMaterialName; // 0x418(0x10)
		UMaterial LightingTexelDensityMaterial; // 0x428(0x8)
		FString LightingTexelDensityName; // 0x430(0x10)
		UMaterial ShadedLevelColorationLitMaterial; // 0x440(0x8)
		FString ShadedLevelColorationLitMaterialName; // 0x448(0x10)
		UMaterial ShadedLevelColorationUnlitMaterial; // 0x458(0x8)
		FString ShadedLevelColorationUnlitMaterialName; // 0x460(0x10)
		UMaterial RemoveSurfaceMaterial; // 0x470(0x8)
		FSoftObjectPath RemoveSurfaceMaterialName; // 0x478(0x18)
		UMaterial VertexColorMaterial; // 0x490(0x8)
		FString VertexColorMaterialName; // 0x498(0x10)
		UMaterial VertexColorViewModeMaterial_ColorOnly; // 0x4A8(0x8)
		FString VertexColorViewModeMaterialName_ColorOnly; // 0x4B0(0x10)
		UMaterial VertexColorViewModeMaterial_AlphaAsColor; // 0x4C0(0x8)
		FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x4C8(0x10)
		UMaterial VertexColorViewModeMaterial_RedOnly; // 0x4D8(0x8)
		FString VertexColorViewModeMaterialName_RedOnly; // 0x4E0(0x10)
		UMaterial VertexColorViewModeMaterial_GreenOnly; // 0x4F0(0x8)
		FString VertexColorViewModeMaterialName_GreenOnly; // 0x4F8(0x10)
		UMaterial VertexColorViewModeMaterial_BlueOnly; // 0x508(0x8)
		FString VertexColorViewModeMaterialName_BlueOnly; // 0x510(0x10)
		FSoftObjectPath DebugEditorMaterialName; // 0x520(0x18)
		UMaterial ConstraintLimitMaterial; // 0x538(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialX; // 0x540(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialXAxis; // 0x548(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialY; // 0x550(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialYAxis; // 0x558(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialZ; // 0x560(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialZAxis; // 0x568(0x8)
		UMaterialInstanceDynamic ConstraintLimitMaterialPrismatic; // 0x570(0x8)
		UMaterial InvalidLightmapSettingsMaterial; // 0x578(0x8)
		FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x580(0x18)
		UMaterial PreviewShadowsIndicatorMaterial; // 0x598(0x8)
		FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x5A0(0x18)
		UMaterial ArrowMaterial; // 0x5B8(0x8)
		UMaterialInstanceDynamic ArrowMaterialYellow; // 0x5C0(0x8)
		FSoftObjectPath ArrowMaterialName; // 0x5C8(0x18)
		FLinearColor LightingOnlyBrightness; // 0x5E0(0x10)
		TArray ShaderComplexityColors; // 0x5F0(0x10)
		TArray QuadComplexityColors; // 0x600(0x10)
		TArray LightComplexityColors; // 0x610(0x10)
		TArray StationaryLightOverlapColors; // 0x620(0x10)
		TArray LODColorationColors; // 0x630(0x10)
		TArray HLODColorationColors; // 0x640(0x10)
		TArray StreamingAccuracyColors; // 0x650(0x10)
		FLinearColor GPUSkinCacheVisualizationExcludedColor; // 0x660(0x10)
		FLinearColor GPUSkinCacheVisualizationIncludedColor; // 0x670(0x10)
		FLinearColor GPUSkinCacheVisualizationRecomputeTangentsColor; // 0x680(0x10)
		float GPUSkinCacheVisualizationLowMemoryThresholdInMB; // 0x690(0x4)
		float GPUSkinCacheVisualizationHighMemoryThresholdInMB; // 0x694(0x4)
		FLinearColor GPUSkinCacheVisualizationLowMemoryColor; // 0x698(0x10)
		FLinearColor GPUSkinCacheVisualizationMidMemoryColor; // 0x6A8(0x10)
		FLinearColor GPUSkinCacheVisualizationHighMemoryColor; // 0x6B8(0x10)
		TArray GPUSkinCacheVisualizationRayTracingLODOffsetColors; // 0x6C8(0x10)
		float MaxPixelShaderAdditiveComplexityCount; // 0x6D8(0x4)
		float MaxES3PixelShaderAdditiveComplexityCount; // 0x6DC(0x4)
		float MinLightMapDensity; // 0x6E0(0x4)
		float IdealLightMapDensity; // 0x6E4(0x4)
		float MaxLightMapDensity; // 0x6E8(0x4)
		bool bRenderLightMapDensityGrayscale : 1; // 0x6EC:0(0x1)
		unsigned char UnknownData24_5[0x3]; // 0x6ED(0x3) UNKNOWN PROPERTY
		float RenderLightMapDensityGrayscaleScale; // 0x6F0(0x4)
		float RenderLightMapDensityColorScale; // 0x6F4(0x4)
		FLinearColor LightMapDensityVertexMappedColor; // 0x6F8(0x10)
		FLinearColor LightMapDensitySelectedColor; // 0x708(0x10)
		TArray StatColorMappings; // 0x718(0x10)
		UPhysicalMaterial DefaultPhysMaterial; // 0x728(0x8)
		FSoftObjectPath DefaultPhysMaterialName; // 0x730(0x18)
		UPhysicalMaterial DefaultDestructiblePhysMaterial; // 0x748(0x8)
		FSoftObjectPath DefaultDestructiblePhysMaterialName; // 0x750(0x18)
		TArray ActiveGameNameRedirects; // 0x768(0x10)
		TArray ActiveClassRedirects; // 0x778(0x10)
		TArray ActivePluginRedirects; // 0x788(0x10)
		TArray ActiveStructRedirects; // 0x798(0x10)
		UTexture2D PreIntegratedSkinBRDFTexture; // 0x7A8(0x8)
		FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x7B0(0x18)
		UTexture2D BlueNoiseScalarTexture; // 0x7C8(0x8)
		UTexture2D BlueNoiseVec2Texture; // 0x7D0(0x8)
		FSoftObjectPath BlueNoiseScalarTextureName; // 0x7D8(0x18)
		FSoftObjectPath BlueNoiseVec2TextureName; // 0x7F0(0x18)
		UTexture2DArray GlintTexture; // 0x808(0x8)
		UTexture2DArray GlintTexture2; // 0x810(0x8)
		FSoftObjectPath GlintTextureName; // 0x818(0x18)
		FSoftObjectPath GlintTexture2Name; // 0x830(0x18)
		UVolumeTexture SimpleVolumeTexture; // 0x848(0x8)
		FSoftObjectPath SimpleVolumeTextureName; // 0x850(0x18)
		UVolumeTexture SimpleVolumeEnvTexture; // 0x868(0x8)
		FSoftObjectPath SimpleVolumeEnvTextureName; // 0x870(0x18)
		UTexture2D MiniFontTexture; // 0x888(0x8)
		FSoftObjectPath MiniFontTextureName; // 0x890(0x18)
		UTexture WeightMapPlaceholderTexture; // 0x8A8(0x8)
		UTexture WeightMapArrayPlaceholderTexture; // 0x8B0(0x8)
		FSoftObjectPath WeightMapPlaceholderTextureName; // 0x8B8(0x18)
		FSoftObjectPath WeightMapArrayPlaceholderTextureName; // 0x8D0(0x18)
		UTexture2D LightMapDensityTexture; // 0x8E8(0x8)
		FSoftObjectPath LightMapDensityTextureName; // 0x8F0(0x18)
		unsigned char UnknownData25_6[0x8]; // 0x908(0x8) UNKNOWN PROPERTY
		UGameViewportClient GameViewport; // 0x910(0x8)
		TArray DeferredCommands; // 0x918(0x10)
		float NearClipPlane; // 0x928(0x4)
		bool bSubtitlesEnabled : 1; // 0x92C:0(0x1)
		bool bSubtitlesForcedOff : 1; // 0x92C:1(0x1)
		unsigned char UnknownData26_5[0x3]; // 0x92D(0x3) UNKNOWN PROPERTY
		int32_t MaximumLoopIterationCount; // 0x930(0x4)
		bool bCanBlueprintsTickByDefault : 1; // 0x934:0(0x1)
		bool bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x934:1(0x1)
		bool bAllowMultiThreadedAnimationUpdate : 1; // 0x934:2(0x1)
		bool bEnableEditorPSysRealtimeLOD : 1; // 0x934:3(0x1)
		unsigned char UnknownBit27 : 1; // 0x934:4(0x1) UNKNOWN PROPERTY
		bool bSmoothFrameRate : 1; // 0x934:5(0x1)
		bool bUseFixedFrameRate : 1; // 0x934:6(0x1)
		unsigned char UnknownData28_5[0x3]; // 0x935(0x3) UNKNOWN PROPERTY
		float FixedFrameRate; // 0x938(0x4)
		FFloatRange SmoothedFrameRateRange; // 0x93C(0x10)
		unsigned char UnknownData29_6[0x4]; // 0x94C(0x4) UNKNOWN PROPERTY
		UEngineCustomTimeStep CustomTimeStep; // 0x950(0x8)
		unsigned char UnknownData30_6[0x20]; // 0x958(0x20) UNKNOWN PROPERTY
		FSoftClassPath CustomTimeStepClassName; // 0x978(0x18)
		UTimecodeProvider TimecodeProvider; // 0x990(0x8)
		unsigned char UnknownData31_6[0x20]; // 0x998(0x20) UNKNOWN PROPERTY
		FSoftClassPath TimecodeProviderClassName; // 0x9B8(0x18)
		bool bGenerateDefaultTimecode; // 0x9D0(0x1)
		unsigned char UnknownData32_6[0x3]; // 0x9D1(0x3) UNKNOWN PROPERTY
		FFrameRate GenerateDefaultTimecodeFrameRate; // 0x9D4(0x8)
		float GenerateDefaultTimecodeFrameDelay; // 0x9DC(0x4)
		bool bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x9E0:0(0x1)
		unsigned char UnknownData33_5[0x3]; // 0x9E1(0x3) UNKNOWN PROPERTY
		int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x9E4(0x4)
		bool bShouldGenerateLowQualityLightmaps : 1; // 0x9E8:0(0x1)
		unsigned char UnknownData34_5[0x3]; // 0x9E9(0x3) UNKNOWN PROPERTY
		FColor C_WorldBox; // 0x9EC(0x4)
		FColor C_BrushWire; // 0x9F0(0x4)
		FColor C_AddWire; // 0x9F4(0x4)
		FColor C_SubtractWire; // 0x9F8(0x4)
		FColor C_SemiSolidWire; // 0x9FC(0x4)
		FColor C_NonSolidWire; // 0xA00(0x4)
		FColor C_WireBackground; // 0xA04(0x4)
		FColor C_ScaleBoxHi; // 0xA08(0x4)
		FColor C_VolumeCollision; // 0xA0C(0x4)
		FColor C_BSPCollision; // 0xA10(0x4)
		FColor C_OrthoBackground; // 0xA14(0x4)
		FColor C_Volume; // 0xA18(0x4)
		FColor C_BrushShape; // 0xA1C(0x4)
		unsigned char UnknownData35_6[0x8]; // 0xA20(0x8) UNKNOWN PROPERTY
		FDirectoryPath GameScreenshotSaveDirectory; // 0xA28(0x10)
		bool UseStaticMeshMinLODPerQualityLevels; // 0xA38(0x1)
		bool UseSkeletalMeshMinLODPerQualityLevels; // 0xA39(0x1)
		bool UseClothAssetMinLODPerQualityLevels; // 0xA3A(0x1)
		bool UseGrassVarityPerQualityLevels; // 0xA3B(0x1)
		ETransitionType TransitionType; // 0xA3C(0x1)
		unsigned char UnknownData36_6[0x3]; // 0xA3D(0x3) UNKNOWN PROPERTY
		FString TransitionDescription; // 0xA40(0x10)
		FString TransitionGameMode; // 0xA50(0x10)
		bool bAllowMatureLanguage : 1; // 0xA60:0(0x1)
		unsigned char UnknownData37_5[0x3]; // 0xA61(0x3) UNKNOWN PROPERTY
		float CameraRotationThreshold; // 0xA64(0x4)
		float CameraTranslationThreshold; // 0xA68(0x4)
		float PrimitiveProbablyVisibleTime; // 0xA6C(0x4)
		float MaxOcclusionPixelsFraction; // 0xA70(0x4)
		bool bPauseOnLossOfFocus : 1; // 0xA74:0(0x1)
		unsigned char UnknownData38_5[0x3]; // 0xA75(0x3) UNKNOWN PROPERTY
		int32_t MaxParticleResize; // 0xA78(0x4)
		int32_t MaxParticleResizeWarn; // 0xA7C(0x4)
		TArray PendingDroppedNotes; // 0xA80(0x10)
		float NetClientTicksPerSecond; // 0xA90(0x4)
		float DisplayGamma; // 0xA94(0x4)
		float MinDesiredFrameRate; // 0xA98(0x4)
		FLinearColor DefaultSelectedMaterialColor; // 0xA9C(0x10)
		FLinearColor SelectedMaterialColor; // 0xAAC(0x10)
		FLinearColor SelectionOutlineColor; // 0xABC(0x10)
		FLinearColor SubduedSelectionOutlineColor; // 0xACC(0x10)
		FLinearColor SelectedMaterialColorOverride; // 0xADC(0x10)
		bool bIsOverridingSelectedColor; // 0xAEC(0x1)
		unsigned char UnknownData39_6[0x3]; // 0xAED(0x3) UNKNOWN PROPERTY
		bool bEnableOnScreenDebugMessages : 1; // 0xAF0:0(0x1)
		bool bEnableOnScreenDebugMessagesDisplay : 1; // 0xAF0:1(0x1)
		bool bSuppressMapWarnings : 1; // 0xAF0:2(0x1)
		bool bDisableAILogging : 1; // 0xAF0:3(0x1)
		unsigned char UnknownData40_5[0x3]; // 0xAF1(0x3) UNKNOWN PROPERTY
		uint32_t bEnableVisualLogRecordingOnStart; // 0xAF4(0x4)
		int32_t ScreenSaverInhibitorSemaphore; // 0xAF8(0x4)
		bool bLockReadOnlyLevels : 1; // 0xAFC:0(0x1)
		unsigned char UnknownData41_5[0x3]; // 0xAFD(0x3) UNKNOWN PROPERTY
		FString ParticleEventManagerClassPath; // 0xB00(0x10)
		float SelectionHighlightIntensity; // 0xB10(0x4)
		float BSPSelectionHighlightIntensity; // 0xB14(0x4)
		float SelectionHighlightIntensityBillboards; // 0xB18(0x4)
		unsigned char UnknownData42_6[0x294]; // 0xB1C(0x294) UNKNOWN PROPERTY
		uint32_t GlobalNetTravelCount; // 0xDB0(0x4)
		unsigned char UnknownData43_6[0x4]; // 0xDB4(0x4) UNKNOWN PROPERTY
		TArray NetDriverDefinitions; // 0xDB8(0x10)
		TArray IrisNetDriverConfigs; // 0xDC8(0x10)
		TArray ServerActors; // 0xDD8(0x10)
		TArray RuntimeServerActors; // 0xDE8(0x10)
		float NetErrorLogInterval; // 0xDF8(0x4)
		bool bStartedLoadMapMovie : 1; // 0xDFC:0(0x1)
		unsigned char UnknownData44_5[0x3B]; // 0xDFD(0x3B) UNKNOWN PROPERTY
		int32_t NextWorldContextHandle; // 0xE38(0x4)
		unsigned char UnknownData45_7[0xE4]; // 0xE3C(0xE4) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Engine");
			return ret;
		}
	};


	// Class Engine.ViewModeUtils
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UViewModeUtils : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ViewModeUtils");
			return ret;
		}
	};


	// Class Engine.EngineBaseTypes
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEngineBaseTypes : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EngineBaseTypes");
			return ret;
		}
	};


	// Class Engine.EngineTypes
	// Inherited from UObject
	// Size: 0x0 (0x28 - 0x28)
	class UEngineTypes : public UObject	
	{
	public:

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.EngineTypes");
			return ret;
		}
	};


	// Class Engine.ExponentialHeightFog
	// Inherited from AInfo -> AActor -> UObject
	// Size: 0x10 (0x2A0 - 0x290)
	class AExponentialHeightFog : public AInfo	
	{
	public:
		UExponentialHeightFogComponent Component; // 0x290(0x8)
		bool bEnabled : 1; // 0x298:0(0x1)
		unsigned char UnknownData01_7[0x7]; // 0x299(0x7) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ExponentialHeightFog");
			return ret;
		}

		void OnRep_bEnabled(); // Flags: Native|Public 0x7FF4144E1AF8
	};


	// Class Engine.ExponentialHeightFogComponent
	// Inherited from USceneComponent -> UActorComponent -> UObject
	// Size: 0xE0 (0x300 - 0x220)
	class UExponentialHeightFogComponent : public USceneComponent	
	{
	public:
		float FogDensity; // 0x220(0x4)
		float FogHeightFalloff; // 0x224(0x4)
		FExponentialHeightFogData SecondFogData; // 0x228(0xC)
		FLinearColor FogInscatteringColor; // 0x234(0x10)
		FLinearColor FogInscatteringLuminance; // 0x244(0x10)
		FLinearColor SkyAtmosphereAmbientContributionColorScale; // 0x254(0x10)
		unsigned char UnknownData03_6[0x4]; // 0x264(0x4) UNKNOWN PROPERTY
		UTextureCube InscatteringColorCubemap; // 0x268(0x8)
		float InscatteringColorCubemapAngle; // 0x270(0x4)
		FLinearColor InscatteringTextureTint; // 0x274(0x10)
		float FullyDirectionalInscatteringColorDistance; // 0x284(0x4)
		float NonDirectionalInscatteringColorDistance; // 0x288(0x4)
		float DirectionalInscatteringExponent; // 0x28C(0x4)
		float DirectionalInscatteringStartDistance; // 0x290(0x4)
		FLinearColor DirectionalInscatteringColor; // 0x294(0x10)
		FLinearColor DirectionalInscatteringLuminance; // 0x2A4(0x10)
		float FogMaxOpacity; // 0x2B4(0x4)
		float StartDistance; // 0x2B8(0x4)
		float EndDistance; // 0x2BC(0x4)
		float FogCutoffDistance; // 0x2C0(0x4)
		bool bEnableVolumetricFog; // 0x2C4(0x1)
		unsigned char UnknownData04_6[0x3]; // 0x2C5(0x3) UNKNOWN PROPERTY
		float VolumetricFogScatteringDistribution; // 0x2C8(0x4)
		FColor VolumetricFogAlbedo; // 0x2CC(0x4)
		FLinearColor VolumetricFogEmissive; // 0x2D0(0x10)
		float VolumetricFogExtinctionScale; // 0x2E0(0x4)
		float VolumetricFogDistance; // 0x2E4(0x4)
		float VolumetricFogStartDistance; // 0x2E8(0x4)
		float VolumetricFogNearFadeInDistance; // 0x2EC(0x4)
		float VolumetricFogStaticLightingScatteringIntensity; // 0x2F0(0x4)
		bool bOverrideLightColorsWithFogInscatteringColors; // 0x2F4(0x1)
		bool bHoldout : 1; // 0x2F5:0(0x1)
		bool bRenderInMainPass : 1; // 0x2F5:1(0x1)
		unsigned char UnknownData05_7[0xA]; // 0x2F6(0xA) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.ExponentialHeightFogComponent");
			return ret;
		}

		void SetVolumetricFogStartDistance(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E3458
		void SetVolumetricFogScatteringDistribution(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E3378
		void SetVolumetricFogNearFadeInDistance(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E3298
		void SetVolumetricFogExtinctionScale(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E31B8
		void SetVolumetricFogEmissive(FLinearColor NewValue); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E30D8
		void SetVolumetricFogDistance(float NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2FF8
		void SetVolumetricFogAlbedo(FColor NewValue); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E2F18
		void SetVolumetricFog(bool bNewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2E38
		void SetStartDistance(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2D58
		void SetSecondFogHeightOffset(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2C78
		void SetSecondFogHeightFalloff(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2B98
		void SetSecondFogDensity(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2AB8
		void SetSecondFogData(FExponentialHeightFogData NewValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E29D8
		void SetRenderInMainPass(bool bValue); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E28F8
		void SetNonDirectionalInscatteringColorDistance(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2818
		void SetInscatteringTextureTint(FLinearColor Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E2738
		void SetInscatteringColorCubemapAngle(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2658
		void SetInscatteringColorCubemap(UTextureCube Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2578
		void SetHoldout(bool bNewHoldout); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2498
		void SetFullyDirectionalInscatteringColorDistance(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E23B8
		void SetFogMaxOpacity(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E22D8
		void SetFogInscatteringColor(FLinearColor Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E21F8
		void SetFogHeightFalloff(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2118
		void SetFogDensity(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E2038
		void SetFogCutoffDistance(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1F58
		void SetEndDistance(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1E78
		void SetDirectionalInscatteringStartDistance(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1D98
		void SetDirectionalInscatteringExponent(float Value); // Flags: Final|RequiredAPI|Native|Public|BlueprintCallable 0x7FF4144E1CB8
		void SetDirectionalInscatteringColor(FLinearColor Value); // Flags: Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable 0x7FF4144E1BD8
	};


	// Class Engine.Exporter
	// Inherited from UObject
	// Size: 0x50 (0x78 - 0x28)
	class UExporter : public UObject	
	{
	public:
		UClass SupportedClass; // 0x28(0x8)
		UObject ExportRootScope; // 0x30(0x8)
		TArray FormatExtension; // 0x38(0x10)
		TArray FormatDescription; // 0x48(0x10)
		int32_t PreferredFormatIndex; // 0x58(0x4)
		int32_t TextIndent; // 0x5C(0x4)
		bool bText : 1; // 0x60:0(0x1)
		bool bSelectedOnly : 1; // 0x60:1(0x1)
		bool bForceFileOperations : 1; // 0x60:2(0x1)
		unsigned char UnknownData02_5[0x7]; // 0x61(0x7) UNKNOWN PROPERTY
		UAssetExportTask ExportTask; // 0x68(0x8)
		unsigned char UnknownData03_7[0x8]; // 0x70(0x8) UNKNOWN PROPERTY

		static UClass* StaticClass() const {
			static auto ret = SDK::Utils::StaticFindObject<UClass>("/Script/Engine.Exporter");
			return ret;
		}

		bool ScriptRunAssetExportTask(UAssetExportTask Task); // Flags: Event|Public|BlueprintEvent 0x7FF4144E36F8
		bool RunAssetExportTasks(TArray& ExportTasks); // Flags: Final|RequiredAPI|Native|Static|Public|HasOutParms|BlueprintCallable 0x7FF4144E3618
