#pragma once

// Dumped with <3 by android1337
// Version: ++Fortnite+Release-31.00-CL-35447195
// Package: Rock_Vehicle_Anim
// Current Base + Text VA: 0x0
// WARNING: Memory::va_text is 0, ufunctions will show current addresses

namespace SDK
{

	// Struct /RockVehicle/Rock_Vehicle_Anim.Rock_Vehicle_Anim_C.AnimBlueprintGeneratedConstantData
	// Inherited from FAnimBlueprintConstantData
	// Size: 0x5CF (0x5D0 - 0x1)
	struct FAnimBlueprintGeneratedConstantDatadup_220 : public FAnimBlueprintConstantData	
	{
	public:
		unsigned char UnknownData02_3[0x3]; // 0x1(0x3) UNKNOWN PROPERTY
		FName __NameProperty; // 0x4(0x4)
		FName __NameProperty; // 0x8(0x4)
		TEnumAsByte __ByteProperty; // 0xC(0x1)
		unsigned char UnknownData03_6[0x3]; // 0xD(0x3) UNKNOWN PROPERTY
		FAnimNodeFunctionRef __StructProperty; // 0x10(0x18)
		FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x28(0x80)
		FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0xA8(0x18)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root; // 0xC0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace; // 0xF0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x120(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x150(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x180(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x1E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x210(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x240(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x270(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace; // 0x2A0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RockVehilceController; // 0x2D0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x300(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose; // 0x330(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x360(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x390(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone; // 0x3C0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x3F0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x420(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x450(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x480(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x4B0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x4E0(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x510(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x540(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x570(0x30)
		FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt; // 0x5A0(0x30)
	};

}
